
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ВидОрганизации = Параметры.ВидОрганизации;
	ИностраннаяОрганизация = Параметры.ИностраннаяОрганизация;
	ЗарегистрированВОЭЗ = Параметры.ЗарегистрированВОЭЗ;
	НаименованиеИнострОрганизации = Параметры.НаименованиеИнострОрганизации;
	КодВСтранеРегистрации = Параметры.КодВСтранеРегистрации;
	СтранаПостоянногоМестонахождения = Параметры.СтранаПостоянногоМестонахождения;
	СтранаРегистрации = Параметры.СтранаРегистрации;
	
	УстановитьДоступностьЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы,, ТекстПредупреждения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИностраннаяОрганизацияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда) 
	
	СохранитьИЗакрыть();	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормы(Форма)
	
	Форма.Элементы.ГруппаИспользуетсяИностраннаяОрганизация.Доступность = Форма.ИностраннаяОрганизация;
		
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть() Экспорт
	
	Модифицированность = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИностраннаяОрганизация", ИностраннаяОрганизация);
	СтруктураПараметров.Вставить("ЗарегистрированВОЭЗ", ЗарегистрированВОЭЗ);
	СтруктураПараметров.Вставить("КодВСтранеРегистрации", КодВСтранеРегистрации);
	СтруктураПараметров.Вставить("СтранаПостоянногоМестонахождения", СтранаПостоянногоМестонахождения);
	СтруктураПараметров.Вставить("НаименованиеИнострОрганизации", НаименованиеИнострОрганизации);
	СтруктураПараметров.Вставить("СтранаРегистрации", СтранаРегистрации);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти
