#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Партнер") И ЗначениеЗаполнено(ДанныеЗаполнения.Партнер) Тогда
			Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Партнеры.Наименование,
			|	Партнеры.НаименованиеПолное,
			|	ВЫБОР
			|		КОГДА Партнеры.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.КомпанияЧастноеЛицо.ЧастноеЛицо)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЭтоФизЛицо
			|ИЗ
			|	Справочник.Партнеры КАК Партнеры
			|ГДЕ
			|	Партнеры.Ссылка = &Партнер");
			Запрос.УстановитьПараметр("Партнер", ДанныеЗаполнения.Партнер);
			Результат = Запрос.Выполнить();
			Если Результат.Пустой() Тогда
				Возврат;
			КонецЕсли;
			ПартнерВладелец = Результат.Выбрать();
			ПартнерВладелец.Следующий();
			Партнер = ДанныеЗаполнения.Партнер;
			Наименование = ПартнерВладелец.Наименование;
			НаименованиеПолное = ПартнерВладелец.НаименованиеПолное;
			Если ПартнерВладелец.ЭтоФизЛицо ИЛИ Партнер = Справочники.Партнеры.РозничныйПокупатель Тогда
				ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПартнерыИКонтрагенты.ПроверитьКорректностьЗаполненияКонтрагента(ЭтотОбъект, Ссылка, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ИНН) Тогда    //jadmin
	
		ЭтотОбъект.ИНН = СокрЛП(ЭтотОбъект.ИНН);
	
	КонецЕсли; 
	
	////jadmin проверка заполнения юрадреса контрагента
	ПроверкаЗаполненияАдреса = 0;
	Если ЭтотОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо ИЛИ 
		ЭтотОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		
		Для каждого стрКИ Из ЭтотОбъект.КонтактнаяИнформация Цикл
			Если стрКИ.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента
				И стрКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				
				ПроверкаЗаполненияАдреса = ПроверкаЗаполненияАдреса +1 ;
				
			КонецЕсли; 
			
			Если стрКИ.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента
				И стрКИ.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
				
				ПроверкаЗаполненияАдреса = ПроверкаЗаполненияАдреса +1 ;
				
			КонецЕсли; 
		КонецЦикла; 
		
		Если ПроверкаЗаполненияАдреса < 2 Тогда
			Сообщить("Не заполнен юридический и/или фактический адрес контрагента" + ЭтотОбъект.Наименование);                       
			
			Если РольДоступна("АдминистраторСистемы") Тогда
			
			Иначе
				Отказ = ИСТИНА;
			КонецЕсли;
			
		КонецЕсли; 
	КонецЕсли; 
	///
	
	Если ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель
		Или ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
		
	ИначеЕсли ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо
		Или ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
		
		ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		
	КонецЕсли;
	
	ПоставщикИРезидент = Не Партнер.Пустая()
		И (ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент)
		И (ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Партнер, "Поставщик") = Истина;
	
	Если Не ПоставщикИРезидент Тогда
		НДСпоСтавкам4и2 = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ГоловнойКонтрагент) И Не ОбособленноеПодразделение Тогда
		
		Если ЭтоНовый() Тогда
			НоваяСсылка = Справочники.Контрагенты.ПолучитьСсылку();
			УстановитьСсылкуНового(НоваяСсылка);
			ГоловнойКонтрагент = ПолучитьСсылкуНового();
		Иначе
			ГоловнойКонтрагент = Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
	// Обработка смены пометки удаления.
	Если Не ЭтоНовый() И Не ЭтоГруппа Тогда

		Если ПометкаУдаления <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") Тогда
			Справочники.КлючиАналитикиУчетаПоПартнерам.УстановитьПометкуУдаления(Новый Структура("Контрагент", Ссылка), ПометкаУдаления);
			Справочники.КлючиАналитикиУчетаПартий.УстановитьПометкуУдаления(Новый Структура("Контрагент", Ссылка), ПометкаУдаления);
		КонецЕсли;
		
		//изменим ИНН в подчиненных контрагентах
		Если Не ОбособленноеПодразделение И ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			ПартнерыИКонтрагенты.ИзменитьИННПодчиненныхКонтрагентов(Ссылка, ИНН);
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ОбъектКопирования.ГоловнойКонтрагент = ОбъектКопирования.Ссылка Тогда
		ГоловнойКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли




Процедура ЗаполнитьДанныеДляОбмена()
	
	
	
	       	БанкСчетСсылка =  Справочники.БанковскиеСчетаКонтрагентов.ПолучитьБанковскийСчетПоУмолчанию(ЭтотОбъект.Ссылка,Справочники.Валюты.НайтиПоНаименованию("BYN"));			

				
			ЮрАдрес = "";
			ФактАдрес = "";
			Телефон = "";
			
			Для каждого стр Из ЭтотОбъект.КонтактнаяИнформация Цикл
			    Если стр.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда	
					ЮрАдрес = стр.Представление; 		
				КонецЕсли;
				
				Если стр.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда		
					ФактАдрес = стр.Представление; 		
				КонецЕсли;

				Если стр.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда	
					Телефон = стр.Представление;	
				КонецЕсли;	
			КонецЦикла; 

	    UID = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
	
	
		НаборЗаписей = РегистрыСведений.Обмен_Контрагенты.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.КонтрагентСсылка.Установить(ЭтотОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			ЕстьИзменения = ЛОЖЬ;
			Для каждого стр Из НаборЗаписей Цикл
				
				Если стр.UID <> UID Тогда
					стр.UID = UID;
				    ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если стр.УНП <> СокрЛП(ЭтотОбъект.ИНН) Тогда
					стр.УНП = СокрЛП(ЭтотОбъект.ИНН);
					ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если стр.КодФилиалаКонтрагента <> ЭтотОбъект.КодФилиала Тогда
					стр.КодФилиалаКонтрагента = ЭтотОбъект.КодФилиала;
					ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если стр.Клиент <> ЭтотОбъект.Наименование Тогда
					стр.Клиент = ЭтотОбъект.Наименование;
					ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если стр.КлиентПолноеНаименование <> ЭтотОбъект.НаименованиеПолное Тогда
					стр.КлиентПолноеНаименование = ЭтотОбъект.НаименованиеПолное;
					ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если стр.ВидКонтрагента <> ЭтотОбъект.Партнер.ВидПартнераКонтрагента Тогда
					стр.ВидКонтрагента = ЭтотОбъект.Партнер.ВидПартнераКонтрагента;
					ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если стр.РасчетныйСчет <> ""+БанкСчетСсылка.НомерСчета Тогда
					стр.РасчетныйСчет = ""+БанкСчетСсылка.НомерСчета;
					ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если стр.БИКБанка <> ""+БанкСчетСсылка.БИКБанка Тогда
					стр.БИКБанка = ""+БанкСчетСсылка.БИКБанка;
					ЕстьИзменения = ИСТИНА;
				КонецЕсли;

				
				Если стр.ЮрАдрес <> ЮрАдрес Тогда
					стр.ЮрАдрес = ЮрАдрес;
				    ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если стр.ФактАдрес <> ФактАдрес Тогда
					стр.ФактАдрес = ФактАдрес;
				    ЕстьИзменения = ИСТИНА;
				КонецЕсли;

				Если стр.Телефон <> Телефон Тогда
					стр.Телефон = Телефон;
				    ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				
				Если ЭтотОбъект.ПометкаУдаления = ЛОЖЬ Тогда
					ПомУдал = 0;   
				Иначе
					ПомУдал = 1;
					ОснДог = 0;
				КонецЕсли;
				
								
				Если стр.ПометкаУдаления <> ПомУдал Тогда
					стр.ПометкаУдаления = ПомУдал;
					ЕстьИзменения = ИСТИНА;
				КонецЕсли;
				
				Если ЕстьИзменения = ИСТИНА Тогда
					стр.ПризнакОбработано = 0;
				КонецЕсли;
				
			КонецЦикла; 
			
			Если ЕстьИзменения = ИСТИНА Тогда
				НаборЗаписей.Записать(ИСТИНА);
			КонецЕсли;
			
		Иначе
			
			МенеджерЗаписей = РегистрыСведений.Обмен_Контрагенты.СоздатьМенеджерЗаписи();
			МенеджерЗаписей.КонтрагентСсылка = ЭтотОбъект.Ссылка;

			МенеджерЗаписей.УНП = ""+СокрЛП(ЭтотОбъект.ИНН);
			МенеджерЗаписей.Клиент = ЭтотОбъект.Наименование;
			МенеджерЗаписей.КлиентПолноеНаименование = ЭтотОбъект.НаименованиеПолное;
			МенеджерЗаписей.КодФилиалаКонтрагента = ""+ЭтотОбъект.КодФилиала;
			МенеджерЗаписей.ВидКонтрагента = ЭтотОбъект.Партнер.ВидПартнераКонтрагента;
	
			МенеджерЗаписей.РасчетныйСчет = ""+БанкСчетСсылка.НомерСчета;
			МенеджерЗаписей.БИКБанка = ""+БанкСчетСсылка.БИКБанка;
				
			МенеджерЗаписей.ЮрАдрес = ЮрАдрес;
			МенеджерЗаписей.ФактАдрес = ФактАдрес; 
			МенеджерЗаписей.Телефон = Телефон;
			
			МенеджерЗаписей.UID = UID;
			
			Если ЭтотОбъект.ПометкаУдаления = ЛОЖЬ Тогда
				ПомУдал = 0;   
			Иначе
				ПомУдал = 1;
			КонецЕсли;
			
			МенеджерЗаписей.ПометкаУдаления = ПомУдал;
			МенеджерЗаписей.ПризнакОбработано = 0;
			
			МенеджерЗаписей.Регистратор = ЭтотОбъект.Ссылка;
			МенеджерЗаписей.Записать(ИСТИНА);
		КонецЕсли; 				
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
		//jadmin Для выгрузки изменений в бух Обмен_Договора
	Если Не Отказ Тогда
		Если ЭтотОбъект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо
			ИЛИ ЭтотОбъект.ЮрФизЛицо <> Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		       
			ЗаполнитьДанныеДляОбмена();		
		
		КонецЕсли; 
	КонецЕсли; 
	////
КонецПроцедуры


Функция ПолучитьБанковскийСчет(Владелец)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчетаКонтрагентов.Ссылка КАК Ссылка,
		|	БанковскиеСчетаКонтрагентов.НомерСчета КАК НомерСчета,
		|	БанковскиеСчетаКонтрагентов.БИКБанка КАК БИКБанка
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
		|ГДЕ
		|	БанковскиеСчетаКонтрагентов.Владелец = &Владелец
		|	И БанковскиеСчетаКонтрагентов.Закрыт = ЛОЖЬ
		|	И БанковскиеСчетаКонтрагентов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	

КонецФункции // ()

 