#Область РегламентныеЗадания

Процедура ВыгрузкаТоваровНаСайт() Экспорт
	
	ВыгружатьИзображения = ЛОЖЬ;

	ВыгрузитьНаСервереРозница(ВыгружатьИзображения);

	//ПередачаФайловПоFTP();
    ПередачаФайловПоAPI_Розница();
КонецПроцедуры


Процедура ВыгрузкаТоваровНаСайтОпт() Экспорт
	ВыгружатьИзображения = ЛОЖЬ;
	
	ВыгрузитьОптНаСервере(ВыгружатьИзображения);
	ВыгрузитьПаролиОпт();

	//ПередачаФайловПоFTPОпт();	
	//ПередачаПАРОЛЕЙПоFTPОпт();   
	ПередачаФайловПоAPI_Опт();
КонецПроцедуры

Процедура ВыгрузкаТоваровНаСайтПолная(ВыгружатьИзображения = ЛОЖЬ) Экспорт
	
	//ВыгружатьИзображения = ЛОЖЬ;

	//Константы.ТекущееЗначениеДляВыгрузкиКартинокНаСайт.Установить(День(ТекущаяДата()));
	
	ВыгрузитьНаСервереРозница(ВыгружатьИзображения);

	ВыгрузитьКаталогНаСервере();
	
	ВыгрузитьХарактеристикиДляСайтаНаСервере();	
	
	ОбновитьДанныеОПСЕвропочта();

	//опт
	ВыгрузитьОптНаСервере(ВыгружатьИзображения);
		
	ПередачаФайловИКартинокПоFTP(ВыгружатьИзображения);
	
КонецПроцедуры
//
Процедура ПолучениеЗаказов() Экспорт
	
//ПолучениеЗаказовОптПоFTP();
//ОбработатьФайлыЗаказов();  

ПолучениеЗаказов_ОПТ();

ПолучениеЗаказовРозница();

КонецПроцедуры
//
Процедура ПолучениеЗаказовРозница() Экспорт
	
	//ПолучениеЗаказовРозницаПоFTP();
	//ОбработатьФайлыЗаказовРозница();
	ПолучитьНеобработанныеЗаказыНаСайтеАПИ();
	ПроверитьОплатуИнтернетЗаказов();

КонецПроцедуры
//       

Процедура ПолучениеЗаказов_ОПТ() Экспорт
	
	ПолучитьНеобработанныеЗаказыНаСайтеАПИ_ОПТ();

КонецПроцедуры


Процедура УстановкаПризнакаПопулярныйВНоменклатуре() Экспорт
	УбратьПризнакПопулярный();
	УстановкаПризнакаНоменклатуреПопулярный();

КонецПроцедуры
//
Процедура УстановкаПризнакаНовинкаВНоменклатуре() Экспорт

	УстановитьСнятьПризнакНовинкаНоменклатуре();

КонецПроцедуры
 
//
Процедура ПроверкаОплатИнтернетЗаказов()  Экспорт

	ПроверитьОплатуИнтернетЗаказов();

КонецПроцедуры
 
#КонецОбласти


Процедура ВыгрузитьПароли() Экспорт
	
	ВыгрузитьПаролиОпт();	
	ПередачаПАРОЛЕЙПоFTPОпт();

КонецПроцедуры


&НаСервере
Процедура ВыгрузитьНаСервереРозница(ВыгружатьИзображения)
	
	НеВыгружатьПустыеХарактеристики = Истина;
	
	Путь = ПолучитьПуть();
	КаталогВыгрузки_product = ""+сокрлп(Путь)+"product.csv";
	
	Попытка
	
		УдалитьФайлы(""+сокрлп(Путь)+"image\", "*"); 
	
	Исключение
	
	КонецПопытки;

	
	//НомерИзКонстанты = Константы.ТекущееЗначениеДляВыгрузкиКартинокНаСайт.Получить();
	
	// записываем в файл с символами BOM в начале файле	
	ТекстовыйФайлUTF8_Bom = Новый Массив;
	
	
	//Файл_product = Новый ЗаписьТекста(КаталогВыгрузки_product,КодировкаТекста.UTF8);
	
	
	СтрокаФайла = 1;			
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.Родитель.Код КАК РодительКод
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ИСТИНА
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	//jadmin|	И Номенклатура.Характеристика1 <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	Записи = РезультатЗапроса.Выбрать();
	
	МассивГрупп = Новый Массив;
	
	XXX_НомерПоПорядку = 0;
	Пока Записи.Следующий() Цикл	
		МассивГрупп.Добавить(Записи.Ссылка);	
	КонецЦикла;
	
	
	/////	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыДляСайта.Номенклатура.Наименование КАК Наименование,
	|	ГруппыДляСайта.Номенклатура.Код КАК Код,
	|	ГруппыДляСайта.Номенклатура.ВесЧислитель КАК ВесЧислитель,  
	|	ГруппыДляСайта.Номенклатура.ВесЗнаменатель КАК ВесЗнаменатель,
	|	ГруппыДляСайта.Номенклатура.Ссылка КАК Ссылка,
	|	ГруппыДляСайта.ГруппаДляСайта.Код КАК КодГруппыДляСайта,
	|	ВЫБОР
	|		КОГДА ГруппыДляСайта.Номенклатура.НедоступноДляРозницы = ИСТИНА
	|			ТОГДА 1
	|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.НедоступноДляРозницы = ИСТИНА
	|			ТОГДА 1
	|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
	|			ТОГДА 1
	|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
	|			ТОГДА 1
	|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
	|			ТОГДА 1
	|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НедоступноДляРозницы
	|ПОМЕСТИТЬ ТАБ
	|ИЗ
	|	РегистрСведений.ГруппыДляСайта КАК ГруппыДляСайта
	|ГДЕ
	|	ГруппыДляСайта.Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаСсылка)
	|	И ГруппыДляСайта.Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И ГруппыДляСайта.Номенклатура.НеВыгружатьНаСайт = ЛОЖЬ
	|	И ГруппыДляСайта.ОсновнаяГруппа = ИСТИНА
	|	И ГруппыДляСайта.ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБ.Наименование КАК Наименование,
	|	ТАБ.Код КАК Код,
	|	ТАБ.ВесЧислитель КАК ВесЧислитель, 
	|	ТАБ.ВесЗнаменатель КАК ВесЗнаменатель,
	|	ТАБ.Ссылка КАК Ссылка,
	|	ТАБ.КодГруппыДляСайта КАК КодГруппыДляСайта
	|ИЗ
	|	ТАБ КАК ТАБ
	|ГДЕ
	|	ТАБ.НедоступноДляРозницы <> 1";
	
	Запрос.УстановитьПараметр("ГруппаСсылка",МассивГрупп);
	
	РезультатЗапроса = Запрос.Выполнить();
	/////А = Запрос.Выполнить().Выгрузить();
	Записи = РезультатЗапроса.Выбрать();
	
	id = 0;
	Пока Записи.Следующий() Цикл
		ТоварВИнтМаг = 0;
		Остаток = 0;
		// 0 - нет в наличии
		// 1 - где купить			
		// 2 - купить
		// 3 - предзаказ
		
		ОстатокПоМаг = 0;
		
		ЗапросОст = Новый Запрос;
		ЗапросОст = Новый Запрос;
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Склад.ТипСклада КАК СкладТипСклада,
		|	ТоварыНаСкладахОстатки.Склад.НомерМагазинаДляОтчетов КАК СкладНомерМагазинаДляОтчетов,
		|	МАКСИМУМ(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ВНаличииОстаток,
		|	МАКСИМУМ(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0)) КАК ВРезервеОстаток,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВЫБОР
		|		КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0)
		|	КОНЕЦ КАК ОСТАТОК,
		|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) КАК ДоступныйОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
		|		ПО ТоварыНаСкладахОстатки.Склад = СвободныеОстаткиОстатки.Склад
		|			И ТоварыНаСкладахОстатки.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Номенклатура.Ссылка = &Ссылка
		|	И ТоварыНаСкладахОстатки.Склад = &Склад
		|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|	И ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0) > 0
		|	И ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Склад.ТипСклада,
		|	ТоварыНаСкладахОстатки.Склад.НомерМагазинаДляОтчетов,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ВЫБОР
		|		КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0)
		|	КОНЕЦ,
		|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкладНомерМагазинаДляОтчетов";
				
		ЗапросОст.Текст = ТекстЗапроса;
		
		ЗапросОст.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
		ЗапросОст.УстановитьПараметр("Ссылка", Записи.Ссылка);
		//ЗапросОст.УстановитьПараметр("Маг5", Справочники.Склады.НайтиПоНаименованию("Магазин N 5",ИСТИНА));
		ЗапросОст.УстановитьПараметр("Склад", Справочники.Склады.НайтиПоНаименованию("Интернет магазин",ИСТИНА));
		ЗапросОст.УстановитьПараметр("ГородПогода", Справочники.ПогодаГорода.НайтиПоКоду("1")); //Минск
		
		РезультатЗапросаОст = ЗапросОст.Выполнить().Выгрузить();
		
		Если РезультатЗапросаОст.Итог("ОСТАТОК") > 0.99 Тогда
			
		////jadmin Остатки по маг5 - 290422 откл. т.к попадает на сайт много мусора с магазина
		//Иначе

		//	Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("3.	Луковицы, корневища  цветов",ИСТИНА)
		//			ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("3.	Луковицы, корневища  цветов",ИСТИНА) 
		//				ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель  = Справочники.Номенклатура.НайтиПоНаименованию("3.	Луковицы, корневища  цветов",ИСТИНА) 
		//		ИЛИ Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("2.1.2.	Розы",ИСТИНА)
		//			ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("2.1.2.	Розы",ИСТИНА)
		//			   ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("2.1.2.	Розы",ИСТИНА)
		//			   	 ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("2.1.2.	Розы",ИСТИНА)
		//			Тогда
		//			
		//	Иначе

		//		ЗапросОст.Текст = ТекстЗапроса;
		//		
		//		ЗапросОст.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
		//		ЗапросОст.УстановитьПараметр("Ссылка", Записи.Ссылка);
		//		ЗапросОст.УстановитьПараметр("Склад", Справочники.Склады.НайтиПоНаименованию("Магазин N 5",ИСТИНА));
		//		
		//		РезультатЗапросаОст = ЗапросОст.Выполнить().Выгрузить();
		//	КонецЕсли;
		//КонецЕсли;
		//	
		//Если РезультатЗапросаОст.Итог("ОСТАТОК") > 0.99 Тогда
			Остаток = 2;
				//Луковичные кратность упаковки при выгрузке на сайт
				Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000013")
					ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("00-00000013") 
						ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель  = Справочники.Номенклатура.НайтиПоНаименованию("00-00000013") Тогда     //3.	Луковицы, корневища цветов
						ОстатокНаМаг = 0;
						ЕдИзмерУпак = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("упак",,,Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения);
						ОстатокНаМаг = РезультатЗапросаОст.Итог("ОСТАТОК");
						КратностьУпаковки = 0;
						КолВоВУпак = 1;
						
						ЗапросУпак = Новый Запрос;
						ЗапросУпак.Текст = 
							"ВЫБРАТЬ
							|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
							|	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
							|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
							|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
							|ИЗ
							|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
							|ГДЕ
							|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
							|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения";
						
						ЗапросУпак.УстановитьПараметр("Владелец", Записи.Ссылка);
						ЗапросУпак.УстановитьПараметр("ЕдиницаИзмерения", ЕдИзмерУпак);
						
						РезультатЗапросаУпак = ЗапросУпак.Выполнить();
						
						ВыборкаДетальныеЗаписиУпак = РезультатЗапросаУпак.Выбрать();
						
						Пока ВыборкаДетальныеЗаписиУпак.Следующий() Цикл
							КолВоВУпак = ВыборкаДетальныеЗаписиУпак.Числитель;
						КонецЦикла;

						КратностьУпаковки = ОстатокНаМаг / КолВоВУпак;
						
						Если КратностьУпаковки >=1 Тогда 
							Остаток = 2;  
							ТоварВИнтМаг = 1;
					    КонецЕсли;	
				КонецЕсли; 
				///
				
				
			//ПолучитьКОлВоПоОстатку  перенес сюда чтобы смотреть остаток только магазину
			Если Остаток = 2 Тогда
				
				ОстатокОбщий = 0;
				
				ЗапросОстатокОбщий = Новый Запрос;
				ЗапросОстатокОбщий.Текст = 
					 "ВЫБРАТЬ
					 |	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
					 |	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) КАК ДоступныйОстаток
					 |ПОМЕСТИТЬ ТАБ
					 |ИЗ
					 |	РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
					 |ГДЕ
					 |	СвободныеОстаткиОстатки.Номенклатура = &Ссылка
					 |	И СвободныеОстаткиОстатки.Склад = &ИнтМаг
					 |
					 |ОБЪЕДИНИТЬ
					 |
					 |ВЫБРАТЬ
					 |	ГрафикПоступленияТоваровОстатки.Номенклатура,
					 |	ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовОстаток
					 |ИЗ
					 |	РегистрНакопления.ГрафикПоступленияТоваров.Остатки(, ) КАК ГрафикПоступленияТоваровОстатки
					 |ГДЕ
					 |	ГрафикПоступленияТоваровОстатки.Номенклатура = &Ссылка
					 |	И ГрафикПоступленияТоваровОстатки.Склад = &ИнтМаг
					 |;
					 |
					 |////////////////////////////////////////////////////////////////////////////////
					 |ВЫБРАТЬ
					 |	ТАБ.Номенклатура КАК Номенклатура,
					 |	СУММА(ТАБ.ДоступныйОстаток) КАК ДоступныйОстаток
					 |ИЗ
					 |	ТАБ КАК ТАБ
					 |
					 |СГРУППИРОВАТЬ ПО
					 |	ТАБ.Номенклатура";
					 
					 //"ВЫБРАТЬ
					//|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
					//|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0)) КАК ДоступныйОстаток
					//|ИЗ
					//|	РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
					//|ГДЕ
					//|	СвободныеОстаткиОстатки.Номенклатура = &Ссылка
					//|	И СвободныеОстаткиОстатки.Склад = &ИнтМаг
					//|
					//|СГРУППИРОВАТЬ ПО
					//|	СвободныеОстаткиОстатки.Номенклатура";
					
					

				
				ЗапросОстатокОбщий.УстановитьПараметр("ИнтМаг", Справочники.Склады.НайтиПоНаименованию("Интернет магазин",ИСТИНА));
				ЗапросОстатокОбщий.УстановитьПараметр("Ссылка", Записи.Ссылка);

				РезультатЗапроса = ЗапросОстатокОбщий.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ОстатокОбщий = ВыборкаДетальныеЗаписи.ДоступныйОстаток;
					ДоступныйОстаток = ОстатокОбщий;
				КонецЦикла;
		
			КонецЕсли; 

				
				
				
		Иначе 
			
			Если Константы.МССО_ВыгружатьНаСайтОстаткиТолькоИнтернетМагазина.Получить() = ЛОЖЬ Тогда
				
				//jadmin Остатки Для ИнтМагазина
				ОстатокОбщий = 0;
				ВсегоОстаток = 0;
				ВРезервеОстаток = 0;
				СобраноОстаток  = 0;
				СобираетсяОстаток = 0;
				ДоступныйОстаток = 0;
				
				ЗапросОстСкл = Новый Запрос;
				ЗапросОстСкл.Текст = "ВЫБРАТЬ
				|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад КАК Склад,
				|	ТоварыНаСкладахОстатки.Склад.ТипСклада КАК СкладТипСклада,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ВНаличииОстаток,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0)) КАК ВРезервеОстаток,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) КАК КОтгрузкеОстаток,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОформлениюОстаток, 0)) КАК КОформлениюОстаток,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КСборкеОстаток, 0)) КАК КСборкеОстаток,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобираетсяОстаток, 0)) КАК СобираетсяОстаток,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобраноОстаток, 0)) КАК СобраноОстаток,
				|	ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобраноОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобираетсяОстаток, 0) КАК ЧИСЛО(15, 3)) КАК ОСТАТОК,
				|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.Родитель.МинимальныйОстатокДляПрайса, 0) КАК ЧИСЛО(15, 3))) КАК МинимальныйОстатокДляПрайса,
				|	ТоварыНаСкладахОстатки.Серия КАК Серия,
				|	ТоварыНаСкладахОстатки.Серия.ГоденДо КАК СерияГоденДо,
				|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) КАК ДоступныйОстаток,
				|	ТоварыНаСкладахОстатки.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияПартия_МССОСрокДействияАнализаТекущий
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(&Период, ) КАК ТоварыКОтгрузкеОстатки
				|		ПО ТоварыНаСкладахОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
				|			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
				|		ПО ТоварыНаСкладахОстатки.Склад = СвободныеОстаткиОстатки.Склад
				|			И ТоварыНаСкладахОстатки.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
				|		ПО ТоварыНаСкладахОстатки.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
				|ГДЕ
				|	ТоварыНаСкладахОстатки.Номенклатура.Ссылка = &Ссылка
				|	И (ТоварыНаСкладахОстатки.Склад = &Склад3
				|			ИЛИ ТоварыНаСкладахОстатки.Склад = &Склад5
				|				ИЛИ ТоварыНаСкладахОстатки.Склад = &Склад1)
				//|	И ШтрихкодыНоменклатуры.Штрихкод ЕСТЬ НЕ NULL 
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыНаСкладахОстатки.Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад,
				|	ТоварыНаСкладахОстатки.Серия,
				|	ТоварыНаСкладахОстатки.Склад.ТипСклада,
				|	ТоварыНаСкладахОстатки.Серия.ГоденДо,
				|	ТоварыНаСкладахОстатки.Серия.Партия_МССО.СрокДействияАнализаТекущий,
				|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0),
				|	ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобраноОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобираетсяОстаток, 0) КАК ЧИСЛО(15, 3))";
				
				
				ЗапросОстСкл.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
				ЗапросОстСкл.УстановитьПараметр("Ссылка", Записи.Ссылка);
				ЗапросОстСкл.УстановитьПараметр("Склад3", Справочники.Склады.Склад3);
				ЗапросОстСкл.УстановитьПараметр("Склад5", Справочники.Склады.Склад5); 
				ЗапросОстСкл.УстановитьПараметр("Склад1",  Справочники.Склады.Склад1);


				
				Склад3 = Справочники.Склады.Склад3;
				ДатаСравнения = ТекущаяДата()+ 14*86400;
				РезультатЗапросаОстСкл = ЗапросОстСкл.Выполнить().Выгрузить();
				
				ПроверятьСрокАнализа = РегистрыСведений.НоменклатураБезПроверкиСрокаАнализа.ПроверятьСрокАнализа(Записи.Ссылка);
				
				Для каждого стрСкл Из РезультатЗапросаОстСкл Цикл
					Если стрСкл.Склад = Склад3
						И ПроверятьСрокАнализа = ИСТИНА Тогда
						Если ЗначениеЗаполнено(стрСкл.СерияПартия_МССОСрокДействияАнализаТекущий) Тогда
							Если стрСкл.СерияПартия_МССОСрокДействияАнализаТекущий >= ДатаСравнения  Тогда
								ОстатокОбщий = ОстатокОбщий + стрСкл.ВНаличииОстаток;
							КонецЕсли;
						КонецЕсли;
						
						
						ВРезервеОстаток = стрСкл.ВРезервеОстаток;
						СобраноОстаток  = стрСкл.СобраноОстаток;
						СобираетсяОстаток = стрСкл.СобираетсяОстаток;
						МинимальныйОстатокДляПрайса = стрСкл.МинимальныйОстатокДляПрайса;
						ДоступныйОстаток = стрСкл.ДоступныйОстаток;
					Иначе
						ОстатокОбщий = ОстатокОбщий + стрСкл.ОСТАТОК;
						ВРезервеОстаток = стрСкл.ВРезервеОстаток;
						СобраноОстаток  = стрСкл.СобраноОстаток;
						СобираетсяОстаток = стрСкл.СобираетсяОстаток;
						МинимальныйОстатокДляПрайса = стрСкл.МинимальныйОстатокДляПрайса;
						ДоступныйОстаток = стрСкл.ДоступныйОстаток;
					КонецЕсли; 
				КонецЦикла; 
				
				ВсегоОстаток = ОстатокОбщий - ВРезервеОстаток - СобраноОстаток - СобираетсяОстаток;
				
				Если ВсегоОстаток > 0 И ДоступныйОстаток > 0 И ДоступныйОстаток >= МинимальныйОстатокДляПрайса И  ВсегоОстаток >= МинимальныйОстатокДляПрайса Тогда
					Остаток = 2;
					ТоварВИнтМаг = 2;
					//Луковичные кратность упаковки при выгрузке на сайт
					Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000013")
					ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("00-00000013") 
						ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель  = Справочники.Номенклатура.НайтиПоНаименованию("00-00000013") Тогда     //3.	Луковицы, корневища цветов
						
						ЕдИзмерУпак = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("упак",,,Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения);
						
						КратностьУпаковки = 0;
						
						ЗапросУпак = Новый Запрос;
						ЗапросУпак.Текст = 
						"ВЫБРАТЬ
						|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
						|	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
						|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
						|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
						|ИЗ
						|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
						|ГДЕ
						|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
						|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения";
						
						ЗапросУпак.УстановитьПараметр("Владелец", Записи.Ссылка);
						ЗапросУпак.УстановитьПараметр("ЕдиницаИзмерения", ЕдИзмерУпак);
						
						РезультатЗапросаУпак = ЗапросУпак.Выполнить();
						
						ВыборкаДетальныеЗаписиУпак = РезультатЗапросаУпак.Выбрать();
						
						КолВоВУпак = 1;
						Пока ВыборкаДетальныеЗаписиУпак.Следующий() Цикл
							КолВоВУпак = ВыборкаДетальныеЗаписиУпак.Числитель;
						КонецЦикла;
						
						КратностьУпаковки = ДоступныйОстаток / КолВоВУпак;
						
						Если КратностьУпаковки >=1 Тогда 
							Остаток = 2; 
							ТоварВИнтМаг = 2;

						КонецЕсли;
						
					КонецЕсли; 
					///
				Иначе	
					Остаток = 0;
				КонецЕсли; 
				
				
				
			КонецЕсли;
	
			
			///Предзаказ
			ТоварПрисутствуетВЗаказе = ЛОЖЬ;
			Если Константы.ПредзаказНаСайте.Получить() = ИСТИНА Тогда
				ТоварПрисутствуетВЗаказе = ПроверитьВхождениеТовараВЗаказПоступления(Записи.Ссылка);
				
				Если ТоварПрисутствуетВЗаказе = ИСТИНА Тогда	
					ДатаПоступления = "";
					Если Остаток = 0 Тогда
						
						//Запрос Товара на предзаказ	
						//Запрос Товара на предзаказ	
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ГрафикПоступленияТоваровОстатки.Номенклатура КАК Номенклатура,
						|	ГрафикПоступленияТоваровОстатки.Характеристика КАК Характеристика,
						|	ГрафикПоступленияТоваровОстатки.Склад КАК Склад,
						|	ГрафикПоступленияТоваровОстатки.ДатаСобытия КАК ДатаСобытия,
						|	ГрафикПоступленияТоваровОстатки.Назначение КАК Назначение,
						|	ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовОстаток КАК КоличествоИзЗаказовОстаток,
						|	ГрафикПоступленияТоваровОстатки.КоличествоПодЗаказОстаток КАК КоличествоПодЗаказОстаток,
						|	ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовСНеподтвержденнымиОстаток КАК КоличествоИзЗаказовСНеподтвержденнымиОстаток,
						|	ГрафикПоступленияТоваровОстатки.КоличествоПодЗаказСНеподтвержденнымиОстаток КАК КоличествоПодЗаказСНеподтвержденнымиОстаток,
						|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
						|	ГрафикПоступленияТоваровОстатки.Номенклатура.Родитель.МинимальныйОстатокДляПрайса КАК НоменклатураРодительМинимальныйОстатокДляПрайса
						|ПОМЕСТИТЬ ТАБЗАКАЗ
						|ИЗ
						|	РегистрНакопления.ГрафикПоступленияТоваров.Остатки КАК ГрафикПоступленияТоваровОстатки
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
						|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ГрафикПоступленияТоваровОстатки.Номенклатура)
						|			И (ТоварыНаСкладахОстатки.Склад = ГрафикПоступленияТоваровОстатки.Склад)
						|ГДЕ
						|	ГрафикПоступленияТоваровОстатки.Номенклатура = &Номенклатура
						|	И (ГрафикПоступленияТоваровОстатки.Склад.Ссылка = &Склад3
						|		ИЛИ ГрафикПоступленияТоваровОстатки.Склад.Ссылка = &Склад5)
						//|		И ГрафикПоступленияТоваровОстатки.ДатаСобытия  >= &ДатаСобытия
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ТАБЗАКАЗ.Номенклатура КАК Номенклатура,
						|	ТАБЗАКАЗ.Характеристика КАК Характеристика,
						|	ТАБЗАКАЗ.Склад КАК Склад,
						|	ТАБЗАКАЗ.ДатаСобытия КАК ДатаСобытия,
						|	ТАБЗАКАЗ.Назначение КАК Назначение,
						|	ТАБЗАКАЗ.КоличествоИзЗаказовОстаток КАК КоличествоИзЗаказовОстаток,
						|	ТАБЗАКАЗ.КоличествоПодЗаказОстаток КАК КоличествоПодЗаказОстаток,
						|	ТАБЗАКАЗ.КоличествоИзЗаказовСНеподтвержденнымиОстаток КАК КоличествоИзЗаказовСНеподтвержденнымиОстаток,
						|	ТАБЗАКАЗ.КоличествоПодЗаказСНеподтвержденнымиОстаток КАК КоличествоПодЗаказСНеподтвержденнымиОстаток,
						|	ТАБЗАКАЗ.ВНаличииОстаток КАК ВНаличииОстаток,
						|	ТАБЗАКАЗ.НоменклатураРодительМинимальныйОстатокДляПрайса КАК НоменклатураРодительМинимальныйОстатокДляПрайса
						|ИЗ
						|	ТАБЗАКАЗ КАК ТАБЗАКАЗ
						|ГДЕ
						|	ТАБЗАКАЗ.ВНаличииОстаток < ТАБЗАКАЗ.Номенклатура.Родитель.МинимальныйОстатокДляПрайса";
						
						Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
						
						Запрос.УстановитьПараметр("Склад3", Справочники.Склады.Склад3);
						Запрос.УстановитьПараметр("Склад5", Справочники.Склады.Склад5);
						Запрос.УстановитьПараметр("ДатаСобытия", ТекущаяДата());
						
						
						ТоварыПредзаказ = Запрос.Выполнить().Выгрузить();
						
						//в документе
						Если ТоварыПредзаказ.Количество() > 0 Тогда				
							Остаток = 3;       //предзаказ
							Если НачалоДня(ТоварыПредзаказ[0].ДатаСобытия) > НачалоДня(ТекущаяДата()) Тогда
								ДатаПоступления = Формат(ТоварыПредзаказ[0].ДатаСобытия, "ДФ='MMMM yyyy'");
							Иначе
								ДатаПоступления = "";
							КонецЕсли; 
							
						КонецЕсли; 
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;

			////// предзаказ
			
			
		КонецЕсли; 
		
		
				//Проверка на картофель и Саженцы и рассада	отбор по складу 3и		
		Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")      //Картофель
			ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") 
			
			ИЛИ Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004")                //Саженцы и рассада
				ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") 
					ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004")
					 	ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") Тогда
			
			ЗапросОст = Новый Запрос;
			
			ТекстЗапроса = 
				"ВЫБРАТЬ
				|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад КАК Склад,
				|	ТоварыНаСкладахОстатки.Склад.ТипСклада КАК СкладТипСклада,
				|	ТоварыНаСкладахОстатки.Склад.НомерМагазинаДляОтчетов КАК СкладНомерМагазинаДляОтчетов,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ВНаличииОстаток,
				|	МАКСИМУМ(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0)) КАК ВРезервеОстаток,
				|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0) КАК ОСТАТОК,
				|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) КАК ДоступныйОстаток
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
				|		ПО ТоварыНаСкладахОстатки.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
				|		ПО ТоварыНаСкладахОстатки.Склад = СвободныеОстаткиОстатки.Склад
				|			И ТоварыНаСкладахОстатки.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
				|ГДЕ
				|	ТоварыНаСкладахОстатки.Номенклатура.Ссылка = &Ссылка
				|	И (ТоварыНаСкладахОстатки.Склад = &Склад3и
				|			ИЛИ ТоварыНаСкладахОстатки.Склад = &МагИнтМаг
				|			ИЛИ ТоварыНаСкладахОстатки.Склад = &Склад1)
				|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
				|	И ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0) > 0
				|	И ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0) >= 0
				|	И ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) > 0
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыНаСкладахОстатки.Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад,
				|	ТоварыНаСкладахОстатки.Склад.ТипСклада,
				|	ТоварыНаСкладахОстатки.Склад.НомерМагазинаДляОтчетов,
				|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток, 0),
				|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0)
				|
				|УПОРЯДОЧИТЬ ПО
				|	СкладНомерМагазинаДляОтчетов";
					
			ЗапросОст.Текст = ТекстЗапроса;
			
			ЗапросОст.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
			ЗапросОст.УстановитьПараметр("Ссылка", Записи.Ссылка);
			//ЗапросОст.УстановитьПараметр("Склад3и", Справочники.Склады.НайтиПоНаименованию("Склад N 3и",ИСТИНА));
			
			//jadmin картошку переместили на 1 склад
			ЗапросОст.УстановитьПараметр("Склад1", Справочники.Склады.Склад1);
			ЗапросОст.УстановитьПараметр("Склад3и", Справочники.Склады.НайтиПоНаименованию("Склад N 3и",ИСТИНА));

			
			ЗапросОст.УстановитьПараметр("МагИнтМаг", Справочники.Склады.НайтиПоНаименованию("Интернет магазин",ИСТИНА));

			РезультатЗапросаОст = ЗапросОст.Выполнить().Выгрузить();
			
			Если РезультатЗапросаОст.Итог("ОСТАТОК") > 0.99 Тогда
				Остаток = 2;
			КонецЕсли;
			
			Если Записи.Ссылка.НеДоступенДляИнтМаг = ИСТИНА Тогда	
				Остаток = 0;
			КонецЕсли;
			
			
		КонецЕсли;
		

		
		Если Записи.Ссылка.НеДоступенДляИнтМаг = ИСТИНА Тогда	
			Остаток = 0;
		КонецЕсли;
		
		
		
		//Для каждого СтрокаРез Из РезультатЗапросаОст Цикл
		//	СтрокаРез.СкладНомерМагазинаДляОтчетов = Число(СтрокаРез.СкладНомерМагазинаДляОтчетов);
		//КонецЦикла; 
		
		ОстатокПоМагазинам = "";
		
		
		ЗапросОстМаг = Новый Запрос;
		ЗапросОстМаг.Текст = 
		"ВЫБРАТЬ
		|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	СвободныеОстаткиОстатки.Склад КАК Склад,
		|	СвободныеОстаткиОстатки.Склад.ТипСклада КАК СкладТипСклада,
		|	СвободныеОстаткиОстатки.Склад.НомерМагазинаДляОтчетов КАК СкладНомерМагазинаДляОтчетов,
		|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
		|	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток, 0) КАК ОСТАТОК
		|ИЗ
		|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
		|ГДЕ
		|	СвободныеОстаткиОстатки.Номенклатура.Ссылка = &Ссылка
		|	И СвободныеОстаткиОстатки.Склад.ТипСклада = &ТипСклада
		|	И СвободныеОстаткиОстатки.ВНаличииОстаток > 0
		|	И НЕ СвободныеОстаткиОстатки.Склад = &ИнтМаг
		|
		|УПОРЯДОЧИТЬ ПО
		|	СкладНомерМагазинаДляОтчетов" ;
		
		ЗапросОстМаг.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
		ЗапросОстМаг.УстановитьПараметр("Ссылка", Записи.Ссылка);
		ЗапросОстМаг.УстановитьПараметр("ТипСклада", Перечисления.ТипыСкладов.РозничныйМагазин);
		ЗапросОстМаг.УстановитьПараметр("ИнтМаг", Справочники.Склады.НайтиПоНаименованию("Интернет магазин",ИСТИНА));

		РезультатЗапросаОстМаг = ЗапросОстМаг.Выполнить().Выгрузить();
		
		Для Счетчик = 1 По 40 Цикл
			ОстатокМагазина = 0;
			Разделитель = "';'";
			Для каждого СтрокаРез Из РезультатЗапросаОстМаг Цикл
				Если Счетчик = Число(СтрокаРез.СкладНомерМагазинаДляОтчетов) Тогда
					//ОстатокМагазина = СтрокаРез.ВНаличииОстаток - СтрокаРез.ВРезервеОстаток;
					ОстатокМагазина = СтрокаРез.ОСТАТОК;
					
					Если ОстатокМагазина < 1 Тогда
						ОстатокМагазина = 0;
					КонецЕсли; 
					
					////Проверка на картофель НЕТ В НАЛИЧИИ	
					//Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")      //Картофель
					//	ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") Тогда 
					//
					//	ОстатокМагазина = 0;
					//
					//КонецЕсли;
					////
					
				КонецЕсли;
			КонецЦикла;
			
			Если Счетчик = 40 Тогда
				Разделитель = "";
			КонецЕсли; 
			ОстатокПоМагазинам = ОстатокПоМагазинам+ОстатокМагазина+Разделитель;
		КонецЦикла; 
		
		ОстатокПоМагазинам = СтрЗаменить(ОстатокПоМагазинам,",",".");
		
		
		Если Остаток = 0 Тогда
			Если РезультатЗапросаОстМаг.Итог("ОСТАТОК") >= 1 Тогда
				Остаток = 1;
			Иначе 
				Остаток = 0;
			КонецЕсли; 			
		КонецЕсли;
		
		

		
	//	//ПолучитьКОлВоПоОстатку
	//	
	//	Если Остаток = 2 Тогда
	//		
	//		ОстатокОбщий = 0;
	//		
	//		ЗапросОстатокОбщий = Новый Запрос;
	//		ЗапросОстатокОбщий.Текст = 
	//			"ВЫБРАТЬ
	//			|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	//			|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0)) КАК ДоступныйОстаток
	//			|ИЗ
	//			|	РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
	//			|ГДЕ
	//			|	СвободныеОстаткиОстатки.Номенклатура = &Ссылка
	//			|	И (СвободныеОстаткиОстатки.Склад = &Склад3
	//			|			ИЛИ СвободныеОстаткиОстатки.Склад = &Склад5
	//			|			ИЛИ СвободныеОстаткиОстатки.Склад = &ИнтМаг)
	//			|
	//			|СГРУППИРОВАТЬ ПО
	//			|	СвободныеОстаткиОстатки.Номенклатура";
	//		
	//		ЗапросОстатокОбщий.УстановитьПараметр("ИнтМаг", Справочники.Склады.НайтиПоНаименованию("Интернет магазин",ИСТИНА));
	//		ЗапросОстатокОбщий.УстановитьПараметр("Ссылка", Записи.Ссылка);
	//		ЗапросОстатокОбщий.УстановитьПараметр("Склад3", Справочники.Склады.НайтиПоНаименованию("склад N 3 Готовой продукции",ИСТИНА));
	//		ЗапросОстатокОбщий.УстановитьПараметр("Склад5", Справочники.Склады.НайтиПоНаименованию("склад N 5 Лукохранилище",ИСТИНА));

	//		РезультатЗапроса = ЗапросОстатокОбщий.Выполнить();
	//		
	//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//		
	//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//			ОстатокОбщий = ВыборкаДетальныеЗаписи.ДоступныйОстаток;
	//		КонецЦикла;
	//
	//	КонецЕсли; 
		
		
		//Товары под заказ от другого поставщика
		Если Остаток <> 2 Тогда
			
			ОстатокПодЗаказ = 0;
			
			ЗапросПодЗаказ = Новый Запрос;
			ЗапросПодЗаказ.Текст = 
			"ВЫБРАТЬ
			|	НоменклатураЧужая.Номенклатура КАК Номенклатура,
			|	НоменклатураЧужая.Остаток КАК Остаток
			|ИЗ
			|	РегистрСведений.НоменклатураЧужая КАК НоменклатураЧужая
			|ГДЕ
			|	НоменклатураЧужая.Номенклатура = &Номенклатура";
			
			ЗапросПодЗаказ.УстановитьПараметр("Номенклатура", Записи.Ссылка);
			
			РезультатЗапросаПодЗаказ = ЗапросПодЗаказ.Выполнить().Выбрать();
			
			Пока РезультатЗапросаПодЗаказ.Следующий() Цикл
				ОстатокПодЗаказ = РезультатЗапросаПодЗаказ.Остаток;
			КонецЦикла;
			
			Если ОстатокПодЗаказ >= 3 Тогда		
				Остаток = 2;  
				ТоварВИнтМаг = 5;

				ОстатокОбщий = 100;		
			КонецЕсли;
			
			
		КонецЕсли; 

		/////
		
		
		
			//Проверка на картофель НЕТ В НАЛИЧИИ	
		//Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")      //Картофель
		//	ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") Тогда 
		//	Остаток = 0;
		//КонецЕсли;
		//Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004")      //Саженцы И Рассада
		//	ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") 
		//		ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") Тогда 
		//	Остаток = 0;
		//КонецЕсли;
		
		ЭлементСправочника = Записи.Ссылка; 
		
		
		Код_Товара = ""+ЭлементСправочника.Код;

		
		Номер = Строка(ЭлементСправочника.Код);
		Номер = СтрЗаменить(Номер,"-","");
		
		
		Пока Лев(Номер, 1) = "0" Цикл 
			Номер = Прав(Номер, СтрДлина(Номер) - 1);
		КонецЦикла;
		
		Номер = Формат(Номер, "ЧГ=0");
		
		id = Номер;
		
		
		//НомерИзКонстанты
		НомерИзКонстанты = РегистрыСведений.КартинкиВыгрузка.ПолучитьНомерВыгрузки(Записи.Ссылка);		
		
		
		////Мета 

		Мета_title = "";
		Мета_url = "";
		Мета_meta_header = "";
		Мета_meta_description = "";
		Мета_meta_keyword = "";	
	
		ЗапросМета = Новый Запрос;
		ЗапросМета.Текст = 
			"ВЫБРАТЬ
			|	MetaДляСайта.Владелец КАК Владелец,
			|	MetaДляСайта.Наименование КАК Наименование,
			|	MetaДляСайта.url КАК url,
			|	MetaДляСайта.meta_header КАК meta_header,
			|	MetaДляСайта.meta_description КАК meta_description,
			|	MetaДляСайта.meta_keyword КАК meta_keyword,
			|	MetaДляСайта.ЗаголовокH1 КАК ЗаголовокH1,
			|	MetaДляСайта.ЗаголовокH2 КАК ЗаголовокH2
			|ИЗ
			|	Справочник.MetaДляСайта КАК MetaДляСайта
			|ГДЕ
			|	MetaДляСайта.Владелец = &Владелец
			|	И MetaДляСайта.ПометкаУдаления = ЛОЖЬ";
		
		ЗапросМета.УстановитьПараметр("Владелец", Записи.Ссылка);
		
		РезультатМета = ЗапросМета.Выполнить();
		
		ВыборкаМета = РезультатМета.Выбрать();
		
		Пока ВыборкаМета.Следующий() Цикл		
			Мета_title = ВыборкаМета.Наименование;
			Мета_url = ВыборкаМета.url;
			Мета_meta_header = ВыборкаМета.meta_header;
			Мета_meta_description = ВыборкаМета.meta_description;
			Мета_meta_keyword = ВыборкаМета.meta_keyword;		
		КонецЦикла;
		
		
		title = "";  
		Если ЗначениеЗаполнено(Мета_title) Тогда
			title = Мета_title;
		Иначе	
			title = СокрЛП(Записи.Ссылка.Наименование);   ///// наименование
		КонецЕсли;
		
		
		url = "";  
		Если ЗначениеЗаполнено(Мета_url) Тогда
			url = Мета_url;
		Иначе	
			url = Транслит(Строка(title));  			  ///// наименование на латинице  
			url = СтрЗаменить(url,"%","");
			url = СтрЗаменить(url,":","-");
			url = СтрЗаменить(url,"*","");
			url = СтрЗаменить(url,"--","-");
			
			url = НРег(url);
			
		КонецЕсли;
		
		
		
		disabled = 0;   ///////// Пока Если проставлен в номенклутуре признак "Не выгружать на сайт, то сразу убираем в выборке по запросу
		
		
		meta_header = "";
		Если ЗначениеЗаполнено(Мета_meta_header) Тогда
			meta_header = Мета_meta_header;
		Иначе	
			meta_header =   ""+Строка(title)+" купить в Минске - Цена и фото в интернет-магазине";
		КонецЕсли;
		
		meta_keyword = ""; 
		Если ЗначениеЗаполнено(Мета_meta_keyword) Тогда
			meta_keyword = Мета_meta_keyword;
		Иначе	
			meta_keyword = СокрЛП(Записи.Ссылка.Наименование);   ///// наименование
		КонецЕсли;
		
		
		
		meta_description  = "";  
		Если ЗначениеЗаполнено(Мета_meta_description) Тогда
			meta_description = Мета_meta_description;
		Иначе	
			//meta_description = "купить "+Строка(title)+" от компании «МинскСортСемОвощ» в Минске. Большой выбор, высокое качество и низкие цены.";
			//meta_description = ""+Строка(title)+" по выгодной цене! ➤➤➤ В компании «МинскСортСемОвощ» вы можете купить "+Строка(title)+" оптом и в розницу. ✅ Высокое качество. &#128666 Возможна доставка по Беларуси. ☎ Звоните по указанным на сайте телефонам.";
			meta_description = "Интернет-магазин Насенне &#127804 предлагает купить "+Строка(title)+" в Минске. &#10003 Низкие цены! &#10003 Работаем более 50 лет и имеем более 30 магазинов по Беларуси! ✈Доставка почтой! &#10003 50 лет на рынке!";
		КонецЕсли;
		
		
		content = ""; 
		
		
		//jadmin форматированный документ
		
		ОпиcаниеВHTML = ПолучитьФорматированныйДокОписание(Записи.Ссылка);
		
		Если ОпиcаниеВHTML <> "" Тогда	
			content = ОпиcаниеВHTML;				
		Иначе
			content =  СокрЛП(Записи.Ссылка.Описание);
			content = СтрЗаменить(content,Символы.ПС," ");
		КонецЕсли; 
		
		ВидеоHTML = "";
		Если ЗначениеЗаполнено(Записи.Ссылка.НазваниеВидеоФайла) Тогда
		   ВидеоHTML = "<div class=""d-flex mt-3 justify-content-center align-items-center"" style=""text-align: center;""><video style=""max-width:100%;height:450px;"" src=""/upload/video/" + Записи.Ссылка.НазваниеВидеоФайла + """ controls="" ""></video></div>";
			
		   content = content + ВидеоHTML;
		КонецЕсли;
		
		
		//краткоеОписание
		short_content  = СокрЛП(Записи.Ссылка.Описание);
		short_content = СтрЗаменить(short_content,Символы.ПС," ");
		
		
		weight  = "";  //ВесТовара
		Если Записи.ВесЗнаменатель <> 0 Тогда
			weight = Окр(Записи.ВесЧислитель / Записи.ВесЗнаменатель,3);  
		Иначе
			weight = Окр(Записи.ВесЧислитель,3);	
		КонецЕсли;
		
		weight = СтрЗаменить(weight,",",".");
		
		
		///ВыгрузкаКартинок
		image = "";     //////// картинка
		image_dop = "";
		images = "";
		
		//ОсновнаяКартинка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.Наименование КАК Наименование,
		|	Файлы.Расширение КАК Расширение,
		|	Файлы.Описание КАК Описание,
		|	Файлы.ВладелецФайла КАК ВладелецФайла,
		|	Файлы.Размер КАК Размер,
		|	Файлы.ТипХраненияФайла КАК ТипХраненияФайла,
		|	Файлы.Том.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
		|	Файлы.ПутьКФайлу КАК ПутьКФайлу
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И Файлы.ПометкаУдаления = ЛОЖЬ
		|	И Файлы.Наименование ПОДОБНО ""%site[_,-]%""
		|	И (Файлы.Расширение = ""jpg""
		|			ИЛИ Файлы.Расширение = ""png""
		|			ИЛИ Файлы.Расширение = ""jpeg"")";
		
		Запрос.УстановитьПараметр("ВладелецФайла", Записи.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
				
		Пока Выборка.Следующий() Цикл
			
			ИмяВремФайла = "";
			ИмяВремФайла = ""+Выборка.Наименование+"@"+НомерИзКонстанты+"."+Выборка.Расширение; //для обновления картинок добавляем номер дня в название файлоа
			ИмяКартинкаПоУмолчанию = ""+Выборка.Наименование+"."+Выборка.Расширение; //для обновления картинок добавляем номер дня в название файлоа
			
			РасположениеФайлаИсточника = "";
			
			Если ВыгружатьИзображения = ИСТИНА Тогда
				ПолноеИмяВремФайла = ""+сокрлп(Путь)+"image\"+ИмяВремФайла;				
				ПолноеИмяВремФайла = СтрЗаменить(ПолноеИмяВремФайла,"%","_");
				
				КартинкаПоУмолчаниюПолноеИмяФайла = ""+сокрлп(Путь)+"image\"+ИмяКартинкаПоУмолчанию;
				КартинкаПоУмолчаниюПолноеИмяФайла = СтрЗаменить(КартинкаПоУмолчаниюПолноеИмяФайла,"%","_");
				
				Если Выборка.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
					МенеджерЗаписи = РегистрыСведений.ПрисоединенныеФайлы.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.ПрисоединенныйФайл = Выборка.Ссылка;
					МенеджерЗаписи.Прочитать();
					ДвоичныеДанные = МенеджерЗаписи.ХранимыйФайл.Получить();
					
					Попытка

						ДвоичныеДанные.Записать(ПолноеИмяВремФайла);  
						ДвоичныеДанные.Записать(КартинкаПоУмолчаниюПолноеИмяФайла);					
						
						image = ИмяВремФайла;
						image = СтрЗаменить(image,"%","_");
					Исключение
						//Сообщить("Не удаётся записать временный файл на диск!!! "+"("+ПолноеИмяВремФайла+")");
					КонецПопытки;   
					
				Иначе						
					РасположениеФайлаИсточника = ""+Выборка.ТомПолныйПутьWindows + "" + Выборка.ПутьКФайлу;
					
                    КопироватьФайл(РасположениеФайлаИсточника,ПолноеИмяВремФайла);
				    КопироватьФайл(РасположениеФайлаИсточника,КартинкаПоУмолчаниюПолноеИмяФайла);
				КонецЕсли;

			Иначе
				//image = ""+Выборка.Наименование+"."+Выборка.Расширение;
				image = ИмяВремФайла;       
				image = СтрЗаменить(image,"%","_");	
			КонецЕсли;
			
			Если images = "" Тогда
				images = image;
			КонецЕсли; 
		КонецЦикла;	
		
		//ДополнительныеИзображения
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.Наименование КАК Наименование,
		|	Файлы.Расширение КАК Расширение,
		|	Файлы.Описание КАК Описание,
		|	Файлы.ВладелецФайла КАК ВладелецФайла,
		|	Файлы.Размер КАК Размер,
		|	Файлы.ТипХраненияФайла КАК ТипХраненияФайла,
		|	Файлы.Том.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
		|	Файлы.ПутьКФайлу КАК ПутьКФайлу
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
		|ГДЕ
		|	Файлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ Файлы.ПометкаУдаления
		|	И Файлы.Наименование ПОДОБНО ""%site[1-9]%""
		|	И (Файлы.Расширение = ""jpg""
		|			ИЛИ Файлы.Расширение = ""png""
		|			ИЛИ Файлы.Расширение = ""jpeg"")
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование" ;
		
		Запрос.УстановитьПараметр("ВладелецФайла", Записи.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ИмяВремФайла = "";
			ИмяВремФайла = ""+Выборка.Наименование+"@"+НомерИзКонстанты+"."+Выборка.Расширение; //для обновления картинок добавляем номер дня в название файлоа
			
			Если ВыгружатьИзображения = ИСТИНА Тогда	    
				ПолноеИмяВремФайла = ""+сокрлп(Путь)+"image\"+ИмяВремФайла;				
				ПолноеИмяВремФайла = СтрЗаменить(ПолноеИмяВремФайла,"%","_");	
				
				Если Выборка.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда

					МенеджерЗаписи = РегистрыСведений.ПрисоединенныеФайлы.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.ПрисоединенныйФайл = Выборка.Ссылка;
					МенеджерЗаписи.Прочитать();
					ДвоичныеДанные = МенеджерЗаписи.ХранимыйФайл.Получить();
					
					Попытка

		
						ДвоичныеДанные.Записать(ПолноеИмяВремФайла);  
						
						image_dop = ИмяВремФайла;
						image_dop = СтрЗаменить(image_dop,"%","_");	

					Исключение
						//Сообщить("Не удаётся записать временный файл на диск!!! "+"("+ПолноеИмяВремФайла+")");
					КонецПопытки;   
				Иначе						
					РасположениеФайлаИсточника = ""+Выборка.ТомПолныйПутьWindows + "" + Выборка.ПутьКФайлу;					
                    КопироватьФайл(РасположениеФайлаИсточника,ПолноеИмяВремФайла);					
				КонецЕсли;
			Иначе			
				image_dop = ИмяВремФайла;
				image_dop = СтрЗаменить(image_dop,"%","_");	
			КонецЕсли;
			
			Если images = "" Тогда
				images = image_dop;
			Иначе
				images = images + "#" + image_dop;
			КонецЕсли; 
	
		КонецЦикла;	

		
		
		custom_title = "";
		
		custom_title = СокрЛП(Записи.Ссылка.Наименование);
		
		price = 0;
		
		Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Розничных(Записи.Ссылка,ТекущаяДата())=ЛОЖЬ Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
			|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
			|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код КАК НоменклатураКод,
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК НоменклатураКоэффициентЕдиницыДляОтчетов
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
			|ГДЕ
			|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
			|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
			
			Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",Истина));
			Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
					
			РезультатЗапроса = Запрос.Выполнить();		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
			Если ВыборкаДетальныеЗаписи.Количество() = 0 И Остаток <> 0 Тогда				
				Продолжить;				
			КонецЕсли; 
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				price = ВыборкаДетальныеЗаписи.Цена;
			КонецЦикла;
			
			Код_Товара = ""+ВыборкаДетальныеЗаписи.НоменклатураКод;
			
		Иначе
			ОстатокПоСерииТЗ = СВ_ОбменКассовыйСервер.ПолучитьОстатокСерии(Записи.Ссылка,"Розница",КонецДня(ТекущаяДата()));		
		    ОстатокПоСерииТЗ.Сортировать("Цена УБЫВ");
			Если ОстатокПоСерииТЗ.Количество() > 0 Тогда
				price = ОстатокПоСерииТЗ[0].Цена;
				Код_Товара = ОстатокПоСерииТЗ[0].Номенклатура.Код;
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
				|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
				|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код КАК НоменклатураКод,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК НоменклатураКоэффициентЕдиницыДляОтчетов
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
				|ГДЕ
				|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
				|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
				
				Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",Истина));
				Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
				Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();		
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество() = 0 И Остаток <> 0 Тогда				
					Продолжить;				
				КонецЕсли; 
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					price = ВыборкаДетальныеЗаписи.Цена;
				КонецЦикла;
				
				Код_Товара = ""+ВыборкаДетальныеЗаписи.НоменклатураКод;
			КонецЕсли;
			
			
		КонецЕсли;
		
		
		new_ = 0;
		Если Записи.Ссылка.ПризнакНовинка Тогда
			new_ = 1;
		КонецЕсли; 
		
		
		popular = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопулярныеТоварыСрезПоследних.Период КАК Период,
		|	ПопулярныеТоварыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ПопулярныеТоварыСрезПоследних.ТекущийПопулярный КАК ТекущийПопулярный
		|ИЗ
		|	РегистрСведений.ПопулярныеТовары.СрезПоследних КАК ПопулярныеТоварыСрезПоследних
		|ГДЕ
		|	ПопулярныеТоварыСрезПоследних.Номенклатура = &Номенклатура
		|	И ПопулярныеТоварыСрезПоследних.ТекущийПопулярный = ИСТИНА";
		
		Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
		
		РезЗпрПопулярный = Запрос.Выполнить().Выбрать();	
		
		Если РезЗпрПопулярный.Количество()>0 Тогда
			popular = 1;
		КонецЕсли; 
		
		
		
		//////////////////////     
		
		ИнфоДляСайта = "";
		ФильтрХарактеристики = "";
		
		//
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Номенклатура.Родитель.Порядок1 КАК РодительПорядок1,
		//|	Номенклатура.Родитель.Порядок2 КАК РодительПорядок2,
		//|	Номенклатура.Родитель.Порядок3 КАК РодительПорядок3,
		//|	Номенклатура.Родитель.Порядок4 КАК РодительПорядок4,
		//|	Номенклатура.Родитель.Порядок5 КАК РодительПорядок5,
		//|	Номенклатура.Родитель.Порядок6 КАК РодительПорядок6,
		//|	Номенклатура.Родитель.Порядок7 КАК РодительПорядок7,
		//|	Номенклатура.Родитель.Порядок8 КАК РодительПорядок8,
		//|	Номенклатура.Родитель.Порядок9 КАК РодительПорядок9,
		//|	Номенклатура.Родитель.Порядок10 КАК РодительПорядок10,
		//|	Номенклатура.Родитель.Порядок11 КАК РодительПорядок11,
		//|	Номенклатура.Родитель.Порядок12 КАК РодительПорядок12,
		//|	Номенклатура.Родитель.Порядок13 КАК РодительПорядок13,
		//|	Номенклатура.Родитель.Порядок14 КАК РодительПорядок14,
		//|	Номенклатура.Родитель.Порядок15 КАК РодительПорядок15,
		//|	Номенклатура.Родитель.Порядок16 КАК РодительПорядок16,
		//|	Номенклатура.Родитель.Порядок17 КАК РодительПорядок17,
		//|	Номенклатура.Родитель.Порядок18 КАК РодительПорядок18,
		//|	Номенклатура.Родитель.Порядок19 КАК РодительПорядок19,
		//|	Номенклатура.Родитель.Порядок20 КАК РодительПорядок20,
		//|	Номенклатура.Родитель.ФильтрХар1 КАК ФильтрХар1,
		//|	Номенклатура.Родитель.ФильтрХар2 КАК ФильтрХар2,
		//|	Номенклатура.Родитель.ФильтрХар3 КАК ФильтрХар3,
		//|	Номенклатура.Родитель.ФильтрХар4 КАК ФильтрХар4,
		//|	Номенклатура.Родитель.ФильтрХар5 КАК ФильтрХар5,
		//|	Номенклатура.Родитель.ФильтрХар6 КАК ФильтрХар6,
		//|	Номенклатура.Родитель.ФильтрХар7 КАК ФильтрХар7,
		//|	Номенклатура.Родитель.ФильтрХар8 КАК ФильтрХар8,
		//|	Номенклатура.Родитель.ФильтрХар9 КАК ФильтрХар9,
		//|	Номенклатура.Родитель.ФильтрХар10 КАК ФильтрХар10,
		//|	Номенклатура.Родитель.ФильтрХар11 КАК ФильтрХар11,
		//|	Номенклатура.Родитель.ФильтрХар12 КАК ФильтрХар12,
		//|	Номенклатура.Родитель.ФильтрХар13 КАК ФильтрХар13,
		//|	Номенклатура.Родитель.ФильтрХар14 КАК ФильтрХар14,
		//|	Номенклатура.Родитель.ФильтрХар15 КАК ФильтрХар15,
		//|	Номенклатура.Родитель.ФильтрХар16 КАК ФильтрХар16,
		//|	Номенклатура.Родитель.ФильтрХар17 КАК ФильтрХар17,
		//|	Номенклатура.Родитель.ФильтрХар18 КАК ФильтрХар18,
		//|	Номенклатура.Родитель.ФильтрХар19 КАК ФильтрХар19,
		//|	Номенклатура.Родитель.ФильтрХар20 КАК ФильтрХар20,
		//|	Номенклатура.Родитель.Характеристика1 КАК РодительХарактеристика1,
		//|	Номенклатура.Родитель.Характеристика2 КАК РодительХарактеристика2,
		//|	Номенклатура.Родитель.Характеристика3 КАК РодительХарактеристика3,
		//|	Номенклатура.Родитель.Характеристика4 КАК РодительХарактеристика4,
		//|	Номенклатура.Родитель.Характеристика5 КАК РодительХарактеристика5,
		//|	Номенклатура.Родитель.Характеристика6 КАК РодительХарактеристика6,
		//|	Номенклатура.Родитель.Характеристика7 КАК РодительХарактеристика7,
		//|	Номенклатура.Родитель.Характеристика8 КАК РодительХарактеристика8,
		//|	Номенклатура.Родитель.Характеристика9 КАК РодительХарактеристика9,
		//|	Номенклатура.Родитель.Характеристика10 КАК РодительХарактеристика10,
		//|	Номенклатура.Родитель.Характеристика11 КАК РодительХарактеристика11,
		//|	Номенклатура.Родитель.Характеристика12 КАК РодительХарактеристика12,
		//|	Номенклатура.Родитель.Характеристика13 КАК РодительХарактеристика13,
		//|	Номенклатура.Родитель.Характеристика14 КАК РодительХарактеристика14,
		//|	Номенклатура.Родитель.Характеристика15 КАК РодительХарактеристика15,
		//|	Номенклатура.Родитель.Характеристика16 КАК РодительХарактеристика16,
		//|	Номенклатура.Родитель.Характеристика17 КАК РодительХарактеристика17,
		//|	Номенклатура.Родитель.Характеристика18 КАК РодительХарактеристика18,
		//|	Номенклатура.Родитель.Характеристика19 КАК РодительХарактеристика19,
		//|	Номенклатура.Родитель.Характеристика20 КАК РодительХарактеристика20
		//|ИЗ
		//|	Справочник.Номенклатура КАК Номенклатура
		//|ГДЕ
		//|	Номенклатура.Ссылка = &Ссылка";
		//
		//Запрос.УстановитьПараметр("Ссылка", Записи.Ссылка);
		//
		//ТЗ = Запрос.Выполнить().Выгрузить();
		//
		//
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураИнфоДляСайта.Ссылка КАК Ссылка,
		|	НоменклатураИнфоДляСайта.НомерСтроки КАК Порядок,
		|	ВЫБОР
		|		КОГДА НоменклатураИнфоДляСайта.Значение.ПолноеНаименование = """"
		|			ТОГДА НоменклатураИнфоДляСайта.Значение.Наименование
		|		ИНАЧЕ НоменклатураИнфоДляСайта.Значение.ПолноеНаименование
		|	КОНЕЦ КАК Значение,
		|	НоменклатураИнфоДляСайта.Наименование.Наименование КАК Наименование,
		|	0 КАК Фильтр
		|ИЗ
		|	Справочник.Номенклатура.ИнфоДляСайта КАК НоменклатураИнфоДляСайта
		|ГДЕ
		|	НоменклатураИнфоДляСайта.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураИнфоДляСайта.НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", Записи.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Хар = РезультатЗапроса.Выгрузить();
			
			//Хар.Колонки.Добавить("Порядок");
			//Хар.Колонки.Добавить("Фильтр");
			//Хар.Колонки.Добавить("Наименование");
			
			
		//	
		//	Хар[0].Порядок = ТЗ[0].РодительПорядок1; 
		//	Хар[1].Порядок = ТЗ[0].РодительПорядок2;
		//	Хар[2].Порядок = ТЗ[0].РодительПорядок3;
		//	Хар[3].Порядок = ТЗ[0].РодительПорядок4;
		//	Хар[4].Порядок = ТЗ[0].РодительПорядок5;
		//	Хар[5].Порядок = ТЗ[0].РодительПорядок6;
		//	Хар[6].Порядок = ТЗ[0].РодительПорядок7;
		//	Хар[7].Порядок = ТЗ[0].РодительПорядок8;
		//	Хар[8].Порядок = ТЗ[0].РодительПорядок9;
		//	Хар[9].Порядок = ТЗ[0].РодительПорядок10;
		//	Хар[10].Порядок = ТЗ[0].РодительПорядок11; 
		//	Хар[11].Порядок = ТЗ[0].РодительПорядок12;
		//	Хар[12].Порядок = ТЗ[0].РодительПорядок13;
		//	Хар[13].Порядок = ТЗ[0].РодительПорядок14;
		//	Хар[14].Порядок = ТЗ[0].РодительПорядок15;
		//	Хар[15].Порядок = ТЗ[0].РодительПорядок16;
		//	Хар[16].Порядок = ТЗ[0].РодительПорядок17;
		//	Хар[17].Порядок = ТЗ[0].РодительПорядок18;
		//	Хар[18].Порядок = ТЗ[0].РодительПорядок19;
		//	Хар[19].Порядок = ТЗ[0].РодительПорядок20;
		//	
		//	Хар[0].Фильтр = ?(ТЗ[0].ФильтрХар1=ИСТИНА,1,0); 
		//	Хар[1].Фильтр = ?(ТЗ[0].ФильтрХар2=ИСТИНА,1,0);
		//	Хар[2].Фильтр = ?(ТЗ[0].ФильтрХар3=ИСТИНА,1,0);
		//	Хар[3].Фильтр = ?(ТЗ[0].ФильтрХар4=ИСТИНА,1,0);
		//	Хар[4].Фильтр = ?(ТЗ[0].ФильтрХар5=ИСТИНА,1,0);
		//	Хар[5].Фильтр = ?(ТЗ[0].ФильтрХар6=ИСТИНА,1,0);
		//	Хар[6].Фильтр = ?(ТЗ[0].ФильтрХар7=ИСТИНА,1,0);
		//	Хар[7].Фильтр = ?(ТЗ[0].ФильтрХар8=ИСТИНА,1,0);
		//	Хар[8].Фильтр = ?(ТЗ[0].ФильтрХар9=ИСТИНА,1,0);
		//	Хар[9].Фильтр = ?(ТЗ[0].ФильтрХар10=ИСТИНА,1,0);
		//	Хар[10].Фильтр = ?(ТЗ[0].ФильтрХар11=ИСТИНА,1,0); 
		//	Хар[11].Фильтр = ?(ТЗ[0].ФильтрХар12=ИСТИНА,1,0);
		//	Хар[12].Фильтр = ?(ТЗ[0].ФильтрХар13=ИСТИНА,1,0);
		//	Хар[13].Фильтр = ?(ТЗ[0].ФильтрХар14=ИСТИНА,1,0);
		//	Хар[14].Фильтр = ?(ТЗ[0].ФильтрХар15=ИСТИНА,1,0);
		//	Хар[15].Фильтр = ?(ТЗ[0].ФильтрХар16=ИСТИНА,1,0);
		//	Хар[16].Фильтр = ?(ТЗ[0].ФильтрХар17=ИСТИНА,1,0);
		//	Хар[17].Фильтр = ?(ТЗ[0].ФильтрХар18=ИСТИНА,1,0);
		//	Хар[18].Фильтр = ?(ТЗ[0].ФильтрХар19=ИСТИНА,1,0);
		//	Хар[19].Фильтр = ?(ТЗ[0].ФильтрХар20=ИСТИНА,1,0);
		//	
		//	Хар[0].Наименование = ТЗ[0].РодительХарактеристика1; 
		//	Хар[1].Наименование = ТЗ[0].РодительХарактеристика2;
		//	Хар[2].Наименование = ТЗ[0].РодительХарактеристика3;
		//	Хар[3].Наименование = ТЗ[0].РодительХарактеристика4;
		//	Хар[4].Наименование = ТЗ[0].РодительХарактеристика5;
		//	Хар[5].Наименование = ТЗ[0].РодительХарактеристика6;
		//	Хар[6].Наименование = ТЗ[0].РодительХарактеристика7;
		//	Хар[7].Наименование = ТЗ[0].РодительХарактеристика8;
		//	Хар[8].Наименование = ТЗ[0].РодительХарактеристика9;
		//	Хар[9].Наименование = ТЗ[0].РодительХарактеристика10;
		//	Хар[10].Наименование = ТЗ[0].РодительХарактеристика11; 
		//	Хар[11].Наименование = ТЗ[0].РодительХарактеристика12;
		//	Хар[12].Наименование = ТЗ[0].РодительХарактеристика13;
		//	Хар[13].Наименование = ТЗ[0].РодительХарактеристика14;
		//	Хар[14].Наименование = ТЗ[0].РодительХарактеристика15;
		//	Хар[15].Наименование = ТЗ[0].РодительХарактеристика16;
		//	Хар[16].Наименование = ТЗ[0].РодительХарактеристика17;
		//	Хар[17].Наименование = ТЗ[0].РодительХарактеристика18;
		//	Хар[18].Наименование = ТЗ[0].РодительХарактеристика19;
		//	Хар[19].Наименование = ТЗ[0].РодительХарактеристика20;
			
			Стр20 = Хар.Добавить();
			//Стр20.НомерСтроки = 21;
			Стр20.Наименование = "Страна происхождения";
			Стр20.Порядок = 21;
			Стр20.Фильтр = 0;    //ЛОЖЬ
			Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")      //семена овощей
				//ИЛИ Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")      //семена цветов
				Тогда
			    Стр20.Значение = "";
			Иначе	
				Стр20.Значение = Записи.Ссылка.СтранаПроисхождения;
			КонецЕсли; 
			
			//Для i=0 По Хар.Количество()-1 Цикл
			//	
			//	Если Хар[i].Порядок = 0 Тогда
			//		Хар[i].Порядок = Хар[i].НомерСтроки;
			//	КонецЕсли;
			//	
			//КонецЦикла; 
			
			Хар.Сортировать("Порядок") ;
			
			
			Для i=0 По Хар.Количество()-1 Цикл
				Если Хар[i].Значение <> "" Тогда   
					Хар[i].Значение = СтрЗаменить(Хар[i].Значение,"""","");  
					
					ИнфоДляСайта = ИнфоДляСайта + Хар[i].Наименование + ":" + Хар[i].Значение + "#" ;
				КонецЕсли;
			КонецЦикла; 
			
			//Для i = 0 По 20 Цикл
			//	Попытка		
			//		Если СтрДлина(Хар[i].Порядок)<2 Тогда
			//			Хар[i].Порядок = "0" + Хар[i].Порядок;
			//		КонецЕсли;		
			//		ФильтрХарактеристики = ФильтрХарактеристики + Хар[i].Порядок + Хар[i].Значение + "#" + Хар[i].Фильтр + "#" + Хар[i].Наименование + "';'" ;			
			//	Исключение
			//		ФильтрХарактеристики = ФильтрХарактеристики + "';'" ;		
			//	КонецПопытки;			
			//КонецЦикла; 
			
			Хар.Очистить();
		Иначе
			Для i = 0 По 20 Цикл
				ФильтрХарактеристики = ФильтрХарактеристики + "';'" ;		
			КонецЦикла; 
		КонецЕсли; 		
		
		
		ИнфоДляСайта = СтрЗаменить(ИнфоДляСайта,Символы.ПС,"");
		//ФильтрХарактеристики = СтрЗаменить(ФильтрХарактеристики,Символы.ПС,"");
		
		
		//////////////////////	
		
		upak = "";
		sale_percent = 0; //ПроцентСкидки
		sale_price = 0; //ЦенаСоСкидкой
		ЦенаСоСкидкой = 0;
		
		Если Остаток <> 0 Тогда
			
			Если СтрНайти(Записи.Ссылка.ЕдиницаДляОтчетов.Наименование, "упак") > 0  Тогда
				Если ВыборкаДетальныеЗаписи.НоменклатураКоэффициентЕдиницыДляОтчетов > 1 Тогда
					price = Окр(ВыборкаДетальныеЗаписи.Цена * ВыборкаДетальныеЗаписи.НоменклатураКоэффициентЕдиницыДляОтчетов,2);
					ОстатокОбщий = ЦЕЛ(ОстатокОбщий / ВыборкаДетальныеЗаписи.НоменклатураКоэффициентЕдиницыДляОтчетов);
				КонецЕсли; 
			КонецЕсли; 
			
			Если Записи.Ссылка.ЕИдляСайта = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
				upak = Записи.Ссылка.ЕдиницаДляОтчетов.Наименование;
			Иначе	
				upak = Записи.Ссылка.ЕИдляСайта.Наименование;
			КонецЕсли; 
			//upak = Записи.Ссылка.ЕдиницаДляОтчетов.Наименование;  
			
			//Скидка 	
			sale_percent = 0; //ПроцентСкидки
			sale_price = 0; //ЦенаСоСкидкой
			sale_price_effective_date = Неопределено;
			ЦенаСоСкидкой = 0;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РозничныеСкидкиМССОСрезПоследних.Период КАК Период,
			|	РозничныеСкидкиМССОСрезПоследних.Регистратор КАК Регистратор,
			|	РозничныеСкидкиМССОСрезПоследних.НомерСтроки КАК НомерСтроки,
			|	РозничныеСкидкиМССОСрезПоследних.Активность КАК Активность,
			|	РозничныеСкидкиМССОСрезПоследних.Магазин КАК Магазин,
			|	РозничныеСкидкиМССОСрезПоследних.Номенклатура КАК Номенклатура,
			|	РозничныеСкидкиМССОСрезПоследних.ШтрихКод КАК ШтрихКод,
			|	РозничныеСкидкиМССОСрезПоследних.Скидка КАК Скидка,
			|	РозничныеСкидкиМССОСрезПоследних.РазмерСкидки КАК РазмерСкидки,
			|	РозничныеСкидкиМССОСрезПоследних.ДатаНачала КАК ДатаНачала,
			|	РозничныеСкидкиМССОСрезПоследних.ДатаОкончания КАК ДатаОкончания,
			|	РозничныеСкидкиМССОСрезПоследних.Статус КАК Статус,
			|	РозничныеСкидкиМССОСрезПоследних.РозничнаяЦена КАК РозничнаяЦена,
			|	РозничныеСкидкиМССОСрезПоследних.РозничнаяЦенаСоСкидкой КАК РозничнаяЦенаСоСкидкой,
			|	РозничныеСкидкиМССОСрезПоследних.Скидка.Ссылка КАК СкидкаСсылка
			|ИЗ
			|	РегистрСведений.РозничныеСкидкиМССО.СрезПоследних КАК РозничныеСкидкиМССОСрезПоследних
			|ГДЕ
			|	РозничныеСкидкиМССОСрезПоследних.Номенклатура = &Номенклатура
			|	И РозничныеСкидкиМССОСрезПоследних.ДатаНачала <= &Дата
			|	И РозничныеСкидкиМССОСрезПоследних.ДатаОкончания >= &Дата
			|	И РозничныеСкидкиМССОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
			|	И РозничныеСкидкиМССОСрезПоследних.Магазин = &Магазин
			|
			|УПОРЯДОЧИТЬ ПО
			|	РазмерСкидки УБЫВ";
			
			Запрос.УстановитьПараметр("Дата", ТекущаяДата());
			Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
			Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДействияСкидок.Действует);
			Запрос.УстановитьПараметр("Магазин", Справочники.Склады.НайтиПоНаименованию("Интернет магазин"));

			
			РезЗпрСкидка = Запрос.Выполнить().Выгрузить();
			
			Если РезЗпрСкидка.Количество() > 0 Тогда
				//2016–02–24T13:00–0800/2016–02–29T15:30–0800
				ДатаНачала = Формат(РезЗпрСкидка[0].ДатаНачала,"ДФ=yyyy-MM-ddThh:mm+0300");
				ДатаОкончания =  Формат(РезЗпрСкидка[0].ДатаОкончания,"ДФ=yyyy-MM-ddThh:mm+0300");
				sale_price_effective_date = "" + ДатаНачала + "/" + ДатаОкончания;
				
				Если РезЗпрСкидка[0].СкидкаСсылка = Справочники.РозничныеСкидки_МССО.НайтиПоНаименованию("Специальная цена",ИСТИНА) Тогда    //код 000000003
					
					ЦенаСоСкидкой = РезЗпрСкидка[0].РозничнаяЦенаСоСкидкой;
					price = ЦенаСоСкидкой;

				ИначеЕсли РезЗпрСкидка[0].СкидкаСсылка = Справочники.РозничныеСкидки_МССО.НайтиПоНаименованию("Скидка (наценка) процентом",ИСТИНА) Тогда    //код 000000002
					
					sale_percent = РезЗпрСкидка[0].РазмерСкидки;
					
					
					Если СтрНайти(Записи.Ссылка.ЕдиницаДляОтчетов.Наименование, "упак") > 0  Тогда
						Если ВыборкаДетальныеЗаписи.НоменклатураКоэффициентЕдиницыДляОтчетов > 1 Тогда
							sale_price = Окр(ВыборкаДетальныеЗаписи.Цена* (1 - sale_percent/100),2,РежимОкругления.Окр15как10) * ВыборкаДетальныеЗаписи.НоменклатураКоэффициентЕдиницыДляОтчетов;
						Иначе
							ЦенаСоСкидкой = Окр(price * (1 - sale_percent/100),2,РежимОкругления.Окр15как10);
							sale_price = ЦенаСоСкидкой;
						КонецЕсли;
					Иначе
						ЦенаСоСкидкой = Окр(price * (1 - sale_percent/100),2,РежимОкругления.Окр15как10);
						sale_price = ЦенаСоСкидкой;
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		sale_percent = СтрЗаменить(Строка(sale_percent),Символы.НПП,"");
		sale_percent = СтрЗаменить(Строка(sale_percent),",",".");

		
		sale_price = СтрЗаменить(Строка(sale_price),Символы.НПП,"");
		sale_price = СтрЗаменить(Строка(sale_price),",",".");
		//
		price = СтрЗаменить(Строка(price),Символы.НПП,"");
		price = СтрЗаменить(Строка(price),",",".");
		
		
		//minprice
		minprice = 0;
		Если Записи.Ссылка.РегулированиеЦенРозница = ИСТИНА 
			ИЛИ Записи.Ссылка.Родитель.РегулированиеЦенРозница = ИСТИНА
			ИЛИ Записи.Ссылка.Родитель.Родитель.РегулированиеЦенРозница = ИСТИНА
			ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель.РегулированиеЦенРозница = ИСТИНА
			ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель.Родитель.РегулированиеЦенРозница = ИСТИНА
			Тогда
		
			minprice = ""+price;	
		
		КонецЕсли;
		
		
		
		
		
		product_status = 1;
		
		
		//Набор для интернет магазина / кратность упаковки
		НаборДляИнтМаг = 1;		
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковкиЕдиницыИзмерения.Владелец.Ссылка КАК Номенклатура,
			|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
			|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|ГДЕ
			|	УпаковкиЕдиницыИзмерения.Владелец.Ссылка = &Номенклатура
			|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдИзм";
		
		Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
		Запрос.УстановитьПараметр("ЕдИзм", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("Н-р для ИнтМаг",,,Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения));

		
		РезЗпр = Запрос.Выполнить().Выбрать();
		
			Пока РезЗпр.Следующий() Цикл
			     НаборДляИнтМаг = РезЗпр.Числитель;
			КонецЦикла;
		
		///Признак для созданияФидаНаКартах
		feed_maps = 0;
		feed_maps = РегистрыСведений.ТоварыДляВыгрузкиНаКартыYML.ПроверитьНаличиеВРегистре(Записи.Ссылка);		
		
		///// ГруппаДляСайта 			
		parent_id = "";						
		
		parent_id = Записи.КодГруппыДляСайта;                 			
		parent_id =  СтрЗаменить(Строка(parent_id), Символы.НПП, "");	
		
		
		ГруппаАкции = "0";
		ГруппаПроцентСкидки = "0";
		ГруппаКоличествоТоваровДляАкции = "0"; 
		АкцияПлюс1 = "0";
		
		
		Ликвидация = 0;
		Если Записи.Ссылка.Неликвид = ИСТИНА Тогда
		
			Ликвидация = 1;	
		
		КонецЕсли;
		
		ГруппаНоменклатурыКод = "";
		ГруппаНоменклатуры = ПолучитьРодителя(Записи.Ссылка);
		ГруппаНоменклатурыКод = ГруппаНоменклатуры.Код;
		////Записываем строчку в файл	
		
		Если СтрокаФайла = 1 Тогда
			СтрСтрокаФайла = 99999;
			СтрСтрокаФайла = СтрЗаменить(СтрСтрокаФайла,Символы.НПП,"");
			
			СтрокаТекст = "'"+СтрСтрокаФайла + "';'" + Строка(id)+"';'"+Строка(title)+"';'"+Строка(url)+"';'"+parent_id+"';'"+disabled+"';'"+meta_header+"';'"+meta_keyword+"';'"+
			meta_description+"';'"+content+"';'"+short_content+"';'"+weight+"';'"+image+"';'"+images+"';'"+НомерИзКонстанты+"';'"+custom_title+"';'"+price+"';'"+sale_percent+"';'"+sale_price+"';'"+sale_price_effective_date+"';'"+НаборДляИнтМаг+"';'"+new_+"';'"+popular+"';'"+Ликвидация+"';'"+
			upak+"';'"+Код_Товара+"';'"+Остаток+"';'"+ОстатокОбщий+"';'"+ДатаПоступления+"';'"+ОстатокПоМагазинам+"';'"+ИнфоДляСайта+"';'"+product_status+"';'"+feed_maps+"';'"+ГруппаАкции+"';'"+ГруппаПроцентСкидки+"';'"+ГруппаКоличествоТоваровДляАкции+"';'"+АкцияПлюс1+"';'"+minprice+"';'"+
			ГруппаНоменклатурыКод+"';'"+ТоварВИнтМаг+"';'";
			//upak+"';'"+Код_Товара+"';'"+Остаток+"';'"+ОстатокОбщий+"';'"+ДатаПоступления+"';'"+ОстатокПоМагазинам+"';'"+ИнфоДляСайта+"';'"+product_status+"';'"+feed_maps+"';'"+ФильтрХарактеристики+"';"+ГруппаАкции+"';"+ГруппаПроцентСкидки+"';"+ГруппаКоличествоТоваровДляАкции+"';";

			
			СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
			ТекстовыйФайлUTF8_Bom.Добавить(СтрокаТекст);			
		КонецЕсли; 
		
		//ТоварВИнтМаг выгрузить товар есть в инт маг 1 есть 2 нет
		СтрокаФайла = СтрокаФайла + 1;	
		СтрСтрокаФайла = СтрЗаменить(СтрокаФайла,Символы.НПП,"");
		
		СтрокаТекст = "'"+СтрСтрокаФайла + "';'" + Строка(id)+"';'"+Строка(title)+"';'"+Строка(url)+"';'"+parent_id+"';'"+disabled+"';'"+meta_header+"';'"+meta_keyword+"';'"+
		meta_description+"';'"+content+"';'"+short_content+"';'"+weight+"';'"+image+"';'"+images+"';'"+НомерИзКонстанты+"';'"+custom_title+"';'"+price+"';'"+sale_percent+"';'"+sale_price+"';'"+sale_price_effective_date+"';'"+НаборДляИнтМаг+"';'"+new_+"';'"+popular+"';'"+Ликвидация+"';'"+
		upak+"';'"+Код_Товара+"';'"+Остаток+"';'"+ОстатокОбщий+"';'"+ДатаПоступления+"';'"+ОстатокПоМагазинам+"';'"+ИнфоДляСайта+"';'"+product_status+"';'"+feed_maps+"';'"+ГруппаАкции+"';'"+ГруппаПроцентСкидки+"';'"+ГруппаКоличествоТоваровДляАкции+"';'"+АкцияПлюс1+"';'"+minprice+"';'"+
		ГруппаНоменклатурыКод+"';'"+ТоварВИнтМаг+"';'";
		
		СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
		ТекстовыйФайлUTF8_Bom.Добавить(СтрокаТекст);
		
		///Проверка на допгруппы для сайта
		ГруппаСайта = "";
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДляСайта.Номенклатура.Наименование КАК Наименование,
		|	ГруппыДляСайта.Номенклатура.Код КАК Код,
		|	ГруппыДляСайта.Номенклатура.ВесЧислитель КАК ВесЧислитель,
		|	ГруппыДляСайта.Номенклатура.Ссылка КАК Ссылка,
		|	ГруппыДляСайта.ГруппаДляСайта.Код КАК ГруппаДляСайтаКод
		|ИЗ
		|	РегистрСведений.ГруппыДляСайта КАК ГруппыДляСайта
		|ГДЕ
		|	ГруппыДляСайта.Номенклатура = &Номенклатура
		|	И ГруппыДляСайта.Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И ГруппыДляСайта.Номенклатура.НеВыгружатьНаСайт = ЛОЖЬ
		|	И ГруппыДляСайта.ОсновнаяГруппа = ЛОЖЬ
		|	И ГруппыДляСайта.ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ";
		
		
		Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока РезультатЗапроса.Следующий() Цикл
			parent_id="";
			//popular = 0;
			//new_ = 0;
			ГруппаЗначение = РезультатЗапроса.ГруппаДляСайтаКод;
			parent_id = ГруппаЗначение;
			parent_id =  СтрЗаменить(Строка(parent_id), Символы.НПП, "");
			feed_maps = 0;
			////Записываем строчку в файл	
			СтрокаФайла = СтрокаФайла + 1;	
			СтрСтрокаФайла = СтрЗаменить(СтрокаФайла,Символы.НПП,"");
			
			СтрокаТекст = "'"+СтрСтрокаФайла + "';'" + Строка(id)+"';'"+Строка(title)+"';'"+Строка(url)+"';'"+parent_id+"';'"+disabled+"';'"+meta_header+"';'"+meta_keyword+"';'"+
			meta_description+"';'"+content+"';'"+short_content+"';'"+weight+"';'"+image+"';'"+images+"';'"+НомерИзКонстанты+"';'"+custom_title+"';'"+price+"';'"+sale_percent+"';'"+sale_price+"';'"+sale_price_effective_date+"';'"+НаборДляИнтМаг+"';'"+new_+"';'"+popular+"';'"+Ликвидация+"';'"+
			upak+"';'"+Код_Товара+"';'"+Остаток+"';'"+ОстатокОбщий+"';'"+ДатаПоступления+"';'"+ОстатокПоМагазинам+"';'"+ИнфоДляСайта+"';'"+product_status+"';'"+feed_maps+"';'"+ГруппаАкции+"';'"+ГруппаПроцентСкидки+"';'"+ГруппаКоличествоТоваровДляАкции+"';'"+АкцияПлюс1+"';'"+minprice+"';'"+
			ГруппаНоменклатурыКод+"';'"+ТоварВИнтМаг+"';'";
			
			СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
			ТекстовыйФайлUTF8_Bom.Добавить(СтрокаТекст);
		КонецЦикла;		
		
	КонецЦикла;
	
	Строка = СтрСоединить(ТекстовыйФайлUTF8_Bom, Символы.ПС);  //переделка в строку
	                                                                                       
	ТДок = Новый ТекстовыйДокумент;

	ТДок.ДобавитьСтроку(Строка);
	
	ТДок.Записать(КаталогВыгрузки_product,"UTF-8");
	
	
	// открываем файл и считываем символы после символов BOM
	Данные = Новый ДвоичныеДанные(КаталогВыгрузки_product);
	Строка64=Base64Строка(Данные);
	Строка64=Прав(Строка64,СтрДлина(Строка64)-4);
	ДанныеНаЗапись=Base64Значение(Строка64);
	ДанныеНаЗапись.Записать(КаталогВыгрузки_product); // записываем
	
	//Сообщить("Выгрузка завершена.");
	
	
КонецПроцедуры
//  

&НаСервере
Процедура ВыгрузитьОптНаСервере(ВыгружатьИзображения)
	
	//
		Путь = ПолучитьПуть();
		КаталогВыгрузки_product = ""+сокрлп(Путь)+"productopt.csv";
		
		
		//НомерИзКонстанты = Константы.ТекущееЗначениеДляВыгрузкиКартинокНаСайт.Получить();

		//Файл_product = Новый ЗаписьТекста(КаталогВыгрузки_product,КодировкаТекста.UTF8);
		
		//СтрСтрокаФайла = СтрЗаменить(СтрокаФайла,Символы.НПП,"");

		//ТекстовыйФайлUTF8_Bom = Новый ТекстовыйДокумент;
         ТекстовыйФайлUTF8_Bom = Новый Массив;
	
	//////////////////////////////////////////////////////////////	
		//
		//Файл_product.ЗаписатьСтроку(""+СтрСтрокаФайла+";"+"0"+";"+""+";"+""+";"+""+";"+"0"+";"+""+";"+""+";"+
		//	""+";"+""+";"+""+";"+""+";"+""+";"+"0"+";"+"0"+";"+"0"+";"+"0"+";"+"0"+";"+""+";"+""+";"+"0"+";"+""+";"+"");

	
		НеВыгружатьПустыеХарактеристики = Истина;
	    СтрокаФайла = 1;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Родитель.Код КАК РодительКод
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ИСТИНА
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		//jadmin|	И Номенклатура.Характеристика1 <> """"
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
		
		РезультатЗапроса = Запрос.Выполнить();
		Записи = РезультатЗапроса.Выбрать();
		
		МассивГрупп = Новый Массив;

		XXX_НомерПоПорядку = 0;
		Пока Записи.Следующий() Цикл	
			МассивГрупп.Добавить(Записи.Ссылка);	
		КонецЦикла;
		
		
		///
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДляСайта.Номенклатура.Наименование КАК Наименование,
		|	ГруппыДляСайта.Номенклатура.Код КАК Код,
		|	ГруппыДляСайта.Номенклатура.ВесЧислитель КАК ВесЧислитель,
		|	ГруппыДляСайта.Номенклатура.Ссылка КАК Ссылка,
		|	ГруппыДляСайта.ГруппаДляСайта.Код КАК КодГруппыДляСайта,
		|	ВЫБОР
		|		КОГДА ГруппыДляСайта.Номенклатура.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.Родитель.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.Родитель.Родитель.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ГруппыДляСайта.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НедоступноДляОпта
		|ПОМЕСТИТЬ ТАБ
		|ИЗ
		|	РегистрСведений.ГруппыДляСайта КАК ГруппыДляСайта
		|ГДЕ
		|	ГруппыДляСайта.Номенклатура.Ссылка В ИЕРАРХИИ(&ГруппаСсылка)
		|	И ГруппыДляСайта.Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И ГруппыДляСайта.Номенклатура.НеВыгружатьНаСайт = ЛОЖЬ
		|	И ГруппыДляСайта.ОсновнаяГруппа = ИСТИНА
		|	И ГруппыДляСайта.ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТАБ.Наименование КАК Наименование,
		|	ТАБ.Код КАК Код,
		|	ТАБ.ВесЧислитель КАК ВесЧислитель,
		|	ТАБ.Ссылка КАК Ссылка,
		|	ТАБ.КодГруппыДляСайта КАК КодГруппыДляСайта
		|ИЗ
		|	ТАБ КАК ТАБ
		|ГДЕ
		|	ТАБ.НедоступноДляОпта <> 1";


		Запрос.УстановитьПараметр("ГруппаСсылка",МассивГрупп);
		
		РезультатЗапроса = Запрос.Выполнить();

		Записи = РезультатЗапроса.Выбрать();
		
		
		
		//Файл_product.ЗаписатьСтроку("200;0;;;;;;;;;;;0;0;0;;0;0;0;");
		
		
		id = 0;
		Пока Записи.Следующий() Цикл
							
			Остаток = 0;
			ОстатокОбщий = 0;
	        ВсегоОстаток = 0;
			ВРезервеОстаток = 0;
			СобраноОстаток  = 0;
			СобираетсяОстаток = 0;
			ДоступныйОстаток = 0;
			
			ЗапросОст = Новый Запрос;
			ЗапросОст.Текст = "ВЫБРАТЬ
			                  |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
			                  |	ТоварыНаСкладахОстатки.Склад КАК Склад,
			                  |	ТоварыНаСкладахОстатки.Склад.ТипСклада КАК СкладТипСклада,
			                  |	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
			                  |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) КАК ВРезервеОстаток,
			                  |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0) КАК КОтгрузкеОстаток,
			                  |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОформлениюОстаток, 0) КАК КОформлениюОстаток,
			                  |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КСборкеОстаток, 0) КАК КСборкеОстаток,
			                  |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобираетсяОстаток, 0) КАК СобираетсяОстаток,
			                  |	ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобраноОстаток, 0) КАК СобраноОстаток,
			                  |	ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобраноОстаток, 0) - ЕСТЬNULL(ТоварыКОтгрузкеОстатки.СобираетсяОстаток, 0) КАК ЧИСЛО(15, 3)) КАК ОСТАТОК,
			                  |	ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.Родитель.МинимальныйОстатокДляПрайса, 0) КАК ЧИСЛО(15, 3)) КАК МинимальныйОстатокДляПрайса,
			                  |	ТоварыНаСкладахОстатки.Серия КАК Серия,
			                  |	ТоварыНаСкладахОстатки.Серия.ГоденДо КАК СерияГоденДо,
			                  |	ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток, 0) КАК ДоступныйОстаток,
			                  |	ТоварыНаСкладахОстатки.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияПартия_МССОСрокДействияАнализаТекущий
			                  |ИЗ
			                  |	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
			                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(&Период, ) КАК ТоварыКОтгрузкеОстатки
			                  |		ПО ТоварыНаСкладахОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
			                  |			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
			                  |			И ТоварыНаСкладахОстатки.Серия = ТоварыКОтгрузкеОстатки.Серия
			                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки КАК СвободныеОстаткиОстатки
			                  |		ПО ТоварыНаСкладахОстатки.Склад = СвободныеОстаткиОстатки.Склад
			                  |			И ТоварыНаСкладахОстатки.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
			                  |ГДЕ
			                  |	ТоварыНаСкладахОстатки.Номенклатура.Ссылка = &Ссылка
			                  |	И ТоварыНаСкладахОстатки.Склад В (&МассивСкладов)";			

			ЗапросОст.УстановитьПараметр("Период", КонецДня(ТекущаяДата()));
			ЗапросОст.УстановитьПараметр("Ссылка", Записи.Ссылка);       
			
			МассивСкладов = Новый Массив;
			МассивСкладов.Добавить(Справочники.Склады.Склад1);
 
			МассивСкладов.Добавить(Справочники.Склады.Склад5);   
			
			Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000013")  // 3.	Луковицы, корневища цветов
				//ИЛИ Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000006") //2.1.2.	Розы
				// ИЛИ Записи.Ссылка.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000006") //2.1.2.	Розы 
				// ИЛИ Записи.Ссылка.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000006") //2.1.2.	Розы
				Тогда
            	МассивСкладов.Добавить(Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА));
			Иначе	
				МассивСкладов.Добавить(Справочники.Склады.Склад3);  	
			КонецЕсли;   
			
			ЗапросОст.УстановитьПараметр("МассивСкладов", МассивСкладов);
			//ЗапросОст.УстановитьПараметр("Склад1", Справочники.Склады.Склад1);
			//ЗапросОст.УстановитьПараметр("Склад3", Справочники.Склады.Склад3);
			//ЗапросОст.УстановитьПараметр("Склад5", Справочники.Склады.Склад5);
			
			Склад3 = Справочники.Склады.Склад3;
			ДатаСравнения = ТекущаяДата()+ 14*86400;
			РезультатЗапросаОст = ЗапросОст.Выполнить().Выгрузить();
		
			Для каждого стр Из РезультатЗапросаОст Цикл
				Если стр.Склад = Склад3  Тогда
					Если ЗначениеЗаполнено(стр.СерияПартия_МССОСрокДействияАнализаТекущий) Тогда
						Если стр.СерияПартия_МССОСрокДействияАнализаТекущий >= ДатаСравнения  Тогда
						    ОстатокОбщий = ОстатокОбщий + стр.ВНаличииОстаток;
						КонецЕсли; 
					КонецЕсли; 

					ВРезервеОстаток = стр.ВРезервеОстаток;
					СобраноОстаток  = стр.СобраноОстаток;
					СобираетсяОстаток = стр.СобираетсяОстаток;
					МинимальныйОстатокДляПрайса = стр.МинимальныйОстатокДляПрайса;
					ДоступныйОстаток = стр.ДоступныйОстаток;
				Иначе
					ОстатокОбщий = ОстатокОбщий + стр.ОСТАТОК;
					ВРезервеОстаток = ВРезервеОстаток + стр.ВРезервеОстаток;
					СобраноОстаток  = СобраноОстаток + стр.СобраноОстаток;
					СобираетсяОстаток = СобираетсяОстаток + стр.СобираетсяОстаток;
				    МинимальныйОстатокДляПрайса = стр.МинимальныйОстатокДляПрайса;
					ДоступныйОстаток = стр.ДоступныйОстаток;
				КонецЕсли; 
			КонецЦикла; 
			
			
				ВсегоОстаток = ОстатокОбщий;
			
			Если ВсегоОстаток > 0 И ДоступныйОстаток > 0 И ДоступныйОстаток >= МинимальныйОстатокДляПрайса И  ВсегоОстаток >= МинимальныйОстатокДляПрайса Тогда
				Остаток = 2;
			КонецЕсли;  

			//ВсегоОстаток = ОстатокОбщий - ВРезервеОстаток - СобраноОстаток - СобираетсяОстаток;
			//
			//Если ВсегоОстаток > 0 И ДоступныйОстаток > 0 И ДоступныйОстаток >= МинимальныйОстатокДляПрайса И  ВсегоОстаток >= МинимальныйОстатокДляПрайса Тогда
			//	Остаток = 2;
			//КонецЕсли;  

			
	////// предзаказ
			
			Если Константы.ПредзаказНаСайте.Получить() = ИСТИНА Тогда
				
				Если Остаток = 0 Тогда
					
					//Запрос Товара на предзаказ	
					//Запрос Товара на предзаказ	
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ГрафикПоступленияТоваровОстатки.Номенклатура КАК Номенклатура,
					|	ГрафикПоступленияТоваровОстатки.Характеристика КАК Характеристика,
					|	ГрафикПоступленияТоваровОстатки.Склад КАК Склад,
					|	ГрафикПоступленияТоваровОстатки.ДатаСобытия КАК ДатаСобытия,
					|	ГрафикПоступленияТоваровОстатки.Назначение КАК Назначение,
					|	ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовОстаток КАК КоличествоИзЗаказовОстаток,
					|	ГрафикПоступленияТоваровОстатки.КоличествоПодЗаказОстаток КАК КоличествоПодЗаказОстаток,
					|	ГрафикПоступленияТоваровОстатки.КоличествоИзЗаказовСНеподтвержденнымиОстаток КАК КоличествоИзЗаказовСНеподтвержденнымиОстаток,
					|	ГрафикПоступленияТоваровОстатки.КоличествоПодЗаказСНеподтвержденнымиОстаток КАК КоличествоПодЗаказСНеподтвержденнымиОстаток,
					|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК ВНаличииОстаток,
					|	ГрафикПоступленияТоваровОстатки.Номенклатура.Родитель.МинимальныйОстатокДляПрайса КАК НоменклатураРодительМинимальныйОстатокДляПрайса
					|ПОМЕСТИТЬ ТАБЗАКАЗ
					|ИЗ
					|	РегистрНакопления.ГрафикПоступленияТоваров.Остатки КАК ГрафикПоступленияТоваровОстатки
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
					|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ГрафикПоступленияТоваровОстатки.Номенклатура)
					|			И (ТоварыНаСкладахОстатки.Склад = ГрафикПоступленияТоваровОстатки.Склад)
					|ГДЕ
					|	ГрафикПоступленияТоваровОстатки.Номенклатура = &Номенклатура
					|	И (ГрафикПоступленияТоваровОстатки.Склад.Ссылка = &Склад3
					|		ИЛИ ГрафикПоступленияТоваровОстатки.Склад.Ссылка = &Склад5)
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТАБЗАКАЗ.Номенклатура КАК Номенклатура,
					|	ТАБЗАКАЗ.Характеристика КАК Характеристика,
					|	ТАБЗАКАЗ.Склад КАК Склад,
					|	ТАБЗАКАЗ.ДатаСобытия КАК ДатаСобытия,
					|	ТАБЗАКАЗ.Назначение КАК Назначение,
					|	ТАБЗАКАЗ.КоличествоИзЗаказовОстаток КАК КоличествоИзЗаказовОстаток,
					|	ТАБЗАКАЗ.КоличествоПодЗаказОстаток КАК КоличествоПодЗаказОстаток,
					|	ТАБЗАКАЗ.КоличествоИзЗаказовСНеподтвержденнымиОстаток КАК КоличествоИзЗаказовСНеподтвержденнымиОстаток,
					|	ТАБЗАКАЗ.КоличествоПодЗаказСНеподтвержденнымиОстаток КАК КоличествоПодЗаказСНеподтвержденнымиОстаток,
					|	ТАБЗАКАЗ.ВНаличииОстаток КАК ВНаличииОстаток,
					|	ТАБЗАКАЗ.НоменклатураРодительМинимальныйОстатокДляПрайса КАК НоменклатураРодительМинимальныйОстатокДляПрайса
					|ИЗ
					|	ТАБЗАКАЗ КАК ТАБЗАКАЗ
					|ГДЕ
					|	ТАБЗАКАЗ.ВНаличииОстаток < ТАБЗАКАЗ.Номенклатура.Родитель.МинимальныйОстатокДляПрайса";
					
					Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
					
					Запрос.УстановитьПараметр("Склад3", Справочники.Склады.Склад3);
					Запрос.УстановитьПараметр("Склад5", Справочники.Склады.Склад5);
					
					
					ТоварыПредзаказ = Запрос.Выполнить().Выгрузить();
					
					//в документе
					Если ТоварыПредзаказ.Количество() > 0 Тогда				
						Остаток = 1;       //предзаказ
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЕсли;
			////// конец предзаказ
			
			
			
			ЭлементСправочника = Записи.Ссылка; 
			
			Код_Товара = ""+ЭлементСправочника.Код;

			
			Номер = Строка(ЭлементСправочника.Код);			
			Номер = СтрЗаменить(Номер,"-","");
			
			
			Пока Лев(Номер, 1) = "0" Цикл 
				Номер = Прав(Номер, СтрДлина(Номер) - 1);
			КонецЦикла;
			
			Номер = Формат(Номер, "ЧГ=0");
			//Номер = Число(Номер);
			
			id = Номер;			
			
			НомерИзКонстанты = РегистрыСведений.КартинкиВыгрузка.ПолучитьНомерВыгрузки(Записи.Ссылка);
			
			
			title = "";
			title = СокрЛП(Записи.Ссылка.Наименование);   ///// наименование
			
			url = "";
			url = Транслит(Строка(title));  			  ///// наименование на латинице

			url = СтрЗаменить(url,"%","");
			url = СтрЗаменить(url,":","-");
			url = СтрЗаменить(url,"*","");
			url = СтрЗаменить(url,"--","-");
			url = НРЕГ(url);
			
	        disabled = 0;   ///////// Пока Если проставлен в номенклутуре признак "Не выгружать на сайт, то сразу убираем в выборке по запросу
			
			
			
			
			meta_header = "";
			meta_header = ""+Строка(title)+","+"купить "+Строка(title)+" в Минске";
			
			meta_header = "";
			//meta_header = ""+Строка(title)+","+"купить "+Строка(title)+" в Минске";
			meta_header = ""+Строка(title)+" купить в Минске по выгодной цене";
			
			meta_keyword = "";
			meta_keyword = СокрЛП(Записи.Ссылка.Наименование);   ///// наименование
			
			meta_description  = "";
			//meta_description = "купить "+Строка(title)+" от компании «МинскСортСемОвощ» в Минске. Большой выбор, высокое качество и низкие цены.";
			meta_description = ""+Строка(title)+" по выгодной цене! ➤➤➤ В компании «МинскСортСемОвощ» вы можете купить "+Строка(title)+" оптом и в розницу. ✅ Высокое качество. &#128666 Возможна доставка по Беларуси. ☎ Звоните по указанным на сайте телефонам.";   //&#128666 
			

			//jadmin форматированный документ		
			ОпиcаниеВHTML = ПолучитьФорматированныйДокОписание(Записи.Ссылка);
			
			Если ОпиcаниеВHTML <> "" Тогда	
				content = ОпиcаниеВHTML;				
			Иначе
				content =  СокрЛП(Записи.Ссылка.Описание);
				content = СтрЗаменить(content,Символы.ПС," ");
			КонецЕсли; 
			
			ВидеоHTML = "";
			Если ЗначениеЗаполнено(Записи.Ссылка.НазваниеВидеоФайла) Тогда
			   ВидеоHTML = "<div class=""d-flex mt-3 justify-content-center align-items-center"" style=""text-align: center;""><video style=""max-width:100%;height:450px;"" src=""/upload/video/" + Записи.Ссылка.НазваниеВидеоФайла + """ controls="" ""></video></div>";
				
			   content = content + ВидеоHTML;
			КонецЕсли;
			///
			
			
			short_content  = "";
			
			
			image = "";     //////// картинка
			
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Файлы.Ссылка КАК Ссылка,
			|	Файлы.Наименование КАК Наименование,
			|	Файлы.Расширение КАК Расширение,
			|	Файлы.Описание КАК Описание,
			|	Файлы.ВладелецФайла КАК ВладелецФайла,
			|	Файлы.Размер КАК Размер,
			|	Файлы.ТипХраненияФайла КАК ТипХраненияФайла,
			|	Файлы.Том.ПолныйПутьWindows КАК ТомПолныйПутьWindows,
			|	Файлы.ПутьКФайлу КАК ПутьКФайлу
			|ИЗ
			|	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
			|ГДЕ
			|	Файлы.ВладелецФайла = &ВладелецФайла
			|	И НЕ Файлы.ПометкаУдаления
			|	И Файлы.Наименование ПОДОБНО ""%site[_,-]%""
			|	И (Файлы.Расширение = ""jpg""
			|			ИЛИ Файлы.Расширение = ""png""
			|			ИЛИ Файлы.Расширение = ""jpeg"")" ;
						
			Запрос.УстановитьПараметр("ВладелецФайла", Записи.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
						
			Пока Выборка.Следующий() Цикл
				ИмяВремФайла = "";
				ИмяВремФайла = ""+Выборка.Наименование+"@"+НомерИзКонстанты+"."+Выборка.Расширение; //для обновления картинок добавляем номер дня в название файлоа
				РасположениеФайлаИсточника = "";
				
				Если ВыгружатьИзображения = ИСТИНА Тогда       
					ИмяКартинкаПоУмолчанию = ""+Выборка.Наименование+"."+Выборка.Расширение; //для обновления картинок добавляем номер дня в название файлоа
					
					ПолноеИмяВремФайла = ""+сокрлп(Путь)+"image\"+ИмяВремФайла;
					ПолноеИмяВремФайла = СтрЗаменить(ПолноеИмяВремФайла,"%","_");
					
					КартинкаПоУмолчаниюПолноеИмяФайла = ""+сокрлп(Путь)+"image\"+ИмяКартинкаПоУмолчанию;
					КартинкаПоУмолчаниюПолноеИмяФайла = СтрЗаменить(КартинкаПоУмолчаниюПолноеИмяФайла,"%","_");
					
					Если Выборка.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе Тогда
						МенеджерЗаписи = РегистрыСведений.ПрисоединенныеФайлы.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.ПрисоединенныйФайл = Выборка.Ссылка;
						МенеджерЗаписи.Прочитать();
						ДвоичныеДанные = МенеджерЗаписи.ХранимыйФайл.Получить();
						
						Попытка
							
							ДвоичныеДанные.Записать(ПолноеИмяВремФайла);  
							ДвоичныеДанные.Записать(КартинкаПоУмолчаниюПолноеИмяФайла);					
							
							image = ИмяВремФайла;
							image = СтрЗаменить(image,"%","_");
						Исключение
							//Сообщить("Не удаётся записать временный файл на диск!!! "+"("+ПолноеИмяВремФайла+")");
						КонецПопытки;    
						
					Иначе
						РасположениеФайлаИсточника = ""+Выборка.ТомПолныйПутьWindows + "" + Выборка.ПутьКФайлу;
						
						КопироватьФайл(РасположениеФайлаИсточника,ПолноеИмяВремФайла);
						КопироватьФайл(РасположениеФайлаИсточника,КартинкаПоУмолчаниюПолноеИмяФайла);
						
					КонецЕсли;
						
				Иначе	
					image = ИмяВремФайла;
					image = СтрЗаменить(image,"%","_");
				КонецЕсли;
			КонецЦикла;			
			
			
				
			/////////////////////////
						
			
			custom_title = "";
			
			custom_title = СокрЛП(Записи.Ссылка.Наименование);
			
			price = 0;
			
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//	"ВЫБРАТЬ
			//	|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
			//	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
			//	|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
			//	|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
			//	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
			//	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код КАК НоменклатураКод,
			//	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК НоменклатураКоэффициентЕдиницыДляОтчетов,
			//	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СтавкаНДС КАК НоменклатураСтавкаНДС,
			//	|	ВЫБОР
			//	|		КОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.СтавкаНДС = &Ставка20
			//	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * 1.2
			//	|		КОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.СтавкаНДС = &Ставка10
			//	|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * 1.1
			//	|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена
			//	|	КОНЕЦ КАК ЦенаСНДС
			//	|ИЗ
			//	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
			//	|ГДЕ
			//	|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
			//	|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
			//Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",Истина));
			//Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
			//Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
			//Запрос.УстановитьПараметр("Ставка10", Перечисления.СтавкиНДС.НДС10);
			//Запрос.УстановитьПараметр("Ставка20", Перечисления.СтавкиНДС.НДС20);

			//
			//РезультатЗапроса = Запрос.Выполнить();
			//
			//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			//
			//Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			//
			//	Продолжить;
			//
			//КонецЕсли; 

			//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//	price = ВыборкаДетальныеЗаписи.ЦенаСНДС;
			//КонецЦикла;
			
			//Код_Товара = ""+ВыборкаДетальныеЗаписи.НоменклатураКод;

			Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(Записи.Ссылка,ТекущаяДата())=ЛОЖЬ Тогда
		
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
				|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
				|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Код КАК НоменклатураКод,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК НоменклатураКоэффициентЕдиницыДляОтчетов,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура.СтавкаНДС КАК НоменклатураСтавкаНДС,
				|	ВЫБОР
				|		КОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.СтавкаНДС = &Ставка20
				|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * 1.2
				|		КОГДА ЦеныНоменклатурыСрезПоследних.Номенклатура.СтавкаНДС = &Ставка10
				|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * 1.1
				|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена
				|	КОНЕЦ КАК ЦенаСНДС
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
				|ГДЕ
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
				
				Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",Истина));
				Запрос.УстановитьПараметр("НаДату", КонецДня(ТекущаяДата()));
				Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
				Запрос.УстановитьПараметр("Ставка10", Перечисления.СтавкиНДС.НДС10);
				Запрос.УстановитьПараметр("Ставка20", Перечисления.СтавкиНДС.НДС20);

				
				РезультатЗапроса = Запрос.Выполнить();		
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество() = 0 И Остаток <> 0 Тогда				
					Продолжить;				
				КонецЕсли; 
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					price = ВыборкаДетальныеЗаписи.ЦенаСНДС;
				КонецЦикла;
				
				Надбавка = 999;
				Код_Товара = ""+ВыборкаДетальныеЗаписи.НоменклатураКод;
				
			Иначе
				ОстатокПоСерииТЗ = СВ_ОбменКассовыйСервер.ПолучитьОстатокСерии(Записи.Ссылка,,КонецДня(ТекущаяДата()));		
				ОстатокПоСерииТЗ.Сортировать("Цена УБЫВ");
				ЦенаСНДС = 0;
				
				Если ОстатокПоСерииТЗ.Количество() > 0 Тогда
					Номенклатура = Записи.Ссылка;
					Если Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
						ЦенаСНДС = ОстатокПоСерииТЗ[0].Цена * 1.2;
					ИначеЕсли Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
						ЦенаСНДС = ОстатокПоСерииТЗ[0].Цена * 1.1;
					ИначеЕсли Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда	
						ЦенаСНДС = ОстатокПоСерииТЗ[0].Цена * 1;
					КонецЕсли;
					price = ЦенаСНДС;
					Код_Товара = "" + ОстатокПоСерииТЗ[0].Номенклатура.Код;
					
					Надбавка = 999;
					Если ОстатокПоСерииТЗ[0].Серия.ЦенаПоставщика <> 0 Тогда
					
						Надбавка = (ОстатокПоСерииТЗ[0].Цена /ОстатокПоСерииТЗ[0].Серия.ЦенаПоставщика * 100)  - 100;
					
					КонецЕсли; 
					//Если Надбавка = 0 Тогда
					//    ЦенаИмпортера;
					//ИначеЕсли Надбавка > 0 Тогда
					//	ЦенаПоставщика;						
					//КонецЕсли; 
					
				Иначе
					Продолжить;
				КонецЕсли;
				
				Если ЦенаСНДС = 0 Тогда				
					Продолжить;				
				КонецЕсли; 	
			КонецЕсли;
			
			
						
			new_ = 0;
			
			Если Записи.Ссылка.ПризнакНовинка Тогда
				new_ = 1;
			КонецЕсли; 
			
		    ////ПризнакСамовывоза
			ТолькоСамовывоз = 0;
			
			ТолькоСамовывоз =  ПолучитьТоварыСЗапретомОтгрузки(Записи.Ссылка) ;

			
			
			
			
	НаборДляОпта = 1;		
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Владелец.Ссылка КАК Номенклатура,
		|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
		|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец.Ссылка = &Номенклатура
		|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдИзм
		|	И УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
	Запрос.УстановитьПараметр("ЕдИзм", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("Н-р для опта",,,Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения));

	
	РезЗпр = Запрос.Выполнить().Выбрать();
	
		Пока РезЗпр.Следующий() Цикл
		     НаборДляОпта = РезЗпр.Числитель;
		КонецЦикла;
		
	Если Записи.Ссылка.Родитель.Склад = Справочники.Склады.Склад5 Тогда

		Если РезЗпр.Количество()=0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковкиЕдиницыИзмерения.Владелец.Ссылка КАК Номенклатура,
			|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
			|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|ГДЕ
			|	УпаковкиЕдиницыИзмерения.Владелец.Ссылка = &Номенклатура
			|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдИзм
			|	И УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
			Запрос.УстановитьПараметр("ЕдИзм", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("упак",,,Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения));
			
			
			РезЗпр = Запрос.Выполнить().Выбрать();
			
			Пока РезЗпр.Следующий() Цикл
				НаборДляОпта = РезЗпр.Числитель;
			КонецЦикла;		
		КонецЕсли;	
			
	
	КонецЕсли;
	
		
		
			popular = 0;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПопулярныеТоварыСрезПоследних.Период КАК Период,
				|	ПопулярныеТоварыСрезПоследних.Номенклатура КАК Номенклатура
				|ИЗ
				|	РегистрСведений.ПопулярныеТовары.СрезПоследних КАК ПопулярныеТоварыСрезПоследних
				|ГДЕ
				|	ПопулярныеТоварыСрезПоследних.Номенклатура = &Номенклатура
				|	И ПопулярныеТоварыСрезПоследних.ТекущийПопулярный = ИСТИНА";
			
			Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
			
			РезЗпрПопулярный = Запрос.Выполнить().Выбрать();	
			
			Если РезЗпрПопулярный.Количество()>0 Тогда
				popular = 1;
			КонецЕсли; 


		
	// //////////////////////     
	// 
	// 
	// ИнфоДляСайта = "";

	// 
	// 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Номенклатура.Родитель.Порядок1 КАК РодительПорядок1,
	//	|	Номенклатура.Родитель.Порядок2 КАК РодительПорядок2,
	//	|	Номенклатура.Родитель.Порядок3 КАК РодительПорядок3,
	//	|	Номенклатура.Родитель.Порядок4 КАК РодительПорядок4,
	//	|	Номенклатура.Родитель.Порядок5 КАК РодительПорядок5,
	//	|	Номенклатура.Родитель.Порядок6 КАК РодительПорядок6,
	//	|	Номенклатура.Родитель.Порядок7 КАК РодительПорядок7,
	//	|	Номенклатура.Родитель.Порядок8 КАК РодительПорядок8,
	//	|	Номенклатура.Родитель.Порядок9 КАК РодительПорядок9,
	//	|	Номенклатура.Родитель.Порядок10 КАК РодительПорядок10,
	//	|	Номенклатура.Родитель.Порядок11 КАК РодительПорядок11,
	//	|	Номенклатура.Родитель.Порядок12 КАК РодительПорядок12,
	//	|	Номенклатура.Родитель.Порядок13 КАК РодительПорядок13,
	//	|	Номенклатура.Родитель.Порядок14 КАК РодительПорядок14,
	//	|	Номенклатура.Родитель.Порядок15 КАК РодительПорядок15,
	//	|	Номенклатура.Родитель.Порядок16 КАК РодительПорядок16,
	//	|	Номенклатура.Родитель.Порядок17 КАК РодительПорядок17,
	//	|	Номенклатура.Родитель.Порядок18 КАК РодительПорядок18,
	//	|	Номенклатура.Родитель.Порядок19 КАК РодительПорядок19,
	//	|	Номенклатура.Родитель.Порядок20 КАК РодительПорядок20
	//	|ИЗ
	//	|	Справочник.Номенклатура КАК Номенклатура
	//	|ГДЕ
	//	|	Номенклатура.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Записи.Ссылка);
	//
	//ТЗ = Запрос.Выполнить().Выгрузить();
	//
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	НоменклатураИнфоДляСайта.Ссылка КАК Ссылка,
	//	|	НоменклатураИнфоДляСайта.НомерСтроки КАК НомерСтроки,
	//	|	НоменклатураИнфоДляСайта.Наименование КАК Наименование,
	//	|	НоменклатураИнфоДляСайта.Значение КАК Значение
	//	|ИЗ
	//	|	Справочник.Номенклатура.ИнфоДляСайта КАК НоменклатураИнфоДляСайта
	//	|ГДЕ
	//	|	НоменклатураИнфоДляСайта.Ссылка = &Ссылка
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	НомерСтроки";
	//
	//Запрос.УстановитьПараметр("Ссылка", Записи.Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Если НЕ РезультатЗапроса.Пустой() Тогда
	//
	//	Хар = РезультатЗапроса.Выгрузить();

	//	Хар.Колонки.Добавить("Порядок");
	//	
	//	Хар[0].Порядок = ТЗ[0].РодительПорядок1; 
	//	Хар[1].Порядок = ТЗ[0].РодительПорядок2;
	//	Хар[2].Порядок = ТЗ[0].РодительПорядок3;
	//	Хар[3].Порядок = ТЗ[0].РодительПорядок4;
	//	Хар[4].Порядок = ТЗ[0].РодительПорядок5;
	//	Хар[5].Порядок = ТЗ[0].РодительПорядок6;
	//	Хар[6].Порядок = ТЗ[0].РодительПорядок7;
	//	Хар[7].Порядок = ТЗ[0].РодительПорядок8;
	//	Хар[8].Порядок = ТЗ[0].РодительПорядок9;
	//	Хар[9].Порядок = ТЗ[0].РодительПорядок10;
	//	Хар[10].Порядок = ТЗ[0].РодительПорядок11; 
	//	Хар[11].Порядок = ТЗ[0].РодительПорядок12;
	//	Хар[12].Порядок = ТЗ[0].РодительПорядок13;
	//	Хар[13].Порядок = ТЗ[0].РодительПорядок14;
	//	Хар[14].Порядок = ТЗ[0].РодительПорядок15;
	//	Хар[15].Порядок = ТЗ[0].РодительПорядок16;
	//	Хар[16].Порядок = ТЗ[0].РодительПорядок17;
	//	Хар[17].Порядок = ТЗ[0].РодительПорядок18;
	//	Хар[18].Порядок = ТЗ[0].РодительПорядок19;
	//	Хар[19].Порядок = ТЗ[0].РодительПорядок20;
	//	
	//	Стр20 = Хар.Добавить();
	//	Стр20.НомерСтроки = 21;
	//	Стр20.Наименование = "Страна происхождения";
	//	Стр20.Порядок = 21;
	//	Стр20.Значение = Записи.Ссылка.СтранаПроисхождения;

	//	Хар.Сортировать("Порядок") ;
	//
	//	Для i=0 По Хар.Количество()-1 Цикл
	//	    Если Хар[i].Значение <> "" Тогда
	//			ИнфоДляСайта = ИнфоДляСайта + Хар[i].Наименование + ":" + Хар[i].Значение + "#" ;
	//	    КонецЕсли;
	//	КонецЦикла; 
	//	
	//	Хар.Очистить();

	//КонецЕсли; 		
	//
	//  ИнфоДляСайта = СтрЗаменить(ИнфоДляСайта,Символы.ПС,"");
			//////////////////////     
		
		ИнфоДляСайта = "";
		ФильтрХарактеристики = "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураИнфоДляСайта.Ссылка КАК Ссылка,
		|	НоменклатураИнфоДляСайта.НомерСтроки КАК Порядок,
		|	ВЫБОР
		|		КОГДА НоменклатураИнфоДляСайта.Значение.ПолноеНаименование = """"
		|			ТОГДА НоменклатураИнфоДляСайта.Значение.Наименование
		|		ИНАЧЕ НоменклатураИнфоДляСайта.Значение.ПолноеНаименование
		|	КОНЕЦ КАК Значение,
		|	НоменклатураИнфоДляСайта.Наименование.Наименование КАК Наименование,
		|	0 КАК Фильтр
		|ИЗ
		|	Справочник.Номенклатура.ИнфоДляСайта КАК НоменклатураИнфоДляСайта
		|ГДЕ
		|	НоменклатураИнфоДляСайта.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураИнфоДляСайта.НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", Записи.Ссылка);

		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Хар = РезультатЗапроса.Выгрузить();

			Стр20 = Хар.Добавить();
			//Стр20.НомерСтроки = 21;
			Стр20.Наименование = "Страна происхождения";
			Стр20.Порядок = 21;
			Стр20.Фильтр = 0;    //ЛОЖЬ
			Если Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")      //семена овощей
				//ИЛИ Записи.Ссылка.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")      //семена цветов
				Тогда
			    Стр20.Значение = "";
			Иначе	
				Стр20.Значение = Записи.Ссылка.СтранаПроисхождения;
			КонецЕсли; 
			
			Для i=0 По Хар.Количество()-1 Цикл
				
				Если Хар[i].Порядок = 0 Тогда
					Хар[i].Порядок = Хар[i].НомерСтроки;
				КонецЕсли;
				
			КонецЦикла; 
			
			Хар.Сортировать("Порядок") ;
			
			
			Для i=0 По Хар.Количество()-1 Цикл
				Если Хар[i].Значение <> "" Тогда   
					Хар[i].Значение = СтрЗаменить(Хар[i].Значение,"""","");  
					
					ИнфоДляСайта = ИнфоДляСайта + Хар[i].Наименование + ":" + Хар[i].Значение + "#" ;
				КонецЕсли;
			КонецЦикла; 
			
			Для i = 0 По 20 Цикл
				Попытка		
					Если СтрДлина(Хар[i].Порядок)<2 Тогда
						Хар[i].Порядок = "0" + Хар[i].Порядок;
					КонецЕсли;		
					ФильтрХарактеристики = ФильтрХарактеристики + Хар[i].Порядок + Хар[i].Значение + "#" + Хар[i].Фильтр + "#" + Хар[i].Наименование + "';'" ;			
				Исключение
					ФильтрХарактеристики = ФильтрХарактеристики + "';'" ;		
				КонецПопытки;			
			КонецЦикла; 
			
			Хар.Очистить();
		Иначе
			Для i = 0 По 20 Цикл
				ФильтрХарактеристики = ФильтрХарактеристики + "';'" ;		
			КонецЦикла; 
		КонецЕсли; 		
		
		
		ИнфоДляСайта = СтрЗаменить(ИнфоДляСайта,Символы.ПС,"");
		ФильтрХарактеристики = СтрЗаменить(ФильтрХарактеристики,Символы.ПС,"");

	  
			
	//////////////////////	

			upak = "";			
			
			//jadmin в опте цена за упаковку
			//Если СтрНайти(Записи.Ссылка.ЕдиницаДляОтчетов.Наименование, "упак") > 0  Тогда
			//	 Если ВыборкаДетальныеЗаписи.НоменклатураКоэффициентЕдиницыДляОтчетов > 1 Тогда
			//		 price = Окр(ВыборкаДетальныеЗаписи.ЦенаСНДС * ВыборкаДетальныеЗаписи.НоменклатураКоэффициентЕдиницыДляОтчетов,2);
			//	 КонецЕсли; 
			//КонецЕсли; 
			
			Если Записи.Ссылка.ЕИдляСайта = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка() Тогда
				upak = Записи.Ссылка.ЕдиницаДляОтчетов.Наименование;
			Иначе	
				upak = Записи.Ссылка.ЕИдляСайта.Наименование;
			КонецЕсли; 
				//upak = Записи.Ссылка.ЕдиницаДляОтчетов.Наименование; 

			 
			
			price = СтрЗаменить(Строка(price),Символы.НПП,"");
			price = СтрЗаменить(Строка(price),",",".");
			
			
			////скидка
			sale_percent = 0;
			
			//Номенклатура =  Записи.Ссылка;
			//Если Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")
			//	ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")
			//	ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")
			//	ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")
			//	ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014") Тогда
			//
			//	  sale_percent = 15;
			//
			//КонецЕсли;
			
			sale_price = 0;
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Период КАК Период,
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Источник КАК Источник,
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Номенклатура КАК Номенклатура,
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Характеристика КАК Характеристика,
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Статус КАК Статус,
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Комментарий КАК Комментарий,
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Ответственный КАК Ответственный,
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Источник.ЗначениеСкидкиНаценки КАК ИсточникЗначениеСкидкиНаценки
				|ИЗ
				|	РегистрСведений.ДействиеСкидокНаценокПоНоменклатуре.СрезПоследних(&Дата, ) КАК ДействиеСкидокНаценокПоНоменклатуреСрезПоследних
				|ГДЕ
				|	ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Номенклатура = &Номенклатура
				|	И ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Статус = &Статус
				|	И ДействиеСкидокНаценокПоНоменклатуреСрезПоследних.Источник.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("Дата", ТекущаяДата());
			Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
			Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДействияСкидок.Действует);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				sale_percent =  ВыборкаДетальныеЗаписи.ИсточникЗначениеСкидкиНаценки;
				ЦенаСоСкидкой = Окр(price * (1 - sale_percent/100),2,РежимОкругления.Окр15как10);
				sale_price = ЦенаСоСкидкой;
			КонецЦикла;

			
			///BROS Скидка
			Если ТекущаяДата() >= Дата("20230824") И ТекущаяДата() <= Дата("20230915235959") Тогда
				Если Номенклатура = Справочники.Номенклатура.НайтиПоКоду("00-00016249")
					ИЛИ Номенклатура = Справочники.Номенклатура.НайтиПоКоду("00-00012038")
						ИЛИ Номенклатура = Справочники.Номенклатура.НайтиПоКоду("00-00019632") Тогда			
							ДопСкидка = 15;	
							sale_percent =  ДопСкидка;
							ЦенаСоСкидкой = Окр(price * (1 - sale_percent/100),2,РежимОкругления.Окр15как10);
							sale_price = ЦенаСоСкидкой;
				КонецЕсли; 
			КонецЕсли;
	

			sale_percent = СтрЗаменить(Строка(sale_percent),Символы.НПП,"");
			sale_percent = СтрЗаменить(Строка(sale_percent),",",".");

			
			///// ГруппаДляСайта 			
			parent_id = "";						
			
			parent_id = Записи.КодГруппыДляСайта;                 			
			parent_id =  СтрЗаменить(Строка(parent_id), Символы.НПП, "");	
			
			СкидкаНеПрименяется = 0;
			
			
			
			Если Записи.Ссылка.РегулированиеЦенОпт = Истина
				ИЛИ Записи.Ссылка.Родитель.РегулированиеЦенОпт = Истина 
				ИЛИ Записи.Ссылка.Родитель.Родитель.РегулированиеЦенОпт = Истина Тогда
			
				 СкидкаНеПрименяется = 1;
			
			КонецЕсли; 
			
			////Записываем строчку в файл	

		Если СтрокаФайла = 1 Тогда
			СтрСтрокаФайла = 99999;
			СтрСтрокаФайла = СтрЗаменить(СтрСтрокаФайла,Символы.НПП,"");
			
			СтрокаТекст = "'"+СтрСтрокаФайла+"';'"+Строка(id)+"';'"+Строка(title)+"';'"+Строка(url)+"';'"+parent_id+"';'"+disabled+"';'"
			+meta_header+"';'"+meta_keyword+"';'"+
			meta_description+"';'"+content+"';'"+short_content+"';'"+image+"';'"+НомерИзКонстанты+"';'"+custom_title+"';'"+price+"';'"+sale_percent+"';'"+sale_price+"';'"+new_+"';'"+popular+"';'"+upak+"';'"+Код_Товара+"';'"+Остаток+"';'"+НаборДляОпта+"';'"+ИнфоДляСайта+"';'"+Надбавка+"';'"+СкидкаНеПрименяется+"';'"+ТолькоСамовывоз+"';";

			
			СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
			ТекстовыйФайлUTF8_Bom.Добавить(СтрокаТекст);			
		КонецЕсли; 
		
		
		СтрокаФайла = СтрокаФайла + 1;	
		СтрСтрокаФайла = СтрЗаменить(СтрокаФайла,Символы.НПП,"");
		
			СтрокаТекст = "'"+СтрСтрокаФайла+"';'"+Строка(id)+"';'"+Строка(title)+"';'"+Строка(url)+"';'"+parent_id+"';'"+disabled+"';'"
			+meta_header+"';'"+meta_keyword+"';'"+
			meta_description+"';'"+content+"';'"+short_content+"';'"+image+"';'"+НомерИзКонстанты+"';'"+custom_title+"';'"+price+"';'"+sale_percent+"';'"+sale_price+"';'"+new_+"';'"+popular+"';'"+upak+"';'"+Код_Товара+"';'"+Остаток+"';'"+НаборДляОпта+"';'"+ИнфоДляСайта+"';'"+Надбавка+"';'"+СкидкаНеПрименяется+"';'"+ТолькоСамовывоз+"';";

		
		СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
		ТекстовыйФайлUTF8_Bom.Добавить(СтрокаТекст);
		
		///Проверка на допгруппы для сайта
		ГруппаСайта = "";
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДляСайта.Номенклатура.Наименование КАК Наименование,
		|	ГруппыДляСайта.Номенклатура.Код КАК Код,
		|	ГруппыДляСайта.Номенклатура.ВесЧислитель КАК ВесЧислитель,
		|	ГруппыДляСайта.Номенклатура.Ссылка КАК Ссылка,
		|	ГруппыДляСайта.ГруппаДляСайта.Код КАК ГруппаДляСайтаКод
		|ИЗ
		|	РегистрСведений.ГруппыДляСайта КАК ГруппыДляСайта
		|ГДЕ
		|	ГруппыДляСайта.Номенклатура = &Номенклатура
		|	И ГруппыДляСайта.Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И ГруппыДляСайта.Номенклатура.НеВыгружатьНаСайт = ЛОЖЬ
		|	И ГруппыДляСайта.ОсновнаяГруппа = ЛОЖЬ
		|	И ГруппыДляСайта.ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ";
		
		
		Запрос.УстановитьПараметр("Номенклатура", Записи.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока РезультатЗапроса.Следующий() Цикл
			parent_id="";
			popular = 0;
			new_ = 0;
			ГруппаЗначение = РезультатЗапроса.ГруппаДляСайтаКод;
			parent_id = ГруппаЗначение;
			parent_id =  СтрЗаменить(Строка(parent_id), Символы.НПП, "");
			
			////Записываем строчку в файл	
			СтрокаФайла = СтрокаФайла + 1;	
			СтрСтрокаФайла = СтрЗаменить(СтрокаФайла,Символы.НПП,"");
			
			СтрокаТекст = "'"+СтрСтрокаФайла+"';'"+Строка(id)+"';'"+Строка(title)+"';'"+Строка(url)+"';'"+parent_id+"';'"+disabled+"';'"
			+meta_header+"';'"+meta_keyword+"';'"+
			meta_description+"';'"+content+"';'"+short_content+"';'"+image+"';'"+НомерИзКонстанты+"';'"+custom_title+"';'"+price+"';'"+sale_percent+"';'"+sale_price+"';'"+new_+"';'"+popular+"';'"+upak+"';'"+Код_Товара+"';'"+Остаток+"';'"+НаборДляОпта+"';'"+ИнфоДляСайта+"';'"+Надбавка+"';'"+СкидкаНеПрименяется+"';'"+ТолькоСамовывоз+"';";

			
			СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
			ТекстовыйФайлUTF8_Bom.Добавить(СтрокаТекст);
			
			

			
		КонецЦикла;
		
	КонецЦикла;
	
	Строка = СтрСоединить(ТекстовыйФайлUTF8_Bom, Символы.ПС);  //переделка в строку
	
	
	//запись в файл
	ТДок = Новый ТекстовыйДокумент;

	ТДок.ДобавитьСтроку(Строка);

	ТДок.Записать(КаталогВыгрузки_product,"UTF-8");
	//////	
	
	// открываем файл и считываем символы после символов BOM
	Данные = Новый ДвоичныеДанные(КаталогВыгрузки_product);
	Строка64=Base64Строка(Данные);
	Строка64=Прав(Строка64,СтрДлина(Строка64)-4);
	ДанныеНаЗапись=Base64Значение(Строка64);
	ДанныеНаЗапись.Записать(КаталогВыгрузки_product); // записываем
	
		
КонецПроцедуры
	
// выгрузка catalog
&НаСервере
Процедура ВыгрузитьКаталогНаСервере() Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Родитель");
	ТЗ.Колонки.Добавить("Ссылка");
	ТЗ.Колонки.Добавить("Уровень");
	ТЗ.Колонки.Добавить("КолВоДетей");
	ТЗ.Колонки.Добавить("Код");
	ТЗ.Колонки.Добавить("НеПоказывать");
	ТЗ.Колонки.Добавить("ПорядокВМеню");

	
	ТЗ_Ур1 = Новый ТаблицаЗначений;
	ТЗ_Ур1.Колонки.Добавить("Родитель");
	ТЗ_Ур1.Колонки.Добавить("Ссылка");
	ТЗ_Ур1.Колонки.Добавить("Уровень");
	ТЗ_Ур1.Колонки.Добавить("КолВоДетей");
	ТЗ_Ур1.Колонки.Добавить("Код");
	ТЗ_Ур1.Колонки.Добавить("ПорядокВМеню");
	
	Запрос0 = Новый Запрос;
	Запрос0.Текст = 
	"ВЫБРАТЬ
	|	ГруппаДляСайта.Родитель КАК Родитель,
	|	ГруппаДляСайта.Ссылка КАК Ссылка,
	|	ГруппаДляСайта.Код КАК Код,
	|	ВЫБОР
	|		КОГДА ГруппаДляСайта.ПорядокВМеню <> 0
	|			ТОГДА ГруппаДляСайта.ПорядокВМеню
	|		ИНАЧЕ 99
	|	КОНЕЦ КАК ПорядокВМеню
	|ИЗ
	|	Справочник.ГруппаДляСайта КАК ГруппаДляСайта
	|ГДЕ
	|	ГруппаДляСайта.Родитель = &ПустаяГруппа
	|	И ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
	|	И ГруппаДляСайта.НеИспользоватьВМеню = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГруппаДляСайта.Код";

	
	Запрос0.УстановитьПараметр("ПустаяГруппа", Справочники.ГруппаДляСайта.ПустаяСсылка());
	
	РезультатЗапроса0 = Запрос0.Выполнить().Выбрать();
	
	ТЗ_Запрос0 = Запрос0.Выполнить().Выгрузить();
	ТЗ_Запрос0.Сортировать("ПорядокВМеню");
	Для каждого стрЗапроса0 Из ТЗ_Запрос0 Цикл
	//Пока РезультатЗапроса0.Следующий() Цикл
		
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
		"ВЫБРАТЬ
		|	ГруппаДляСайта.Родитель КАК Родитель,
		|	ГруппаДляСайта.Ссылка КАК Ссылка,
		|	ГруппаДляСайта.Код КАК Код,
		|	ВЫБОР
		|		КОГДА ГруппаДляСайта.ПорядокВМеню <> 0
		|			ТОГДА ГруппаДляСайта.ПорядокВМеню
		|		ИНАЧЕ 99
		|	КОНЕЦ КАК ПорядокВМеню
		|ИЗ
		|	Справочник.ГруппаДляСайта КАК ГруппаДляСайта
		|ГДЕ
		|	ГруппаДляСайта.Родитель = &СсылкаУровень0
		|	И ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
		|	И ГруппаДляСайта.НеИспользоватьВМеню = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ГруппаДляСайта.ПорядокВМеню,
		|	ГруппаДляСайта.Наименование";

		
		Запрос1.УстановитьПараметр("СсылкаУровень0", стрЗапроса0.Ссылка);
		
		РезультатЗапроса1 = Запрос1.Выполнить().Выбрать();
		



		КолВоДетейУр0 = 0;
		Если РезультатЗапроса1.Количество() > 0  Тогда
			КолВоДетейУр0 = 1;
			
			ТЗ_Запрос1 = Запрос1.Выполнить().Выгрузить();
			ТЗ_Запрос1.Сортировать("ПорядокВМеню");
			Для каждого стрЗапроса1 Из ТЗ_Запрос1 Цикл

			//Пока РезультатЗапроса1.Следующий() Цикл
				Запрос2 = Новый Запрос;
				Запрос2.Текст = 
				"ВЫБРАТЬ
				|	ГруппаДляСайта.Родитель КАК Родитель,
				|	ГруппаДляСайта.Ссылка КАК Ссылка,
				|	ГруппаДляСайта.Код КАК Код,
				|	ВЫБОР
				|		КОГДА ГруппаДляСайта.ПорядокВМеню <> 0
				|			ТОГДА ГруппаДляСайта.ПорядокВМеню
				|		ИНАЧЕ 99
				|	КОНЕЦ КАК ПорядокВМеню
				|ИЗ
				|	Справочник.ГруппаДляСайта КАК ГруппаДляСайта
				|ГДЕ
				|	ГруппаДляСайта.Родитель = &СсылкаУровень1
				|	И ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
				|	И ГруппаДляСайта.НеИспользоватьВМеню = ЛОЖЬ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ГруппаДляСайта.ПорядокВМеню,
				|	ГруппаДляСайта.Наименование";
				
				Запрос2.УстановитьПараметр("СсылкаУровень1", стрЗапроса1.Ссылка);
				
				РезультатЗапроса2 = Запрос2.Выполнить().Выбрать();
				
				КолВоДетейУр1 = 0;
				Если РезультатЗапроса2.Количество() > 0  Тогда
					КолВоДетейУр1 = 1;
					
					ТЗ_Запрос2 = Запрос2.Выполнить().Выгрузить();
					ТЗ_Запрос2.Сортировать("ПорядокВМеню");
					
					Для каждого стрЗапроса2 Из ТЗ_Запрос2 Цикл
					//Пока РезультатЗапроса2.Следующий() Цикл
													
							стрТЗ = ТЗ.Добавить();
							стрТЗ.Ссылка = стрЗапроса2.Ссылка; 
							стрТЗ.КолВоДетей = 1;
							стрТЗ.Уровень = 2;
							стрТЗ.Родитель = стрЗапроса2.Родитель;
							стрТЗ.Код = стрЗапроса2.Код;
							стрТЗ.НеПоказывать = 0;
							стрТЗ.ПорядокВМеню = стрЗапроса2.ПорядокВМеню;


					КонецЦикла; 
					
					
				КонецЕсли;
				
				стрТЗ = ТЗ.Добавить();
				стрТЗ.Ссылка = стрЗапроса1.Ссылка; 
				стрТЗ.КолВоДетей = КолВоДетейУр1;
				СтрТЗ.Уровень = 1;
				стрТЗ.Родитель = стрЗапроса1.Родитель;
				стрТЗ.Код = стрЗапроса1.Код;
				стрТЗ.НеПоказывать = 0;
				стрТЗ.ПорядокВМеню = стрЗапроса1.ПорядокВМеню;

				
				стрТЗ_Ур1 = ТЗ_Ур1.Добавить();
				стрТЗ_Ур1.Ссылка = стрЗапроса1.Ссылка; 
				стрТЗ_Ур1.КолВоДетей = КолВоДетейУр1;
				стрТЗ_Ур1.Уровень = 1;
				стрТЗ_Ур1.Родитель = стрЗапроса1.Родитель;
				стрТЗ_Ур1.Код = стрЗапроса1.Код;
				стрТЗ_Ур1.ПорядокВМеню = стрЗапроса1.ПорядокВМеню;

			КонецЦикла;
			
		КонецЕсли;	
		
		стрТЗ = ТЗ.Добавить();
		стрТЗ.Ссылка = стрЗапроса0.Ссылка; 
		стрТЗ.КолВоДетей = КолВоДетейУр0;
		СтрТЗ.Уровень = 0;
		стрТЗ.Родитель = стрЗапроса0.Родитель;
		стрТЗ.Код = стрЗапроса0.Код;
		стрТЗ.НеПоказывать = 0;
		стрТЗ.ПорядокВМеню = стрЗапроса0.ПорядокВМеню;

	КонецЦикла;
	
	
	//уникальность
	ТЗ.Колонки.Добавить("Уникальность");
	ТЗ.Колонки.Добавить("Порядок");

	
	ТЗ_Ур1.Колонки.Добавить("Уникальность");
	ТЗ_Ур1.Колонки.Добавить("Порядок");
	РезультатЗапроса0 = Запрос0.Выполнить().Выбрать();
	Пока  РезультатЗапроса0.Следующий() Цикл
		НайденныеСтроки = ТЗ.НайтиСтроки( Новый Структура("Родитель", РезультатЗапроса0.Ссылка));
		
		Список = Новый СписокЗначений; // Подготовительные действия: создание списка значений
		Список.ЗагрузитьЗначения(НайденныеСтроки); // Этап 1
		Список.СортироватьПоЗначению(НаправлениеСортировки.Возр); // Этап 2
		Массив = Список.ВыгрузитьЗначения(); // Этап 3
		
		Для каждого стрТЗ_Ур1 Из НайденныеСтроки Цикл
			//Если стрТЗ_Ур1.Родитель = РезультатЗапроса0.Ссылка Тогда
			Уникальность = 0;
			Если стрТЗ_Ур1.КолВоДетей > 0 Тогда
				
				Уникальность = 1;
				Прервать;
			КонецЕсли;     	
			//КонецЕсли; 
			
		КонецЦикла; 
		
		//Заполнение уникальности
		i = 0;    Сч = 0;
		Для каждого стрТЗ_Ур1 Из НайденныеСтроки Цикл
			
			
			//Если стрТЗ_Ур1.Родитель = РезультатЗапроса0.Ссылка Тогда
			
			стрТЗ_Ур1.Уникальность = Уникальность;
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если i < НайденныеСтроки.Количество()-1 Тогда
					Если i = 0 Тогда
						Если стрТЗ_Ур1.КолВоДетей <> НайденныеСтроки[i+1].КолВоДетей Тогда
							стрТЗ_Ур1.Порядок = 3;
						Иначе							
							стрТЗ_Ур1.Порядок = 0; 		
						КонецЕсли;
					ИначеЕсли стрТЗ_Ур1.КолВоДетей = НайденныеСтроки[i+1].КолВоДетей
						И стрТЗ_Ур1.КолВоДетей <> НайденныеСтроки[i-1].КолВоДетей Тогда
						стрТЗ_Ур1.Порядок = 0;		
					ИначеЕсли стрТЗ_Ур1.КолВоДетей = НайденныеСтроки[i+1].КолВоДетей Тогда
						стрТЗ_Ур1.Порядок = 1;	
					ИначеЕсли (стрТЗ_Ур1.КолВоДетей <> НайденныеСтроки[i+1].КолВоДетей)
						И (стрТЗ_Ур1.КолВоДетей <> НайденныеСтроки[i-1].КолВоДетей)  Тогда
						стрТЗ_Ур1.Порядок = 3;						
					Иначе
						стрТЗ_Ур1.Порядок = 2;
					КонецЕсли; 
				Иначе
					Если стрТЗ_Ур1.КолВоДетей <> НайденныеСтроки[i-1].КолВоДетей Тогда	
						стрТЗ_Ур1.Порядок = 3;
					Иначе
						стрТЗ_Ур1.Порядок = 2;	
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
			//КонецЕсли;
			i = i + 1;
		КонецЦикла;
	КонецЦикла;
	
	
	
				Запрос5 = Новый Запрос;
				Запрос5.Текст = 
				"ВЫБРАТЬ
				|	ГруппаДляСайта.Ссылка КАК Ссылка,
				|	ГруппаДляСайта.Родитель КАК Родитель,
				|	ВЫБОР
				|		КОГДА ГруппаДляСайта.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|			ТОГДА 1
				|		КОГДА ГруппаДляСайта.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|			ТОГДА 2
				|		КОГДА ГруппаДляСайта.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|			ТОГДА 3
				|		КОГДА ГруппаДляСайта.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|			ТОГДА 4
				|		КОГДА ГруппаДляСайта.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|			ТОГДА 5
				|		КОГДА ГруппаДляСайта.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|			ТОГДА 6
				|	КОНЕЦ КАК Уровень,
				|	ГруппаДляСайта.Код КАК Код
				|ИЗ
				|	Справочник.ГруппаДляСайта КАК ГруппаДляСайта
				|ГДЕ
				|	ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
				|	И (ВЫБОР
				|				КОГДА ГруппаДляСайта.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|					ТОГДА 1
				|				КОГДА ГруппаДляСайта.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|					ТОГДА 2
				|				КОГДА ГруппаДляСайта.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|					ТОГДА 3
				|				КОГДА ГруппаДляСайта.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|					ТОГДА 4
				|				КОГДА ГруппаДляСайта.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|					ТОГДА 5
				|				КОГДА ГруппаДляСайта.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)
				|					ТОГДА 6
				|			КОНЕЦ > 3
				|			ИЛИ ГруппаДляСайта.НеИспользоватьВМеню = ИСТИНА)
				|
				|УПОРЯДОЧИТЬ ПО
				|	ГруппаДляСайта.Код";
				
				//"ВЫБРАТЬ
				//|	ГруппаДляСайта.Родитель КАК Родитель,
				//|	ГруппаДляСайта.Ссылка КАК Ссылка,
				//|	ГруппаДляСайта.Код КАК Код
				//|ИЗ
				//|	Справочник.ГруппаДляСайта КАК ГруппаДляСайта
				//|ГДЕ
				//|	ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
				//|	И ГруппаДляСайта.НеИспользоватьВМеню = ИСТИНА
				//|
				//|УПОРЯДОЧИТЬ ПО
				//|	ГруппаДляСайта.Код";
				
				РезультатЗапроса5 = Запрос5.Выполнить().Выбрать();
	
				Пока РезультатЗапроса5.Следующий() Цикл
					
					стрДоб = ТЗ.Добавить();
					стрДоб.Ссылка = РезультатЗапроса5.Ссылка; 
					стрДоб.КолВоДетей = 9;
					стрДоб.Уровень = 9;
					стрДоб.Родитель = РезультатЗапроса5.Родитель;
					стрДоб.Код = РезультатЗапроса5.Код;
					стрДоб.Порядок = 9;
					стрДоб.Уникальность = 9;
					стрДоб.НеПоказывать = 1;
				КонецЦикла; 
				
	//Запись в Файл
	
		Путь = ПолучитьПуть();
		КаталогВыгрузки_catalog = ""+сокрлп(Путь)+"catalog.csv";
		
		СтрокаФайла = 1;
		
		// записываем в файл с символами BOM в начале файле	
		ТекстовыйФайлUTF8_Bom = Новый Массив;

		//Файл_catalog = Новый ЗаписьТекста(КаталогВыгрузки_catalog,КодировкаТекста.UTF8);
		
		id = 0;
		title = "";
		url = "";
		parent_id = 0;
		disabled = 0;
		meta_header ="";
		meta_description = "";
		meta_keyword = "";
		content = "";
		short_content = "";
		image = "";
		showcat = 0;
		cat_title = "";
		cat_disabled = 0;
		count = 0;
		prefix = 0;
		uniq = 0;
		start = 0;
		NoMenu = 0;
		menuorder=0;
		
		id = 9999;
		parent_id = 9999;

		id = СтрЗаменить(id,Символы.НПП,"");
		id = СтрЗаменить(id,",","");

		parent_id = СтрЗаменить(parent_id,Символы.НПП,"");
		parent_id = СтрЗаменить(parent_id,",","");

		
		СтрПустая = "'"+id+"';'"+title+"';'"+url+"';'"+parent_id+"';'"+disabled+"';'"+meta_header+"';'"+meta_description+"';'"+meta_keyword+"';'"+content+"';'"+
		short_content+"';'"+image+"';'"+showcat+"';'"+cat_title+"';'"+cat_disabled+"';'"+count+"';'"+prefix+"';'"+uniq+"';'"+start+"';'"+NoMenu+"';'"+menuorder+"';";
		
		СтрПустая = СтрЗаменить(СтрПустая,Символы.НПП,"");
		ТекстовыйФайлUTF8_Bom.Добавить(СтрПустая);
		
	
	//заполнить значения ТЗ
	ТЗ.Сортировать("Код");
	Для каждого стр Из ТЗ Цикл
		id = 0;
		title = "";
		url = "";
		parent_id = 0;
		disabled = 0;
		meta_header ="";
		meta_description = "";
		meta_keyword = "";
		content = "";
		short_content = "";
		image = "";
		showcat = 0;
		cat_title = "";
		cat_disabled = 0;
		count = 0;
		prefix = 0;
		uniq = 0;
		start = 0;
		NoMenu = 0;
		menuorder=999;
		
		стрСсылка = стр.Ссылка;
					
		
		id = стрСсылка.Код;
		title = стрСсылка.Наименование;
		Если ЗначениеЗаполнено(стрСсылка.url) Тогда		
		    url = стрСсылка.url;
		Иначе
			url = НРег(Транслит(стрСсылка.Наименование));  			  ///// наименование на латинице;		
		КонецЕсли; 

		parent_id = стрСсылка.Родитель.Код;
		
		Если стрСсылка.disabled = ИСТИНА Тогда
		
			disabled = 1;
		
		КонецЕсли;
		
		meta_header = стрСсылка.meta_header;
		meta_description = стрСсылка.meta_description;
		//meta_header = ""; 
		//meta_description = "";
		//content = "";
		//meta_keyword = "";
		meta_keyword = стрСсылка.meta_keyword;
		content = стрСсылка.content;
		short_content = стрСсылка.short_content;
		image = стрСсылка.image;
		Если стрСсылка.showcat = ИСТИНА Тогда
		
			showcat = 1;
		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(стрСсылка.cat_title) Тогда	
			cat_title = стрСсылка.cat_title;
		Иначе
		    cat_title = стрСсылка.Наименование;
		КонецЕсли;
		
		Если стрСсылка.cat_disabled = ИСТИНА Тогда
		    cat_disabled = 1;
		Иначе
			cat_disabled = 0;
		КонецЕсли;

		
		Если стр.Уровень = 2 Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГруппыДляСайта.ГруппаДляСайта КАК ГруппаДляСайта,
			|	ГруппыДляСайта.Номенклатура КАК Номенклатура
			|ИЗ
			|	РегистрСведений.ГруппыДляСайта КАК ГруппыДляСайта
			|ГДЕ
			|	ГруппыДляСайта.ГруппаДляСайта В ИЕРАРХИИ(&ГруппаДляСайта)
			//|	И ГруппыДляСайта.ОсновнаяГруппа = ИСТИНА
			|	И ГруппыДляСайта.Номенклатура.НедоступноДляРозницы = ЛОЖЬ
			|	И ГруппыДляСайта.Номенклатура.НеВыгружатьНаСайт = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ГруппаДляСайта", стрСсылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда			
				count = 0;
			Иначе
				count = 1;		
			КонецЕсли; 			
		Иначе	
			count = стр.КолВоДетей;
		КонецЕсли;
		
		prefix = стр.Уровень;

		
		Если ЗначениеЗаполнено(стр.Уникальность) Тогда			
			uniq = стр.Уникальность;
		КонецЕсли; 

		Если ЗначениеЗаполнено(стр.Порядок) Тогда			
			start = стр.Порядок;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(стр.НеПоказывать) Тогда			
			NoMenu = стр.НеПоказывать;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(стрСсылка.ПорядокВМеню) Тогда	
			menuorder = стрСсылка.ПорядокВМеню;
		КонецЕсли;
		
		id = СтрЗаменить(id,Символы.НПП,"");
		id = СтрЗаменить(id,",","");

		parent_id = СтрЗаменить(parent_id,Символы.НПП,"");
		parent_id = СтрЗаменить(parent_id,",","");

		
		СтрокаТекст = "'"+id+"';'"+title+"';'"+url+"';'"+parent_id+"';'"+disabled+"';'"+meta_header+"';'"+meta_description+"';'"+meta_keyword+"';'"+content+"';'"+
		short_content+"';'"+image+"';'"+showcat+"';'"+cat_title+"';'"+cat_disabled+"';'"+count+"';'"+prefix+"';'"+uniq+"';'"+start+"';'"+NoMenu+"';'"+menuorder+"';";
		СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
		
		
		ТекстовыйФайлUTF8_Bom.Добавить(СтрокаТекст);

	КонецЦикла; 
	
	
	Строка = СтрСоединить(ТекстовыйФайлUTF8_Bom, Символы.ПС);  //переделка в строку
	
	
	//запись в файл
	ТДок = Новый ТекстовыйДокумент;

	ТДок.ДобавитьСтроку(Строка);

	ТДок.Записать(КаталогВыгрузки_catalog,"UTF-8");

	//ТекстовыйФайлUTF8_Bom.Записать(КаталогВыгрузки_catalog,"UTF-8");
	
	
	// открываем файл и считываем символы после символов BOM
	Данные = Новый ДвоичныеДанные(КаталогВыгрузки_catalog);
	Строка64=Base64Строка(Данные);
	Строка64=Прав(Строка64,СтрДлина(Строка64)-4);
	ДанныеНаЗапись=Base64Значение(Строка64);
	ДанныеНаЗапись.Записать(КаталогВыгрузки_catalog); // записываем

	
	
КонецПроцедуры
//////

// выгрузка filter
&НаСервере
Процедура ВыгрузитьХарактеристикиДляСайтаНаСервере() Экспорт
	
	Путь = ПолучитьПуть();
	КаталогВыгрузки_filter = ""+сокрлп(Путь)+"filter.csv";
	
	НомерИзКонстанты = Константы.ТекущееЗначениеДляВыгрузкиКартинокНаСайт.Получить();
	
	// записываем в файл с символами BOM в начале файле	
	ТекстовыйФайлUTF8_Bom = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураИнфоДляСайта.Ссылка.Код КАК Код,
		|	НоменклатураИнфоДляСайта.Ссылка КАК Ссылка,
		|	НоменклатураИнфоДляСайта.Значение КАК Значение,
		|	НоменклатураИнфоДляСайта.Наименование.Наименование КАК НаименованиеНаименование,
		|	НоменклатураИнфоДляСайта.Наименование.id КАК Наименованиеid,
		|	ВЫБОР
		|		КОГДА НоменклатураИнфоДляСайта.Значение.ПолноеНаименование = """"
		|			ТОГДА НоменклатураИнфоДляСайта.Значение.Наименование
		|		ИНАЧЕ НоменклатураИнфоДляСайта.Значение.ПолноеНаименование
		|	КОНЕЦ КАК ЗначениеПолноеНаименование,
		|	НоменклатураИнфоДляСайта.Значение.id КАК Значениеid
		|ИЗ
		|	Справочник.Номенклатура.ИнфоДляСайта КАК НоменклатураИнфоДляСайта
		|ГДЕ
		|	НоменклатураИнфоДляСайта.Наименование.id <> """"
		|	И НоменклатураИнфоДляСайта.Значение.id <> """"
		|	И НоменклатураИнфоДляСайта.Наименование.НеВыгружатьНаСайт = ЛОЖЬ
		|	И НоменклатураИнфоДляСайта.Ссылка.НеВыгружатьНаСайт = ЛОЖЬ
		|	И НоменклатураИнфоДляСайта.Ссылка.НеДоступенДляИнтМаг = ЛОЖЬ
		|	И НоменклатураИнфоДляСайта.Ссылка.ПометкаУдаления = ЛОЖЬ";       
	
	//ИД = "";	
	//Запрос.УстановитьПараметр("id", ИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Номер = 1; 	
	product_id = "";  
	name = ""; // Наименование характеристики 
	nameid = "";
	value = "";   // Значение характеристкики
	valueid = "";          
	КодТовара = "";
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		КодТовара = Строка(ВыборкаДетальныеЗаписи.Код);
		КодТовара = СтрЗаменить(КодТовара,"-","");
		
		
		Пока Лев(КодТовара, 1) = "0" Цикл 
			КодТовара = Прав(КодТовара, СтрДлина(КодТовара) - 1);
		КонецЦикла;
		
		product_id = Формат(КодТовара, "ЧГ=0");		
		name = ВыборкаДетальныеЗаписи.НаименованиеНаименование;
		nameid = ВыборкаДетальныеЗаписи.Наименованиеid;
		value = ВыборкаДетальныеЗаписи.ЗначениеПолноеНаименование;
		valueid = ВыборкаДетальныеЗаписи.Значениеid;
			
	    id = Номер;
		id = СтрЗаменить(id,Символы.НПП,"");
		id = СтрЗаменить(id,",","");

		product_id = СтрЗаменить(product_id,Символы.НПП,"");
		product_id = СтрЗаменить(product_id,",","");
	
		СтрокаТекст = "'"+id+"';'"+product_id+"';'"+name+"';'"+nameid+"';'"+value+"';'"+valueid+"';";
		СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");

		ТекстовыйФайлUTF8_Bom.Добавить(СтрокаТекст);
		
		Номер = Номер + 1;	

	КонецЦикла; 
	
	
	Строка = СтрСоединить(ТекстовыйФайлUTF8_Bom, Символы.ПС);  //переделка в строку
	
	
	//запись в файл
	ТДок = Новый ТекстовыйДокумент;

	ТДок.ДобавитьСтроку(Строка);

	ТДок.Записать(КаталогВыгрузки_filter,"UTF-8");

	//ТекстовыйФайлUTF8_Bom.Записать(КаталогВыгрузки_catalog,"UTF-8");
	
	
	// открываем файл и считываем символы после символов BOM
	Данные = Новый ДвоичныеДанные(КаталогВыгрузки_filter);
	Строка64=Base64Строка(Данные);
	Строка64=Прав(Строка64,СтрДлина(Строка64)-4);
	ДанныеНаЗапись=Base64Значение(Строка64);
	ДанныеНаЗапись.Записать(КаталогВыгрузки_filter); // записываем

КонецПроцедуры
//////




&НаСервере	
Функция Транслит(Строка) 
		
		Рез = СокрЛП(Строка);   
		Рез = СтрЗаменить(Рез,"а","a"); 
		Рез = СтрЗаменить(Рез,"б","b"); 
		Рез = СтрЗаменить(Рез,"в","v"); 
		Рез = СтрЗаменить(Рез,"г","g"); 
		Рез = СтрЗаменить(Рез,"д","d"); 
		Рез = СтрЗаменить(Рез,"е","e"); 
		Рез = СтрЗаменить(Рез,"ё","e"); 
		Рез = СтрЗаменить(Рез,"ж","zh"); 
		Рез = СтрЗаменить(Рез,"з","z"); 
		Рез = СтрЗаменить(Рез,"и","i"); 
		Рез = СтрЗаменить(Рез,"к","k"); 
		Рез = СтрЗаменить(Рез,"л","l"); 
		Рез = СтрЗаменить(Рез,"м","m"); 
		Рез = СтрЗаменить(Рез,"н","n"); 
		Рез = СтрЗаменить(Рез,"о","o"); 
		Рез = СтрЗаменить(Рез,"п","p"); 
		Рез = СтрЗаменить(Рез,"р","r"); 
		Рез = СтрЗаменить(Рез,"с","s"); 
		Рез = СтрЗаменить(Рез,"т","t"); 
		Рез = СтрЗаменить(Рез,"у","u"); 
		Рез = СтрЗаменить(Рез,"ф","f"); 
		Рез = СтрЗаменить(Рез,"х","h"); 
		Рез = СтрЗаменить(Рез,"ч","ch"); 
		Рез = СтрЗаменить(Рез,"ш","sh"); 
		Рез = СтрЗаменить(Рез,"щ","sch"); 
		Рез = СтрЗаменить(Рез,"ъ",""); 
		Рез = СтрЗаменить(Рез,"ь",""); 
		Рез = СтрЗаменить(Рез,"э","e"); 
		Рез = СтрЗаменить(Рез,"ю","yu"); 
		Рез = СтрЗаменить(Рез,"й","i"); 
		Рез = СтрЗаменить(Рез,"ц","c"); 
		Рез = СтрЗаменить(Рез,"я","ya"); 
		Рез = СтрЗаменить(Рез,"ы","i"); 
		Рез = СтрЗаменить(Рез,"А","A"); 
		Рез = СтрЗаменить(Рез,"Б","B"); 
		Рез = СтрЗаменить(Рез,"В","V"); 
		Рез = СтрЗаменить(Рез,"Г","G"); 
		Рез = СтрЗаменить(Рез,"Д","D"); 
		Рез = СтрЗаменить(Рез,"Е","E"); 
		Рез = СтрЗаменить(Рез,"Ё","E"); 
		Рез = СтрЗаменить(Рез,"Ж","ZH"); 
		Рез = СтрЗаменить(Рез,"З","Z"); 
		Рез = СтрЗаменить(Рез,"И","I"); 
		Рез = СтрЗаменить(Рез,"К","K"); 
		Рез = СтрЗаменить(Рез,"Л","L"); 
		Рез = СтрЗаменить(Рез,"М","M"); 
		Рез = СтрЗаменить(Рез,"Н","N"); 
		Рез = СтрЗаменить(Рез,"О","O"); 
		Рез = СтрЗаменить(Рез,"П","P"); 
		Рез = СтрЗаменить(Рез,"Р","R"); 
		Рез = СтрЗаменить(Рез,"С","S"); 
		Рез = СтрЗаменить(Рез,"Т","T"); 
		Рез = СтрЗаменить(Рез,"У","U"); 
		Рез = СтрЗаменить(Рез,"Ф","F"); 
		Рез = СтрЗаменить(Рез,"Х","H"); 
		Рез = СтрЗаменить(Рез,"Ч","CH"); 
		Рез = СтрЗаменить(Рез,"Ш","SH"); 
		Рез = СтрЗаменить(Рез,"Щ","SCH"); 
		Рез = СтрЗаменить(Рез,"Ъ",""); 
		Рез = СтрЗаменить(Рез,"Ь",""); 
		Рез = СтрЗаменить(Рез,"Ы","I"); 
		Рез = СтрЗаменить(Рез,"Ц","C"); 
		Рез = СтрЗаменить(Рез,"Э","E"); 
		Рез = СтрЗаменить(Рез,"Ю","YU"); 
		Рез = СтрЗаменить(Рез,"Я","YA"); 
		Рез = СтрЗаменить(Рез,"Й","I");
		
		Рез = СтрЗаменить(Рез," ","-"); 
		Рез = СтрЗаменить(Рез,"--","-"); 
		Рез = СтрЗаменить(Рез,"--","-"); 
		Рез = СтрЗаменить(Рез,"--","-"); 
		Рез = СтрЗаменить(Рез,"#",""); 
		Рез = СтрЗаменить(Рез,"№",""); 
		Рез = СтрЗаменить(Рез,",",""); 
		Рез = СтрЗаменить(Рез,".",""); 
		Рез = СтрЗаменить(Рез,"/",""); 
		Рез = СтрЗаменить(Рез,"""",""); 
		Рез = СтрЗаменить(Рез,"(",""); 
		Рез = СтрЗаменить(Рез,")","");
		
		//jadmin
		Рез = СтрЗаменить(Рез,"`","");
		Рез = СтрЗаменить(Рез,"ö","o");
		Рез = СтрЗаменить(Рез,"ń","n");
		Рез = СтрЗаменить(Рез,"’","");
		Рез = СтрЗаменить(Рез,"'","");
		Рез = СтрЗаменить(Рез,"=","");
		Рез = СтрЗаменить(Рез,"+","");
		Рез = СтрЗаменить(Рез,"°","");
		Рез = СтрЗаменить(Рез,"&","-");  
		Рез = СтрЗаменить(Рез,"ł","l");
		Рез = СтрЗаменить(Рез,"«",""); 
		Рез = СтрЗаменить(Рез,"»","");   
		Рез = СтрЗаменить(Рез,"á","a");
		Рез = СтрЗаменить(Рез,"ĭ","i");  
		Рез = СтрЗаменить(Рез,"і","i");
		
		
		Рез = СтрЗаменить(Рез,Символы.НПП,"-");

		Возврат(Рез);
		
	КонецФункции
////	
&НаСервере
Функция ПолучитьПуть() 
	Возврат (Константы.ПутьОбменаСБухгалтерией.Получить());	
КонецФункции	
////          

 ////
&НаСервере
Процедура ПередачаФайловПоAPI_Розница() Экспорт
	
	ДанныеФайлов = Новый Структура;
	МассивДанных = Новый Массив;

	/////////////////////
	//product.csv		
	ИмяВыгружаемогоФайла = "";
	ИмяВыгружаемогоФайла = "product.csv";
	
	РасположениеФайлаИсточника = "\\192.168.0.111\DATA_EXCHANGE_1C83\";
	ДобавитьВыгружаемыйФайлВМассив(РасположениеФайлаИсточника,ИмяВыгружаемогоФайла,МассивДанных);
	
	//флаг upload
	
	ИмяВыгружаемогоФайла = "";
	ИмяВыгружаемогоФайла = "upload.flg";

	ТекстовыйДок = Новый ТекстовыйДокумент;
	Дата = Формат(ТекущаяДата(),"ДФ= yyyyMMdd");
	ПутьФайлФлаг = "\\192.168.0.111\DATA_EXCHANGE_1C83\"+ИмяВыгружаемогоФайла;

	ФайлФлаг = Новый ЗаписьТекста(
        ПутьФайлФлаг, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        Ложь // перезаписывать файл, а не дописывать в конец (необ.)
    );
	ФайлФлаг.Закрыть();

	ДобавитьВыгружаемыйФайлВМассив(ПутьФайлФлаг,ИмяВыгружаемогоФайла,МассивДанных);

	ДанныеФайлов.Вставить("files",МассивДанных);	

	
	
	
	
	///Отправка
	ЗаписьJSON = Новый ЗаписьJSON;	
	
	тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
	ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 

	
	ЗаписатьJSON(ЗаписьJSON, ДанныеФайлов);
	СтрокаJS = ЗаписьJSON.Закрыть();
		
	Соединение = Новый HTTPСоединение(
	    "www.msso.by", // сервер (хост)
	    443, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    , // таймаут в секундах, 0 или пусто - не устанавливать
	   Новый ЗащищенноеСоединениеOpenSSL()
	);
	
	ТОКЕН = "dFk9M6R2NwIKsfc8bCnjvHXt";
	
	ЗапросPOST = Новый HTTPЗапрос("/postupload.php");
	ЗапросPOST.Заголовки.Вставить("Content-type", "application/json");
	ЗапросPOST.Заголовки.Вставить("X-API-KEY", ТОКЕН);
	
	
	ЗапросPOST.УстановитьТелоИзСтроки(СтрокаJS);
	Результат = Соединение.ВызватьHTTPМетод("POST",ЗапросPOST);	
	
	Если Результат.КодСостояния = 200 Тогда        
		Сообщить(Результат.ПолучитьТелоКакСтроку("UTF-8"));  
		А=1;
	Иначе
		Сообщить("Ошибка соединения с сайтом "+ Результат.КодСостояния);
	КонецЕсли;

	
    Сообщить("Файлы по API переданы успешно.");
 
КонецПроцедуры
/// 
 ////
&НаСервере
Процедура ПередачаФайловПоAPI_Опт() Экспорт
	
	ДанныеФайлов = Новый Структура;
	МассивДанных = Новый Массив;

	/////////////////////
	//product.csv		
	ИмяВыгружаемогоФайла = "";
	ИмяВыгружаемогоФайла = "productopt.csv";
	
	РасположениеФайлаИсточника = "\\192.168.0.111\DATA_EXCHANGE_1C83\";
	ДобавитьВыгружаемыйФайлВМассив(РасположениеФайлаИсточника,ИмяВыгружаемогоФайла,МассивДанных);
	
	//флаг upload
	
	ИмяВыгружаемогоФайла = "";
	ИмяВыгружаемогоФайла = "upload_opt.flg";

	ТекстовыйДок = Новый ТекстовыйДокумент;
	Дата = Формат(ТекущаяДата(),"ДФ= yyyyMMdd");
	ПутьФайлФлаг = "\\192.168.0.111\DATA_EXCHANGE_1C83\"+ИмяВыгружаемогоФайла;

	ФайлФлаг = Новый ЗаписьТекста(
        ПутьФайлФлаг, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        Ложь // перезаписывать файл, а не дописывать в конец (необ.)
    );
	ФайлФлаг.Закрыть();
	

	ДобавитьВыгружаемыйФайлВМассив(ПутьФайлФлаг,ИмяВыгружаемогоФайла,МассивДанных);

	ДанныеФайлов.Вставить("files",МассивДанных);	

	
	////пароли    		
	ИмяВыгружаемогоФайла = "";
	ИмяВыгружаемогоФайла = "logins.csv";
	
	РасположениеФайлаИсточника = "\\192.168.0.111\DATA_EXCHANGE_1C83\";
	ДобавитьВыгружаемыйФайлВМассив(РасположениеФайлаИсточника,ИмяВыгружаемогоФайла,МассивДанных);
	
	//флаг upload
	
	ИмяВыгружаемогоФайла = "";
	ИмяВыгружаемогоФайла = "upload_pass_opt.flg";

	ТекстовыйДок = Новый ТекстовыйДокумент;
	Дата = Формат(ТекущаяДата(),"ДФ= yyyyMMdd");
	ПутьФайлФлаг = "\\192.168.0.111\DATA_EXCHANGE_1C83\"+ИмяВыгружаемогоФайла;

	ФайлФлаг = Новый ЗаписьТекста(
        ПутьФайлФлаг, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        Ложь // перезаписывать файл, а не дописывать в конец (необ.)
    );
	ФайлФлаг.Закрыть();
	

	ДобавитьВыгружаемыйФайлВМассив(ПутьФайлФлаг,ИмяВыгружаемогоФайла,МассивДанных);

	ДанныеФайлов.Вставить("files",МассивДанных);
		
	
	
	
	
	///Отправка
	ЗаписьJSON = Новый ЗаписьJSON;	
	
	тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
	ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 

	
	ЗаписатьJSON(ЗаписьJSON, ДанныеФайлов);
	СтрокаJS = ЗаписьJSON.Закрыть();
		
	Соединение = Новый HTTPСоединение(
	    "www.msso.by", // сервер (хост)
	    443, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    , // таймаут в секундах, 0 или пусто - не устанавливать
	   Новый ЗащищенноеСоединениеOpenSSL()
	);
	
	ТОКЕН = "dFk9M6R2NwIKsfc8bCnjvHXt";
	
	ЗапросPOST = Новый HTTPЗапрос("/postupload.php");
	ЗапросPOST.Заголовки.Вставить("Content-type", "application/json");
	ЗапросPOST.Заголовки.Вставить("X-API-KEY", ТОКЕН);
	
	
	ЗапросPOST.УстановитьТелоИзСтроки(СтрокаJS);
	Результат = Соединение.ВызватьHTTPМетод("POST",ЗапросPOST);	
	
	Если Результат.КодСостояния = 200 Тогда        
		Сообщить(Результат.ПолучитьТелоКакСтроку("UTF-8"));  
		А=1;
	Иначе
		Сообщить("Ошибка соединения с сайтом "+ Результат.КодСостояния);
	КонецЕсли;

	
    Сообщить("Файлы по API переданы успешно.");
 
КонецПроцедуры
///


Процедура ДобавитьВыгружаемыйФайлВМассив(РасположениеФайла,ИмяВыгружаемогоФайла,МассивДанных)

	ФайлыСтруктура = Новый Структура; 
	ФайлыСтруктура.Вставить("fileName", "");
	ФайлыСтруктура.Вставить("fileData", ""); 
	ФайлыСтруктура.Вставить("files", "");
	
	//ИмяВыгружаемогоФайла = "";
	//ИмяВыгружаемогоФайла = "product.csv";
	
	РасположениеФайлаИсточника = "\\192.168.0.111\DATA_EXCHANGE_1C83\"+ИмяВыгружаемогоФайла;
	ДвоичныеДанные = Новый ДвоичныеДанные(РасположениеФайлаИсточника);		
	СтрBase64 = Base64Строка(ДвоичныеДанные);
	
	ФайлыСтруктура.Вставить("fileName", ИмяВыгружаемогоФайла); 
	ФайлыСтруктура.Вставить("fileData", ""+СтрBase64);	
	
	МассивДанных.Добавить(ФайлыСтруктура);

КонецПроцедуры



////
&НаСервере
Процедура ПередачаФайловПоFTP() Экспорт
	
 ПарольФТП = Константы.ДоступПоФТП.Получить();
 //ПарольФТП = "BTb#97bYr3qM5-";
 //Соединение = Новый FTPСоединение("vh98.hoster.by",21,"mssoby",ПарольФТП,,,60); 
 //https://breakout.hostflyby.net:2083/
  Соединение = Новый FTPСоединение("breakout.hostflyby.net",21,"mssoby",ПарольФТП,,ИСТИНА,60); 
  
   //Таймайт на подключении
  	ДатаКон = ТекущаяДата() + 5;//1 секундой больше
	Пока ТекущаяДата() < ДатаКон Цикл
		//пока выполняется цикл поток прерван
	КонецЦикла;

 
	ТекстовыйДок = Новый ТекстовыйДокумент;
	Дата = Формат(ТекущаяДата(),"ДФ= yyyyMMdd");
	ПутьФайлФлаг = "\\192.168.0.111\DATA_EXCHANGE_1C83\upload.flg";

	ФайлФлаг = Новый ЗаписьТекста(
        ПутьФайлФлаг, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        Ложь // перезаписывать файл, а не дописывать в конец (необ.)
    );
	ФайлФлаг.Закрыть();
	
	Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\product.csv","/public_html/upload/import/product.csv");
	
	
	Хеш1 = Новый ХешированиеДанных(ХешФункция.MD5);
	
	ХеШ1.ДобавитьФайл("\\192.168.0.111\DATA_EXCHANGE_1C83\product.csv");
	
	  
  	Хеш2 = Новый ХешированиеДанных(ХешФункция.MD5);
 	ВременныйФайл = ПолучитьИмяВременногоФайла("csv");
  	Соединение.Получить("/public_html/upload/import/product.csv",ВременныйФайл);
   	ХеШ2.ДобавитьФайл(ВременныйФайл);

	

	//Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\product_specification_values.csv","/public_html/upload/import/product_specification_values.csv");
	//Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\product_specifications.csv","/public_html/upload/import/product_specifications.csv");
	//
	
	//НайденныеОбъектыFTP = Соединение.НайтиФайлы("/public_html/upload/product/images/","*.*",Истина);
	//
	//НайденныеОбъектыFTPСписок = Новый Массив;
	//Для каждого ФайлFTP Из НайденныеОбъектыFTP Цикл
	//	НайденныеОбъектыFTPСписок.Добавить(ФайлFTP.Имя);	
	//КонецЦикла; 
	
	
	///jadmin откл картинки
	//НайденныеФайлы = НайтиФайлы("\\192.168.0.111\DATA_EXCHANGE_1C83\image", "*.*");
	//
	//Для каждого Файл Из НайденныеФайлы Цикл
	//	//Поиск = НайденныеОбъектыFTPСписок.Найти(Файл.Имя);
	//	//Если Поиск <> Неопределено Тогда
	//	//    РазмерFTP = НайденныеОбъектыFTP[Поиск].Размер();
	//	//	Если Файл.Размер() <> РазмерFTP Тогда
	//	//	  Соединение.Записать(Файл.ПолноеИмя,"/public_html/upload/product/images/"+Файл.Имя);	
	//	//	КонецЕсли; 	 
	//	//Иначе
	//		Соединение.Записать(Файл.ПолноеИмя,"/public_html/upload/product/images/"+Файл.Имя);	
	//	//КонецЕсли; 
	//КонецЦикла; 
	////
	Если Хеш1.ХешСумма = Хеш2.ХешСумма Тогда
	
 		Соединение.Записать(ПутьФайлФлаг,"/public_html/upload/import/upload.flg");	
	
	КонецЕсли;
	
    Сообщить("Передали файл по FTP.");
 
КонецПроцедуры
///
&НаСервере
Процедура ПередачаФайловИКартинокПоFTP(ВыгружатьИзображения) Экспорт
	
 ПарольФТП = Константы.ДоступПоФТП.Получить();
 //ПарольФТП = "BTb#97bYr3qM5-";
 Соединение = Новый FTPСоединение("breakout.hostflyby.net",21,"mssoby",ПарольФТП,,ИСТИНА,600); 
 
  //Таймайт на подключении
  	ДатаКон = ТекущаяДата() + 5;//1 секундой больше
	Пока ТекущаяДата() < ДатаКон Цикл
		//пока выполняется цикл поток прерван
	КонецЦикла;

 
	ТекстовыйДок = Новый ТекстовыйДокумент;
	Дата = Формат(ТекущаяДата(),"ДФ= yyyyMMdd");
	ПутьФайлФлаг = "\\192.168.0.111\DATA_EXCHANGE_1C83\upload.flg";

	ФайлФлаг = Новый ЗаписьТекста(
        ПутьФайлФлаг, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        Ложь // перезаписывать файл, а не дописывать в конец (необ.)
    );
	ФайлФлаг.Закрыть();
	
	
	ТекстовыйДок = Новый ТекстовыйДокумент;
	Дата = Формат(ТекущаяДата(),"ДФ= yyyyMMdd");
	ПутьФайлФлаг = "\\192.168.0.111\DATA_EXCHANGE_1C83\images.flg";

	ФайлФлаг = Новый ЗаписьТекста(
        ПутьФайлФлаг, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        Ложь // перезаписывать файл, а не дописывать в конец (необ.)
    );
	ФайлФлаг.Закрыть();
	
	
	Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\product.csv","/public_html/upload/import/product.csv");
	Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\catalog.csv","/public_html/upload/import/catalog.csv");
	
	Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\OPS_Europost.csv","/public_html/upload/import/department.csv");   //файлыОПС_Европочта
	
	//данные для таблицы фильтр
	Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\filter.csv","/public_html/upload/import/filter.csv");
	
	
	
	
	Хеш1 = Новый ХешированиеДанных(ХешФункция.MD5);
	
	Хеш1.ДобавитьФайл("\\192.168.0.111\DATA_EXCHANGE_1C83\product.csv");
	
	  
  	Хеш2 = Новый ХешированиеДанных(ХешФункция.MD5);
 	ВременныйФайл = ПолучитьИмяВременногоФайла("csv");
  	Соединение.Получить("/public_html/upload/import/product.csv",ВременныйФайл);
   	ХеШ2.ДобавитьФайл(ВременныйФайл);

	
	
	Хеш3 = Новый ХешированиеДанных(ХешФункция.MD5);
	
	Хеш3.ДобавитьФайл("\\192.168.0.111\DATA_EXCHANGE_1C83\catalog.csv");
	
	  
  	Хеш4 = Новый ХешированиеДанных(ХешФункция.MD5);
 	ВременныйФайл = ПолучитьИмяВременногоФайла("csv");
  	Соединение.Получить("/public_html/upload/import/catalog.csv",ВременныйФайл);
   	ХеШ4.ДобавитьФайл(ВременныйФайл);


	
	Если Хеш1.ХешСумма = Хеш2.ХешСумма И Хеш3.ХешСумма = Хеш4.ХешСумма Тогда
	
 		Соединение.Записать(ПутьФайлФлаг,"/public_html/upload/import/upload.flg");
	
	КонецЕсли;

	
	//НайденныеОбъектыFTP = Соединение.НайтиФайлы("/public_html/upload/product/images/","*.*",Истина);
	//
	//НайденныеОбъектыFTPСписок = Новый Массив;
	//Для каждого ФайлFTP Из НайденныеОбъектыFTP Цикл
	//	НайденныеОбъектыFTPСписок.Добавить(ФайлFTP.Имя);	
	//КонецЦикла; 
	
    
	//картинки
	//НайденныеФайлы = НайтиФайлы("\\192.168.0.111\DATA_EXCHANGE_1C83\image", "*.*");
	Если ВыгружатьИзображения = ИСТИНА Тогда
	
		ЗаписьZIP = Новый ЗаписьZipФайла("\\192.168.0.111\DATA_EXCHANGE_1C83\images.zip",,,МетодСжатияZIP.Сжатие,УровеньСжатияZIP.Оптимальный);
					
		ЗаписьZIP.Добавить("\\192.168.0.111\DATA_EXCHANGE_1C83\image\*.*",РежимСохраненияПутейZIP.НеСохранятьПути);				
		ЗаписьZIP.Записать();	
		
		Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\images.zip","/public_html/upload/product/images.zip");
		
		
		
		Хеш5 = Новый ХешированиеДанных(ХешФункция.MD5);
		
		Хеш5.ДобавитьФайл("\\192.168.0.111\DATA_EXCHANGE_1C83\images.zip");
		
		  
	  	Хеш6 = Новый ХешированиеДанных(ХешФункция.MD5);
	 	ВременныйФайл = ПолучитьИмяВременногоФайла("zip");
	  	Соединение.Получить("/public_html/upload/product/images.zip",ВременныйФайл);
	   	ХеШ6.ДобавитьФайл(ВременныйФайл);

		//Для каждого Файл Из НайденныеФайлы Цикл
			//Поиск = НайденныеОбъектыFTPСписок.Найти(Файл.Имя);
			//Если Поиск <> Неопределено Тогда
			//    РазмерFTP = НайденныеОбъектыFTP[Поиск].Размер();
			//	Если Файл.Размер() <> РазмерFTP Тогда
			//	  Соединение.Записать(Файл.ПолноеИмя,"/public_html/upload/product/images/"+Файл.Имя);	
			//	КонецЕсли; 	 
			//Иначе
			

			
				//Соединение.Записать(Файл.ПолноеИмя,"/public_html/upload/product/images/"+Файл.Имя);	
			//КонецЕсли; 
		//КонецЦикла; 
		//
		
		Если Хеш5.ХешСумма = Хеш6.ХешСумма Тогда
		
			Соединение.Записать(ПутьФайлФлаг,"/public_html/upload/import/images.flg");
		
		КонецЕсли;	
	
	КонецЕсли; 
	
    Сообщить("Передали файл по FTP.");
 
КонецПроцедуры
///
&НаСервере
Процедура ПередачаФайловПоFTPОпт()
	
 ПарольФТП = Константы.ДоступПоФТП.Получить();
 //ПарольФТП = "BTb#97bYr3qM5-";
 Соединение = Новый FTPСоединение("breakout.hostflyby.net",21,"mssoby",ПарольФТП,,ИСТИНА,60); 
 
 
    //Таймайт на подключении
  	ДатаКон = ТекущаяДата() + 5;//1 секундой больше
	Пока ТекущаяДата() < ДатаКон Цикл
		//пока выполняется цикл поток прерван
	КонецЦикла;

	ТекстовыйДок = Новый ТекстовыйДокумент;
	Дата = Формат(ТекущаяДата(),"ДФ= yyyyMMdd");
	ПутьФайлФлаг = "\\192.168.0.111\DATA_EXCHANGE_1C83\upload_opt.flg";

	ФайлФлаг = Новый ЗаписьТекста(
        ПутьФайлФлаг, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        Ложь // перезаписывать файл, а не дописывать в конец (необ.)
    );
	ФайлФлаг.Закрыть();
	
	Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\productopt.csv","/public_html/upload/import/productopt.csv");
	//Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\logins.csv","/public_html/upload/import/logins.csv");
	//Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\productopt_specifications.csv","/public_html/upload/import/productopt_specifications.csv");
	//
	
	
		Хеш1 = Новый ХешированиеДанных(ХешФункция.MD5);
	
	ХеШ1.ДобавитьФайл("\\192.168.0.111\DATA_EXCHANGE_1C83\productopt.csv");
	
	  
  	Хеш2 = Новый ХешированиеДанных(ХешФункция.MD5);
 	ВременныйФайл = ПолучитьИмяВременногоФайла("csv");
  	Соединение.Получить("/public_html/upload/import/productopt.csv",ВременныйФайл);
   	ХеШ2.ДобавитьФайл(ВременныйФайл);

	Если Хеш1.ХешСумма = Хеш2.ХешСумма Тогда
	
 		Соединение.Записать(ПутьФайлФлаг,"/public_html/upload/import/upload_opt.flg");	
	
	КонецЕсли;

	
	//НайденныеОбъектыFTP = Соединение.НайтиФайлы("/public_html/upload/product/images/","*.*",Истина);
	//
	//НайденныеОбъектыFTPСписок = Новый Массив;
	//Для каждого ФайлFTP Из НайденныеОбъектыFTP Цикл
	//	НайденныеОбъектыFTPСписок.Добавить(ФайлFTP.Имя);	
	//КонецЦикла; 
	
	//jamin
	//НайденныеФайлы = НайтиФайлы("\\192.168.0.111\DATA_EXCHANGE_1C83\image", "*.*");
	//
	//Для каждого Файл Из НайденныеФайлы Цикл
	//	//Поиск = НайденныеОбъектыFTPСписок.Найти(Файл.Имя);
	//	//Если Поиск <> Неопределено Тогда
	//	//    РазмерFTP = НайденныеОбъектыFTP[Поиск].Размер();
	//	//	Если Файл.Размер() <> РазмерFTP Тогда
	//	//	  Соединение.Записать(Файл.ПолноеИмя,"/public_html/upload/product/imagesImp/"+Файл.Имя);	
	//	//	КонецЕсли; 	 
	//	//Иначе
	//		Соединение.Записать(Файл.ПолноеИмя,"/public_html/upload/product/images/"+Файл.Имя);	
	//	//КонецЕсли; 
	//КонецЦикла; 
	 
    Сообщить("Передали файл для опта по FTP.");
 
КонецПроцедуры
///
&НаСервере
Процедура ПередачаПАРОЛЕЙПоFTPОпт()
	
 ПарольФТП = Константы.ДоступПоФТП.Получить();
 //ПарольФТП = "BTb#97bYr3qM5-";
 Соединение = Новый FTPСоединение("breakout.hostflyby.net",21,"mssoby",ПарольФТП,,ИСТИНА,60); 
 
  //Таймайт на подключении
  	ДатаКон = ТекущаяДата() + 5;//1 секундой больше
	Пока ТекущаяДата() < ДатаКон Цикл
		//пока выполняется цикл поток прерван
	КонецЦикла;

 
	ТекстовыйДок = Новый ТекстовыйДокумент;
	Дата = Формат(ТекущаяДата(),"ДФ= yyyyMMdd");
	ПутьФайлФлаг = "\\192.168.0.111\DATA_EXCHANGE_1C83\upload_pass_opt.flg";

	ФайлФлаг = Новый ЗаписьТекста(
        ПутьФайлФлаг, // имя
        КодировкаТекста.ANSI, // кодировка
        Символы.ПС, // разделитель строк (необ.)
        Ложь // перезаписывать файл, а не дописывать в конец (необ.)
    );
	ФайлФлаг.Закрыть();
	
	Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\logins.csv","/public_html/upload/import/logins.csv");
	//Соединение.Записать("\\192.168.0.111\DATA_EXCHANGE_1C83\productopt_specifications.csv","/public_html/upload/import/productopt_specifications.csv");
	
	Хеш1 = Новый ХешированиеДанных(ХешФункция.MD5);
	
	ХеШ1.ДобавитьФайл("\\192.168.0.111\DATA_EXCHANGE_1C83\logins.csv");
	
	  
  	Хеш2 = Новый ХешированиеДанных(ХешФункция.MD5);
 	ВременныйФайл = ПолучитьИмяВременногоФайла("csv");
  	Соединение.Получить("/public_html/upload/import/logins.csv",ВременныйФайл);
   	ХеШ2.ДобавитьФайл(ВременныйФайл);

	Если Хеш1.ХешСумма = Хеш2.ХешСумма Тогда
	
 		Соединение.Записать(ПутьФайлФлаг,"/public_html/upload/import/upload_pass_opt.flg");	
	
	КонецЕсли;

	
    Сообщить("Передали файл для опта по FTP.");
 
КонецПроцедуры
///
&НаСервере
Процедура ПолучениеЗаказовОптПоFTP()
    
	Попытка
		
		ПарольФТП = Константы.ДоступПоФТП.Получить();
		//ПарольФТП = "BTb#97bYr3qM5-";
		Соединение = Новый FTPСоединение("breakout.hostflyby.net",21,"mssoby",ПарольФТП,,ИСТИНА,180); 
		
	    Попытка
			НайденныеОбъектыFTP = Соединение.НайтиФайлы("/public_html/uploads/","*.in",Истина);	

			
			ПапкаДляСохранения = "\\192.168.0.111\DATA_EXCHANGE_1C83\ЗаказыССайта\";    
			// Внимание! Используем прямые слеши.
			
			
			Для каждого ФайлFTP Из НайденныеОбъектыFTP Цикл
				
				Соединение.Получить(
				"/public_html/uploads/" + ФайлFTP.ИмяБезРасширения + ".txt", // что качаем
				ПапкаДляСохранения + ФайлFTP.ИмяБезРасширения + ".txt" // куда качаем
				);
				
				//Качаем файлыФлаги
				Соединение.Получить(
				"/public_html/uploads/" + ФайлFTP.ИмяБезРасширения + ".in", // что качаем
				ПапкаДляСохранения + ФайлFTP.ИмяБезРасширения + ".in" // куда качаем
				);
				
				
				//Сообщить("Сохранили файл в " + ПапкаДляСохранения);
				
				Соединение.Удалить(
				"/public_html/uploads/", // путь к удаляемым файлам
				ФайлFTP.ИмяБезРасширения + ".in" // маска для выбора
				); // или несколько файлов поиском по маске
				
			КонецЦикла; 
		Исключение
		     Сообщить(ОписаниеОшибки());
		КонецПопытки;

		
		Сообщить("Заказы по FTP получены.");
		
		
	Исключение
		//пишем в телеграм ошибку обмена
		ЗаголовокОшибки = "ОШИБКА ОБМЕНА 1C И САЙТА"; 
		Ошибка = ОписаниеОшибки();

		А = МССО_РассылкиУведомления.ОтправитьУведомлениеВТелеграм(ЗаголовокОшибки, Ошибка);
		
	КонецПопытки; 
 
КонецПроцедуры
///
&НаСервере
Процедура ПолучениеЗаказовРозницаПоFTP()
    
 	Попытка
	
	 ПарольФТП = Константы.ДоступПоФТП.Получить();	
	 //ПарольФТП = "BTb#97bYr3qM5-";
	 Соединение = Новый FTPСоединение("breakout.hostflyby.net",21,"mssoby",ПарольФТП,,ИСТИНА,60); 
	

	НайденныеОбъектыFTP = Соединение.НайтиФайлы("/public_html/uploads_retail/","*.in",Истина);
	
	ПапкаДляСохранения = "\\192.168.0.111\DATA_EXCHANGE_1C83\ЗаказыССайтаРозница\";    
      // Внимание! Используем прямые слеши.

	  
	Для каждого ФайлFTP Из НайденныеОбъектыFTP Цикл
		
		 Соединение.Получить(
         "/public_html/uploads_retail/" + ФайлFTP.ИмяБезРасширения + ".txt", // что качаем
         ПапкаДляСохранения + ФайлFTP.ИмяБезРасширения + ".txt" // куда качаем
    );
	
	//Качаем файлыФлаги
		 Соединение.Получить(
         "/public_html/uploads_retail/" + ФайлFTP.ИмяБезРасширения + ".in", // что качаем
         ПапкаДляСохранения + ФайлFTP.ИмяБезРасширения + ".in" // куда качаем
    );

 
	//Сообщить("Сохранили файл в " + ПапкаДляСохранения);
	
	Соединение.Удалить(
	    "/public_html/uploads_retail/", // путь к удаляемым файлам
	    ФайлFTP.ИмяБезРасширения + ".in" // маска для выбора
	); // или несколько файлов поиском по маске
	
	КонецЦикла; 

    Сообщить("Заказы по FTP получены.");


	Исключение
		//пишем в телеграм ошибку обмена
		Ошибка = ОписаниеОшибки();
		Команда1 = "C:\cURL\curl.exe https://api.telegram.org/bot977867589:AAF0xKkESIU4XcTzIJF3DsFVfnGExEACK3Y/sendMessage?chat_id=-338090218=&text=""*ОШИБКА ОБМЕНА 1C И САЙТА* %0A" + Ошибка +  "&parse_mode=Markdown";  
		Shell = Новый COMОбъект("WScript.Shell");
		WshExec = Shell.Exec(Команда1);
		OutStream = WshExec.StdOut;

	КонецПопытки; 
 
КонецПроцедуры
///
Процедура ОбработатьФайлыЗаказовРозница()
	ПапкаПуть =  "\\192.168.0.111\DATA_EXCHANGE_1C83\ЗаказыССайтаРозница\" ;
	
	НайденныеФайлы = НайтиФайлы(ПапкаПуть, "*.in");
	
	Для каждого Файл Из НайденныеФайлы Цикл
		
		 ПрочитанныйФайл = Новый текстовыйДокумент;
		 ПрочитанныйФайл.Прочитать(ПапкаПуть + Файл.ИмяБезРасширения + ".txt",КодировкаТекста.UTF8);

		
	     КомандаОбработатьДанныеНаСервереРозница(ПрочитанныйФайл);
		 
		 УдалитьФайлы(ПапкаПуть + Файл.ИмяБезРасширения + ".in");	
	КонецЦикла; 

КонецПроцедуры 
/// 
Процедура ОбработатьФайлыЗаказов()
	ПапкаПуть =  "\\192.168.0.111\DATA_EXCHANGE_1C83\ЗаказыССайта\" ;
	
	НайденныеФайлы = НайтиФайлы(ПапкаПуть, "*.in");
	
	Для каждого Файл Из НайденныеФайлы Цикл
		
		 ПрочитанныйФайл = Новый текстовыйДокумент;
		 ПрочитанныйФайл.Прочитать(ПапкаПуть + Файл.ИмяБезРасширения + ".txt",КодировкаТекста.UTF8);

		
	     КомандаОбработатьДанныеНаСервере(ПрочитанныйФайл);
		 
		 УдалитьФайлы(ПапкаПуть + Файл.ИмяБезРасширения + ".in");	
	КонецЦикла; 

КонецПроцедуры 
///  
&НаСервере
Процедура КомандаОбработатьДанныеНаСервере(ПрочитанныйФайл)
	
	Попытка

		Разделитель = ";";
		
		ДанныеЗаказа = ПрочитанныйФайл.ПолучитьСтроку(1);
		СтрокаЗаказ = СтрРазделить(ПрочитанныйФайл.ПолучитьСтроку(2),Разделитель);
		КодКлиента = СтрокаЗаказ[2 -1];
		КодКлиента = СтрЗаменить(КодКлиента, "login:", "");
		
		Если КодКлиента = "" Тогда
		
			Возврат;
		
		КонецЕсли;
		
		ПризнакДоставки = СтрокаЗаказ[3 -1];
		ПризнакДоставки = Число(СтрЗаменить(ПризнакДоставки, "Признак доставки:", ""));       
		
		//если значение Признак доставки 1 то самовывоз, 2 то доставка
		Если ПризнакДоставки = 2 Тогда
		
			АдресДоставки = СтрокаЗаказ[4 -1];	
		    АдресДоставки = СтрЗаменить(АдресДоставки, "Адрес:", "");
			
		КонецЕсли; 
		
		Если СтрДлина(КодКлиента) >= 8 Тогда
		     КодКлиента = Прав(КодКлиента,6);		
		КонецЕсли; 
		
		Пока СтрДлина(КодКлиента) <> 8 Цикл
			КодКлиента = "0" + КодКлиента;
		КонецЦикла; 
		КодКлиента = "00-" + КодКлиента;
		
		Партнер = Справочники.Партнеры.НайтиПоКоду(КодКлиента);
		Склад = Справочники.Склады.Склад3;
		ЗаказНомер = СтрокаЗаказ[1 -1];
		

			Заказ = Документы.ИнтернетЗаказКлиента.СоздатьДокумент();
			Заказ.Партнер = Партнер;
			Заказ.Контрагент = Партнер;
			Заказ.ОсновнойМенеджер = Партнер.ОсновнойМенеджер;

			//Заказ.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",Истина);
			
			Заказ.Дата = ТекущаяДата();
			Заказ.ЗаказТребуетВниманияМенеджера = Истина;
			Заказ.ИнтернетЗаказ = Истина;
			//Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;			
			Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован; //jadmin
			
		   	Заказ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний",Истина);
			Заказ.Склад = Склад.Родитель;
			
			Если ПризнакДоставки = 2 Тогда
				
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
				Заказ.АдресДоставкиСайт = АдресДоставки;
				
			Иначе
				
			    Заказ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;

			КонецЕсли; 
			
			
			Заказ.Комментарий = "Интернет" + ЗаказНомер + ", " + ДанныеЗаказа;
			Комментарий = Заказ.Комментарий;
			//СуммаИтого = 0;
			Для НомерСтроки=3 по ПрочитанныйФайл.КоличествоСтрок() Цикл
				
				Строка = ПрочитанныйФайл.ПолучитьСтроку(НомерСтроки);
			
				Если Найти(Строка, "Итого ") > 0 Тогда
					
					СтрокаИтого = СтрРазделить(Строка,Разделитель);
					СуммаИтого = СтрокаИтого[2 -1];				
					Заказ.СуммаДокумента = СуммаИтого;
					
					Прервать;
				
				КонецЕсли;

				
				
				Строка = ПрочитанныйФайл.ПолучитьСтроку(НомерСтроки);
				
				МассивКол = СтрРазделить(Строка,Разделитель);
				
				КодТовара = МассивКол[2-1];
				Наименование =  МассивКол[4-1]; 
				КолВо = МассивКол[5-1];
				Цена = МассивКол[6-1];
				Сумма = МассивКол[7-1];
			
				
				
				Пока СтрДлина(КодТовара) <> 8 Цикл
					КодТовара = "0" + КодТовара;
				КонецЦикла; 
				КодТовара = "00-" + КодТовара;

				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
			
				Товар = Заказ.Товары.Добавить();
				Товар.Номенклатура = Номенклатура;
				Товар.Упаковка = Номенклатура.ЕдиницаИзмерения;
				Товар.Количество = Число(КолВо);
				Товар.КоличествоУпаковок = Число(КолВо);
				Товар.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",Истина);
				Товар.Цена = ПолучитьЦену(Номенклатура); 
				Товар.Сумма = Товар.Количество * Товар.Цена;
				Товар.СтатусУказанияСерий = 14;
				Товар.Склад = ПолучитьСклад(Номенклатура);
				Товар.СтавкаНДС = Номенклатура.СтавкаНДС;
				Товар.ДатаОтгрузки = НачалоДня(ТекущаяДата());
				Товар.КлючСвязи = Товар.НомерСтроки;
				//СуммаИтого = СуммаИтого + Товар.Сумма;				
				
			КонецЦикла;
		//
		//		СтрокаИтого = СтрРазделить(ПрочитанныйФайл.ПолучитьСтроку(ПрочитанныйФайл.КоличествоСтрок()),Разделитель);
		//		СуммаИтого = СтрокаИтого[2 -1];
		//		
		//		Заказ.СуммаДокумента = СуммаИтого;

				Заказ.Записать(РежимЗаписиДокумента.Запись);		
				
				//Файл = Справочники.ЗаказКлиентаПрисоединенныеФайлы.СоздатьЭлемент();
				//Файл.ФайлХранилище =  Новый ХранилищеЗначения(ПрочитанныйФайл);
				//Файл.ФайлХранилище.Получить();
				//Файл.ВладелецФайла = Заказ.Ссылка;
				//Файл.Наименование = "Заказ";
				//Файл.Расширение = "txt";
				//Файл.ТипХраненияФайла = Перечисления.ТипыХраненияФайлов.ВИнформационнойБазе;
				//Файл.Записать();
				
				
				
				УчетнаяЗаписьПочта = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
				
				ПрофильПодключения = Новый ИнтернетПочтовыйПрофиль;
				ПрофильПодключения.АдресСервераSMTP = УчетнаяЗаписьПочта.СерверИсходящейПочты;
				
				ПрофильПодключения.ИспользоватьSSLSMTP=УчетнаяЗаписьПочта.ИспользоватьЗащищенноеСоединениеДляИсходящейПочты;
				
				ПрофильПодключения.ПортSMTP = УчетнаяЗаписьПочта.ПортСервераИсходящейПочты;
				
				ПрофильПодключения.ПользовательSMTP = УчетнаяЗаписьПочта.АдресЭлектроннойПочты;
				Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(УчетнаяЗаписьПочта, "Пароль, ПарольSMTP");
				
				ПрофильПодключения.ПарольSMTP = Пароли.Пароль;
				
				
				//Создаем объект ИнтернетПочта
				Почта = Новый ИнтернетПочта;
				
				//Пытаемся подключится к серверу используя наши настройки.
				Попытка
					Почта.Подключиться(ПрофильПодключения);
				Исключение
					Сообщить("Не удалось подключиться к серверу smtp");
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
				//Определяемся с текстом письма
				Тело="Добрый день!
				|Получен новый интернет-заказ:
				|
				|"+Комментарий+" Сумма заказа: "+СуммаИтого;
				
				//Создаем сообщение
				Письмо = Новый ИнтернетПочтовоеСообщение;
				
				//Добавляем наш текст в письмо
				Письмо.Тексты.Добавить(Тело);
				
				//Добавляем тему
				Письмо.Тема = "Новый интернет-заказ";
				
				////Добавляем ту же почту, через которую подключаемся к серверу

				Письмо.Отправитель = "seedgatovo@msso.by";
				
				//Добавляем имя отправителя
				Письмо.ИмяОтправителя = "Новый интернет-заказ";
				
				////Добавляем получателя
				ЕmailМенеджера = "";
				                                
				Попытка
					ЕmailМенеджера = ""+СокрЛП(Партнер.ОсновнойМенеджер.ФизическоеЛицо.КонтактнаяИнформация[0].Представление);
				Исключение
					//ОписаниеОшибки()
				КонецПопытки; 
				
				Письмо.Получатели.Добавить(ЕmailМенеджера);
				
				Попытка
					Почта.Послать(Письмо);
				Исключение
					Сообщить("Не удалось отправить письмо ");
					Сообщить(ОписаниеОшибки());
				КонецПопытки;	
				
				//Обязательно отключаемся от почтового сервера по завершении отправки письма.	
				Почта.Отключиться();
	Исключение
		//пишем в телеграм ошибку
		Ошибка = ОписаниеОшибки();
		Команда1 = "C:\cURL\curl.exe https://api.telegram.org/bot977867589:AAF0xKkESIU4XcTzIJF3DsFVfnGExEACK3Y/sendMessage?chat_id=-338090218=&text=""*ОШИБКА ПРИ СОЗДАНИИ ИНТЕРНЕТ ЗАКАЗОВ ОПТА* %0A " + Ошибка + " ""&parse_mode=Markdown";  
		Shell = Новый COMОбъект("WScript.Shell");
		WshExec = Shell.Exec(Команда1);
		OutStream = WshExec.StdOut;

	КонецПопытки;
			
КонецПроцедуры
///
&НаСервере
Процедура КомандаОбработатьДанныеНаСервереРозница(ПрочитанныйФайл)
	
	Попытка
		Если ПрочитанныйФайл.КоличествоСтрок() > 3 Тогда
			
			Разделитель = ";";
			
			ДанныеЗаказа = ПрочитанныйФайл.ПолучитьСтроку(1);
			СтрокаДанныеЗаказа = СтрРазделить(ПрочитанныйФайл.ПолучитьСтроку(1),Разделитель);	
			Клиент = СтрокаДанныеЗаказа[1 -1];
			Телефон = СтрокаДанныеЗаказа[2 -1];
			ЭлПочта = СтрокаДанныеЗаказа[3 -1];
			Комментарий = СтрокаДанныеЗаказа[4 -1];
			
			СтрокаЗаказ = СтрРазделить(ПрочитанныйФайл.ПолучитьСтроку(2),Разделитель);
			
			ПризнакДоставки = СтрокаЗаказ[2 -1];
			ПризнакДоставки = Число(СтрЗаменить(ПризнакДоставки, "Признак доставки:", ""));
			//1 - самовывоз
			//2 - доставка
			СтрокаМагазинАдресДоставки = СтрокаЗаказ[3 -1];
			
			Если ПризнакДоставки = 1 Тогда		
				СтрокаМагазин = СтрЗаменить(СтрокаМагазинАдресДоставки, "Адрес\Магазин:", "");
			Иначе	
				АдресДоставки = СтрЗаменить(СтрокаМагазинАдресДоставки, "Адрес\Магазин:", "");	
			КонецЕсли; 
			
			///Если магазин не выбран на сайте - выбираем склад магазин 5
			//Если СтрокаМагазин = "" Тогда
			
			СтрокаМагазин = "170";	
			
			//КонецЕсли; 
			
			
			ВидОплаты = СтрокаЗаказ[4 -1];
			ВидОплаты  = Число(СтрЗаменить(ВидОплаты, "Вид оплаты:", ""));
			//1 - наличные
			//2 - бан.карта
			//3 - ЕРИП
			//4 - Инт.Оплата
			//5 - Безнал(юр.лица)
			//6 - Наложенный платеж
			
			//Пока СтрДлина(КодКлиента) <> 8 Цикл
			//	КодКлиента = "0" + КодКлиента;
			//КонецЦикла; 
			//КодКлиента = "00-" + КодКлиента;
			
			ПромоКод = СтрЗаменить(СтрокаЗаказ[5-1],Символы.ПС,"");
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Склады.Ссылка КАК Ссылка,
			|	Склады.ТипСклада КАК ТипСклада,
			|	Склады.УчетныйВидЦены КАК УчетныйВидЦены,
			|	Склады.РозничныйВидЦены КАК РозничныйВидЦены
			|ИЗ
			|	Справочник.Склады КАК Склады
			|ГДЕ
			|	Склады.СВ_КодМагазин = &СВ_КодМагазин";
			
			Запрос.УстановитьПараметр("СВ_КодМагазин", СтрокаМагазин);
			
			РезЗпр = Запрос.Выполнить().Выбрать();
			
			Пока РезЗпр.Следующий() Цикл	
				Склад = РезЗпр.Ссылка;
				ВидЦены = РезЗпр.РозничныйВидЦены;	
			КонецЦикла;
			
			
			//Проверить и Создать Клиента
			
			
			ЕстьКлиент = ЛОЖЬ;
			ЕстьКлиент = ПроверитьСозданногоКлиента(ЭлПочта);
			
			Если ЕстьКлиент = ЛОЖЬ Тогда
				
				ПартнерыФизЛица = Справочники.Партнеры.СоздатьЭлемент();
				ПартнерыФизЛица.ЮрФизЛицо =Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
				ПартнерыФизЛица.Наименование = Клиент;
				ПартнерыФизЛица.НаименованиеПолное = Клиент;
				ПартнерыФизЛица.Клиент = Истина;
				ПартнерыФизЛица.ВидПартнераКонтрагента = Справочники.ВидПартнераКонтрагента.НайтиПоНаименованию("Розница");
				ПартнерыФизЛица.СогласиеКлиентаНаПолучениеРассылки = ИСТИНА;
				ПартнерыФизЛица.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять;
				ПартнерыФизЛица.ОсновнойМенеджер = Справочники.Пользователи.НайтиПоНаименованию("Самусевич Максим");
				ПартнерыФизЛица.ИнтернетРозница = Истина;
				
				ПартнерыКонтакты1 = ПартнерыФизЛица.КонтактнаяИнформация.Добавить();
				ПартнерыКонтакты1.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				ПартнерыКонтакты1.АдресЭП = ЭлПочта;
				ПартнерыКонтакты1.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
				ПартнерыКонтакты1.Представление = ПартнерыКонтакты1.АдресЭП;
				Попытка
					АдресЭПСтрока = СтрРазделить(ЭлПочта,"@");
					ПартнерыКонтакты1.ДоменноеИмяСервера = АдресЭПСтрока[1];
				Исключение
					
				КонецПопытки;
				
				
				ПартнерыКонтакты2 = ПартнерыФизЛица.КонтактнаяИнформация.Добавить();
				ПартнерыКонтакты2.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				ПартнерыКонтакты2.НомерТелефона = Телефон;
				ПартнерыКонтакты2.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
				ПартнерыКонтакты2.Представление = ПартнерыКонтакты2.НомерТелефона;
				ПартнерыКонтакты2.НомерТелефонаБезКодов =  ПартнерыКонтакты2.НомерТелефона;
				
				ПартнерыФизЛица.Записать();
				
				
				
				ФизЛица = Справочники.Контрагенты.СоздатьЭлемент();
				ФизЛица.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
				ФизЛица.Наименование = Клиент;
				ФизЛица.НаименованиеПолное = Клиент;
				ФизЛица.СтранаРегистрации = Справочники.СтраныМира.Беларусь;
				ФизЛица.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
				
				Контакты1 = ФизЛица.КонтактнаяИнформация.Добавить();
				Контакты1.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				Контакты1.АдресЭП = ЭлПочта;
				Контакты1.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
				Контакты1.Представление = Контакты1.АдресЭП;
				
				Попытка
					АдресЭПСтрока = СтрРазделить(ЭлПочта,"@");
					Контакты1.ДоменноеИмяСервера = АдресЭПСтрока[1];
				Исключение
					
				КонецПопытки;
				
				
				Контакты2 = ФизЛица.КонтактнаяИнформация.Добавить();
				Контакты2.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				Контакты2.НомерТелефона = Телефон;
				Контакты2.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				Контакты2.Представление = Контакты2.НомерТелефона;
				Контакты2.НомерТелефонаБезКодов =  Контакты2.НомерТелефона;
				
				ФизЛица.Партнер = ПартнерыФизЛица.Ссылка;
				
				ФизЛица.Записать();
				
				
			КонецЕсли; 
			
			
			
			
			
			//СоздатьЗаказ
			ЗаказНомер = СтрокаЗаказ[1 -1];
			
			Заказ = Документы.ИнтернетЗаказРозничный.СоздатьДокумент();
			
			
			Заказ.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","600052664");
			Заказ.Дата = ТекущаяДата();
			//Заказ.ЗаказТребуетВниманияМенеджера = Истина;
			Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
			Заказ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний",Истина);
			//Заказ.Склад = Склад.Родитель;
			Заказ.Склад = Склад;
			Заказ.ПромоКод = ПромоКод;
			
			Заказ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
			//Заказ.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ-00000002");
			Заказ.Партнер = Справочники.Партнеры.НайтиПоКоду("УТ-00000002");
			Заказ.ОсновнойМенеджер = Заказ.Партнер.ОсновнойМенеджер;
			Заказ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			
			Если ПризнакДоставки = 2 Тогда		
				//Заказ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика;
				Заказ.АдресДоставки = АдресДоставки;		
			ИначеЕсли ПризнакДоставки = 1 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
			ИначеЕсли ПризнакДоставки = 3 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.Почта;
				Заказ.АдресДоставки = АдресДоставки;
			ИначеЕсли ПризнакДоставки = 4 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.Европочта; //ЕвроПочта Отделение
				Заказ.АдресДоставки = АдресДоставки;
			ИначеЕсли ПризнакДоставки = 5 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.ЕвропочтаДоКлиента; //Европочта до двери
				Заказ.АдресДоставки = АдресДоставки;
				
			КонецЕсли; 
			
			Если ВидОплаты = 1 Тогда  //Наличные
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.Наличная;
			ИначеЕсли ВидОплаты = 2 Тогда  //Банк.карта
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта;
			ИначеЕсли ВидОплаты = 3 Тогда    //ЕРИП
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.ЕРИП;
			ИначеЕсли ВидОплаты = 4 Тогда    //ИнтЭквайринг
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.ИнтернетОплата;
			ИначеЕсли ВидОплаты = 5 Тогда    //Безнал       
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная;
			ИначеЕсли ВидОплаты = 6 Тогда    //Наложенный платеж       
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.НаложенныйПлатеж;
			КонецЕсли;	
			
			Заказ.Клиент = Клиент;
			Заказ.Телефон = Телефон;
			Заказ.ЭлПочта = ЭлПочта;
			Заказ.ИнтЗаказНомер = ЗаказНомер;
			Заказ.Комментарий = Комментарий;
			Заказ.Валюта = Справочники.Валюты.НайтиПоНаименованию("BYN",ИСТИНА);
			Заказ.ИнтернетЗаказ = Истина;
			//Заказ.НомерИнтернетЗаказа = ЗаказНомер;
			
			Заказ.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Интернет-магазин", ИСТИНА);
			
			
			
			ИтогоЗаказСумма = 0;
			
			Для НомерСтроки=3 по ПрочитанныйФайл.КоличествоСтрок() Цикл
				
				Строка = ПрочитанныйФайл.ПолучитьСтроку(НомерСтроки);
				
				Если Найти(Строка, "Итого ") > 0 Тогда
					
					Прервать;
					
				КонецЕсли; 
				
				
				МассивКол = СтрРазделить(Строка,Разделитель);
				
				КодТовара = МассивКол[2-1];
				Наименование =  МассивКол[4-1]; 
				КолВо = МассивКол[5-1];
				ЦенаСайта = МассивКол[6-1];
				ЦенаСайтаСоСкидкой = МассивКол[7-1];
				Сумма = МассивКол[8-1];
				Упак = МассивКол[9-1];
				
				
				
				Пока СтрДлина(КодТовара) <> 8 Цикл
					КодТовара = "0" + КодТовара;
				КонецЦикла; 
				КодТовара = "00-" + КодТовара;
				
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
				
				//Таблица Заказ
				ТабЗаказ = Заказ.Заказ.Добавить();
				ТабЗаказ.Номенклатура = Номенклатура;
				ТабЗаказ.Упаковка = Номенклатура.ЕдиницаИзмерения;
				
				Если Упак = "упак" Тогда
					Если Номенклатура.КоэффициентЕдиницыДляОтчетов > 1 Тогда
						КолВо = Окр(КолВо * Номенклатура.КоэффициентЕдиницыДляОтчетов,2);
						ЦенаСайта = Окр(ЦенаСайта / Номенклатура.КоэффициентЕдиницыДляОтчетов,2);
					КонецЕсли; 
				КонецЕсли; 
				
				ТабЗаказ.Количество = Число(КолВо);
				ТабЗаказ.КоличествоУпаковок = Число(КолВо);
				ТабЗаказ.Цена = ПолучитьЦенуРозница(Номенклатура);
				ТабЗаказ.ЦенаСоСкидкой = ЦенаСайтаСоСкидкой; 
				ТабЗаказ.Сумма = ТабЗаказ.Количество * ТабЗаказ.ЦенаСоСкидкой;
				
				ИтогоЗаказСумма = ИтогоЗаказСумма + Сумма;
				//Таблица Товары
				
				ОстаткиПоСериям = СВ_ПолучениеДанныхСервер.ПолучитьОстаткиПоСериям( ТекущаяДата(),  ТекущаяДата(), Склад, Номенклатура);
				
				КолВоТовар = Число(КолВо);
				
				Для Каждого стрСерия Из ОстаткиПоСериям Цикл
					СерияКолво = стрСерия.Остаток;	
					
					Если СерияКолво = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Пока КолВоТовар > 0 Цикл
						
						ТабТовар = Заказ.Товары.Добавить();
						ТабТовар.Номенклатура = Номенклатура;
						ТабТовар.Упаковка = Номенклатура.ЕдиницаИзмерения;
						ТабТовар.Цена = ПолучитьЦенуРозница(Номенклатура);
						ТабТовар.ЦенаСоСкидкой = ТабЗаказ.ЦенаСоСкидкой; 
						ТабТовар.СтатусУказанияСерий = 14;
						ТабТовар.Склад = ПолучитьСклад(Номенклатура);
						ТабТовар.ДатаОтгрузки = НачалоДня(ТекущаяДата()); 
						ТабТовар.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						
						
						Если КолВоТовар >= стрСерия.Остаток Тогда
							ТекКолво = стрСерия.Остаток;
							КолвоТовар = КолвоТовар - ТекКолво;
						Иначе
							ТекКолво = КолвоТовар;
							КолвоТовар = КолвоТовар - ТекКолво;
						КонецЕсли; 
						
						ТабТовар.Количество = ТекКолво;
						ТабТовар.КоличествоУпаковок = ТекКолво;
						ТабТовар.Сумма = ТекКолво * ТабТовар.ЦенаСоСкидкой;
						ТабТовар.Серия = стрСерия.Серия;
						
						
						ОстатокРозничный = 0;
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
						|	СвободныеОстаткиОстатки.Склад КАК Склад,
						|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
						|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК
						|ИЗ
						|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
						|ГДЕ
						|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
						|	И СвободныеОстаткиОстатки.Склад = &Склад";
						//|	И ТоварыНаСкладахОстатки.Серия = &Серия
						
						Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
						Запрос.УстановитьПараметр("Период", ТекущаяДата());
						//Запрос.УстановитьПараметр("Серия", Строка.Серия);
						Запрос.УстановитьПараметр("Склад", Склад);
						
						
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							ОстатокРозничный = ВыборкаДетальныеЗаписи.ОСТАТОК;
						КонецЦикла;
						
						ТабТовар.Остаток_Розница = ОстатокРозничный;
						
						
						
						СерияКолво = СерияКолво - ТекКолво;	  									  
						
						Если СерияКолво = 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если КолвоТовар = 0 Тогда
						Прервать;
					КонецЕсли;						
				КонецЦикла;
				
				//ПодОбеспечение
				ПланируемаяДатаДоставки = Дата(1,1,1);
				
				Если КолвоТовар > 0 Тогда
					////Маг5				
					//СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
					/////1.Проверяем остатки товара на складе
					//Запрос0 = Новый Запрос;
					//Запрос0.Текст =
					//"ВЫБРАТЬ
					//|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
					//|	СвободныеОстаткиОстатки.Склад КАК Склад,
					//|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
					//|	СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ВРезервеСоСкладаОстаток,
					//|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК
					//|ИЗ
					//|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
					//|ГДЕ
					//|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
					//|	И СвободныеОстаткиОстатки.Склад = &СкладМаг5"; 
					//
					//Запрос0.УстановитьПараметр("Номенклатура", Номенклатура);
					//Запрос0.УстановитьПараметр("Период", ТекущаяДата());
					//Запрос0.УстановитьПараметр("СкладМаг5", Справочники.Склады.НайтиПоНаименованию("Магазин N 5",ИСТИНА));
					//
					//РезЗпр0 = Запрос0.Выполнить().Выгрузить();
					//
					//Если РезЗпр0.Количество() > 0 Тогда
					//	
					//	СкладОбеспечения = РезЗпр0[0].Склад;
					//	ТоварМаг5 = 0;
					//	Если РезЗпр0[0].ОСТАТОК >= КолвоТовар  Тогда
					//		ТоварМаг5 = КолвоТовар;
					//	Иначе	
					//		ТоварМаг5 = РезЗпр0[0].ОСТАТОК;
					//	КонецЕсли; 
					//	
					//	Товар = Заказ.ТоварыПодОбеспечение.Добавить();
					//	
					//	Товар.Номенклатура = Номенклатура;
					//	Товар.Упаковка = Номенклатура.ЕдиницаИзмерения;
					//	
					//	Товар.Количество = ТоварМаг5;
					//	Товар.КоличествоУпаковок = ТоварМаг5;
					//	
					//	Товар.ПланируемаяДатаДоставки = ПланируемаяДатаДоставки;
					//	
					//	Товар.Склад = СкладОбеспечения; 
					//	
					//	
					//	Запрос = Новый Запрос;
					//	Запрос.Текст = 
					//	"ВЫБРАТЬ
					//	|  ЦеныНоменклатурыСрезПоследних.Период,
					//	|  ЦеныНоменклатурыСрезПоследних.Номенклатура,
					//	|  ЦеныНоменклатурыСрезПоследних.ВидЦены,
					//	|  ЦеныНоменклатурыСрезПоследних.Валюта,
					//	|  ЦеныНоменклатурыСрезПоследних.Цена
					//	|ИЗ
					//	|  РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
					//	|ГДЕ
					//	|  ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
					//	|  И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
					//	
					//	
					//	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
					//	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
					//	Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
					//	
					//	РезультатЗапроса = Запрос.Выполнить();
					//	
					//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					//	
					//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					//		Товар.РозничнаяЦена = ВыборкаДетальныеЗаписи.Цена;
					//		Товар.Цена = Товар.РозничнаяЦена;
					//		Товар.ЦенаСоСкидкой = Товар.РозничнаяЦена;
					//	КонецЦикла;
					//	
					//	Товар.РозничнаяЦена = ЦенаСайта;
					//	Товар.Сумма = Товар.РозничнаяЦена * Товар.КоличествоУпаковок; 
					//	
					//	КолвоТовар = КолвоТовар - ТоварМаг5;
					//КонецЕсли;	
					
					//ИначеЕсли КолвоТовар > 0 Тогда
					
					СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
					///1.Проверяем остатки товара на складе
					Запрос1 = Новый Запрос;
					Запрос1.Текст =
					"ВЫБРАТЬ
					|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
					|	СвободныеОстаткиОстатки.Склад КАК Склад,
					|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
					|	СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ВРезервеСоСкладаОстаток,
					|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК
					|ИЗ
					|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
					|ГДЕ
					|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
					|	И (СвободныеОстаткиОстатки.Склад = &Склад3
					|			ИЛИ СвободныеОстаткиОстатки.Склад = &Склад5)
					|	И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток >= &КолВоОстаток"; 
					
					Запрос1.УстановитьПараметр("Номенклатура", Номенклатура);
					Запрос1.УстановитьПараметр("Период", ТекущаяДата());
					Запрос1.УстановитьПараметр("Склад3", Справочники.Склады.НайтиПоНаименованию("склад N 3 Готовой продукции",ИСТИНА));
					Запрос1.УстановитьПараметр("Склад5", Справочники.Склады.НайтиПоНаименованию("склад N 5 Лукохранилище",ИСТИНА));
					Запрос1.УстановитьПараметр("КолВоОстаток", КолвоТовар);
					
					
					РезЗпр1 = Запрос1.Выполнить().Выгрузить();
					ТЗОстатки = Новый ТаблицаЗначений;
					Если РезЗпр1.Количество() > 0 Тогда
						СкладОбеспечения = РезЗпр1[0].Склад;
						ТЗОстатки = РезЗпр1;
						
					Иначе
						/////2. Проверяем остатки на магазинах
						//Маг5
						Запрос2 = Новый Запрос;
						ТекстЗапроса2 =
						"ВЫБРАТЬ
						|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
						|	СвободныеОстаткиОстатки.Склад КАК Склад,
						|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК,
						|	ГрафикДоставкиТоваров.Понедельник КАК Понедельник,
						|	ГрафикДоставкиТоваров.Вторник КАК Вторник,
						|	ГрафикДоставкиТоваров.Среда КАК Среда,
						|	ГрафикДоставкиТоваров.Четверг КАК Четверг,
						|	ГрафикДоставкиТоваров.Пятница КАК Пятница,
						|	ГрафикДоставкиТоваров.Суббота КАК Суббота,
						|	ГрафикДоставкиТоваров.Воскресение КАК Воскресение
						|ИЗ
						|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикДоставкиТоваров КАК ГрафикДоставкиТоваров
						|		ПО СвободныеОстаткиОстатки.Склад = ГрафикДоставкиТоваров.Склад
						|ГДЕ
						|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
						////|	И СвободныеОстаткиОстатки.Склад.ТипСклада = &ТипСклада
						////|	И СвободныеОстаткиОстатки.Склад.ГородПогода = &ГородПогода
						|   И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток >= &КолВоОстаток
						//|   И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток > 0
						////|	И СвободныеОстаткиОстатки.Склад <> &Склад";         //210122 если на складе нет ищем на маг5, чуть что убрать //// коментарии
						|	И СвободныеОстаткиОстатки.Склад = &Маг5"; 
						
						Запрос2.УстановитьПараметр("Номенклатура", Номенклатура);
						Запрос2.УстановитьПараметр("Период", ТекущаяДата());
						Запрос2.УстановитьПараметр("КолВоОстаток", КолвоТовар);
						Запрос2.УстановитьПараметр("Маг5",Справочники.Склады.НайтиПоНаименованию("Магазин N 5",ИСТИНА));
						
						Запрос2.Текст = ТекстЗапроса2;
						РезЗпр2 = Запрос2.Выполнить().Выгрузить();
						
						Если РезЗпр2.Количество() > 0 Тогда
							
							ТЗОстатки = РезЗпр2;
						Иначе
						//	
						//	///Эти группы не обрабатываем на остатки по всем магазинам
						//									
						//		//Все магазины
						//		Запрос2 = Новый Запрос;
						//		ТекстЗапроса =
						//		"ВЫБРАТЬ
						//		|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
						//		|	СвободныеОстаткиОстатки.Склад КАК Склад,
						//		|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК,
						//		|	ГрафикДоставкиТоваров.Понедельник КАК Понедельник,
						//		|	ГрафикДоставкиТоваров.Вторник КАК Вторник,
						//		|	ГрафикДоставкиТоваров.Среда КАК Среда,
						//		|	ГрафикДоставкиТоваров.Четверг КАК Четверг,
						//		|	ГрафикДоставкиТоваров.Пятница КАК Пятница,
						//		|	ГрафикДоставкиТоваров.Суббота КАК Суббота,
						//		|	ГрафикДоставкиТоваров.Воскресение КАК Воскресение
						//		|ИЗ
						//		|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
						//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикДоставкиТоваров КАК ГрафикДоставкиТоваров
						//		|		ПО СвободныеОстаткиОстатки.Склад = ГрафикДоставкиТоваров.Склад
						//		|ГДЕ
						//		|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
						//		|	И СвободныеОстаткиОстатки.Склад.ТипСклада = &ТипСклада
						//		|	И СвободныеОстаткиОстатки.Склад.ГородПогода = &ГородПогода
						//		//|   И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток >= &КолВоОстаток
						//		|   И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток > 0
						//		|	И СвободныеОстаткиОстатки.Склад <> &Склад";         //210122 если на складе нет ищем на маг5, чуть что убрать //// коментарии
						//		
						//		ТекстЗапросаВсеМАГ = ТекстЗапроса;
						//		
						//		ДеньНомер = ДеньНедели(ТекущаяДата());
						//		Если ДеньНомер = 1 и ЧАС(ТекущаяДата()) <= 11  Тогда
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И (ГрафикДоставкиТоваров.Понедельник = ИСТИНА
						//			|ИЛИ ГрафикДоставкиТоваров.Вторник = ИСТИНА)";
						//			
						//		ИначеЕсли ДеньНомер = 1 и ЧАС(ТекущаяДата()) >= 11  Тогда	
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И ГрафикДоставкиТоваров.Вторник = ИСТИНА";
						//			
						//		ИначеЕсли ДеньНомер = 2 и ЧАС(ТекущаяДата()) <= 11  Тогда
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И (ГрафикДоставкиТоваров.Вторник = ИСТИНА
						//			|ИЛИ ГрафикДоставкиТоваров.Среда = ИСТИНА)";
						//			
						//		ИначеЕсли ДеньНомер = 2 и ЧАС(ТекущаяДата()) >= 11  Тогда	
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И ГрафикДоставкиТоваров.Среда = ИСТИНА";
						//			
						//		ИначеЕсли ДеньНомер = 3 и ЧАС(ТекущаяДата()) <= 11  Тогда
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И (ГрафикДоставкиТоваров.Среда = ИСТИНА
						//			|ИЛИ ГрафикДоставкиТоваров.Четверг = ИСТИНА)";
						//			
						//		ИначеЕсли ДеньНомер = 3 и ЧАС(ТекущаяДата()) >= 11  Тогда	
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И ГрафикДоставкиТоваров.Четверг = ИСТИНА";
						//			
						//		ИначеЕсли ДеньНомер = 4 и ЧАС(ТекущаяДата()) <= 11  Тогда
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И (ГрафикДоставкиТоваров.Четверг = ИСТИНА
						//			|ИЛИ ГрафикДоставкиТоваров.Пятница = ИСТИНА)";
						//			
						//		ИначеЕсли ДеньНомер = 4 и ЧАС(ТекущаяДата()) >= 11  Тогда	
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И ГрафикДоставкиТоваров.Пятница = ИСТИНА";
						//			
						//		ИначеЕсли ДеньНомер = 5 ИЛИ ДеньНомер = 6 ИЛИ ДеньНомер = 7  Тогда
						//			ТекстЗапроса = ТекстЗапроса + "
						//			|И ГрафикДоставкиТоваров.Понедельник = ИСТИНА";
						//			
						//		КонецЕсли; 
						//		
						//		Запрос2.УстановитьПараметр("Номенклатура", Номенклатура);
						//		Запрос2.УстановитьПараметр("Период", ТекущаяДата());
						//		Запрос2.УстановитьПараметр("ТипСклада", Перечисления.ТипыСкладов.РозничныйМагазин);
						//		Запрос2.УстановитьПараметр("ГородПогода", Справочники.ПогодаГорода.НайтиПоКоду("1"));  //Минск
						//		Запрос2.УстановитьПараметр("КолВоОстаток", КолвоТовар);
						//		Запрос2.УстановитьПараметр("Склад", Склад);
						//		
						//		
						//		Запрос2.Текст = ТекстЗапроса;
						//		РезЗпр2 = Запрос2.Выполнить().Выгрузить();
						//		РезЗпр2.Сортировать("ОСТАТОК УБЫВ");
						//		
						//		Если РезЗпр2.Количество() > 0 Тогда
						//			//СкладОбеспечения = РезЗпр2[0].Склад;				
						//			ТЗОстатки = РезЗпр2;
						//			
						//		Иначе
						//			Запрос2.Текст = ТекстЗапросаВсеМАГ;
						//			РезЗпр2 = Запрос2.Выполнить().Выгрузить();
						//			РезЗпр2.Сортировать("ОСТАТОК УБЫВ");
						//			Если РезЗпр2.Количество() > 0 Тогда
						//				//СкладОбеспечения = РезЗпр2[0].Склад;
						//				ТЗОстатки = РезЗпр2;
						//			Иначе
						//				СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
						//				//Продолжить;			
						//			КонецЕсли;
						//		КонецЕсли;
							КонецЕсли; 
					КонецЕсли;
					Если ТЗОстатки <> Неопределено Тогда	
						Если ТЗОстатки.Количество()>0 Тогда
							
							Для каждого стрОстатки Из ТЗОстатки Цикл
								СкладОбеспечения = стрОстатки.Склад;
								ОстатокКолво = стрОстатки.ОСТАТОК;
								
								Пока КолвоТовар > 0 Цикл
									
									Если КолВоТовар >= ОстатокКолво Тогда
										ТекКолво = ОстатокКолво;
										КолвоТовар = КолвоТовар - ТекКолво;
									Иначе
										ТекКолво = КолвоТовар;
										КолвоТовар = КолвоТовар - ТекКолво;
									КонецЕсли; 
									
									
									
									ТЗДниДоставки = Новый  ТаблицаЗначений;
									ТЗДниДоставки.Колонки.Добавить("ДеньДоставки");
									//Если РезЗпр2.Количество() > 0  Тогда
									Если СкладОбеспечения = Справочники.Склады.НайтиПоНаименованию("Магазин N 5",ИСТИНА) Тогда							
										ПланируемаяДатаДоставки = Дата(1,1,1);	
									ИначеЕсли РезЗпр2 <> Неопределено И РезЗпр2.Количество() > 0  И СкладОбеспечения <>  Справочники.Склады.ПустаяСсылка() Тогда
										Если РезЗпр2[0].Понедельник = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 1;
										КонецЕсли;
										
										Если РезЗпр2[0].Вторник = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 2;
										КонецЕсли;
										
										Если РезЗпр2[0].Среда = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 3;
										КонецЕсли;
										
										Если РезЗпр2[0].Четверг = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 4;
										КонецЕсли;
										
										Если РезЗпр2[0].Пятница = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 5;
										КонецЕсли;
										
										Если РезЗпр2[0].Суббота = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 6;
										КонецЕсли;
										
										Если РезЗпр2[0].Воскресение = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 7;
										КонецЕсли;
										
										ТЗДниДоставки.Сортировать("ДеньДоставки Возр");
										СамоеБольшое = ТЗДниДоставки[ТЗДниДоставки.Количество()-1].ДеньДоставки;
										Отношение = ДеньНедели(ТекущаяДата()) / СамоеБольшое;
										Если Отношение >= 1  Тогда
											НачалоПоиска = 0;
										Иначе	
											НачалоПоиска = Цел(ТЗДниДоставки.Количество() * Отношение);
										КонецЕсли; 
										
										Если ТЗДниДоставки.Количество() = 1 Тогда
											НачалоПоиска = 0;
										КонецЕсли; 
										
										
										ПланируемаяДатаДоставки = Дата(1,1,1);
										Если ДеньНедели(ТекущаяДата()) < ТЗДниДоставки[НачалоПоиска].ДеньДоставки  Тогда
											ПланируемаяДатаДоставки = ТекущаяДата() + 86400 * (ТЗДниДоставки[НачалоПоиска].ДеньДоставки - ДеньНедели(ТекущаяДата())+1);
										ИначеЕсли ДеньНедели(ТекущаяДата()) > ТЗДниДоставки[НачалоПоиска].ДеньДоставки Тогда
											ПланируемаяДатаДоставки = ТекущаяДата() + 86400* (ТЗДниДоставки[НачалоПоиска].ДеньДоставки + 7 - ДеньНедели(ТекущаяДата())+1);
										Иначе
											ПланируемаяДатаДоставки = ТекущаяДата() + 86400* 7;
										КонецЕсли;
									Иначе
										ПланируемаяДатаДоставки = Дата(1,1,1);
									КонецЕсли;
									
									//КонецЕсли; 
									
									
									Товар = Заказ.ТоварыПодОбеспечение.Добавить();
									
									Товар.Номенклатура = Номенклатура;
									Товар.Упаковка = Номенклатура.ЕдиницаИзмерения;
									
									Товар.Количество = ТекКолво;
									Товар.КоличествоУпаковок = ТекКолво;
									
									
									//Товар.Цена = ЦенаТовар;
									Товар.ПланируемаяДатаДоставки = ПланируемаяДатаДоставки;
									
									Товар.Склад = СкладОбеспечения; 
									
									
									Запрос = Новый Запрос;
									Запрос.Текст = 
									"ВЫБРАТЬ
									|  ЦеныНоменклатурыСрезПоследних.Период,
									|  ЦеныНоменклатурыСрезПоследних.Номенклатура,
									|  ЦеныНоменклатурыСрезПоследних.ВидЦены,
									|  ЦеныНоменклатурыСрезПоследних.Валюта,
									|  ЦеныНоменклатурыСрезПоследних.Цена
									|ИЗ
									|  РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
									|ГДЕ
									|  ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
									|  И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
									
									
									Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
									Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
									Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
									
									РезультатЗапроса = Запрос.Выполнить();
									
									ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
									
									Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
										Товар.РозничнаяЦена = ВыборкаДетальныеЗаписи.Цена;
										Товар.Цена = Товар.РозничнаяЦена;
										Товар.ЦенаСоСкидкой = ЦенаСайтаСоСкидкой;
									КонецЦикла;
									
									Товар.РозничнаяЦена = ЦенаСайта;
									Товар.Сумма = Товар.ЦенаСоСкидкой * Товар.КоличествоУпаковок; 
									
									
									ОстатокКолво = ОстатокКолво - ТекКолво;
									
									Если ОстатокКолво = 0 Тогда
										Прервать;
									КонецЕсли;
								КонецЦикла;
								
								Если КолвоТовар = 0 Тогда
									Прервать;
								КонецЕсли;	
								//
							КонецЦикла; 	
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				Если КолВоТовар > 0  Тогда
					СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
					Товар = Заказ.ТоварыПодОбеспечение.Добавить();
					
					Товар.Номенклатура = Номенклатура;
					Товар.Упаковка = Номенклатура.ЕдиницаИзмерения;
					Товар.Количество = КолвоТовар;
					Товар.КоличествоУпаковок = КолвоТовар;
					
					Товар.ПланируемаяДатаДоставки = Дата(1,1,1);
					
					Товар.Склад = СкладОбеспечения; 
					
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|  ЦеныНоменклатурыСрезПоследних.Период,
					|  ЦеныНоменклатурыСрезПоследних.Номенклатура,
					|  ЦеныНоменклатурыСрезПоследних.ВидЦены,
					|  ЦеныНоменклатурыСрезПоследних.Валюта,
					|  ЦеныНоменклатурыСрезПоследних.Цена
					|ИЗ
					|  РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
					|ГДЕ
					|  ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
					|  И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
					
					
					Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
					Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
					Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Товар.РозничнаяЦена = ВыборкаДетальныеЗаписи.Цена;
						Товар.Цена = Товар.РозничнаяЦена;
						Товар.ЦенаСоСкидкой = Товар.РозничнаяЦена;
					КонецЦикла;
					
					Товар.РозничнаяЦена = ЦенаСайта;
					Товар.Сумма = Товар.РозничнаяЦена * Товар.КоличествоУпаковок; 
				КонецЕсли; 
			КонецЦикла;
			//Заказ.Товары.Сортировать("Номенклатура");
			//Заказ.Заказ.Сортировать("Номенклатура");
			//Заказ.ТоварыПодОбеспечение.Сортировать("Номенклатура");
			
			ТЧ_Товары = Заказ.Товары.Выгрузить();
			ТЧ_Товары.Колонки.Добавить("Группа");
			Для каждого стрТЧ Из ТЧ_Товары Цикл
				стрТЧ.Группа = стрТЧ.Номенклатура.Родитель.Наименование;
			КонецЦикла; 
			ТЧ_Товары.Сортировать("Группа, Номенклатура");
			
			Заказ.Товары.Загрузить(ТЧ_Товары);
			
			
			ТЧ_ТоварыПодОбеспечение = Заказ.ТоварыПодОбеспечение.Выгрузить();
			ТЧ_ТоварыПодОбеспечение.Колонки.Добавить("Группа");
			Для каждого стрТЧ Из ТЧ_ТоварыПодОбеспечение Цикл
				стрТЧ.Группа = стрТЧ.Номенклатура.Родитель.Наименование;
			КонецЦикла; 
			ТЧ_ТоварыПодОбеспечение.Сортировать("Группа, Номенклатура");
			
			Заказ.ТоварыПодОбеспечение.Загрузить(ТЧ_ТоварыПодОбеспечение);

			
			ТЧ_Заказ = Заказ.Заказ.Выгрузить();
			ТЧ_Заказ.Колонки.Добавить("Группа");
			Для каждого стрТЧ Из ТЧ_Заказ Цикл
				стрТЧ.Группа = стрТЧ.Номенклатура.Родитель.Наименование;
			КонецЦикла; 
			ТЧ_Заказ.Сортировать("Группа, Номенклатура");
			
			Заказ.Заказ.Загрузить(ТЧ_Заказ);

			
			Если ИтогоЗаказСумма < 20 Тогда	//Проверка на мининмальный зазак 	
				Возврат;
			Иначе
				Заказ.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			
		КонецЕсли;
		
	Исключение
		//пишем в телеграм ошибку
		Ошибка = ОписаниеОшибки();
		Команда1 = "C:\cURL\curl.exe https://api.telegram.org/bot977867589:AAF0xKkESIU4XcTzIJF3DsFVfnGExEACK3Y/sendMessage?chat_id=-338090218=&text=""*ОШИБКА ПРИ СОЗДАНИИ ИНТЕРНЕТ ЗАКАЗОВ РОЗНИЦА* %0A " + Ошибка + " ""&parse_mode=Markdown";  
		Shell = Новый COMОбъект("WScript.Shell");
		WshExec = Shell.Exec(Команда1);
		OutStream = WshExec.StdOut;
		
	КонецПопытки;
			
КонецПроцедуры
/// апи
&НаСервере
Процедура ПолучитьНеобработанныеЗаказыНаСайтеАПИ()
	
	
	//Соединение = Новый HTTPСоединение(
	//    "test.msso", // сервер (хост)
	//    80, // порт, по умолчанию для http используется 80, для https 443
	//    , // пользователь для доступа к серверу (если он есть)
	//    , // пароль для доступа к серверу (если он есть)
	//    , // здесь указывается прокси, если он есть
	//    , // таймаут в секундах, 0 или пусто - не устанавливать
	//   
	//);

	
	Соединение = Новый HTTPСоединение(
	    "www.msso.by", // сервер (хост)
	    443, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    , // таймаут в секундах, 0 или пусто - не устанавливать
	   Новый ЗащищенноеСоединениеOpenSSL()
	);

	ТОКЕН = "dFk9M6R2NwIKsfc8bCnjvHXt";
	
	ЗапросGET = Новый HTTPЗапрос("/api/item");
	ЗапросGET.Заголовки.Вставить("Content-type", "application/json");
	ЗапросGET.Заголовки.Вставить("X-API-KEY", ТОКЕН);
 
    Результат = Соединение.Получить(ЗапросGET);
	
	Если Результат.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();

		Если Ответ.Количество() > 0 Тогда
			
			Для каждого стрЗаказ Из Ответ Цикл
				ТекстПерваяСтрока = "";
				ТекстВтораяСтрока = "";
				ТекстТовары = "";
				Комментарий = "";
				ПромоКод = "";
				ПромоКодПроцент = 0;
				
				Комментарий = стрЗаказ.comment;
				Комментарий = СтрЗаменить(Комментарий,Символы.ПС,"");
				ТекстПерваяСтрока = стрЗаказ.field_one;
				ТекстВтораяСтрока = стрЗаказ.field_two;
				ТекстТовары = стрЗаказ.user_data;
				ТекстТовары = СтрЗаменить(ТекстТовары,Символы.Таб,"");
				ИДЗаказа = стрЗаказ.id;
				НомерДляОплаты = стрЗаказ.InvoiceNo;
				ПромоКод = стрЗаказ.promo;
				ПромоКодПроцент = стрЗаказ.promo_percent;
				
				Попытка
				    ПромоКодПроцент = Число(ПромоКодПроцент);
				Исключение
				    ПромоКодПроцент = 0;
				КонецПопытки;
				
				Если ЗначениеЗаполнено(ПромоКод) Тогда
				    Если ПромоКодПроцент > 0 Тогда				
						ПроверитьПромокод(ПромоКод,ПромоКодПроцент);				
					КонецЕсли; 			
				КонецЕсли; 
				
				КомандаОбработатьДанныеНаСервереРозницаАПИ(ТекстПерваяСтрока,ТекстВтораяСтрока,ТекстТовары,Комментарий,ИДЗаказа,НомерДляОплаты,ПромоКод);
				
			КонецЦикла; 
		КонецЕсли; 
	Иначе
		Сообщить("Ошибка соединения с сайтом "+ Результат.КодСостояния);
	КонецЕсли;		
		
КонецПроцедуры
/// апи опт
&НаСервере
Процедура ПолучитьНеобработанныеЗаказыНаСайтеАПИ_ОПТ()
	
	
	//Соединение = Новый HTTPСоединение(
	//    "test.msso", // сервер (хост)
	//    80, // порт, по умолчанию для http используется 80, для https 443
	//    , // пользователь для доступа к серверу (если он есть)
	//    , // пароль для доступа к серверу (если он есть)
	//    , // здесь указывается прокси, если он есть
	//    , // таймаут в секундах, 0 или пусто - не устанавливать
	//   
	//);

	
	Соединение = Новый HTTPСоединение(
	    "www.msso.by", // сервер (хост)
	    443, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    , // таймаут в секундах, 0 или пусто - не устанавливать
	   Новый ЗащищенноеСоединениеOpenSSL()
	);

	ТОКЕН = "dFk9M6R2NwIKsfc8bCnjvHXt";
	
	ЗапросGET = Новый HTTPЗапрос("/api/itemopt");
	ЗапросGET.Заголовки.Вставить("Content-type", "application/json");
	ЗапросGET.Заголовки.Вставить("X-API-KEY", ТОКЕН);
 
    Результат = Соединение.Получить(ЗапросGET);
	
	Если Результат.КодСостояния = 200 Тогда
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();

		Если Ответ.Количество() > 0 Тогда
			
			Для каждого стрЗаказ Из Ответ Цикл
				ТекстПерваяСтрока = "";
				ТекстВтораяСтрока = "";
				ТекстТовары = "";
				Комментарий = "";
				ПромоКод = "";
				ПромоКодПроцент = 0;
				
				Комментарий = стрЗаказ.comment;
				Комментарий = СтрЗаменить(Комментарий,Символы.ПС,"");
				ТекстПерваяСтрока = стрЗаказ.field_one;
				ТекстВтораяСтрока = стрЗаказ.field_two;
				ТекстТовары = стрЗаказ.user_data;
				ТекстТовары = СтрЗаменить(ТекстТовары,Символы.Таб,"");
				ИДЗаказа = стрЗаказ.id;
				//НомерДляОплаты = стрЗаказ.InvoiceNo;
				//ПромоКод = стрЗаказ.promo;
				//ПромоКодПроцент = стрЗаказ.promo_percent;
				//
				//Попытка
				//    ПромоКодПроцент = Число(ПромоКодПроцент);
				//Исключение
				//    ПромоКодПроцент = 0;
				//КонецПопытки;
				//
				//Если ЗначениеЗаполнено(ПромоКод) Тогда
				//    Если ПромоКодПроцент > 0 Тогда				
				//		ПроверитьПромокод(ПромоКод,ПромоКодПроцент);				
				//	КонецЕсли; 			
				//КонецЕсли; 
				
				КомандаОбработатьДанныеНаСервереАПИ_ОПТ(ТекстПерваяСтрока,ТекстВтораяСтрока,ТекстТовары,Комментарий,ИДЗаказа);
				
			КонецЦикла; 
		КонецЕсли; 
	Иначе
		Сообщить("Ошибка соединения с сайтом "+ Результат.КодСостояния);
	КонецЕсли;		
		
КонецПроцедуры
///

&НаСервере
Процедура КомандаОбработатьДанныеНаСервереРозницаАПИ(ТекстПерваяСтрока,ТекстВтораяСтрока,ТекстТовары,Комментарий,ИДЗаказа,НомерДляОплаты,ПромоКод)
	
	Попытка
			
			Разделитель = ";";
			
			СтрокаДанныеЗаказа = СтрРазделить(ТекстВтораяСтрока,Разделитель);	
			Клиент = СтрокаДанныеЗаказа[1 -1];
			Телефон = СтрокаДанныеЗаказа[2 -1];
			ЭлПочта = СтрокаДанныеЗаказа[3 -1];
			//Комментарий = СтрокаДанныеЗаказа[4 -1];
			
			
			СтрокаЗаказ = СтрРазделить(ТекстПерваяСтрока,Разделитель);
			
			ПризнакДоставки = СтрокаЗаказ[2 -1];
			ПризнакДоставки = Число(СтрЗаменить(ПризнакДоставки, "Признак доставки:", ""));
			//1 - самовывоз
			//2 - доставка
			//3 - белпочта    
			
			стрАдресНачало = СтрНайти(ТекстПерваяСтрока,"Адрес\Магазин:");
			стрАдресКонец = стрНайти(ТекстПерваяСтрока,";Вид оплаты:"); 
			СтрокаМагазинАдресДоставки = Сред(ТекстПерваяСтрока,стрАдресНачало,стрАдресКонец - стрАдресНачало);
			
			//СтрокаМагазинАдресДоставки = СтрокаЗаказ[3 -1];
			
			Если ПризнакДоставки = 1 Тогда		
				СтрокаМагазин = СтрЗаменить(СтрокаМагазинАдресДоставки, "Адрес\Магазин:", "");
			Иначе	
				АдресДоставки = СтрЗаменить(СтрокаМагазинАдресДоставки, "Адрес\Магазин:", "");	
			КонецЕсли; 
			
			///Если магазин не выбран на сайте - выбираем склад магазин 5
			//Если СтрокаМагазин = "" Тогда
			
			СтрокаМагазин = "170";	
			
			//КонецЕсли; 
			
			стрОстатокДанных = Сред(ТекстПерваяСтрока,стрАдресКонец+1,СтрДлина(ТекстПерваяСтрока) - стрАдресКонец);
			
			МассивОстатокПервойСтроки = СтрРазделить(стрОстатокДанных,";");
			
			//ВидОплаты = СтрокаЗаказ[4 -1];  
			
			ВидОплаты = МассивОстатокПервойСтроки[1 -1];
			ВидОплаты  = Число(СтрЗаменить(ВидОплаты, "Вид оплаты:", ""));
			//1 - наличные
			//2 - бан.карта
			//3 - ЕРИП
			//4 - Инт.Оплата
			//5 - Безнал(юр.лица)
			//6 - Наложенный платеж
			
			//Пока СтрДлина(КодКлиента) <> 8 Цикл
			//	КодКлиента = "0" + КодКлиента;
			//КонецЦикла; 
			//КодКлиента = "00-" + КодКлиента;
			
			//ПромоКод = СтрЗаменить(СтрокаЗаказ[5-1],Символы.ПС,"");
			//ПромоКод = СтрЗаменить(ПромоКод,Символы.Таб,"");
			//ПромоКод = СтрЗаменить(ПромоКод,Символы.ВК,"");
			//ПромоКод = СтрЗаменить(ПромоКод,Символ(182),"");
			//ПромоКод = СтрЗаменить(ПромоКод,"¶","");
			//ПромоКод = СокрЛП(ПромоКод);
			
			//ПромоКодСтрока = СтрЗаменить(СтрокаЗаказ[5-1],Символы.ПС,"");  
			ПромоКодСтрока = СтрЗаменить(МассивОстатокПервойСтроки[2 -1],Символы.ПС,"");
			ПромоКодСтрока = СтрЗаменить(ПромоКодСтрока,Символы.Таб,"");
			ПромоКодСтрока = СтрЗаменить(ПромоКодСтрока,Символы.ВК,"");
			ПромоКодСтрока = СтрЗаменить(ПромоКодСтрока,Символ(182),"");
			ПромоКодСтрока = СтрЗаменить(ПромоКодСтрока,"¶","");
			ПромоКодСтрока = СокрЛП(ПромоКодСтрока);
			
			//ПромоКод = Справочники.Промокоды.НайтиПоНаименованию(ПромоКодСтрока,ИСТИНА);
			
			НомерДляОплаты = СтрЗаменить(НомерДляОплаты,Символы.ПС,"");
			НомерДляОплаты = СтрЗаменить(НомерДляОплаты,Символы.Таб,"");
			НомерДляОплаты = СтрЗаменить(НомерДляОплаты,Символы.ВК,"");
			НомерДляОплаты = СтрЗаменить(НомерДляОплаты,Символ(182),"");

			                                       
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Склады.Ссылка КАК Ссылка,
			|	Склады.ТипСклада КАК ТипСклада,
			|	Склады.УчетныйВидЦены КАК УчетныйВидЦены,
			|	Склады.РозничныйВидЦены КАК РозничныйВидЦены
			|ИЗ
			|	Справочник.Склады КАК Склады
			|ГДЕ
			|	Склады.СВ_КодМагазин = &СВ_КодМагазин";
			
			Запрос.УстановитьПараметр("СВ_КодМагазин", СтрокаМагазин);
			
			РезЗпр = Запрос.Выполнить().Выбрать();
			
			Пока РезЗпр.Следующий() Цикл	
				Склад = РезЗпр.Ссылка;
				ВидЦены = РезЗпр.РозничныйВидЦены;	
			КонецЦикла;
			
			
			////Проверить и Создать Клиента
			//
			//
			//ЕстьКлиент = ЛОЖЬ;
			//ЕстьКлиент = ПроверитьСозданногоКлиента(ЭлПочта);
			//
			//Если ЕстьКлиент = ЛОЖЬ Тогда
			//	
			//	ПартнерыФизЛица = Справочники.Партнеры.СоздатьЭлемент();
			//	ПартнерыФизЛица.ЮрФизЛицо =Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо;
			//	ПартнерыФизЛица.Наименование = Клиент;
			//	ПартнерыФизЛица.НаименованиеПолное = Клиент;
			//	ПартнерыФизЛица.Клиент = Истина;
			//	ПартнерыФизЛица.ВидПартнераКонтрагента = Справочники.ВидПартнераКонтрагента.НайтиПоНаименованию("Розница");
			//	ПартнерыФизЛица.СогласиеКлиентаНаПолучениеРассылки = ИСТИНА;
			//	ПартнерыФизЛица.ВариантОтправкиЭлектронногоЧека = Перечисления.ВариантыОтправкиЭлектронногоЧекаПокупателю.НеОтправлять;
			//	ПартнерыФизЛица.ОсновнойМенеджер = Справочники.Пользователи.НайтиПоНаименованию("Самусевич Максим");
			//	ПартнерыФизЛица.ИнтернетРозница = Истина;
			//	
			//	ПартнерыКонтакты1 = ПартнерыФизЛица.КонтактнаяИнформация.Добавить();
			//	ПартнерыКонтакты1.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			//	ПартнерыКонтакты1.АдресЭП = ЭлПочта;
			//	ПартнерыКонтакты1.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
			//	ПартнерыКонтакты1.Представление = ПартнерыКонтакты1.АдресЭП;
			//	Попытка
			//		АдресЭПСтрока = СтрРазделить(ЭлПочта,"@");
			//		ПартнерыКонтакты1.ДоменноеИмяСервера = АдресЭПСтрока[1];
			//	Исключение
			//		
			//	КонецПопытки;
			//	
			//	
			//	ПартнерыКонтакты2 = ПартнерыФизЛица.КонтактнаяИнформация.Добавить();
			//	ПартнерыКонтакты2.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			//	ПартнерыКонтакты2.НомерТелефона = Телефон;
			//	ПартнерыКонтакты2.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			//	ПартнерыКонтакты2.Представление = ПартнерыКонтакты2.НомерТелефона;
			//	ПартнерыКонтакты2.НомерТелефонаБезКодов =  ПартнерыКонтакты2.НомерТелефона;
			//	
			//	ПартнерыФизЛица.Записать();
			//	
			//	
			//	
			//	ФизЛица = Справочники.Контрагенты.СоздатьЭлемент();
			//	ФизЛица.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			//	ФизЛица.Наименование = Клиент;
			//	ФизЛица.НаименованиеПолное = Клиент;
			//	ФизЛица.СтранаРегистрации = Справочники.СтраныМира.Беларусь;
			//	ФизЛица.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
			//	
			//	Контакты1 = ФизЛица.КонтактнаяИнформация.Добавить();
			//	Контакты1.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			//	Контакты1.АдресЭП = ЭлПочта;
			//	Контакты1.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
			//	Контакты1.Представление = Контакты1.АдресЭП;
			//	
			//	Попытка
			//		АдресЭПСтрока = СтрРазделить(ЭлПочта,"@");
			//		Контакты1.ДоменноеИмяСервера = АдресЭПСтрока[1];
			//	Исключение
			//		
			//	КонецПопытки;
			//	
			//	
			//	Контакты2 = ФизЛица.КонтактнаяИнформация.Добавить();
			//	Контакты2.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			//	Контакты2.НомерТелефона = Телефон;
			//	Контакты2.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			//	Контакты2.Представление = Контакты2.НомерТелефона;
			//	Контакты2.НомерТелефонаБезКодов =  Контакты2.НомерТелефона;
			//	
			//	ФизЛица.Партнер = ПартнерыФизЛица.Ссылка;
			//	
			//	ФизЛица.Записать();
			//	
			//	
			//КонецЕсли; 
			//
			
			
			
			
			//СоздатьЗаказ
			//ЗаказНомер = СтрокаЗаказ[1 -1];
			
			//ЗаказНомер = "30500" + ИДЗаказа;
			ЗаказНомер = ИДЗаказа;

			
			Заказ = Документы.ИнтернетЗаказРозничный.СоздатьДокумент();
			
			
			Заказ.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН","600052664");
			Заказ.Дата = ТекущаяДата();
			//Заказ.ЗаказТребуетВниманияМенеджера = Истина;
			Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
			Заказ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний",Истина);
			//Заказ.Склад = Склад.Родитель;
			Заказ.Склад = Склад;
			Заказ.ПромоКод = ПромоКод;
			
			Заказ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
			//Заказ.Контрагент = Справочники.Контрагенты.НайтиПоКоду("УТ-00000002");
			Заказ.Партнер = Справочники.Партнеры.НайтиПоКоду("УТ-00000002");
			Заказ.ОсновнойМенеджер = Заказ.Партнер.ОсновнойМенеджер;
			Заказ.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			
			Если ПризнакДоставки = 2 Тогда		
				//Заказ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика;
				Заказ.АдресДоставки = АдресДоставки;		
			ИначеЕсли ПризнакДоставки = 1 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
			ИначеЕсли ПризнакДоставки = 3 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.Почта;
				Заказ.АдресДоставки = АдресДоставки;
			ИначеЕсли ПризнакДоставки = 4 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.Европочта; //ЕвроПочта Отделение
				Заказ.АдресДоставки = АдресДоставки;
			ИначеЕсли ПризнакДоставки = 5 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.ЕвропочтаДоКлиента; //Европочта до двери
				Заказ.АдресДоставки = АдресДоставки;
			ИначеЕсли ПризнакДоставки = 6 Тогда	
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.ПочтаДоКлиента; //Почта до двери
				Заказ.АдресДоставки = АдресДоставки;
			КонецЕсли; 
			
			Если ВидОплаты = 1 Тогда  //Наличные
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.Наличная;
			ИначеЕсли ВидОплаты = 2 Тогда  //Банк.карта
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта;
			ИначеЕсли ВидОплаты = 3 Тогда    //ЕРИП
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.ЕРИП;
			ИначеЕсли ВидОплаты = 4 Тогда    //ИнтЭквайринг
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.ИнтернетОплата;
			ИначеЕсли ВидОплаты = 5 Тогда    //Безнал       
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная;
			ИначеЕсли ВидОплаты = 6 Тогда    //Наложенный платеж       
				Заказ.ФормаОплаты = Перечисления.ФормыОплаты.НаложенныйПлатеж;
			КонецЕсли;	
			
			Заказ.Клиент = Клиент;
			Заказ.Телефон = Телефон;
			Заказ.ЭлПочта = ЭлПочта;
			Заказ.ИнтЗаказНомер = ЗаказНомер;
			Заказ.Комментарий = Комментарий;
			Заказ.Валюта = Справочники.Валюты.НайтиПоНаименованию("BYN",ИСТИНА);
			Заказ.ИнтернетЗаказ = Истина;
			Заказ.НомерЕРИП = НомерДляОплаты;
			//Заказ.НомерИнтернетЗаказа = ЗаказНомер;
			
			Заказ.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Интернет-магазин", ИСТИНА);
			
			ИтогоЗаказСумма = 0;
			
			МассивТовары = РазложитьСтрокуНаПодстроки(ТекстТовары,Символы.ПС);

			Для каждого Строка Из МассивТовары Цикл
				
				//Строка = ТекстТовары.ПолучитьСтроку(НомерСтроки);
				
				Если Найти(Строка, "Итого ") > 0 Тогда
					
					Прервать;
					
				КонецЕсли; 
				
				
				МассивКол = СтрРазделить(Строка,Разделитель);
				
				КодТовара = МассивКол[2-1];
				Наименование =  МассивКол[4-1]; 
				КолВо = МассивКол[5-1];
				ЦенаСайта = МассивКол[6-1];
				ЦенаСайтаСоСкидкой = МассивКол[7-1];
				Сумма = МассивКол[8-1];
				Упак = МассивКол[9-1];
				
				
				
				Пока СтрДлина(КодТовара) <> 8 Цикл
					КодТовара = "0" + КодТовара;
				КонецЦикла; 
				КодТовара = "00-" + КодТовара;
				
				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
				
				//Таблица Заказ
				ТабЗаказ = Заказ.Заказ.Добавить();
				ТабЗаказ.Номенклатура = Номенклатура;
				ТабЗаказ.Упаковка = Номенклатура.ЕдиницаИзмерения;
				
				Если Упак = "упак" Тогда
					Если Номенклатура.КоэффициентЕдиницыДляОтчетов > 1 Тогда
						КолВо = Окр(КолВо * Номенклатура.КоэффициентЕдиницыДляОтчетов,2);
						ЦенаСайта = Окр(ЦенаСайта / Номенклатура.КоэффициентЕдиницыДляОтчетов,2);
					КонецЕсли; 
				КонецЕсли; 
				
				ТабЗаказ.Количество = Число(КолВо);
				ТабЗаказ.КоличествоУпаковок = Число(КолВо);
				ТабЗаказ.Цена = ПолучитьЦенуРозница(Номенклатура);
				ТабЗаказ.ЦенаСоСкидкой = ЦенаСайтаСоСкидкой; 
				ТабЗаказ.Сумма = ТабЗаказ.Количество * ТабЗаказ.ЦенаСоСкидкой;
				
				ИтогоЗаказСумма = ИтогоЗаказСумма + Сумма;
				//Таблица Товары
				
				ОстаткиПоСериям = СВ_ПолучениеДанныхСервер.ПолучитьОстаткиПоСериям( ТекущаяДата(),  ТекущаяДата(), Склад, Номенклатура);
				
				КолВоТовар = Число(КолВо);
				
				Для Каждого стрСерия Из ОстаткиПоСериям Цикл
					СерияКолво = стрСерия.Остаток;	
					
					Если СерияКолво = 0 Тогда
						Продолжить;
					КонецЕсли;
					
					Пока КолВоТовар > 0 Цикл
						
						ТабТовар = Заказ.Товары.Добавить();
						ТабТовар.Номенклатура = Номенклатура;
						ТабТовар.Упаковка = Номенклатура.ЕдиницаИзмерения;
						ТабТовар.Цена = ПолучитьЦенуРозница(Номенклатура);
						ТабТовар.ЦенаСоСкидкой = ТабЗаказ.ЦенаСоСкидкой; 
						ТабТовар.СтатусУказанияСерий = 14;
						ТабТовар.Склад = ПолучитьСклад(Номенклатура);
						ТабТовар.ДатаОтгрузки = НачалоДня(ТекущаяДата()); 
						ТабТовар.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
						
						
						Если КолВоТовар >= стрСерия.Остаток Тогда
							ТекКолво = стрСерия.Остаток;
							КолвоТовар = КолвоТовар - ТекКолво;
						Иначе
							ТекКолво = КолвоТовар;
							КолвоТовар = КолвоТовар - ТекКолво;
						КонецЕсли; 
						
						ТабТовар.Количество = ТекКолво;
						ТабТовар.КоличествоУпаковок = ТекКолво;
						ТабТовар.Сумма = ТекКолво * ТабТовар.ЦенаСоСкидкой;
						ТабТовар.Серия = стрСерия.Серия;
						
						
						ОстатокРозничный = 0;
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
						|	СвободныеОстаткиОстатки.Склад КАК Склад,
						|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
						|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК
						|ИЗ
						|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
						|ГДЕ
						|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
						|	И СвободныеОстаткиОстатки.Склад = &Склад";
						//|	И ТоварыНаСкладахОстатки.Серия = &Серия
						
						Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
						Запрос.УстановитьПараметр("Период", ТекущаяДата());
						//Запрос.УстановитьПараметр("Серия", Строка.Серия);
						Запрос.УстановитьПараметр("Склад", Склад);
						
						
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							ОстатокРозничный = ВыборкаДетальныеЗаписи.ОСТАТОК;
						КонецЦикла;
						
						ТабТовар.Остаток_Розница = ОстатокРозничный;
						
						
						
						СерияКолво = СерияКолво - ТекКолво;	  									  
						
						Если СерияКолво = 0 Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если КолвоТовар = 0 Тогда
						Прервать;
					КонецЕсли;						
				КонецЦикла;
				
				//ПодОбеспечение
				ПланируемаяДатаДоставки = Дата(1,1,1);
				
				Если КолвоТовар > 0 Тогда
					////Маг5				
					//СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
					/////1.Проверяем остатки товара на складе
					//Запрос0 = Новый Запрос;
					//Запрос0.Текст =
					//"ВЫБРАТЬ
					//|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
					//|	СвободныеОстаткиОстатки.Склад КАК Склад,
					//|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
					//|	СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ВРезервеСоСкладаОстаток,
					//|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК
					//|ИЗ
					//|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
					//|ГДЕ
					//|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
					//|	И СвободныеОстаткиОстатки.Склад = &СкладМаг5"; 
					//
					//Запрос0.УстановитьПараметр("Номенклатура", Номенклатура);
					//Запрос0.УстановитьПараметр("Период", ТекущаяДата());
					//Запрос0.УстановитьПараметр("СкладМаг5", Справочники.Склады.НайтиПоНаименованию("Магазин N 5",ИСТИНА));
					//
					//РезЗпр0 = Запрос0.Выполнить().Выгрузить();
					//
					//Если РезЗпр0.Количество() > 0 Тогда
					//	
					//	СкладОбеспечения = РезЗпр0[0].Склад;
					//	ТоварМаг5 = 0;
					//	Если РезЗпр0[0].ОСТАТОК >= КолвоТовар  Тогда
					//		ТоварМаг5 = КолвоТовар;
					//	Иначе	
					//		ТоварМаг5 = РезЗпр0[0].ОСТАТОК;
					//	КонецЕсли; 
					//	
					//	Товар = Заказ.ТоварыПодОбеспечение.Добавить();
					//	
					//	Товар.Номенклатура = Номенклатура;
					//	Товар.Упаковка = Номенклатура.ЕдиницаИзмерения;
					//	
					//	Товар.Количество = ТоварМаг5;
					//	Товар.КоличествоУпаковок = ТоварМаг5;
					//	
					//	Товар.ПланируемаяДатаДоставки = ПланируемаяДатаДоставки;
					//	
					//	Товар.Склад = СкладОбеспечения; 
					//	
					//	
					//	Запрос = Новый Запрос;
					//	Запрос.Текст = 
					//	"ВЫБРАТЬ
					//	|  ЦеныНоменклатурыСрезПоследних.Период,
					//	|  ЦеныНоменклатурыСрезПоследних.Номенклатура,
					//	|  ЦеныНоменклатурыСрезПоследних.ВидЦены,
					//	|  ЦеныНоменклатурыСрезПоследних.Валюта,
					//	|  ЦеныНоменклатурыСрезПоследних.Цена
					//	|ИЗ
					//	|  РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
					//	|ГДЕ
					//	|  ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
					//	|  И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
					//	
					//	
					//	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
					//	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
					//	Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
					//	
					//	РезультатЗапроса = Запрос.Выполнить();
					//	
					//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					//	
					//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					//		Товар.РозничнаяЦена = ВыборкаДетальныеЗаписи.Цена;
					//		Товар.Цена = Товар.РозничнаяЦена;
					//		Товар.ЦенаСоСкидкой = Товар.РозничнаяЦена;
					//	КонецЦикла;
					//	
					//	Товар.РозничнаяЦена = ЦенаСайта;
					//	Товар.Сумма = Товар.РозничнаяЦена * Товар.КоличествоУпаковок; 
					//	
					//	КолвоТовар = КолвоТовар - ТоварМаг5;
					//КонецЕсли;	
					
					//ИначеЕсли КолвоТовар > 0 Тогда
					
					СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
					///1.Проверяем остатки товара на складе
					Запрос1 = Новый Запрос;
					Запрос1.Текст =
					"ВЫБРАТЬ
					|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
					|	СвободныеОстаткиОстатки.Склад КАК Склад,
					|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
					|	СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ВРезервеСоСкладаОстаток,
					|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК
					|ИЗ
					|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
					|ГДЕ
					|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
					|	И (СвободныеОстаткиОстатки.Склад = &Склад3и)
					|	И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток >= &КолВоОстаток"; 
					
					Запрос1.УстановитьПараметр("Номенклатура", Номенклатура);
					Запрос1.УстановитьПараметр("Период", ТекущаяДата());
					Запрос1.УстановитьПараметр("Склад3и", Справочники.Склады.НайтиПоНаименованию("Склад N 3и",ИСТИНА));

					Запрос1.УстановитьПараметр("КолВоОстаток", КолвоТовар);
					РезЗпр1 = Запрос1.Выполнить().Выгрузить();
					
					ТЗОстатки = Новый ТаблицаЗначений;
					Если РезЗпр1.Количество() > 0 Тогда
						СкладОбеспечения = РезЗпр1[0].Склад;
						ТЗОстатки = РезЗпр1;
					Иначе
						//2.ОсновныеСклады
						СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
						
						Запрос1 = Новый Запрос;
						Запрос1.Текст =
						"ВЫБРАТЬ
						|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
						|	СвободныеОстаткиОстатки.Склад КАК Склад,
						|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
						|	СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ВРезервеСоСкладаОстаток,
						|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК
						|ИЗ
						|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
						|ГДЕ
						|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
						|	И (СвободныеОстаткиОстатки.Склад = &Склад3
						|			ИЛИ СвободныеОстаткиОстатки.Склад = &Склад5)
						|	И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток >= &КолВоОстаток"; 
						
						Запрос1.УстановитьПараметр("Номенклатура", Номенклатура);
						Запрос1.УстановитьПараметр("Период", ТекущаяДата());
						Запрос1.УстановитьПараметр("Склад3", Справочники.Склады.НайтиПоНаименованию("склад N 3 Готовой продукции",ИСТИНА));
						Запрос1.УстановитьПараметр("Склад5", Справочники.Склады.НайтиПоНаименованию("склад N 5 Лукохранилище",ИСТИНА));

						Запрос1.УстановитьПараметр("КолВоОстаток", КолвоТовар);
						
						
						РезЗпр1 = Запрос1.Выполнить().Выгрузить();
						ТЗОстатки = Новый ТаблицаЗначений;
						Если РезЗпр1.Количество() > 0 Тогда
							СкладОбеспечения = РезЗпр1[0].Склад;
							ТЗОстатки = РезЗпр1;	
						Иначе
							/////3. Проверяем остатки на магазинах
							//Маг5
							Если Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("3.	Луковицы, корневища  цветов",ИСТИНА)
								ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("3.	Луковицы, корневища  цветов",ИСТИНА) 
									ИЛИ Номенклатура.Родитель.Родитель.Родитель  = Справочники.Номенклатура.НайтиПоНаименованию("3.	Луковицы, корневища  цветов",ИСТИНА) 
								ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("2.1.2.	Розы",ИСТИНА)
									ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("2.1.2.	Розы",ИСТИНА)
									   ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("2.1.2.	Розы",ИСТИНА)
								Тогда

								  //пропускаем
								
							   Иначе

								Запрос2 = Новый Запрос;
								ТекстЗапроса2 =
								"ВЫБРАТЬ
								|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
								|	СвободныеОстаткиОстатки.Склад КАК Склад,
								|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК,
								|	ГрафикДоставкиТоваров.Понедельник КАК Понедельник,
								|	ГрафикДоставкиТоваров.Вторник КАК Вторник,
								|	ГрафикДоставкиТоваров.Среда КАК Среда,
								|	ГрафикДоставкиТоваров.Четверг КАК Четверг,
								|	ГрафикДоставкиТоваров.Пятница КАК Пятница,
								|	ГрафикДоставкиТоваров.Суббота КАК Суббота,
								|	ГрафикДоставкиТоваров.Воскресение КАК Воскресение
								|ИЗ
								|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
								|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикДоставкиТоваров КАК ГрафикДоставкиТоваров
								|		ПО СвободныеОстаткиОстатки.Склад = ГрафикДоставкиТоваров.Склад
								|ГДЕ
								|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
								////|	И СвободныеОстаткиОстатки.Склад.ТипСклада = &ТипСклада
								////|	И СвободныеОстаткиОстатки.Склад.ГородПогода = &ГородПогода
								|   И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток >= &КолВоОстаток
								//|   И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток > 0
								////|	И СвободныеОстаткиОстатки.Склад <> &Склад";         //210122 если на складе нет ищем на маг5, чуть что убрать //// коментарии
								|	И СвободныеОстаткиОстатки.Склад = &Маг5"; 
								
								Запрос2.УстановитьПараметр("Номенклатура", Номенклатура);
								Запрос2.УстановитьПараметр("Период", ТекущаяДата());
								Запрос2.УстановитьПараметр("КолВоОстаток", КолвоТовар);
								Запрос2.УстановитьПараметр("Маг5",Справочники.Склады.НайтиПоНаименованию("Магазин N 5",ИСТИНА));
								
								Запрос2.Текст = ТекстЗапроса2;
								РезЗпр2 = Запрос2.Выполнить().Выгрузить();
								
								Если РезЗпр2.Количество() > 0 Тогда
									ТЗОстатки = РезЗпр2;
								Иначе
								//	
								//	///Эти группы не обрабатываем на остатки по всем магазинам
								//									
								//		//Все магазины
								//		Запрос2 = Новый Запрос;
								//		ТекстЗапроса =
								//		"ВЫБРАТЬ
								//		|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
								//		|	СвободныеОстаткиОстатки.Склад КАК Склад,
								//		|	СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток КАК ОСТАТОК,
								//		|	ГрафикДоставкиТоваров.Понедельник КАК Понедельник,
								//		|	ГрафикДоставкиТоваров.Вторник КАК Вторник,
								//		|	ГрафикДоставкиТоваров.Среда КАК Среда,
								//		|	ГрафикДоставкиТоваров.Четверг КАК Четверг,
								//		|	ГрафикДоставкиТоваров.Пятница КАК Пятница,
								//		|	ГрафикДоставкиТоваров.Суббота КАК Суббота,
								//		|	ГрафикДоставкиТоваров.Воскресение КАК Воскресение
								//		|ИЗ
								//		|	РегистрНакопления.СвободныеОстатки.Остатки(&Период, ) КАК СвободныеОстаткиОстатки
								//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикДоставкиТоваров КАК ГрафикДоставкиТоваров
								//		|		ПО СвободныеОстаткиОстатки.Склад = ГрафикДоставкиТоваров.Склад
								//		|ГДЕ
								//		|	СвободныеОстаткиОстатки.Номенклатура = &Номенклатура
								//		|	И СвободныеОстаткиОстатки.Склад.ТипСклада = &ТипСклада
								//		|	И СвободныеОстаткиОстатки.Склад.ГородПогода = &ГородПогода
								//		//|   И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток >= &КолВоОстаток
								//		|   И СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток > 0
								//		|	И СвободныеОстаткиОстатки.Склад <> &Склад";         //210122 если на складе нет ищем на маг5, чуть что убрать //// коментарии
								//		
								//		ТекстЗапросаВсеМАГ = ТекстЗапроса;
								//		
								//		ДеньНомер = ДеньНедели(ТекущаяДата());
								//		Если ДеньНомер = 1 и ЧАС(ТекущаяДата()) <= 11  Тогда
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И (ГрафикДоставкиТоваров.Понедельник = ИСТИНА
								//			|ИЛИ ГрафикДоставкиТоваров.Вторник = ИСТИНА)";
								//			
								//		ИначеЕсли ДеньНомер = 1 и ЧАС(ТекущаяДата()) >= 11  Тогда	
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И ГрафикДоставкиТоваров.Вторник = ИСТИНА";
								//			
								//		ИначеЕсли ДеньНомер = 2 и ЧАС(ТекущаяДата()) <= 11  Тогда
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И (ГрафикДоставкиТоваров.Вторник = ИСТИНА
								//			|ИЛИ ГрафикДоставкиТоваров.Среда = ИСТИНА)";
								//			
								//		ИначеЕсли ДеньНомер = 2 и ЧАС(ТекущаяДата()) >= 11  Тогда	
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И ГрафикДоставкиТоваров.Среда = ИСТИНА";
								//			
								//		ИначеЕсли ДеньНомер = 3 и ЧАС(ТекущаяДата()) <= 11  Тогда
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И (ГрафикДоставкиТоваров.Среда = ИСТИНА
								//			|ИЛИ ГрафикДоставкиТоваров.Четверг = ИСТИНА)";
								//			
								//		ИначеЕсли ДеньНомер = 3 и ЧАС(ТекущаяДата()) >= 11  Тогда	
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И ГрафикДоставкиТоваров.Четверг = ИСТИНА";
								//			
								//		ИначеЕсли ДеньНомер = 4 и ЧАС(ТекущаяДата()) <= 11  Тогда
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И (ГрафикДоставкиТоваров.Четверг = ИСТИНА
								//			|ИЛИ ГрафикДоставкиТоваров.Пятница = ИСТИНА)";
								//			
								//		ИначеЕсли ДеньНомер = 4 и ЧАС(ТекущаяДата()) >= 11  Тогда	
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И ГрафикДоставкиТоваров.Пятница = ИСТИНА";
								//			
								//		ИначеЕсли ДеньНомер = 5 ИЛИ ДеньНомер = 6 ИЛИ ДеньНомер = 7  Тогда
								//			ТекстЗапроса = ТекстЗапроса + "
								//			|И ГрафикДоставкиТоваров.Понедельник = ИСТИНА";
								//			
								//		КонецЕсли; 
								//		
								//		Запрос2.УстановитьПараметр("Номенклатура", Номенклатура);
								//		Запрос2.УстановитьПараметр("Период", ТекущаяДата());
								//		Запрос2.УстановитьПараметр("ТипСклада", Перечисления.ТипыСкладов.РозничныйМагазин);
								//		Запрос2.УстановитьПараметр("ГородПогода", Справочники.ПогодаГорода.НайтиПоКоду("1"));  //Минск
								//		Запрос2.УстановитьПараметр("КолВоОстаток", КолвоТовар);
								//		Запрос2.УстановитьПараметр("Склад", Склад);
								//		
								//		
								//		Запрос2.Текст = ТекстЗапроса;
								//		РезЗпр2 = Запрос2.Выполнить().Выгрузить();
								//		РезЗпр2.Сортировать("ОСТАТОК УБЫВ");
								//		
								//		Если РезЗпр2.Количество() > 0 Тогда
								//			//СкладОбеспечения = РезЗпр2[0].Склад;				
								//			ТЗОстатки = РезЗпр2;
								//			
								//		Иначе
								//			Запрос2.Текст = ТекстЗапросаВсеМАГ;
								//			РезЗпр2 = Запрос2.Выполнить().Выгрузить();
								//			РезЗпр2.Сортировать("ОСТАТОК УБЫВ");
								//			Если РезЗпр2.Количество() > 0 Тогда
								//				//СкладОбеспечения = РезЗпр2[0].Склад;
								//				ТЗОстатки = РезЗпр2;
								//			Иначе
								//				СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
								//				//Продолжить;			
								//			КонецЕсли;
								//		КонецЕсли;
								КонецЕсли; 
							КонецЕсли; 
						КонецЕсли;
					КонецЕсли; 
					Если ТЗОстатки <> Неопределено Тогда	
						Если ТЗОстатки.Количество()>0 Тогда
							
							Для каждого стрОстатки Из ТЗОстатки Цикл
								СкладОбеспечения = стрОстатки.Склад;
								ОстатокКолво = стрОстатки.ОСТАТОК;
								
								Пока КолвоТовар > 0 Цикл
									
									Если КолВоТовар >= ОстатокКолво Тогда
										ТекКолво = ОстатокКолво;
										КолвоТовар = КолвоТовар - ТекКолво;
									Иначе
										ТекКолво = КолвоТовар;
										КолвоТовар = КолвоТовар - ТекКолво;
									КонецЕсли; 
									
									
									
									ТЗДниДоставки = Новый  ТаблицаЗначений;
									ТЗДниДоставки.Колонки.Добавить("ДеньДоставки");
									//Если РезЗпр2.Количество() > 0  Тогда
									Если СкладОбеспечения = Справочники.Склады.НайтиПоНаименованию("Магазин N 5",ИСТИНА) Тогда							
										ПланируемаяДатаДоставки = Дата(1,1,1);	
									ИначеЕсли РезЗпр2 <> Неопределено И РезЗпр2.Количество() > 0  И СкладОбеспечения <>  Справочники.Склады.ПустаяСсылка() Тогда
										Если РезЗпр2[0].Понедельник = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 1;
										КонецЕсли;
										
										Если РезЗпр2[0].Вторник = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 2;
										КонецЕсли;
										
										Если РезЗпр2[0].Среда = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 3;
										КонецЕсли;
										
										Если РезЗпр2[0].Четверг = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 4;
										КонецЕсли;
										
										Если РезЗпр2[0].Пятница = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 5;
										КонецЕсли;
										
										Если РезЗпр2[0].Суббота = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 6;
										КонецЕсли;
										
										Если РезЗпр2[0].Воскресение = ИСТИНА Тогда
											СтрТЗДниДоставки = ТЗДниДоставки.Добавить();
											СтрТЗДниДоставки.ДеньДоставки = 7;
										КонецЕсли;
										
										ТЗДниДоставки.Сортировать("ДеньДоставки Возр");
										СамоеБольшое = ТЗДниДоставки[ТЗДниДоставки.Количество()-1].ДеньДоставки;
										Отношение = ДеньНедели(ТекущаяДата()) / СамоеБольшое;
										Если Отношение >= 1  Тогда
											НачалоПоиска = 0;
										Иначе	
											НачалоПоиска = Цел(ТЗДниДоставки.Количество() * Отношение);
										КонецЕсли; 
										
										Если ТЗДниДоставки.Количество() = 1 Тогда
											НачалоПоиска = 0;
										КонецЕсли; 
										
										
										ПланируемаяДатаДоставки = Дата(1,1,1);
										Если ДеньНедели(ТекущаяДата()) < ТЗДниДоставки[НачалоПоиска].ДеньДоставки  Тогда
											ПланируемаяДатаДоставки = ТекущаяДата() + 86400 * (ТЗДниДоставки[НачалоПоиска].ДеньДоставки - ДеньНедели(ТекущаяДата())+1);
										ИначеЕсли ДеньНедели(ТекущаяДата()) > ТЗДниДоставки[НачалоПоиска].ДеньДоставки Тогда
											ПланируемаяДатаДоставки = ТекущаяДата() + 86400* (ТЗДниДоставки[НачалоПоиска].ДеньДоставки + 7 - ДеньНедели(ТекущаяДата())+1);
										Иначе
											ПланируемаяДатаДоставки = ТекущаяДата() + 86400* 7;
										КонецЕсли;
									Иначе
										ПланируемаяДатаДоставки = Дата(1,1,1);
									КонецЕсли;
									
									//КонецЕсли; 
									
									
									Товар = Заказ.ТоварыПодОбеспечение.Добавить();
									
									Товар.Номенклатура = Номенклатура;
									Товар.Упаковка = Номенклатура.ЕдиницаИзмерения;
									
									Товар.Количество = ТекКолво;
									Товар.КоличествоУпаковок = ТекКолво;
									
									
									//Товар.Цена = ЦенаТовар;
									Товар.ПланируемаяДатаДоставки = ПланируемаяДатаДоставки;
									
									Товар.Склад = СкладОбеспечения; 
									
									
									Запрос = Новый Запрос;
									Запрос.Текст = 
									"ВЫБРАТЬ
									|  ЦеныНоменклатурыСрезПоследних.Период,
									|  ЦеныНоменклатурыСрезПоследних.Номенклатура,
									|  ЦеныНоменклатурыСрезПоследних.ВидЦены,
									|  ЦеныНоменклатурыСрезПоследних.Валюта,
									|  ЦеныНоменклатурыСрезПоследних.Цена
									|ИЗ
									|  РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
									|ГДЕ
									|  ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
									|  И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
									
									
									Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
									Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
									Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
									
									РезультатЗапроса = Запрос.Выполнить();
									
									ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
									
									Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
										Товар.РозничнаяЦена = ВыборкаДетальныеЗаписи.Цена;
										Товар.Цена = Товар.РозничнаяЦена;
										Товар.ЦенаСоСкидкой = ЦенаСайтаСоСкидкой;
									КонецЦикла;
									
									Товар.РозничнаяЦена = ЦенаСайта;
									Товар.Сумма = Товар.ЦенаСоСкидкой * Товар.КоличествоУпаковок; 
									
									
									ОстатокКолво = ОстатокКолво - ТекКолво;
									
									Если ОстатокКолво = 0 Тогда
										Прервать;
									КонецЕсли;
								КонецЦикла;
								
								Если КолвоТовар = 0 Тогда
									Прервать;
								КонецЕсли;	
								//
							КонецЦикла; 	
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
				
				Если КолВоТовар > 0  Тогда
					СкладОбеспечения = Справочники.Склады.ПустаяСсылка();
					Товар = Заказ.ТоварыПодОбеспечение.Добавить();
					
					Товар.Номенклатура = Номенклатура;
					Товар.Упаковка = Номенклатура.ЕдиницаИзмерения;
					Товар.Количество = КолвоТовар;
					Товар.КоличествоУпаковок = КолвоТовар;
					
					Товар.ПланируемаяДатаДоставки = Дата(1,1,1);
					
					Товар.Склад = СкладОбеспечения; 
					
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|  ЦеныНоменклатурыСрезПоследних.Период,
					|  ЦеныНоменклатурыСрезПоследних.Номенклатура,
					|  ЦеныНоменклатурыСрезПоследних.ВидЦены,
					|  ЦеныНоменклатурыСрезПоследних.Валюта,
					|  ЦеныНоменклатурыСрезПоследних.Цена
					|ИЗ
					|  РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
					|ГДЕ
					|  ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
					|  И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
					
					
					Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
					Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
					Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Товар.РозничнаяЦена = ВыборкаДетальныеЗаписи.Цена;
						Товар.Цена = Товар.РозничнаяЦена;
						Товар.ЦенаСоСкидкой = Товар.РозничнаяЦена;
					КонецЦикла;
					
					Товар.РозничнаяЦена = ЦенаСайта;
					Товар.Сумма = Товар.РозничнаяЦена * Товар.КоличествоУпаковок; 
				КонецЕсли; 
			КонецЦикла;
			Заказ.Товары.Сортировать("Номенклатура");
			Заказ.Заказ.Сортировать("Номенклатура");
			Заказ.ТоварыПодОбеспечение.Сортировать("Номенклатура");
			
			
			ТЗ_Товары = Заказ.Товары.Выгрузить();
			ТЗ_Товары.Колонки.Добавить("Группа");
			Для каждого стрТовары Из ТЗ_Товары Цикл
			    стрТовары.Группа = стрТовары.Номенклатура.Родитель;
			КонецЦикла; 
			ТЗ_Товары.Сортировать("Группа,Номенклатура");
			Заказ.Товары.Загрузить(ТЗ_Товары);

			ТЗ_Заказ = Заказ.Заказ.Выгрузить();
			ТЗ_Заказ.Колонки.Добавить("Группа");
			Для каждого стрЗаказ Из ТЗ_Заказ Цикл
			    стрЗаказ.Группа = стрЗаказ.Номенклатура.Родитель;
			КонецЦикла; 
			ТЗ_Заказ.Сортировать("Группа,Номенклатура");
			Заказ.Заказ.Загрузить(ТЗ_Заказ);
			
			
			ТЗ_ТоварыПодОбеспечение = Заказ.ТоварыПодОбеспечение.Выгрузить();
			ТЗ_ТоварыПодОбеспечение.Колонки.Добавить("Группа");
			Для каждого стрОбеспечение Из ТЗ_ТоварыПодОбеспечение Цикл
			    стрОбеспечение.Группа = стрОбеспечение.Номенклатура.Родитель;
			КонецЦикла; 
			ТЗ_ТоварыПодОбеспечение.Сортировать("Группа,Номенклатура");
			Заказ.ТоварыПодОбеспечение.Загрузить(ТЗ_ТоварыПодОбеспечение);
			
			ЗаказНайден = ПроверитьЗаказНаСуществование(Заказ.ИнтЗаказНомер);
			
			Заказ.ДатаСозданияЗаказа = ТекущаяДата();
			
			Если ЗаказНайден = ЛОЖЬ Тогда				
					
				//Если ИтогоЗаказСумма < 20 Тогда	//Проверка на мининмальный зазак 	
				//	Возврат;
				//Иначе
				Заказ.Записать(РежимЗаписиДокумента.Проведение);
				Тело = "Здравствуйте! Ваш заказ "+Заказ.ИнтЗаказНомер+" принят в работу интернет-магазином ""Насенне"". Данное сообщение не является подтверждением резерва товаров. Дождитесь уведомления о готовности (sms/письмо на почту)";
				
				Заказ.ОтправитьСМСУведомление(Тело,Заказ.Телефон);
				
				//КонецЕсли;
				
				УстановитьСтатусНаСайтеОбработан(ИДЗаказа);				
			Иначе
				УстановитьСтатусНаСайтеОбработан(ИДЗаказа);	
			КонецЕсли; 
			
	Исключение
		////пишем в телеграм ошибку
		//Ошибка = ОписаниеОшибки();
		//Команда1 = "C:\cURL\curl.exe https://api.telegram.org/bot977867589:AAF0xKkESIU4XcTzIJF3DsFVfnGExEACK3Y/sendMessage?chat_id=-338090218=&text=""*ОШИБКА ПРИ СОЗДАНИИ ИНТЕРНЕТ ЗАКАЗОВ РОЗНИЦА* %0A " + Ошибка + " ""&parse_mode=Markdown";  
		//Shell = Новый COMОбъект("WScript.Shell");
		//WshExec = Shell.Exec(Команда1);
		//OutStream = WshExec.StdOut;
		//пишем в телеграм ошибку обмена  
		
		ЗаголовокОшибки = "ОШИБКА ПРИ СОЗДАНИИ ИНТЕРНЕТ ЗАКАЗОВ РОЗНИЦА"; 
		Ошибка = ОписаниеОшибки();

		А = МССО_РассылкиУведомления.ОтправитьУведомлениеВТелеграм(ЗаголовокОшибки, Ошибка);

	КонецПопытки;
			
КонецПроцедуры
///

&НаСервере
Процедура КомандаОбработатьДанныеНаСервереАПИ_ОПТ(ТекстПерваяСтрока,ТекстВтораяСтрока,ТекстТовары,Комментарий,ИДЗаказа)

	
	Попытка

		Разделитель = ";";
		
		ДанныеЗаказа = СтрРазделить(ТекстПерваяСтрока,Разделитель);     
		
		
		СтрокаЗаказ = СтрРазделить(ТекстВтораяСтрока,Разделитель);
		КодКлиента = СтрокаЗаказ[2 -1];
		КодКлиента = СтрЗаменить(КодКлиента, "login:", "");
		КодКлиента = СтрЗаменить(КодКлиента, " ", "");
		
		Если КодКлиента = "" Тогда
		
			Возврат;
		
		КонецЕсли;
		
		ПризнакДоставки = СтрокаЗаказ[3 -1];
		ПризнакДоставки = Число(СтрЗаменить(ПризнакДоставки, "Признак доставки:", ""));       
		
		//если значение Признак доставки 1 то самовывоз, 2 то доставка
		Если ПризнакДоставки = 2 Тогда
		
			АдресДоставки = СтрокаЗаказ[4 -1];	
		    АдресДоставки = СтрЗаменить(АдресДоставки, "Адрес:", "");
			
		КонецЕсли; 
		
		Если СтрДлина(КодКлиента) >= 8 Тогда
		     КодКлиента = Прав(КодКлиента,6);		
		КонецЕсли; 
		
		Пока СтрДлина(КодКлиента) <> 8 Цикл
			КодКлиента = "0" + КодКлиента;
		КонецЦикла; 
		КодКлиента = "00-" + КодКлиента;
		
		Партнер = Справочники.Партнеры.НайтиПоКоду(КодКлиента);
		Склад = Справочники.Склады.Склад3;
		ЗаказНомер = СтрокаЗаказ[1 -1];
		

			Заказ = Документы.ИнтернетЗаказКлиента.СоздатьДокумент();
			Заказ.Партнер = Партнер;
			Заказ.Контрагент = Партнер;
			Заказ.ОсновнойМенеджер = Партнер.ОсновнойМенеджер;

			//Заказ.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",Истина);
			
			Заказ.Дата = ТекущаяДата();
			Заказ.ЗаказТребуетВниманияМенеджера = Истина;
			Заказ.ИнтернетЗаказ = Истина;
			//Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;			
			Заказ.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован; //jadmin
			
		   	Заказ.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний",Истина);
			Заказ.Склад = Склад.Родитель;
			
			Если ПризнакДоставки = 2 Тогда
				
				Заказ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
				Заказ.АдресДоставкиСайт = АдресДоставки;
				
			Иначе
				
			    Заказ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;

			КонецЕсли; 
			
			Заказ.ИДЗаказа = ИДЗаказа;
			
			Заказ.Комментарий = "Интернет" + ЗаказНомер + ", " + ТекстПерваяСтрока;
			Комментарий = Заказ.Комментарий;
			//СуммаИтого = 0;          
			
			МассивТовары = РазложитьСтрокуНаПодстроки(ТекстТовары,Символы.ПС);
			
			Для каждого Строка Из МассивТовары Цикл
				
				Если Строка = "" Тогда
				
					Продолжить;	
				
				КонецЕсли;
				//Строка = ПрочитанныйФайл.ПолучитьСтроку(НомерСтроки);
			
				//Если Найти(Строка, "Итого ") > 0 Тогда
				//	
				//	СтрокаИтого = СтрРазделить(Строка,Разделитель);
				//	СуммаИтого = СтрокаИтого[2 -1];				
				//	Заказ.СуммаДокумента = СуммаИтого;
				//	
				//	Прервать;				//	
				//	Прервать;
				//
				//КонецЕсли;

				Если Найти(Строка, "Итого ") > 0 Тогда
					
					СтрокаИтого = СтрРазделить(Строка,Разделитель);
					СуммаИтого = СтрокаИтого[2 -1];				
					Заказ.СуммаДокумента = СуммаИтого;
					
					Прервать;
					
				КонецЕсли;
								
				МассивКол = СтрРазделить(Строка,Разделитель);
				
				КодТовара = МассивКол[2-1];
				Наименование =  МассивКол[4-1]; 
				КолВо = МассивКол[5-1];
				Цена = МассивКол[6-1];
				Сумма = МассивКол[7-1];
			
				
				
				Пока СтрДлина(КодТовара) <> 8 Цикл
					КодТовара = "0" + КодТовара;
				КонецЦикла; 
				КодТовара = "00-" + КодТовара;

				Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
			
				Товар = Заказ.Товары.Добавить();
				Товар.Номенклатура = Номенклатура;
				Товар.Упаковка = Номенклатура.ЕдиницаИзмерения;
				Товар.Количество = Число(КолВо);
				Товар.КоличествоУпаковок = Число(КолВо);
				Товар.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",Истина);
				Товар.Цена = ПолучитьЦену(Номенклатура); 
				Товар.Сумма = Товар.Количество * Товар.Цена;
				Товар.СтатусУказанияСерий = 14;
				Товар.Склад = ПолучитьСклад(Номенклатура);
				Товар.СтавкаНДС = Номенклатура.СтавкаНДС;
				Товар.ДатаОтгрузки = НачалоДня(ТекущаяДата());
				Товар.КлючСвязи = Товар.НомерСтроки;
				//СуммаИтого = СуммаИтого + Товар.Сумма;				
				
			КонецЦикла;
		//
		//		СтрокаИтого = СтрРазделить(ПрочитанныйФайл.ПолучитьСтроку(ПрочитанныйФайл.КоличествоСтрок()),Разделитель);
		//		СуммаИтого = СтрокаИтого[2 -1];
		//		
		//		Заказ.СуммаДокумента = СуммаИтого;
            ЗаказНайден = ПроверитьЗаказНаСуществование_ОПТ(ИДЗаказа);
				
			Если ЗаказНайден = ЛОЖЬ Тогда
				
				Заказ.Записать(РежимЗаписиДокумента.Запись);		
				
				
				
				УчетнаяЗаписьПочта = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
				
				ПрофильПодключения = Новый ИнтернетПочтовыйПрофиль;
				ПрофильПодключения.АдресСервераSMTP = УчетнаяЗаписьПочта.СерверИсходящейПочты;
				
				ПрофильПодключения.ИспользоватьSSLSMTP=УчетнаяЗаписьПочта.ИспользоватьЗащищенноеСоединениеДляИсходящейПочты;
				
				ПрофильПодключения.ПортSMTP = УчетнаяЗаписьПочта.ПортСервераИсходящейПочты;
				
				ПрофильПодключения.ПользовательSMTP = УчетнаяЗаписьПочта.АдресЭлектроннойПочты;
				Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(УчетнаяЗаписьПочта, "Пароль, ПарольSMTP");
				
				ПрофильПодключения.ПарольSMTP = Пароли.Пароль;
				
				
				//Создаем объект ИнтернетПочта
				Почта = Новый ИнтернетПочта;
				
				//Пытаемся подключится к серверу используя наши настройки.
				Попытка
					Почта.Подключиться(ПрофильПодключения);
				Исключение
					Сообщить("Не удалось подключиться к серверу smtp");
					Сообщить(ОписаниеОшибки());
				КонецПопытки;
				
				//Определяемся с текстом письма
				Тело="Добрый день!
				|Получен новый интернет-заказ:
				|
				|"+Комментарий+" Сумма заказа: "+СуммаИтого;
				
				//Создаем сообщение
				Письмо = Новый ИнтернетПочтовоеСообщение;
				
				//Добавляем наш текст в письмо
				Письмо.Тексты.Добавить(Тело);
				
				//Добавляем тему
				Письмо.Тема = "Новый интернет-заказ";
				
				////Добавляем ту же почту, через которую подключаемся к серверу
				
				Письмо.Отправитель = "seedgatovo@msso.by";
				
				//Добавляем имя отправителя
				Письмо.ИмяОтправителя = "Новый интернет-заказ";
				
				////Добавляем получателя
				ЕmailМенеджера = "";
				
				Попытка
					ЕmailМенеджера = ""+СокрЛП(Партнер.ОсновнойМенеджер.ФизическоеЛицо.КонтактнаяИнформация[0].Представление);
				Исключение
					//ОписаниеОшибки()
				КонецПопытки; 
				
				Письмо.Получатели.Добавить(ЕmailМенеджера);
				
				Попытка
					Почта.Послать(Письмо);
				Исключение
					Сообщить("Не удалось отправить письмо ");
					Сообщить(ОписаниеОшибки());
				КонецПопытки;	
				
				//Обязательно отключаемся от почтового сервера по завершении отправки письма.	
				Почта.Отключиться();

				УстановитьСтатусНаСайтеОбработан_ОПТ(ИДЗаказа);				
			Иначе
				УстановитьСтатусНаСайтеОбработан_ОПТ(ИДЗаказа);	
			КонецЕсли; 	
	Исключение
		////пишем в телеграм ошибку
		//Ошибка = ОписаниеОшибки();
		//Команда1 = "C:\cURL\curl.exe https://api.telegram.org/bot977867589:AAF0xKkESIU4XcTzIJF3DsFVfnGExEACK3Y/sendMessage?chat_id=-338090218=&text=""*ОШИБКА ПРИ СОЗДАНИИ ИНТЕРНЕТ ЗАКАЗОВ ОПТА* %0A " + Ошибка + " ""&parse_mode=Markdown";  
		//Shell = Новый COMОбъект("WScript.Shell");
		//WshExec = Shell.Exec(Команда1);
		//OutStream = WshExec.StdOut;
		
		//пишем в телеграм ошибку обмена
		ЗаголовокОшибки = "ОШИБКА ПРИ СОЗДАНИИ ИНТЕРНЕТ ЗАКАЗОВ ОПТ"; 
		Ошибка = ОписаниеОшибки();

		А = МССО_РассылкиУведомления.ОтправитьУведомлениеВТелеграм(ЗаголовокОшибки, Ошибка);

	КонецПопытки;
		
КонецПроцедуры
///

///
&НаСервере
Процедура ВыгрузитьПаролиОпт()
	
		
		Путь = ПолучитьПуть();
		КаталогВыгрузки_login_opt = ""+сокрлп(Путь)+"logins.csv";
		
		
		Файл_login_opt = Новый ЗаписьТекста(КаталогВыгрузки_login_opt,КодировкаТекста.UTF8);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Ссылка,
		|	Партнеры.Код КАК Код,
		|	Партнеры.Наименование КАК Наименование,
		|	Партнеры.ДоступНаСайт КАК ДоступНаСайт,
		|	Партнеры.ПарольДляСайта КАК ПарольДляСайта,
		|	Партнеры.ПарольДляСайтаMD5 КАК ПарольДляСайтаMD5
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.ДоступНаСайт = ИСТИНА";
		
		
		РезЗпр = Запрос.Выполнить().Выбрать();

		
		id = 0;
		
		Файл_login_opt.ЗаписатьСтроку("1;Admin;e49b17ebce3ea69cb0f0f6d9c9ee2c99;Admin;");

		Пока РезЗпр.Следующий() Цикл
			
			id = РезЗпр.Код;
			id = Прав(id,8);
			id = Число(id);
			id = СтрЗаменить(id,Символы.НПП,"");
			id = СтрЗаменить(id," ","");
			
			name = id;
			login = id;
			
			pass = РезЗпр.ПарольДляСайтаMD5;
			pass = СтрЗаменить(pass," ","");
			
			Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(РезЗпр.Наименование, ИСТИНА);
			Регистратор = Неопределено;
			СкидкаОбщая = 0;
			СкидкаОбщая = ПолучитьРазмерСкидки_Опт(Контрагент);
			//ОбщийМодуль77w.РасчитатьСкидкуКлиента(Контрагент,Регистратор,,,СкидкаОбщая);
			
			РазмерСкидки = СкидкаОбщая/100;
			РазмерСкидки = СтрЗаменить(РазмерСкидки,",",".");
			
			Файл_login_opt.ЗаписатьСтроку(""+id+";"+login+";"+pass+";"+name+";"+РазмерСкидки);
			
			
			Пока СтрДлина(id) <> 6 Цикл
				id = "0" + id;
			КонецЦикла; 
			
			Для стрИД = 1 По 5 Цикл
				ДопИД = ""+стрИД + "0" + id;
				ДопИД = СтрЗаменить(ДопИД,Символы.НПП,"");
				Файл_login_opt.ЗаписатьСтроку(""+ДопИД+";"+ДопИД+";"+pass+";"+name+";"+РазмерСкидки);
			КонецЦикла;
		КонецЦикла;
		
		Файл_login_opt.Закрыть();
		//Сообщить("Выгрузка завершена.");
		
КонецПроцедуры
//
Функция ПолучитьРазмерСкидки_Опт(Контрагент)
	
	СкидкаОбщая = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидкиКлиентов_Опт.Контрагент КАК Контрагент,
		|	СкидкиКлиентов_Опт.СкидкаОбщая КАК СкидкаОбщая
		|ИЗ
		|	РегистрСведений.СкидкиКлиентов_Опт КАК СкидкиКлиентов_Опт
		|ГДЕ
		|	СкидкиКлиентов_Опт.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СкидкаОбщая = ВыборкаДетальныеЗаписи.СкидкаОбщая;
	КонецЦикла;
	
	Возврат СкидкаОбщая;


КонецФункции // ()


Процедура ЗаписатьСкидкиКлиентов_Опт_В_РС()   ЭКСПОРТ

	    Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Партнеры.Ссылка КАК Ссылка,
		|	Партнеры.Код КАК Код,
		|	Партнеры.Наименование КАК Наименование,
		|	Партнеры.ДоступНаСайт КАК ДоступНаСайт,
		|	Партнеры.ПарольДляСайта КАК ПарольДляСайта,
		|	Партнеры.ПарольДляСайтаMD5 КАК ПарольДляСайтаMD5
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.ДоступНаСайт = ИСТИНА";
		
		
		РезЗпр = Запрос.Выполнить().Выбрать();

		

		Пока РезЗпр.Следующий() Цикл
					
			Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(РезЗпр.Наименование, ИСТИНА);
			СкидкаОбщая = 0;
			Регистратор = Неопределено;
			ОбщийМодуль77w.РасчитатьСкидкуКлиента(Контрагент,Регистратор,,,СкидкаОбщая);

			МенеджерЗаписей = РегистрыСведений.СкидкиКлиентов_Опт.СоздатьМенеджерЗаписи();
			МенеджерЗаписей.Контрагент = Контрагент;
			МенеджерЗаписей.СкидкаОбщая = СкидкаОбщая;
			МенеджерЗаписей.Записать(ИСТИНА);
	
		КонецЦикла;
		
КонецПроцедуры
 



Процедура ПроверитьОплатуИнтернетЗаказов() 

	
	////Проверка оплаты ЕРИП
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнтернетЗаказРозничный.Ссылка КАК Ссылка,
		|	ИнтернетЗаказРозничный.Проведен КАК Проведен,
		|	ИнтернетЗаказРозничный.Статус КАК Статус,
		|	ИнтернетЗаказРозничный.СуммаДокумента КАК СуммаДокумента,
		|	ИнтернетЗаказРозничный.НомерЕРИП КАК НомерЕРИП,
		|	ИнтернетЗаказРозничный.ФормаОплаты КАК ФормаОплаты
		|ИЗ
		|	Документ.ИнтернетЗаказРозничный КАК ИнтернетЗаказРозничный
		|ГДЕ
		|	ИнтернетЗаказРозничный.Проведен = ИСТИНА
		|	И ИнтернетЗаказРозничный.Статус = &Статус
		|	И ИнтернетЗаказРозничный.НомерЕРИП <> """"
		|	И ИнтернетЗаказРозничный.ПризнакОплатыСчета = ЛОЖЬ
		|	И ИнтернетЗаказРозничный.ФормаОплаты = &ФормаОплаты";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	Запрос.УстановитьПараметр("ФормаОплаты", Перечисления.ФормыОплаты.ЕРИП);

	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	ТокенЕРИП = "5e729f70f4b447e4a1b044ea08080ce5";
	Пока РезультатЗапроса.Следующий() Цикл
		НомерЕРИП = РезультатЗапроса.НомерЕРИП;
		
		
		ЗаписьJSON = Новый ЗаписьJSON;

			
		тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
		ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 
		
		
		МассивДанныхJSON = Новый Массив;
		//СтруктураДанныхJSON = Новый Структура; 
		
		
		тДанные = Новый Структура;                             
			тДанные.Вставить("token", ТокенЕРИП);
			тДанные.Вставить("invoiceNo", ""+НомерЕРИП+"");
		МассивДанныхJSON.Добавить(тДанные);
		
		//СтруктураДанныхJSON.Вставить("arrayProd", МассивДанныхJSON);
		
		ЗаписатьJSON(ЗаписьJSON, тДанные);
		СтрокаJS = ЗаписьJSON.Закрыть();
	
		
	Соединение = Новый HTTPСоединение(
        "api.express-pay.by", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        60, // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );
 
    ЗапросGET = Новый HTTPЗапрос("/v1/invoices/"+ СтрЗаменить(НомерЕРИП,Символы.НПП,"") + "/status?token=" + ТокенЕРИП);
	ЗапросGET.Заголовки.Вставить("Content-type", "application/json");
	ЗапросGET.УстановитьТелоИзСтроки(СтрокаJS);

 
 
 
    Результат = Соединение.Получить(ЗапросGET);

	ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();

		ЗаказСсылка = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ЗаказСсылка.ПризнакОплатыСчета = ЛОЖЬ;
		//ЗаказСсылка.ЗаказТребуетВниманияМенеджера = ЛОЖЬ;
		
		
		//Статус счета на оплату:
		//1 - Ожидает оплату
		//2 - Просрочен
		//3 - Отменен
		//4 - Оплачен частично
		//5 - Оплачен
		//6 - Оплачен с помощью банковской карты
		
		Попытка
		    Если Ответ.Status = 3 ИЛИ Ответ.Status = 6 Тогда
				
				ЗаказСсылка.ПризнакОплатыСчета = ИСТИНА;	
				ЗаказСсылка.Записать(РежимЗаписиДокумента.Проведение);
					
			КонецЕсли; 
			
		
		Исключение
		
		КонецПопытки; 

	КонецЦикла;
	
	
///////Проверка Интернет оплаты

	////Проверка оплаты ЕРИП
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнтернетЗаказРозничный.Ссылка КАК Ссылка,
		|	ИнтернетЗаказРозничный.Проведен КАК Проведен,
		|	ИнтернетЗаказРозничный.Статус КАК Статус,
		|	ИнтернетЗаказРозничный.СуммаДокумента КАК СуммаДокумента,
		|	ИнтернетЗаказРозничный.НомерЕРИП КАК НомерЕРИП,
		|	ИнтернетЗаказРозничный.ФормаОплаты КАК ФормаОплаты,
		|	ИнтернетЗаказРозничный.ПризнакОплатыСчета КАК ПризнакОплатыСчета
		|ИЗ
		|	Документ.ИнтернетЗаказРозничный КАК ИнтернетЗаказРозничный
		|ГДЕ
		|	ИнтернетЗаказРозничный.Проведен = ИСТИНА
		|	И ИнтернетЗаказРозничный.НомерЕРИП <> """"
		|	И ИнтернетЗаказРозничный.ПризнакОплатыСчета = ЛОЖЬ
		|	И ИнтернетЗаказРозничный.ФормаОплаты = &ФормаОплаты
		|	И ИнтернетЗаказРозничный.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Закрыт)
		|	И ИнтернетЗаказРозничный.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.Отменен)";
	
	Запрос.УстановитьПараметр("ФормаОплаты", Перечисления.ФормыОплаты.ИнтернетОплата);

	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	ТокенЕРИП = "5e729f70f4b447e4a1b044ea08080ce5";
	Пока РезультатЗапроса.Следующий() Цикл
		НомерЕРИП = РезультатЗапроса.НомерЕРИП;
		
		
		ЗаписьJSON = Новый ЗаписьJSON;

			
		тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
		ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 
		
		
		МассивДанныхJSON = Новый Массив;
		//СтруктураДанныхJSON = Новый Структура; 
		
		
		тДанные = Новый Структура;                             
			тДанные.Вставить("token", ТокенЕРИП);
			тДанные.Вставить("CardInvoiceNo", ""+НомерЕРИП+"");
		МассивДанныхJSON.Добавить(тДанные);
		
		//СтруктураДанныхJSON.Вставить("arrayProd", МассивДанныхJSON);
		
		ЗаписатьJSON(ЗаписьJSON, тДанные);
		СтрокаJS = ЗаписьJSON.Закрыть();
	
		
	Соединение = Новый HTTPСоединение(
        "api.express-pay.by", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        60, // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );
 
    ЗапросGET = Новый HTTPЗапрос("/v1/cardinvoices/"+ СтрЗаменить(НомерЕРИП,Символы.НПП,"") + "/status?token=" + ТокенЕРИП);
	ЗапросGET.Заголовки.Вставить("Content-type", "application/json");
	ЗапросGET.УстановитьТелоИзСтроки(СтрокаJS);

    Результат = Соединение.Получить(ЗапросGET);

	ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();

		ЗаказСсылка = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ЗаказСсылка.ПризнакОплатыСчета = ЛОЖЬ;
		//ЗаказСсылка.ЗаказТребуетВниманияМенеджера = ЛОЖЬ;
		
		
		//Статус счета на оплату:
		//Состояние оплаты:
		//0 - Счет зарегистрирован, но не оплачен
		//1 - Предавторизованная сумма захолдирована (для двухстадийных платежей)
		//2 - Проведена полная авторизация суммы счета
		//3 - Авторизация отменена
		//4 - По транзакции была проведена операция возврата
		//5 - Инициирована авторизация через ACS банка-эмитента
		//6 - Авторизация отклонена
		
		Попытка
			Если Ответ.CardInvoiceStatus = 2 Тогда
				Если НЕ ЗаказСсылка.ОплаченоСумма = Ответ.Amount 
					И ЗаказСсылка.ПризнакОплатыСчета = ЛОЖЬ Тогда
				
					ЗаказСсылка.ОплаченоСумма = Ответ.Amount;
					ЗаказСсылка.ПризнакОплатыСчета = ИСТИНА;	
					ЗаказСсылка.Записать(РежимЗаписиДокумента.Проведение);
				
				КонецЕсли; 
					
			КонецЕсли; 
			
		
		Исключение
		
		КонецПопытки; 

	КонецЦикла;
	

	
	
	    	////ДЛЯ ВИРТУАЛЬНОЙ КАССЫ VPOS ARTIX	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ИнтернетЗаказРозничный.Ссылка КАК Ссылка,
	//	|	ИнтернетЗаказРозничный.Проведен КАК Проведен,
	//	|	ИнтернетЗаказРозничный.Статус КАК Статус,
	//	|	ИнтернетЗаказРозничный.НомерЗаказаДляКассы КАК НомерЗаказаДляКассы,
	//	|	ИнтернетЗаказРозничный.СуммаДокумента КАК СуммаДокумента
	//	|ИЗ
	//	|	Документ.ИнтернетЗаказРозничный КАК ИнтернетЗаказРозничный
	//	|ГДЕ
	//	|	ИнтернетЗаказРозничный.Проведен = ИСТИНА
	//	|	И ИнтернетЗаказРозничный.НомерЗаказаДляКассы <> """"
	//	|	И ИнтернетЗаказРозничный.Статус = &Статус";
	//
	//Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//
	//Пока РезультатЗапроса.Следующий() Цикл
	//	НомерЗаказаДляКассы = РезультатЗапроса.НомерЗаказаДляКассы;
	//	
		
	//	Команда1 = "C:\cURL\curl.exe curl http://192.168.0.50:8080/CSrest/rest/dictionaries/onlinechecks/" + НомерЗаказаДляКассы + " --header ""Content-Type: application/json"" ";
	//	 			
	//	Shell = Новый COMОбъект("WScript.Shell");                                                                                                             //?istotal=true
	//	WshExec = Shell.Exec(Команда1);
	//	OutStream = WshExec.StdOut;	
	//		
	//	Str = "";
	//	Пока Не OutStream.AtEndOfStream Цикл
	//		Str = СокрЛП(OutStream.ReadLine());
	//	КонецЦикла;

	//	
	//	ЧтениеJSON = Новый ЧтениеJSON;
	//	ЧтениеJSON.УстановитьСтроку(Str);
	//	Ответ = ПрочитатьJSON(ЧтениеJSON);	
	//	ЧтениеJSON.Закрыть();
	//	
	//	ЗаказСсылка = РезультатЗапроса.Ссылка.ПолучитьОбъект();
	//	ЗаказСсылка.ЗаказТребуетВниманияМенеджера = ЛОЖЬ;

	//	
	//	Попытка
	//	    Если Ответ.state = "CLOSED" Тогда
	//			
	//			ЧтениеJSON = Новый ЧтениеJSON;
	//			ЧтениеJSON.УстановитьСтроку(Ответ.document);
	//			СтруктураЧек = ПрочитатьJSON(ЧтениеJSON);	
	//			ЧтениеJSON.Закрыть();
	//			
	//			Если СтруктураЧек.sum = РезультатЗапроса.СуммаДокумента Тогда
	//			
	//				
	//								
	//				ЗаказСсылка.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	//			
	//			Иначе
	//				ЗаказСсылка.ЗаказТребуетВниманияМенеджера = ИСТИНА;
	//			
	//			КонецЕсли; 			
	//			
	//			ЗаказСсылка.Записать(РежимЗаписиДокумента.Проведение);
	//				
	//		КонецЕсли; 
	//		
	//	
	//	Исключение
	//	
	//	КонецПопытки; 
	//	
	//	
	//КонецЦикла;

		

КонецПроцедуры
//
Процедура ПроверитьОплатуИнтернетЗаказа(Ссылка) Экспорт

	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ИнтернетЗаказРозничный.Ссылка КАК Ссылка,
	//	|	ИнтернетЗаказРозничный.Проведен КАК Проведен,
	//	|	ИнтернетЗаказРозничный.Статус КАК Статус,
	//	|	ИнтернетЗаказРозничный.НомерЗаказаДляКассы КАК НомерЗаказаДляКассы,
	//	|	ИнтернетЗаказРозничный.СуммаДокумента КАК СуммаДокумента
	//	|ИЗ
	//	|	Документ.ИнтернетЗаказРозничный КАК ИнтернетЗаказРозничный
	//	|ГДЕ
	//	|	ИнтернетЗаказРозничный.Проведен = ИСТИНА
	//	|	И ИнтернетЗаказРозничный.НомерЗаказаДляКассы <> """"
	//	|	И ИнтернетЗаказРозничный.Статус = &Статус
	//	|	И ИнтернетЗаказРозничный.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);

	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//
	//Пока РезультатЗапроса.Следующий() Цикл
	//	НомерЗаказаДляКассы = РезультатЗапроса.НомерЗаказаДляКассы;
	//	
	//	
	//	Команда1 = "C:\cURL\curl.exe curl http://192.168.0.50:8080/CSrest/rest/dictionaries/onlinechecks/" + НомерЗаказаДляКассы + " --header ""Content-Type: application/json"" ";
	//	 			
	//	Shell = Новый COMОбъект("WScript.Shell");                                                                                                             //?istotal=true
	//	WshExec = Shell.Exec(Команда1);
	//	OutStream = WshExec.StdOut;	
	//		
	//	Str = "";
	//	Пока Не OutStream.AtEndOfStream Цикл
	//		Str = СокрЛП(OutStream.ReadLine());
	//	КонецЦикла;

	//	
	//	ЧтениеJSON = Новый ЧтениеJSON;
	//	ЧтениеJSON.УстановитьСтроку(Str);
	//	Ответ = ПрочитатьJSON(ЧтениеJSON);	
	//	ЧтениеJSON.Закрыть();
	//	
	//	ЗаказСсылка = РезультатЗапроса.Ссылка.ПолучитьОбъект();
	//	ЗаказСсылка.ЗаказТребуетВниманияМенеджера = ЛОЖЬ;
	//	
	//	Попытка
	//	    Если Ответ.state = "CLOSED" Тогда
	//			
	//			ЧтениеJSON = Новый ЧтениеJSON;
	//			ЧтениеJSON.УстановитьСтроку(Ответ.document);
	//			СтруктураЧек = ПрочитатьJSON(ЧтениеJSON);	
	//			ЧтениеJSON.Закрыть();
	//			
	//			Если СтруктураЧек.sum = РезультатЗапроса.СуммаДокумента Тогда
	//								
	//				ЗаказСсылка.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	//			
	//			Иначе
	//				ЗаказСсылка.ЗаказТребуетВниманияМенеджера = ИСТИНА;
	//			
	//			КонецЕсли; 			
	//			
	//			ЗаказСсылка.Записать(РежимЗаписиДокумента.Проведение);
	//				
	//		КонецЕсли; 
	//		
	//	
	//	Исключение
	//	
	//	КонецПопытки; 
	//	
	//КонецЦикла;
	//
	
	
	////Проверка оплаты ЕРИП
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнтернетЗаказРозничный.Ссылка КАК Ссылка,
		|	ИнтернетЗаказРозничный.Проведен КАК Проведен,
		|	ИнтернетЗаказРозничный.Статус КАК Статус,
		|	ИнтернетЗаказРозничный.СуммаДокумента КАК СуммаДокумента,
		|	ИнтернетЗаказРозничный.НомерЕРИП КАК НомерЕРИП
		|ИЗ
		|	Документ.ИнтернетЗаказРозничный КАК ИнтернетЗаказРозничный
		|ГДЕ
		|	ИнтернетЗаказРозничный.Проведен = ИСТИНА
		//|	И ИнтернетЗаказРозничный.Статус = &Статус
		|	И ИнтернетЗаказРозничный.Ссылка = &Ссылка
		|	И ИнтернетЗаказРозничный.ФормаОплаты = &ФормаОплаты
		|	И ИнтернетЗаказРозничный.ПризнакОплатыСчета <> """"";
	
	//Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.КОтгрузке);
	Запрос.УстановитьПараметр("ФормаОплаты", Перечисления.ФормыОплаты.ЕРИП);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	ТокенЕРИП = "5e729f70f4b447e4a1b044ea08080ce5";
	Пока РезультатЗапроса.Следующий() Цикл
		НомерЕРИП = РезультатЗапроса.НомерЕРИП;
		
		
		ЗаписьJSON = Новый ЗаписьJSON;

			
		тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
		ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 
		
		
		МассивДанныхJSON = Новый Массив;
		//СтруктураДанныхJSON = Новый Структура; 
		
		
		тДанные = Новый Структура;                             
			тДанные.Вставить("token", ТокенЕРИП);
			тДанные.Вставить("invoiceNo", ""+НомерЕРИП+"");
		МассивДанныхJSON.Добавить(тДанные);
		
		//СтруктураДанныхJSON.Вставить("arrayProd", МассивДанныхJSON);
		
		ЗаписатьJSON(ЗаписьJSON, тДанные);
		СтрокаJS = ЗаписьJSON.Закрыть();
	
		
	Соединение = Новый HTTPСоединение(
        "api.express-pay.by", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        60, // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );
 
    ЗапросGET = Новый HTTPЗапрос("/v1/invoices/"+ СтрЗаменить(НомерЕРИП,Символы.НПП,"") + "?token=" + ТокенЕРИП);
	ЗапросGET.Заголовки.Вставить("Content-type", "application/json");
	ЗапросGET.УстановитьТелоИзСтроки(СтрокаJS);

 
                                             
 
   		Результат = Соединение.Получить(ЗапросGET);

		Если Результат.КодСостояния = 200 Тогда
			
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();

		
		ЗаказСсылка = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ЗаказСсылка.ПризнакОплатыСчета = ЛОЖЬ;
		ЗаказСсылка.ОплаченоСумма = 0;
		//ЗаказСсылка.ЗаказТребуетВниманияМенеджера = ЛОЖЬ;
		
		
		//Статус счета на оплату:
		//1 - Ожидает оплату
		//2 - Просрочен
		//3 - Оплачен 
		//4 - Оплачен частично
		//5 - Отменен  
		//6 - Оплачен с помощью банковской карты
		
		Попытка
			Если Ответ.Status = 3 ИЛИ Ответ.Status = 6 Тогда
				
				ЗаказСсылка.ПризнакОплатыСчета = ИСТИНА;	
				ЗаказСсылка.ОплаченоСумма = Ответ.Amount;
				ЗаказСсылка.Записать(РежимЗаписиДокумента.Проведение);
					
			КонецЕсли; 
			
		
		Исключение
		
		КонецПопытки;
		
		Иначе
			Сообщить("Не удалось получить данные об оплате с портала Экспрес платежей. Ошибка " + Результат.КодСостояния);
		КонецЕсли;
	
	КонецЦикла;
	
	
	
	
	///////Проверка Интернет оплаты
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнтернетЗаказРозничный.Ссылка КАК Ссылка,
		|	ИнтернетЗаказРозничный.Проведен КАК Проведен,
		|	ИнтернетЗаказРозничный.Статус КАК Статус,
		|	ИнтернетЗаказРозничный.СуммаДокумента КАК СуммаДокумента,
		|	ИнтернетЗаказРозничный.НомерЕРИП КАК НомерЕРИП,
		|	ИнтернетЗаказРозничный.ФормаОплаты КАК ФормаОплаты
		|ИЗ
		|	Документ.ИнтернетЗаказРозничный КАК ИнтернетЗаказРозничный
		|ГДЕ
		|	ИнтернетЗаказРозничный.Проведен = ИСТИНА
		|	И ИнтернетЗаказРозничный.НомерЕРИП <> """"
		|	И ИнтернетЗаказРозничный.ПризнакОплатыСчета <> """"
		|	И ИнтернетЗаказРозничный.ФормаОплаты = &ФормаОплаты
		|	И ИнтернетЗаказРозничный.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ФормаОплаты", Перечисления.ФормыОплаты.ИнтернетОплата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	ТокенЕРИП = "5e729f70f4b447e4a1b044ea08080ce5";
	Пока РезультатЗапроса.Следующий() Цикл
		НомерЕРИП = РезультатЗапроса.НомерЕРИП;
		
		
		ЗаписьJSON = Новый ЗаписьJSON;

			
		тПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);  
		ЗаписьJSON.УстановитьСтроку(тПараметрыJSON); 
		
		
		МассивДанныхJSON = Новый Массив;
		//СтруктураДанныхJSON = Новый Структура; 
		
		
		тДанные = Новый Структура;                             
			тДанные.Вставить("token", ТокенЕРИП);
			тДанные.Вставить("CardInvoiceNo", ""+НомерЕРИП+"");
		МассивДанныхJSON.Добавить(тДанные);
		
		//СтруктураДанныхJSON.Вставить("arrayProd", МассивДанныхJSON);
		
		ЗаписатьJSON(ЗаписьJSON, тДанные);
		СтрокаJS = ЗаписьJSON.Закрыть();
	
		
	Соединение = Новый HTTPСоединение(
        "api.express-pay.by", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        60, // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );
 
    ЗапросGET = Новый HTTPЗапрос("/v1/cardinvoices/"+ СтрЗаменить(НомерЕРИП,Символы.НПП,"") + "/status?token=" + ТокенЕРИП);
	ЗапросGET.Заголовки.Вставить("Content-type", "application/json");
	ЗапросGET.УстановитьТелоИзСтроки(СтрокаJS);

    Результат = Соединение.Получить(ЗапросGET);

	ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();

		ЗаказСсылка = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ЗаказСсылка.ПризнакОплатыСчета = ЛОЖЬ;
		//ЗаказСсылка.ЗаказТребуетВниманияМенеджера = ЛОЖЬ;
		
		
		//Статус счета на оплату:
		//Состояние оплаты:
		//0 - Счет зарегистрирован, но не оплачен
		//1 - Предавторизованная сумма захолдирована (для двухстадийных платежей)
		//2 - Проведена полная авторизация суммы счета
		//3 - Авторизация отменена
		//4 - По транзакции была проведена операция возврата
		//5 - Инициирована авторизация через ACS банка-эмитента
		//6 - Авторизация отклонена
		
		Попытка
		    Если Ответ.CardInvoiceStatus = 2 Тогда
				ЗаказСсылка.ОплаченоСумма = Ответ.Amount;
				ЗаказСсылка.ПризнакОплатыСчета = ИСТИНА;	
				ЗаказСсылка.Записать(РежимЗаписиДокумента.Проведение);
					
			КонецЕсли; 
			
		
		Исключение
		
		КонецПопытки; 

	КонецЦикла;
	


КонецПроцедуры
//


/////////////////////////////////////////////////////////////////////////////

Функция ПолучитьСклад(Номенклатура)

	 Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Ссылка КАК Ссылка,
				|	Номенклатура.Родитель КАК Родитель,
				|	Номенклатура.Родитель.Склад КАК РодительСклад
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Номенклатура);
			
			РезЗпр = Запрос.Выполнить().Выбрать();
			
			Пока РезЗпр.Следующий() Цикл
				ТоварСклад = РезЗпр.РодительСклад;
			КонецЦикла;   
			
			//jadmin 26082025 Cклад3опт
			Если Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000013") Тогда			
				ТоварСклад = Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА);			
			КонецЕсли;

	Возврат ТоварСклад
КонецФункции // ПолучитьСклад() 
//
Функция ПолучитьЦену(Номенклатура)

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",Истина);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
		|	И ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	Пока РезультатЗапроса.Следующий() Цикл
		Цена = РезультатЗапроса.Цена;
	КонецЦикла;
	
	Возврат Цена	

КонецФункции // ПолучитьЦену(Номенклатура)
//
Функция ПолучитьЦенуРозница(Номенклатура)
	
	ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",Истина);	
	
	//jadmin 10-01-2023 вытянул выше. старый запрос закомментировал
		Цена = 0;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
			|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
			|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЗаказа, ) КАК ЦеныНоменклатурыСрезПоследних
			|ГДЕ
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
			|	И ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
		Запрос.УстановитьПараметр("ДатаЗаказа", ТекущаяДата());
		
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();	
		
		Пока РезультатЗапроса.Следующий() Цикл
			Цена = РезультатЗапроса.Цена;
		КонецЦикла;
		
		Возврат Цена
	
	//
	//Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(Номенклатура,ТекущаяДата()) = ЛОЖЬ Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	//		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
	//		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	//		|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
	//		|ИЗ
	//		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаЗаказа, ) КАК ЦеныНоменклатурыСрезПоследних
	//		|ГДЕ
	//		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
	//		|	И ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
	//	
	//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	//	Запрос.УстановитьПараметр("ДатаЗаказа", ТекущаяДата());
	//	
	//	
	//	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	//	
	//	Пока РезультатЗапроса.Следующий() Цикл
	//		Цена = РезультатЗапроса.Цена;
	//	КонецЦикла;
	//	
	//	Возврат Цена
	//	
	//Иначе
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
	//	|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор КАК Регистратор,
	//	|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
	//	|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
	//	|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
	//	|ИЗ
	//	|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
	//	|ГДЕ
	//	|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
	//	|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена <> 0
	//	|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Цена УБЫВ";
	//	
	//	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//	//Запрос.УстановитьПараметр("Серия", Серия);
	//	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	//	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	//	
	//	//РезультатЗапроса = Запрос.Выполнить();
	//	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//	
	//	
	//	Если РезультатЗапроса.Следующий() Тогда
	//		Возврат РезультатЗапроса.Цена;
	//	Иначе 
	//		Возврат 0;
	//	КонецЕсли; 
	//	
	//КонецЕсли;
	
КонецФункции // ПолучитьЦену(Номенклатура)
//
Функция ПолучитьКлиента(Партнер)
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Партнер КАК Партнер
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	Пока РезультатЗапроса.Следующий() Цикл
		Клиент = РезультатЗапроса.Ссылка;
	КонецЦикла;
	
	Возврат Клиент
	

КонецФункции // ПолучитьКлиента()
//
Функция ПолучитьСкладМагазин(ЗначениеСклад)
	
	Склад = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка,
		|	Склады.СВ_КодМагазин КАК СВ_КодМагазин
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.СВ_КодМагазин = &СВ_КодМагазин";
	
	Запрос.УстановитьПараметр("СВ_КодМагазин", ЗначениеСклад);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	

	Пока РезультатЗапроса.Следующий() Цикл
		Склад = РезультатЗапроса.Ссылка;
	КонецЦикла;
	
	Возврат Склад;	

КонецФункции // ()
//
&НаСервере
Функция ПроверитьСозданногоКлиента(АдресЭП)

	КлиентСоздан = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	КонтрагентыКонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.АдресЭП = &АдресЭП";
	
	Запрос.УстановитьПараметр("АдресЭП", АдресЭП);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
	     КлиентСоздан = Истина;
	КонецЕсли; 
	 
	Возврат КлиентСоздан;
	

КонецФункции // ()
//	
&НаСервере
Функция ПолучитьФорматированныйДокОписание(ТекОбъект)  Экспорт
    РезультатВыгрузки = "";
	ТекстХТМЛ = "";

    //проверим есть ли описание объекта в базе
    ФорматированныйДокумент = ТекОбъект.ОписаниеДляСайта.Получить();
    Если ФорматированныйДокумент = Неопределено Тогда
        РезультатВыгрузки = "   У данного объекта не определено описание. Выгрузка объекта остановлена";
        Возврат ТекстХТМЛ;
    КонецЕсли;

	ТекстСтрока = ФорматированныйДокумент.ПолучитьТекст();
	ТекстСтрока = СтрЗаменить(ТекстСтрока,Символы.ПС,"");
	ТекстСтрока = СтрЗаменить(ТекстСтрока,Символы.НПП,"");
	ТекстСтрока = СтрЗаменить(ТекстСтрока," ","");
	
	Если ТекстСтрока = "" Тогда	
		Возврат ТекстХТМЛ;
	КонецЕсли; 
	
 	СтруктураКартинок = Новый Структура;
	ФорматированныйДокумент.ПолучитьHTML(ТекстХТМЛ, СтруктураКартинок);

	////Выгрузка картинок и корректировка ХТМЛ  //jadmin откл
	Для Каждого ТекКартинка Из СтруктураКартинок Цикл
	    ИмяТемпФайла = ПолучитьИмяВременногоФайла();
	    ТекКартинка.Значение.Записать(ИмяТемпФайла);
	    ФорматТекущейКартинки = Строка(ТекКартинка.Значение.Формат());
	    Если Не ФорматТекущейКартинки = ФорматКартинки.НеизвестныйФормат Тогда
	        ФорматТекущейКартинкиСтрока = Строка(ФорматТекущейКартинки);
	        ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,ТекКартинка.Ключ,ТекКартинка.Ключ+ "." + ФорматТекущейКартинкиСтрока);
			//ФТП.Записать(ИмяТемпФайла, ТекКартинка.Ключ+ "." + ФорматТекущейКартинкиСтрока);
	        РезультатВыгрузки = РезультатВыгрузки + Символы.ПС + "   Записан файл " + ТекКартинка.Ключ+ "." + ФорматТекущейКартинкиСтрока;
	    Иначе
			//ФТП.Записать(ИмяТемпФайла, ТекКартинка.Ключ);
	        РезультатВыгрузки = РезультатВыгрузки + Символы.ПС + "   Записан файл " + ТекКартинка.Ключ;
		КонецЕсли;
		
		Попытка
		   УдалитьФайлы(ИмяТемпФайла);
		Исключение
		   ЗаписьЖурналаРегистрации(НСтр("ru = 'ВыгрузкаКартинокНаСайт.Действие'"), УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	///

	//ВыгрузкаХТМЛ
	//ИмяТемпФайла = ПолучитьИмяВременногоФайла("html");
	//ФайлHТМЛ = Новый ТекстовыйДокумент;
	ИскомоеЗначение = СтрНайти(ТекстХТМЛ, "<body>")+7; // 386+6 исключаем само слово
	ИскомоеЗначение2 = СтрНайти(ТекстХТМЛ, "</body>")-1; //677
	ДлинаСтроки = СтрДлина(ТекстХТМЛ);
	ТекстХТМЛ = Сред(ТекстХТМЛ,ИскомоеЗначение,ИскомоеЗначение2-ИскомоеЗначение);
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ,Символы.ПС,"");

	//ФайлHТМЛ.ДобавитьСтроку(ТекстХТМЛ);
	//ФайлHТМЛ.Записать(ИмяТемпФайла);

	////Собственно запись хтмл
	//ФТП.Записать(ИмяТемпФайла, ИмяКаталогаОбъекта + ".html");
	//РезультатВыгрузки = РезультатВыгрузки + Символы.ПС + "   Записан файл " + ИмяКаталогаОбъекта + ".html";

    Возврат ТекстХТМЛ;
КонецФункции   
///  для апи
&НаСервере
Функция УстановитьСтатусНаСайтеОбработан(ИДЗаказа)
	
	
	//Соединение = Новый HTTPСоединение(
	//    "test.msso", // сервер (хост)
	//    80, // порт, по умолчанию для http используется 80, для https 443
	//    , // пользователь для доступа к серверу (если он есть)
	//    , // пароль для доступа к серверу (если он есть)
	//    , // здесь указывается прокси, если он есть
	//    , // таймаут в секундах, 0 или пусто - не устанавливать
	//   
	//);

	
	Соединение = Новый HTTPСоединение(
	    "www.msso.by", // сервер (хост)
	    443, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    60, // таймаут в секундах, 0 или пусто - не устанавливать
	   Новый ЗащищенноеСоединениеOpenSSL()
	);

	ТОКЕН = "dFk9M6R2NwIKsfc8bCnjvHXt";
	
	ЗапросPUT = Новый HTTPЗапрос("/api/item/" + ИДЗаказа);
	ЗапросPUT.Заголовки.Вставить("Content-type", "application/x-www-form-urlencoded");
	ЗапросPUT.Заголовки.Вставить("X-API-KEY", ТОКЕН);
	
	
	тДанные = "status=1";
	
	ЗапросPUT.УстановитьТелоИзСтроки(тДанные);

	Результат = Соединение.ВызватьHTTPМетод("PUT",ЗапросPUT);

	Если Результат.КодСостояния = 200 Тогда

		//Сообщить("Все ок");
	
	КонецЕсли; 
			
		
КонецФункции
//   для апи
&НаСервере
Функция УстановитьСтатусНаСайтеОбработан_ОПТ(ИДЗаказа)
	
	
	//Соединение = Новый HTTPСоединение(
	//    "test.msso", // сервер (хост)
	//    80, // порт, по умолчанию для http используется 80, для https 443
	//    , // пользователь для доступа к серверу (если он есть)
	//    , // пароль для доступа к серверу (если он есть)
	//    , // здесь указывается прокси, если он есть
	//    , // таймаут в секундах, 0 или пусто - не устанавливать
	//   
	//);

	
	Соединение = Новый HTTPСоединение(
	    "www.msso.by", // сервер (хост)
	    443, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    60, // таймаут в секундах, 0 или пусто - не устанавливать
	   Новый ЗащищенноеСоединениеOpenSSL()
	);

	ТОКЕН = "dFk9M6R2NwIKsfc8bCnjvHXt";
	
	ЗапросPUT = Новый HTTPЗапрос("/api/itemopt/" + ИДЗаказа);
	ЗапросPUT.Заголовки.Вставить("Content-type", "application/x-www-form-urlencoded");
	ЗапросPUT.Заголовки.Вставить("X-API-KEY", ТОКЕН);
	
	
	тДанные = "status=1";
	
	ЗапросPUT.УстановитьТелоИзСтроки(тДанные);

	Результат = Соединение.ВызватьHTTPМетод("PUT",ЗапросPUT);

	Если Результат.КодСостояния = 200 Тогда

		//Сообщить("Все ок");
	
	КонецЕсли; 
			
		
КонецФункции
//   для апи

&НаСервере
Функция РазложитьСтрокуНаПодстроки(ВходящаяСтрока, Разделитель)
						   
	МассивСтрок = Новый Массив();
	ВходящаяСтрока = СтрЗаменить(ВходящаяСтрока, Разделитель, Символы.ПС);
	
	Для ИндексСтроки = 1 По СтрЧислоСтрок(ВходящаяСтрока) Цикл
		Подстрока = СтрПолучитьСтроку(ВходящаяСтрока, ИндексСтроки);
		МассивСтрок.Добавить(Подстрока);
	КонецЦикла;
	
	Возврат МассивСтрок;

КонецФункции 
///
Процедура ПроверитьПромокод(ПромоКод,ПромоКодПроцент)
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	ФормированиеРозничныхСкидок.Ссылка КАК Ссылка,
	|	ФормированиеРозничныхСкидок.Скидка КАК Скидка,
	|	ФормированиеРозничныхСкидок.ПроцентСкидки КАК ПроцентСкидки,
	|	ФормированиеРозничныхСкидок.Статус КАК Статус,
	|	ФормированиеРозничныхСкидок.НазваниеСкидки КАК НазваниеСкидки,
	|	ФормированиеРозничныхСкидок.Промокод КАК Промокод
	|ИЗ
	|	Документ.ФормированиеРозничныхСкидок КАК ФормированиеРозничныхСкидок
	|ГДЕ
	|	ФормированиеРозничныхСкидок.Промокод = &ПромоКод
	|	И ФормированиеРозничныхСкидок.Скидка = &Скидка
	|	И ФормированиеРозничныхСкидок.Проведен = ИСТИНА
	|	И &ДатаДок МЕЖДУ ФормированиеРозничныхСкидок.НачалоДействия И ФормированиеРозничныхСкидок.ОкончаниеДействия";
	
	Запрос1.УстановитьПараметр("Скидка", Справочники.РозничныеСкидки_МССО.НайтиПоКоду("000000004")); //Промокод
	Запрос1.УстановитьПараметр("ДатаДок", ТекущаяДата());
	Запрос1.УстановитьПараметр("ПромоКод", СокрЛП(ПромоКод));
	
	РезЗпр = Запрос1.Выполнить().Выбрать();
	
	Если РезЗпр.Количество()=0 Тогда
		
		Результат = ПроверитьРазовыйПромокод(ПромоКод);
		Если Результат = 0 Тогда
			
			МенеджерЗаписей = РегистрыСведений.ПромокодыРазовые.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписей.Промокод = ПромоКод;
			МенеджерЗаписей.ПроцентСкидки = ПромоКодПроцент;
			МенеджерЗаписей.Записать();
			
		КонецЕсли; 
	КонецЕсли;
	
 
				 
КонецПроцедуры
			 
Функция ПроверитьРазовыйПромокод(Промокод)
				 ПроцентСкидки = 0;
				 
				 Запрос = Новый Запрос;
				 Запрос.Текст = 
				 "ВЫБРАТЬ
				 |	ПромокодыРазовые.Промокод КАК Промокод,
				 |	ПромокодыРазовые.ПроцентСкидки КАК ПроцентСкидки
				 |ИЗ
				 |	РегистрСведений.ПромокодыРазовые КАК ПромокодыРазовые
				 |ГДЕ
				 |	ПромокодыРазовые.Промокод = &Промокод";
				 
				 Запрос.УстановитьПараметр("Промокод", Промокод);
				 
				 РезультатЗапроса = Запрос.Выполнить();
				 
				 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				 
				 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					 ПроцентСкидки = ВыборкаДетальныеЗаписи.ПроцентСкидки;
				 КонецЦикла;
				 
				 Возврат ПроцентСкидки;
				 
			 КонецФункции // ()
			 


///ЕвроПочта АПИ
Процедура ОбновитьДанныеОПСЕвропочта() Экспорт
	Логин = "600052664_Chernjak";
	Пароль = "523H7I8OBAJGMJ1";
	СерийныйНомер = "D9C11951-F450-48E7-80C7-A42F7FE0D8AA";
	
	Токен = ПолучитьТокенЕвропочты(Логин,Пароль,СерийныйНомер);
	Если Токен <> Неопределено Тогда
	
		ПолучитьОПСЕвропочты(Токен,СерийныйНомер);
	    СформироватьФайлОПС();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьТокенЕвропочты(Логин,Пароль,СерийныйНомер)

	Соединение = Новый HTTPСоединение(          
	    "api.eurotorg.by", // сервер (хост)
	    10352, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    , // таймаут в секундах, 0 или пусто - не устанавливать
	   Новый ЗащищенноеСоединениеOpenSSL()
	);
	
	ЗапросPOST = Новый HTTPЗапрос("/Json");
	ЗапросPOST.Заголовки.Вставить("Content-type", "application/json");
	//ЗапросPOST.Заголовки.Вставить("X-API-KEY", ТОКЕН);

	ПутьДляСохраненияФайла = "\\Vsrv-1c8\data_exchange_1c83\";
	ИмяФайла = ПутьДляСохраненияФайла +"tokenEUROPOST.txt";
	
	ТекстФайл = Новый ТекстовыйДокумент;
	ТекстФайл.Записать(ИмяФайла); 
			
		ЗаписьJSON = Новый ЗаписьJSON;
		
		ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьJSON.ОткрытьФайл(ИмяФайла,,,ПараметрыЗаписиJSON);
		//ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
			ЗаписьJSON.ЗаписатьИмяСвойства("CRC");
			ЗаписьJSON.ЗаписатьЗначение("");
			
			ЗаписьJSON.ЗаписатьИмяСвойства("Packet");               


				////Строка
				//ЗаписьJSON.ЗаписатьЗначение("Значение строка");
				//
				////Число
				//ЗаписьJSON.ЗаписатьЗначение(12.345, Истина);
				//
				////Булево
				//ЗаписьJSON.ЗаписатьЗначение(Истина);
								
					ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
						ЗаписьJSON.ЗаписатьИмяСвойства("JWT");
						ЗаписьJSON.ЗаписатьЗначение("null");
						
						ЗаписьJSON.ЗаписатьИмяСвойства("MethodName");
						ЗаписьJSON.ЗаписатьЗначение("GetJWT");
						
						ЗаписьJSON.ЗаписатьИмяСвойства("ServiceNumber");
						ЗаписьJSON.ЗаписатьЗначение(""+СерийныйНомер+"");

						ЗаписьJSON.ЗаписатьИмяСвойства("Data");               

							ЗаписьJSON.ЗаписатьНачалоОбъекта();

								ЗаписьJSON.ЗаписатьИмяСвойства("LoginName");
								ЗаписьJSON.ЗаписатьЗначение(""+Логин+"");
								
								ЗаписьJSON.ЗаписатьИмяСвойства("Password");
								ЗаписьJSON.ЗаписатьЗначение(""+Пароль+"");
								
								ЗаписьJSON.ЗаписатьИмяСвойства("LoginNameTypeId");
								ЗаписьJSON.ЗаписатьЗначение("1");

							ЗаписьJSON.ЗаписатьКонецОбъекта();
	 						
					ЗаписьJSON.ЗаписатьКонецОбъекта();
					
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		ЗаписьJSON.Закрыть();
		
	ДанныеТела = Новый ДвоичныеДанные(ИмяФайла);
   	ЗапросPOST.УстановитьТелоИзДвоичныхДанных(ДанныеТела);

	Результат = Соединение.ВызватьHTTPМетод("POST",ЗапросPOST);

	Токен = Неопределено;
	
	Если Результат.КодСостояния = 200 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();

		Если Ответ.Количество() > 0 Тогда
			Токен = Ответ.Table[0].JWT;
		КонецЕсли; 
		
		Файл = Новый Файл(ИмяФайла);
		Если Файл.Существует() Тогда
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;
	Иначе
		Сообщить("Ошибка соединения с сайтом "+ Результат.КодСостояния);
	КонецЕсли;		

	Возврат Токен;
КонецФункции // ()

&НаСервере 
Процедура ПолучитьОПСЕвропочты(Токен,СерийныйНомер)

	Соединение = Новый HTTPСоединение(          
	    "api.eurotorg.by", // сервер (хост)
	    10352, // порт, по умолчанию для http используется 80, для https 443
	    , // пользователь для доступа к серверу (если он есть)
	    , // пароль для доступа к серверу (если он есть)
	    , // здесь указывается прокси, если он есть
	    , // таймаут в секундах, 0 или пусто - не устанавливать
	   Новый ЗащищенноеСоединениеOpenSSL()
	);
	
	ЗапросPOST = Новый HTTPЗапрос("/Json");
	ЗапросPOST.Заголовки.Вставить("Content-type", "application/json");
	//ЗапросPOST.Заголовки.Вставить("X-API-KEY", ТОКЕН);

	ПутьДляСохраненияФайла = "\\Vsrv-1c8\data_exchange_1c83\";
	ИмяФайла = ПутьДляСохраненияФайла +"OPSEUROPOST.txt";
	
	ТекстФайл = Новый ТекстовыйДокумент;
	ТекстФайл.Записать(ИмяФайла); 
			
		ЗаписьJSON = Новый ЗаписьJSON;
		
		ЗаписьJSON.ПроверятьСтруктуру = Ложь;
		
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
		ЗаписьJSON.ОткрытьФайл(ИмяФайла,,,ПараметрыЗаписиJSON);
		//ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);	
		
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
			ЗаписьJSON.ЗаписатьИмяСвойства("CRC");
			ЗаписьJSON.ЗаписатьЗначение("");
			
			ЗаписьJSON.ЗаписатьИмяСвойства("Packet");               


				////Строка
				//ЗаписьJSON.ЗаписатьЗначение("Значение строка");
				//
				////Число
				//ЗаписьJSON.ЗаписатьЗначение(12.345, Истина);
				//
				////Булево
				//ЗаписьJSON.ЗаписатьЗначение(Истина);
								
					ЗаписьJSON.ЗаписатьНачалоОбъекта();
				
						ЗаписьJSON.ЗаписатьИмяСвойства("JWT");
						ЗаписьJSON.ЗаписатьЗначение(""+Токен+"");
						
						ЗаписьJSON.ЗаписатьИмяСвойства("MethodName");
						ЗаписьJSON.ЗаписатьЗначение("Postal.OfficesOut");
						
						ЗаписьJSON.ЗаписатьИмяСвойства("ServiceNumber");
						ЗаписьJSON.ЗаписатьЗначение(""+СерийныйНомер+"");

						ЗаписьJSON.ЗаписатьИмяСвойства("Data");               

							ЗаписьJSON.ЗаписатьНачалоОбъекта();
							ЗаписьJSON.ЗаписатьКонецОбъекта();
	 						
					ЗаписьJSON.ЗаписатьКонецОбъекта();
					
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		ЗаписьJSON.Закрыть();
		
	ДанныеТела = Новый ДвоичныеДанные(ИмяФайла);
   	ЗапросPOST.УстановитьТелоИзДвоичныхДанных(ДанныеТела);

	Результат = Соединение.ВызватьHTTPМетод("POST",ЗапросPOST);

	Токен = Неопределено;
	
	Если Результат.КодСостояния = 200 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();

		Если Ответ.Количество() > 0 Тогда
			
			НаборЗаписей = РегистрыСведений.ЕвроПочтаОПС.СоздатьНаборЗаписей();
			НаборЗаписей.Записать();  //очистка РС
			
			Для каждого стр Из Ответ.Table Цикл
								
			    НаборЗаписей = РегистрыСведений.ЕвроПочтаОПС.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИД_ОПС.Установить(стр.WarehouseId);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество()>0 Тогда
				  	Для каждого элНабор Из НаборЗаписей Цикл
					    элНабор.Наименование_ОПС = стр.WarehouseName;
						элНабор.Longitude = стр.Longitude;
						элНабор.Latitude = стр.Latitude;
						элНабор.ИД_Области = стр.Address7Id;
						элНабор.Наименование_Области = стр.Address7Name;
						элНабор.ПризнакНовое = стр.isNew;
						элНабор.Примечание = стр.Note;
					КонецЦикла; 
					НаборЗаписей.Записать();
				Иначе
					МенеджерЗаписи = РегистрыСведений.ЕвроПочтаОПС.СоздатьМенеджерЗаписи();
					
					МенеджерЗаписи.ИД_ОПС = стр.WarehouseId;
					МенеджерЗаписи.Наименование_ОПС = стр.WarehouseName;
					МенеджерЗаписи.Longitude = стр.Longitude;
					МенеджерЗаписи.Latitude = стр.Latitude;
					МенеджерЗаписи.ИД_Области = стр.Address7Id;
					МенеджерЗаписи.Наименование_Области = стр.Address7Name;
					МенеджерЗаписи.ПризнакНовое = стр.isNew;
					МенеджерЗаписи.Примечание = стр.Note;

					МенеджерЗаписи.Записать();	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли; 
		
		Файл = Новый Файл(ИмяФайла);
		Если Файл.Существует() Тогда
			УдалитьФайлы(ИмяФайла);
		КонецЕсли;
	Иначе
		Сообщить("Ошибка соединения с сайтом "+ Результат.КодСостояния);
	КонецЕсли;		
	
КонецПроцедуры // ()

&НаСервере
Процедура СформироватьФайлОПС()
	
	Путь = ПолучитьПуть();
	КаталогВыгрузки = ""+сокрлп(Путь)+"OPS_Europost.csv";
		
	// записываем в файл с символами BOM в начале файле	
	ТекстовыйФайлUTF8_Bom = Новый ТекстовыйДокумент();
	
	СтрокаФайла = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕвроПочтаОПС.ИД_ОПС КАК ИД_ОПС,
	|	ЕвроПочтаОПС.Наименование_ОПС КАК Наименование_ОПС,
	|	ЕвроПочтаОПС.Longitude КАК Longitude,
	|	ЕвроПочтаОПС.Latitude КАК Latitude,
	|	ЕвроПочтаОПС.ИД_Области КАК ИД_Области,
	|	ЕвроПочтаОПС.Наименование_Области КАК Наименование_Области,
	|	ЕвроПочтаОПС.ПризнакНовое КАК ПризнакНовое,
	|	ЕвроПочтаОПС.Примечание КАК Примечание
	|ИЗ
	|	РегистрСведений.ЕвроПочтаОПС КАК ЕвроПочтаОПС";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
		
		Пока РезультатЗапроса.Следующий() Цикл
			ИД_ОПС="";
			Наименование_ОПС = "";
			Longitude = 0;
			Latitude = 0;
			ИД_Области = "";

			////Записываем строчку в файл	Пустую строку для обхода ошибки при импорте mysql
			Если СтрокаФайла = 1 Тогда
				СтрСтрокаФайла = 99999;
				СтрСтрокаФайла = СтрЗаменить(СтрСтрокаФайла,Символы.НПП,"");
				
				СтрокаТекст = "'"+СтрСтрокаФайла + "';'" +Строка(Наименование_ОПС)+"';'"+Строка(ИД_Области)+"';";
				
				СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
				ТекстовыйФайлUTF8_Bom.ДобавитьСтроку(СтрокаТекст);			
			КонецЕсли; 
		
			ИД_ОПС=РезультатЗапроса.ИД_ОПС;
			Наименование_ОПС = РезультатЗапроса.Наименование_ОПС;
			Longitude = РезультатЗапроса.Longitude;
			Latitude = РезультатЗапроса.Latitude;
			ИД_Области = РезультатЗапроса.ИД_Области;

			////Записываем строчку в файл	
			СтрокаФайла = СтрокаФайла + 1;	
			СтрСтрокаФайла = СтрЗаменить(СтрокаФайла,Символы.НПП,"");
			
			СтрокаТекст = "'"+СтрСтрокаФайла + "';'" +Строка(Наименование_ОПС)+"';'"+Строка(ИД_Области)+"';";
			
			СтрокаТекст = СтрЗаменить(СтрокаТекст,Символы.НПП,"");
			ТекстовыйФайлUTF8_Bom.ДобавитьСтроку(СтрокаТекст);	
		КонецЦикла;
		
	ТекстовыйФайлUTF8_Bom.Записать(КаталогВыгрузки,"UTF-8");
	
	// открываем файл и считываем символы после символов BOM
	Данные = Новый ДвоичныеДанные(КаталогВыгрузки);
	Строка64=Base64Строка(Данные);
	Строка64=Прав(Строка64,СтрДлина(Строка64)-4);
	ДанныеНаЗапись=Base64Значение(Строка64);
	ДанныеНаЗапись.Записать(КаталогВыгрузки); // записываем
	//Сообщить("Выгрузка завершена.");

	
КонецПроцедуры
////Конец ЕвроПочта АПИ


///////////////////////
//Установка признака популярные товары
&НаСервере
Процедура УстановкаПризнакаНоменклатуреПопулярный()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппаДляСайта.Ссылка КАК Ссылка,
		|	ГруппаДляСайта.ПометкаУдаления КАК ПометкаУдаления,
		|	ГруппаДляСайта.Код КАК Код,
		|	ГруппаДляСайта.Наименование КАК Наименование,
		|	ГруппаДляСайта.МинКолВоДляОтбораПопулярных КАК МинКолВоДляОтбораПопулярных
		|ИЗ
		|	Справочник.ГруппаДляСайта КАК ГруппаДляСайта
		|ГДЕ
		|	ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
		|	И ГруппаДляСайта.Родитель = ЗНАЧЕНИЕ(Справочник.ГруппаДляСайта.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		
		МинКолВоДляОтбораПопулярных = РезультатЗапроса.МинКолВоДляОтбораПопулярных;
		
		Запрос1 = Новый Запрос;
		Запрос1.УстановитьПараметр("ОсновнаяГруппа",РезультатЗапроса.Ссылка);
		Запрос1.УстановитьПараметр("ТипСклада",Перечисления.ТипыСкладов.РозничныйМагазин);
		Запрос1.УстановитьПараметр("ДатаНач",ТекущаяДата()-86400*15);
		Запрос1.УстановитьПараметр("ДатаКон",ТекущаяДата()-86400*1);
		
		Запрос1.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот) КАК СуммаВыручкиОборот,
			|	СУММА(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот) КАК Количество,
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.Ссылка КАК АналитикаУчетаНоменклатурыНоменклатураСсылка,
			|	ГруппыДляСайта.ГруппаДляСайта КАК ГруппаДляСайта
			|ИЗ
			|	РегистрСведений.ГруппыДляСайта КАК ГруппыДляСайта
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНач, &ДатаКон, , ) КАК ВыручкаИСебестоимостьПродажОбороты
			|		ПО (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура = ГруппыДляСайта.Номенклатура)
			|ГДЕ
			|	ВыручкаИСебестоимостьПродажОбороты.Склад.ТипСклада = &ТипСклада
			|	И ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.НеВыгружатьНаСайт = ЛОЖЬ
			|	И ГруппыДляСайта.ОсновнаяГруппа = ИСТИНА
			|	И ГруппыДляСайта.ГруппаДляСайта.ПометкаУдаления = ЛОЖЬ
			|	И ГруппыДляСайта.Номенклатура.ПометкаУдаления = ЛОЖЬ
			|	И ГруппыДляСайта.ГруппаДляСайта В ИЕРАРХИИ(&ОсновнаяГруппа)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура.Ссылка,
			|	ГруппыДляСайта.ГруппаДляСайта
			|
			|УПОРЯДОЧИТЬ ПО
			|	Количество УБЫВ";
		
		РезЗпр = Запрос1.Выполнить().Выгрузить();
		
		Если РезЗпр.Количество()> 0 Тогда
			Если РезЗпр.Итог("Количество") >= МинКолВоДляОтбораПопулярных Тогда
			
				ТоварыКолВо = Окр(РезЗпр.Количество() * 20/100, 0) - 1;
				Для i=0 По ТоварыКолВо Цикл
									
					//записываем в регистр
					МенеджерЗаписи = РегистрыСведений.ПопулярныеТовары.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Период = ТекущаяДата();
					МенеджерЗаписи.Номенклатура = РезЗпр[i].АналитикаУчетаНоменклатурыНоменклатураСсылка;
					МенеджерЗаписи.ТекущийПопулярный = Истина;
					МенеджерЗаписи.Записать();
				
				КонецЦикла;
			Иначе
				Продолжить;	
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
////

&НаСервере
Процедура УбратьПризнакПопулярный() 

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПопулярныеТоварыСрезПоследних.Период КАК Период,
		|	ПопулярныеТоварыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ПопулярныеТоварыСрезПоследних.ТекущийПопулярный КАК ТекущийПопулярный
		|ИЗ
		|	РегистрСведений.ПопулярныеТовары.СрезПоследних КАК ПопулярныеТоварыСрезПоследних
		|ГДЕ
		|	ПопулярныеТоварыСрезПоследних.ТекущийПопулярный = ИСТИНА";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
		  Набор = РегистрыСведений.ПопулярныеТовары.СоздатьНаборЗаписей();
		  Набор.Отбор.Номенклатура.Установить(ВыборкаДетальныеЗаписи.Номенклатура);
		  Набор.Отбор.Период.Установить(ВыборкаДетальныеЗаписи.Период);
	  	  Набор.Прочитать();
		  
		  Для Каждого Запись Из Набор Цикл
			  Запись.ТекущийПопулярный = ЛОЖЬ;
		  КонецЦикла;

		  Набор.Записать();

	КонецЦикла;
	
КонецПроцедуры
////


Процедура УстановитьСнятьПризнакНовинкаНоменклатуре()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Объект КАК Объект,
		|	ВерсииОбъектов.НомерВерсии КАК НомерВерсии,
		|	ВерсииОбъектов.ДатаВерсии КАК ДатаВерсии,
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.ПризнакНовинка КАК ПризнакНовинка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|		ПО (ВерсииОбъектов.Объект = Номенклатура.Ссылка)
		|ГДЕ
		|	ВерсииОбъектов.НомерВерсии = 1
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоменклатураСсылка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ПризнакНовинкаНоменклатуры = ВыборкаДетальныеЗаписи.ПризнакНовинка;
		
		ПризнакНовинка = ЛОЖЬ;
		Если ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")   //1.1.1.  Овощные культуры (пакетированные)
			ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003") //1.1.2.  Цветочные культуры (пакетированные)
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")   //1.1.1.  Овощные культуры (пакетированные)
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003") //1.1.2.  Цветочные культуры (пакетированные)
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")   //1.1.1.  Овощные культуры (пакетированные)
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003") //1.1.2.  Цветочные культуры (пакетированные)
			
			Тогда
			    ПризнакНовинка =  ПризнакНовинкаНоменклатуры;
				Продолжить;    //jadmin признак не проставляется (по просьбе Мисюченко)
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 1 И Месяц(ДатаСозданияНоменклатуры) <= 4 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = НачалоГода(ДатаСозданияНоменклатуры + 86400*365);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*2 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 
						
		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000015")   //5.  Сидераты и технические культуры
			ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000005")  //2.1.1.  Деревья и кустарники
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000015")   //5.  Сидераты и технические культуры
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000005")  //2.1.1.  Деревья и кустарники
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000015")   //5.  Сидераты и технические культуры
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000005")  //2.1.1.  Деревья и кустарники
			
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 4 И Месяц(ДатаСозданияНоменклатуры) <= 10 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = ДобавитьМесяц(НачалоГода(ДатаСозданияНоменклатуры + 86400*365),3);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000022")  //8.1.1.  Грунты 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000022")
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000022")
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 1 И Месяц(ДатаСозданияНоменклатуры) <= 4 ИЛИ Месяц(ДатаСозданияНоменклатуры) = 12 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = ДобавитьМесяц(НачалоГода(ДатаСозданияНоменклатуры + 86400*365),3);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000024")  //8.1.3.  Удобрения 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000024")  //8.1.3.  Удобрения 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000024")  //8.1.3.  Удобрения 
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 3 И Месяц(ДатаСозданияНоменклатуры) <= 5 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = ДобавитьМесяц(НачалоГода(ДатаСозданияНоменклатуры + 86400*365),2);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 	
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000023")  //8.1.3.  Удобрения 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")  //6.  Лук-севок и чеснок
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000023")  //8.1.3.  Удобрения 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")  //6.  Лук-севок и чеснок
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000023")  //8.1.3.  Удобрения 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")  //6.  Лук-севок и чеснок
			
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 3 И Месяц(ДатаСозданияНоменклатуры) <= 10 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = ДобавитьМесяц(НачалоГода(ДатаСозданияНоменклатуры + 86400*365),2);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 
			
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")  //4.  Газонные травы 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000011")  //2.1.5.  Клубника
			ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000012")  //2.1.6.  Лиственные и хвойники
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")  //4.  Газонные травы 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000011")  //2.1.5.  Клубника
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000012")  //2.1.6.  Лиственные и хвойники
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")  //4.  Газонные травы 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000011")  //2.1.5.  Клубника
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000012")  //2.1.6.  Лиственные и хвойники
			
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 3 И Месяц(ДатаСозданияНоменклатуры) <= 9 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = ДобавитьМесяц(НачалоГода(ДатаСозданияНоменклатуры + 86400*365),2);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 

		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")  //7.  Картофель 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")  //7.  Картофель 
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")  //7.  Картофель 
			
			
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 2 И Месяц(ДатаСозданияНоменклатуры) <= 5 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = ДобавитьМесяц(НачалоГода(ДатаСозданияНоменклатуры + 86400*365),1);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 

		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000029")  //8.1.4.  Укрывной материал, парники, дуги, шпалеры, ограждения, стремянки
            ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000032") //8.1.7.  Инвентарь садовый
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000029")  //8.1.4.  Укрывной материал, парники, дуги, шпалеры, ограждения, стремянки
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000032") //8.1.7.  Инвентарь садовый
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000029")  //8.1.4.  Укрывной материал, парники, дуги, шпалеры, ограждения, стремянки
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000032") //8.1.7.  Инвентарь садовый
			
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 2 И Месяц(ДатаСозданияНоменклатуры) <= 10 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = ДобавитьМесяц(НачалоГода(ДатаСозданияНоменклатуры + 86400*365),1);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000035")  //8.1.9.  Прочие товары
            ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000031") //8.1.6.  Горшки, посуда, ведра
            ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000034") //8.1.8.  Опрыскиватели, лейки, шланги
            ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000030") //8.1.5.  Обувь, одежда, перчатки
            ИЛИ ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000008") //2.1.4.  Рассада цветов и овощей
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000035")  //8.1.9.  Прочие товары
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000031") //8.1.6.  Горшки, посуда, ведра
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000034") //8.1.8.  Опрыскиватели, лейки, шланги
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000030") //8.1.5.  Обувь, одежда, перчатки
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000008") //2.1.4.  Рассада цветов и овощей
			
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000035")  //8.1.9.  Прочие товары
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000031") //8.1.6.  Горшки, посуда, ведра
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000034") //8.1.8.  Опрыскиватели, лейки, шланги
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000030") //8.1.5.  Обувь, одежда, перчатки
            ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000008") //2.1.4.  Рассада цветов и овощей
			
			
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 1 И Месяц(ДатаСозданияНоменклатуры) <= 12 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = НачалоГода(ДатаСозданияНоменклатуры + 86400*365);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 
			
		ИначеЕсли ВыборкаДетальныеЗаписи.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000006")  //2.1.2.  Розы
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000006")  //2.1.2.  Розы
			ИЛИ ВыборкаДетальныеЗаписи.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000006")  //2.1.2.  Розы
			
			Тогда
			
			ДатаСозданияНоменклатуры = ВыборкаДетальныеЗаписи.ДатаВерсии;
			Если Месяц(ДатаСозданияНоменклатуры) >= 1 И Месяц(ДатаСозданияНоменклатуры) <= 10 Тогда
				ДатаОтсчета = НачалоДня(ДатаСозданияНоменклатуры);
			Иначе
				ДатаОтсчета = НачалоГода(ДатаСозданияНоменклатуры + 86400*365);
			КонецЕсли;
			
			Если ДатаОтсчета < ТекущаяДата() Тогда
			
				РазницаДат = НачалоДня(ТекущаяДата()) - ДатаОтсчета;
				Если РазницаДат < 86400*365*1 Тогда
					ПризнакНовинка = ИСТИНА;
				Иначе
					ПризнакНовинка = ЛОЖЬ;
				КонецЕсли; 
			Иначе		
			    ПризнакНовинка = ИСТИНА;
			КонецЕсли; 
		Иначе
			Продолжить;
		КонецЕсли;
		
		Если ПризнакНовинка <> ПризнакНовинкаНоменклатуры  Тогда
			НоменклатураСсылка.ПризнакНовинка = ПризнакНовинка;
			НоменклатураСсылка.Записать();
		КонецЕсли;


		
	КонецЦикла;
	
	Сообщить("Обработка выполнена");
КонецПроцедуры


Функция ПроверитьВхождениеТовараВЗаказПоступления(Номенклатура)

	НоменклатураПрисутствуетВЗаказе = ЛОЖЬ;
 
 	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПредзаказНаСайтеДляИнтМаг.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ПредзаказНаСайтеДляИнтМаг КАК ПредзаказНаСайтеДляИнтМаг
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ПО ПредзаказНаСайтеДляИнтМаг.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка.Проведен = ИСТИНА
		|	И ЗаказПоставщикуТовары.Номенклатура = &Номенклатура
		|	И ПредзаказНаСайтеДляИнтМаг.Действует = ИСТИНА";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
	
		НоменклатураПрисутствуетВЗаказе = ИСТИНА;
	
	КонецЕсли;

	Возврат НоменклатураПрисутствуетВЗаказе;

КонецФункции // ()


Функция ПроверитьЗаказНаСуществование(ИнтЗаказНомер)

	ЗаказНайден = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнтернетЗаказРозничный.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИнтернетЗаказРозничный КАК ИнтернетЗаказРозничный
		|ГДЕ
		|	ИнтернетЗаказРозничный.Проведен = &ИСТИНА
		|	И ИнтернетЗаказРозничный.ИнтЗаказНомер = &ИнтЗаказНомер";
	
	Запрос.УстановитьПараметр("ИнтЗаказНомер", ИнтЗаказНомер);
	Запрос.УстановитьПараметр("ИСТИНА", ИСТИНА);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
	
		ЗаказНайден = ИСТИНА;
	
	КонецЕсли;
	
	Возврат ЗаказНайден;

КонецФункции // ПроверитьЗаказНаСуществование(Заказ.ИнтЗаказНомер)()


Функция ПроверитьЗаказНаСуществование_ОПТ(ИДЗаказа)

	ЗаказНайден = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнтернетЗаказКлиента.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИнтернетЗаказКлиента КАК ИнтернетЗаказКлиента
		|ГДЕ
		|	ИнтернетЗаказКлиента.Проведен = &ИСТИНА
		|	И ИнтернетЗаказКлиента.ИДЗаказа = &ИДЗаказа";
	
	Запрос.УстановитьПараметр("ИДЗаказа", ИДЗаказа);
	Запрос.УстановитьПараметр("ИСТИНА", ИСТИНА);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
	
		ЗаказНайден = ИСТИНА;
	
	КонецЕсли;
	
	Возврат ЗаказНайден;

КонецФункции // ПроверитьЗаказНаСуществование(Заказ.ИнтЗаказНомер)()



Функция ПолучитьТоварыСЗапретомОтгрузки(Номенклатура)
	ЗапретДоставки = 0;
	
	Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗапретДоставкиТоваров.Номенклатура КАК Номенклатура
			|ИЗ
			|	РегистрСведений.ЗапретДоставкиТоваров КАК ЗапретДоставкиТоваров
			|ГДЕ
			|	(ЗапретДоставкиТоваров.Номенклатура = &Номенклатура
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель1
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель2
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель3
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель4
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель5)";
		
	
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НоменклатураРодитель1", Номенклатура.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель2", Номенклатура.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель3", Номенклатура.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель4", Номенклатура.Родитель.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель5", Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель);

		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗапретДоставки = 1;
		КонецЦикла;

	
	Возврат ЗапретДоставки;
КонецФункции // ()



Функция ПолучитьРодителя(Номенклатура)
    ГруппаНоменклатуры = Номенклатура;    
    Пока НЕ ГруппаНоменклатуры.Родитель.Пустая() Цикл
        ГруппаНоменклатуры = ГруппаНоменклатуры.Родитель;    
    КонецЦикла;
    
    Возврат ГруппаНоменклатуры;

КонецФункции

