
&НаКлиенте
Процедура Выставить(Команда)
	СформироватьЭСЧФ();
КонецПроцедуры

&НаСервере
Функция РольДоступнаНаКлиенте(Роль)  Экспорт         //jadmin    
    Возврат РольДоступна(Роль);
    
КонецФункции

Функция Получить_ТекущаяДата() Экспорт
	Возврат ТекущаяДата();
КонецФункции


Функция Получить_НачалоМесяца_ТекущаяДата() Экспорт
	Возврат НачалоГода(ТекущаяДата());
КонецФункции


/////77w qaws
///// В общем модуле с галочкой СЕРВЕР пишешь:
Функция ПроверятьНужноНаСервереБЛИН() Экспорт
    _РольДоступна = Ложь;
    Если РольДоступна("ТСД") тогда 
         _РольДоступна = Истина;  
    КонецЕсли;
    Возврат _РольДоступна;
КонецФункции

Функция ПроверятьНужноНаСервереБЛИН_Инвентаризация() Экспорт
    _РольДоступна = Ложь;
    Если РольДоступна("ТСД_Инвентаризация") тогда 
         _РольДоступна = Истина;  
    КонецЕсли;
    Возврат _РольДоступна;
КонецФункции

Функция ПроверятьНужноНаСервереБЛИН_ШКД() Экспорт
    _РольДоступна = Ложь;
    Если РольДоступна("ШКД") тогда 
         _РольДоступна = Истина;  
    КонецЕсли;
    Возврат _РольДоступна;
КонецФункции

Функция ПроверятьНужноНаСервереБЛИН_ШКД_TSD() Экспорт
    _РольДоступна = Ложь;
    Если РольДоступна("ШКД_TSD") тогда 
         _РольДоступна = Истина;  
    КонецЕсли;
    Возврат _РольДоступна;
КонецФункции

Функция ПроверятьНужноНаСервереБЛИН_ТСД_ИнтернетМагазин() Экспорт
    _РольДоступна = Ложь;
    Если РольДоступна("ТСД_ИнтернетМагазин") тогда 
         _РольДоступна = Истина;  
    КонецЕсли;
    Возврат _РольДоступна;
КонецФункции



Функция КомпонентаУстановлена(ТекстОшибки, Отказ)
	
	EVatService = Неопределено;
	
	Попытка 
		#Если ВебКлиент Тогда
			ПодключитьВнешнююКомпоненту("ОбщийМакет.EInvVatService_Локализация");
			EVatService = Новый ComОбъект("EInvVatService.Connector");
		#Иначе 
			EVatService = Новый ComОбъект("EInvVatService.Connector");
		#КонецЕсли	
		
	Исключение
		ТекстОшибки = Описаниеошибки(); //Нстр("ru='Не установлена компонента для доступа к порталу ЭСЧФ'");
		Отказ = Истина;
	КонецПопытки;
	
	Возврат EVatService;
	
КонецФункции

Функция ПолучитьСоединениеМНС(СтрокаСоединения, ТекстОшибки, Отказ)
		
	EVatService = КомпонентаУстановлена(ТекстОшибки, Отказ);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	ПутьКВебСервису = "https://ws.vat.gov.by:443/InvoicesWS/services/InvoicesPort";   /////РЕАЛЬНЫЙ   ПОРТАЛ
	//ПутьКВебСервису = "https://185.32.226.170:4443/InvoicesWS/services/InvoicesPort"; //// тестовый веб-сервис 
	
	Если EVatService.Login(СтрокаСоединения, 0) = 0 Тогда
		                         
		Если  EVatService.Connect(ПутьКВебСервису) = 0 Тогда 
			Возврат EVatService;
		Иначе
			ТекстОшибки = Нстр("ru='Ошибка авторизации на портале ЭСЧФ: '") + EVatService.LastError;
			Сообщить(ТекстОшибки);
		КонецЕсли;
		
	Иначе
		ТекстОшибки = Нстр("ru='Ошибка авторизации на портале ЭСЧФ: '") + EVatService.LastError; 
			Сообщить(ТекстОшибки);
	КонецЕсли;
	
	Отказ = Истина;
	
	
	Возврат Неопределено;
	
КонецФункции


Функция обПустоеЗначение(Значение) 

	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение = Неопределено Тогда
		Возврат Истина;
	ИначеЕсли Значение = NULL Тогда
		Возврат Истина;
	ИначеЕсли Лев(Значение,18) = "<Объект не найден>" Тогда
		Возврат Истина;
	ИначеЕсли ТипЗначения = Тип("Тип") Тогда
		Возврат Истина;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Возврат ПустаяСтрока(Значение);
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат ?(Значение = 0,Истина,Ложь);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат ?(Значение = Дата('00010101'),Истина,Ложь);
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Возврат Ложь; // Булево будем считать не пустым всегда
	ИначеЕсли ТипЗначения = Тип("Граница") Тогда
		Возврат обПустоеЗначение(Значение.Значение);
	ИначеЕсли ТипЗначения = Тип("Массив")
				ИЛИ ТипЗначения = Тип("СписокЗначений")
				ИЛИ ТипЗначения = Тип("ТаблицаЗначений")
				ИЛИ ТипЗначения = Тип("Структура") Тогда
		Возврат ?(Значение.Количество() = 0,Истина, Ложь);
    ИначеЕсли ТипЗначения = Тип("СтрокаТаблицыЗначений") Тогда
        Возврат Ложь;	
	ИначеЕсли ТипЗначения = Тип("ЭлементСпискаЗначений") Тогда
		Возврат Ложь;
	#Если Клиент Тогда	
		ИначеЕсли ТипЗначения = Тип("Форма") Тогда
			Возврат Ложь;
	#КонецЕсли				
	Иначе
		Возврат ?(Значение = Новый(ТипЗначения),Истина,Ложь);
	КонецЕсли; 

	Возврат Ложь;
	
КонецФункции // обПустоеЗначение()


Функция Статус(СтатусПортала)
	Если СтатусПортала="COMPLETED" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.Выставлен;                                     
	ИначеЕсли СтатусПортала="COMPLETED_SIGNED" Тогда  
		Возврат Перечисления.СтатусыЭСЧФ.Выставлен_Подписан;
	ИначеЕсли СтатусПортала="IN_PROGRESS" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.ВРазработке;
	ИначеЕсли СтатусПортала="IN_PROGRESS_ERROR" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.ВРазработке_Ошибка;
	ИначеЕсли СтатусПортала="ON_AGREEMENT" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.НаСогласовании;
	ИначеЕсли СтатусПортала="CANCELLED" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.Аннулирован;
	ИначеЕсли СтатусПортала="ON_AGREEMENT_CANCEL" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.Выставлен_Аннулирование;
	ИначеЕсли СтатусПортала="ERROR" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.ВРазработке_Ошибка;
	КонецЕсли; 
КонецФункции // Статус

Функция ДатаСтатуса(_Дата)
	Год = Число(лев(_Дата,4));
	Месяц = Число(сред(_Дата,6,2)); 
	День = Число(сред(_Дата,9,2));
	Возврат Дата(Год,Месяц,День);
КонецФункции // ДатаСтатуса


функция ПроверитьСтатусЭСЧФ(НомерЭСЧФ)
	
	//Структура = Новый Структура;
	//
	////EVatService = ПараметрыПодключения.Получить("Соединение");
	//
	//InvVatStatus = EVatService.GetStatus(СокрЛП(НомерЭСЧФ));
	//Если InvVatStatus = Неопределено Тогда
	//	Сообщить("Ошибка при получении статуса ЭСЧФ " + СокрЛП(НомерЭСЧФ) + ":" + EVatService.LastError);
	//	Возврат Структура;
	//КонецЕсли;
	//
	//Если InvVatStatus.Verify() = 0 Тогда		
	//	Если InvVatStatus.Status = "NOT_FOUND" Тогда
	//		Сообщить("ЭСЧФ "+ СокрЛП(НомерЭСЧФ)+" не найден на портале!");
	//	ИначеЕсли InvVatStatus.Status = "ERROR" Тогда
	//		Сообщить("ЭСЧФ "+ СокрЛП(НомерЭСЧФ)+" сформирован с ошибкой! Ошибка: "+СокрЛП(InvVatStatus.Message), СтатусСообщения.ОченьВажное);
	//		Структура.Вставить("СтатусПортала",Статус(InvVatStatus.Status));
	//		Структура.Вставить("ДатаИзмененияСтатуса",ТекущаяДата());
	//	Иначе
	//		Структура.Вставить("СтатусПортала",Статус(InvVatStatus.Status));
	//		Структура.Вставить("ДатаИзмененияСтатуса",ДатаСтатуса(InvVatStatus.Since));
	//	КонецЕсли;
	//Иначе 
	//	Сообщить("Ошибка статуса: " + EVatService.LastError);	
	//КонецЕсли;	

	//Возврат Структура;
	
КонецФункции	


Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") 
     
    Позиция = НайтиНедопустимыеСимволыXML(Текст); 
    Пока Позиция > 0 Цикл 
        ТекущийСимвол = Сред(Текст, Позиция, 1); 
        Если ТекущийСимвол = "&" Тогда    // уже заменяли 
            Позиция = НайтиНедопустимыеСимволыXML(Текст,Позиция+1); 
            Продолжить; 
        КонецЕсли; 
        Текст = СтрЗаменить(Текст, ТекущийСимвол, СимволЗамены); 
        Позиция = НайтиНедопустимыеСимволыXML(Текст,Позиция+1); 
    КонецЦикла; 
     
    Возврат Текст; 
     
КонецФункции 

Функция ЗаменитьНедопустимыеСимволы(_стр)
	стр = СокрЛП(_стр);
	стр = СтрЗаменить(стр,"&","&amp;");
	стр = СтрЗаменить(стр,"<","&lt;");
	стр = СтрЗаменить(стр,">","&gt;");
    стр = СтрЗаменить(стр,"""","&quot;");
	ЗаменитьНедопустимыеСимволыXML(стр);
	Возврат стр;
КонецФункции

Функция ФорматДляВыгрузки(стр)
	Возврат Формат(стр,"ЧРД=.; ЧН=; ЧГ=0");
КонецФункции

функция ПолучитьСтатусПолучателя(Статус)
	
	Если Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Покупатель Тогда
		СтатусПолучателя = "CUSTOMER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Потребитель Тогда
		СтатусПолучателя = "CONSUMER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Комитент Тогда
		СтатусПолучателя = "CONSIGNOR";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Комиссионер Тогда
		СтатусПолучателя = "COMMISSIONAIRE";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПлательщикПолучающийВычеты Тогда
		СтатусПолучателя = "TAX_DEDUCTION_RECIPIENT";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПокупательОбъектаУИностраннойОрганизации Тогда
		СтатусПолучателя = "FOREIGN_ORGANIZATION_BUYER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПлательщикПолучающийОборотыПоРеализации Тогда
		СтатусПолучателя = "TURNOVERS_ON_SALE_RECIPIENT";
	КонецЕсли;
	
	Возврат СтатусПолучателя;
	
КонецФункции

функция ПолучитьСтатусПоставщика(Статус)
	
	Если Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Продавец Тогда
		СтатусПоставщика = "SELLER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Комитент Тогда
		СтатусПоставщика = "CONSIGNOR";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Комиссионер Тогда
		СтатусПоставщика = "COMMISSIONAIRE";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация Тогда
		СтатусПоставщика = "FOREIGN_ORGANIZATION";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Посредник Тогда
		СтатусПоставщика = "AGENT";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Заказчик Тогда
		СтатусПоставщика = "DEVELOPER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ДоверительныйУправляющий Тогда
		СтатусПоставщика = "TRUSTEE";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПлательщикПередающийВычеты Тогда
		СтатусПоставщика = "TAX_DEDUCTION_PAYER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПлательщикПередающийОборотыПоРеализации Тогда
		СтатусПоставщика = "TURNOVERS_ON_SALE_PAYER";
	КонецЕсли;
	Возврат СтатусПоставщика;
	
КонецФункции


Процедура СформироватьЭСЧФ() Экспорт
	
	КомандаОбновитьСОС= "C:\Program Files (x86)\Avest\AvPCM_nces\get_crl.bat";
	         
	Shell = Новый COMОбъект("WScript.Shell");
	WshExec = Shell.Exec(КомандаОбновитьСОС);
	OutStream = WshExec.StdOut;  
	    
	Str = "";
	Пока Не OutStream.AtEndOfStream Цикл
	   Str = СокрЛП(OutStream.ReadLine());
	КонецЦикла;
	
	
	КаталогРазмещенияФайлов = "\\192.168.0.111\eInvVat";
	
	Соединение = Неопределено;
	Отказ = ложь;
	ТекстОшибки = "";
	СтрокаСоединения = "";
	
	//СтрокаСоедиенения = "PUB_KEY_ID=" + СокрЛП(СтрЗаменить(НастройкиПодключенияОрг.Ключ, " ", "")) + ";PASSWORD_KEY=" + НастройкиПодключенияОрг.Пароль;
	СтрокаСоединения = "UNP=600052664" + ";PASSWORD_KEY=293358595";
	
	
	Соединение = ПолучитьСоединениеМНС(СтрокаСоединения, ТекстОшибки, Отказ);
	
	Если Соединение <> Неопределено Тогда
		
		ПараметрыПодключения = Новый Соответствие;
		ПараметрыПодключения.Вставить("Соединение",Соединение);
		
		EVatService = ПараметрыПодключения.Получить("Соединение");
	Иначе
		Возврат;
	КонецЕсли;	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭСЧФДляВыставленияОстатки.ДокументОснование КАК ДокументОснование,
	|	СУММА(ЭСЧФДляВыставленияОстатки.СостояниеОстаток) КАК СостояниеОстаток
	|ИЗ
	|	РегистрНакопления.ЭСЧФДляВыставления.Остатки(&ДатаКонОст, ) КАК ЭСЧФДляВыставленияОстатки
	|ГДЕ
	|	ЭСЧФДляВыставленияОстатки.ДокументОснование.Проведен = &Проведен
	|	И ЭСЧФДляВыставленияОстатки.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ЭСЧФДляВыставленияОстатки.СостояниеОстаток > 0
	|	И ТИПЗНАЧЕНИЯ(ЭСЧФДляВыставленияОстатки.ДокументОснование.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
	//|	И ЭСЧФДляВыставленияОстатки.ДокументОснование.БезвозмезднаяПередача = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭСЧФДляВыставленияОстатки.ДокументОснование";
	
    //Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущаяДата())-1296000);   
    //Запрос.УстановитьПараметр("ДатаКон", НачалоДня(ТекущаяДата()-432000)); /////// 5 дней ранее
    
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущаяДата()-2592000));   ////1296000
	Запрос.УстановитьПараметр("ДатаКон", НачалоДня(ТекущаяДата()-432000)); /////// 5 дней ранее
    
    
	Запрос.УстановитьПараметр("ДатаКонОст", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Проведен", Истина);                     
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Нет данных для формирования ЭСЧФ.");
		//ПроверитьСтатусыНаСервере();
		Возврат;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Основание = Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Основание = ВыборкаДетальныеЗаписи.ДокументОснование;
		
		Если ТипЗнч(Основание.ссылка) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Продолжить;
		КонецЕсли; 	
		
		
		Если Основание <> Неопределено Тогда
			
			Новая_ЭСЧФ = Документы.ЭСЧФИсходящий.СоздатьДокумент();
			Новая_ЭСЧФ.Организация = Основание.Организация;
			Новая_ЭСЧФ.Автор = ПараметрыСеанса.ТекущийПользователь;
			Новая_ЭСЧФ.Дата = ТекущаяДатаСеанса();
			//Новая_ЭСЧФ.НомерЭСЧФ = ""+"600052664-"+Формат(Год(ТекущаяДатаСеанса()),"ЧГ=0")+"-"+СокрЛП(Основание.НомерБСО); 
			
			
			Префикс ="";
			
			лНомер = СокрЛП(Основание.НомерБСО);
			// Префикс убираем 
			Если Не ПустаяСтрока(Префикс) Тогда
				лНомер = СтрЗаменить(лНомер,Префикс,"");
			КонецЕсли;
			
			// Если длина номера меньше 10, то добавляем ведущие нули до 10 знаков
			Если СтрДлина(СокрЛП(лНомер))<10 Тогда
				н = 10 - СтрДлина(СокрЛП(лНомер));
				Пока н > 0 Цикл
					лНомер = "0" + лНомер;	
					н = н - 1;
				КонецЦикла;	
			КонецЕсли;	
			
			
			
			Новая_ЭСЧФ.НомерЭСЧФ = ""+Новая_ЭСЧФ.Организация.ИНН+"-"+Формат(Год(ТекущаяДатаСеанса()),"ЧГ=0")+"-"+лНомер+""+СокрЛП(Основание.НомерБСО); 
			
			Если (Основание.Соглашение.СВ_РасчетныйНДС = Истина) Тогда
				Новая_ЭСЧФ.НомерЭСЧФ = ""+Новая_ЭСЧФ.Организация.ИНН+"-"+Формат(Год(ТекущаяДатаСеанса()),"ЧГ=0")+"-"+лНомер+""+СокрЛП(Основание.НомерБСО); 
				Новая_ЭСЧФ.ФлагРозница = Истина;
			КонецЕсли;
			
			Новая_ЭСЧФ.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.ВРазработке;
			Новая_ЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исходный;
			Новая_ЭСЧФ.ДатаОперации = Основание.Дата;
			Новая_ЭСЧФ.ДатаВыпискиЭСЧФ = ТекущаяДатаСеанса();
			Новая_ЭСЧФ.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.Продавец;
			Новая_ЭСЧФ.КодСтраныПоставщика = "112";
			Новая_ЭСЧФ.УНППоставщика = Новая_ЭСЧФ.Организация.ИНН;
			Новая_ЭСЧФ.Поставщик = Новая_ЭСЧФ.Организация;
			//Новая_ЭСЧФ.НаименованиеПоставщика = Новая_ЭСЧФ.Организация.НаименованиеПолное;
			Новая_ЭСЧФ.НаименованиеПоставщика = "ОАО ""МинскСортСемОвощ"""; 
			Новая_ЭСЧФ.АдресПоставщика = "г.Минск, ул.Кузьмы Минина, д.21, корп.1";
			
			Новая_ЭСЧФ.СтатусПолучателя = Перечисления.СтатусыКонтрагентаЭСЧФ.Покупатель;
			Новая_ЭСЧФ.КодСтраныПолучателя = "112";
			Новая_ЭСЧФ.Получатель = Основание.Контрагент;
			Новая_ЭСЧФ.УНППолучателя = Основание.Контрагент.ИНН;
			
			Если ЗначениеЗаполнено(Основание.Контрагент.КодФилиала) Тогда
				Новая_ЭСЧФ.КодФилиалаПолучателя =  Основание.Контрагент.КодФилиала;
			КонецЕсли; 
			
			Новая_ЭСЧФ.НаименованиеПолучателя = СокрЛП(Основание.Контрагент.НаименованиеПолное);
			
			Попытка
				Новая_ЭСЧФ.АдресПолучателя = СокрЛП(Новая_ЭСЧФ.Получатель.КонтактнаяИнформация[1].Представление);
			Исключение
			КонецПопытки; 
			
			
			
			Новая_ЭСЧФ.Грузоотправитель = Новая_ЭСЧФ.Организация;
			Новая_ЭСЧФ.КодСтраныГрузоотправителя = "112";
			Новая_ЭСЧФ.УНПГрузоотправителя = Новая_ЭСЧФ.Организация.ИНН;
			//Новая_ЭСЧФ.НаименованиеПоставщика = Новая_ЭСЧФ.Организация.НаименованиеПолное;
			Новая_ЭСЧФ.НаименованиеГрузоотправителя = "ОАО ""МинскСортСемОвощ"""; 
			
			Попытка
				Новая_ЭСЧФ.АдресОтправки = Основание.Склад.КонтактнаяИнформация[0].Представление;
			Исключение
				Новая_ЭСЧФ.АдресОтправки = ""+"г.Минск, ул.Кузьмы Минина, д.21, корп.1";
			КонецПопытки; 
			
			
			Новая_ЭСЧФ.Грузополучатель = Основание.Контрагент;
			Новая_ЭСЧФ.КодСтраныГрузополучателя = "112";
			Новая_ЭСЧФ.УНПГрузополучателя = Основание.Контрагент.ИНН;
			Новая_ЭСЧФ.НаименованиеГрузополучателя = СокрЛП(Основание.Контрагент.НаименованиеПолное);
			Новая_ЭСЧФ.АдресДоставки = СокрЛП(Основание.АдресДоставки);
			
			Если (Основание.Соглашение.СВ_РасчетныйНДС = Ложь) Тогда
				Новая_ЭСЧФ.НомерДоговора = СокрЛП(Основание.Договор.Номер);
				Новая_ЭСЧФ.ДатаДоговора = СокрЛП(Основание.Договор.Дата);
			Иначе
				Если Основание.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
					Если Основание.РеализацияПоЗаказам Тогда
						Если ЗначениеЗаполнено(Основание.ЗаказКлиента) = ИСТИНА Тогда
							НомерЗаказа = "";
							
							НомерБезПрефикса = Основание.ЗаказКлиента.Номер;
							НомерБезПрефикса = СтрЗаменить(НомерБезПрефикса,"-","");
							Пока Найти(НомерБезПрефикса,"0") <> 1 Цикл
								НомерБезПрефикса = Сред(НомерБезПрефикса,2); //удаляет лидирующие ненули
							КонецЦикла;
							
							НомерБезНулей = НомерБезПрефикса;
							Пока Найти(НомерБезНулей,"0") = 1 Цикл
								НомерБезНулей = Сред(НомерБезНулей,2); //удаляет лидирующие нули
							КонецЦикла;
							
							НомерЗаказа = НомерБезНулей;
							Новая_ЭСЧФ.НомерДоговора = СокрЛП(НомерЗаказа);
							Новая_ЭСЧФ.ДатаДоговора = СокрЛП(Основание.ЗаказКлиента.Дата);
						КонецЕсли; 
					КонецЕсли; 
					
				Иначе
					Новая_ЭСЧФ.НомерДоговора = СокрЛП(Основание.Договор.Номер);
					Новая_ЭСЧФ.ДатаДоговора = СокрЛП(Основание.Договор.Дата);
				КонецЕсли; 
			КонецЕсли;	
			
			Новая_ЭСЧФ.ВидДокументаПоставки = Основание.ВидДокументаЭСЧФ;
			Новая_ЭСЧФ.НазваниеДокументаПоставки =  СокрЛП(Новая_ЭСЧФ.ВидДокументаПоставки.Наименование);
			Новая_ЭСЧФ.ДатаДокументаПоставки = Основание.Дата;
			Новая_ЭСЧФ.КодБланка = Основание.КодБланка;
			Новая_ЭСЧФ.КодТипаБланка = Новая_ЭСЧФ.КодБланка.Код;
			Новая_ЭСЧФ.СерияДокументаПоставки = Основание.СерияБСО;
			Новая_ЭСЧФ.НомерДокументаПоставки = Основание.НомерБСО;
			
			
			
			ТЧ_ОснованиеТовары = Основание.Товары.Выгрузить(); 
			
			ТЧ_ОснованиеТовары.Свернуть("Номенклатура, Упаковка,Серия, Цена,ЦенаСоСкидкой, КодТНВЭД, СтавкаНДС ","Количество,КоличествоУпаковок,Сумма,СуммаНДС, СуммаСНДС");
			
			//Для каждого СтрокаОснования Из Основание.Товары Цикл  
			Для каждого СтрокаОснования Из ТЧ_ОснованиеТовары Цикл 
			

				Новая_Строка_ЭСЧФ = Новая_ЭСЧФ.Номенклатура.Добавить();
				
				ЗаполнитьЗначенияСвойств(Новая_Строка_ЭСЧФ,СтрокаОснования);
				
				Если СтрокаОснования.ЦенаСоСкидкой > 0 Тогда
					Новая_Строка_ЭСЧФ.Цена = СтрокаОснования.ЦенаСоСкидкой;
				КонецЕсли; 
				
                
                
                Если СтрокаОснования.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
                    Новая_Строка_ЭСЧФ.СтавкаНДС = 20;
                    //Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.КодТНВЭД;
                    
                    Если СтрокаОснования.Серия.КодТНВЭД <> Справочники.КлассификаторТНВЭД.ПустаяСсылка() Тогда
        			    Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.Серия.КодТНВЭД;
                    Иначе
                        Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.КодТНВЭД;
                    КонецЕсли; 
                    
				ИначеЕсли СтрокаОснования.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда  
					
					Новая_Строка_ЭСЧФ.СтавкаНДС = 10; 
					Новая_Строка_ЭСЧФ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ПродукцияРастениеводстваПчеловодства;

					//Новая_Строка_ЭСЧФ.СтавкаНДС = 10;
                    //Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.КодТНВЭД;
                    Если СтрокаОснования.Серия.КодТНВЭД <> Справочники.КлассификаторТНВЭД.ПустаяСсылка() Тогда
        			    Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.Серия.КодТНВЭД;
                    Иначе
                        Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.КодТНВЭД;
                    КонецЕсли; 
                Иначе
                    Новая_Строка_ЭСЧФ.СтавкаНДС = 0;
                    Новая_Строка_ЭСЧФ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ОсвобождениеОтНДС;
                КонецЕсли; 
				
				
				Новая_Строка_ЭСЧФ.ТНВЭД = СтрЗаменить(Строка(Новая_Строка_ЭСЧФ.ТНВЭД),Символы.НПП,"");
				Новая_Строка_ЭСЧФ.ТНВЭД = СтрЗаменить(Строка(Новая_Строка_ЭСЧФ.ТНВЭД)," ","");
				Новая_Строка_ЭСЧФ.ТНВЭД = СтрЗаменить(Строка(Новая_Строка_ЭСЧФ.ТНВЭД),Символ(160),"");
				
				
                Новая_Строка_ЭСЧФ.СтавкаНДСОбъект = СтрокаОснования.СтавкаНДС;
                
				
                //Если (Основание.Соглашение.СВ_РасчетныйНДС = Ложь) Тогда
                //	
                //	Если СтрокаОснования.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
                //		Новая_Строка_ЭСЧФ.СтавкаНДС = 20;
                //		Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.КодТНВЭД;
                //	ИначеЕсли СтрокаОснования.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда 
                //		Новая_Строка_ЭСЧФ.СтавкаНДС = 10;
                //		Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.КодТНВЭД;
                //	Иначе
                //		Новая_Строка_ЭСЧФ.СтавкаНДС = 0;
                //		Новая_Строка_ЭСЧФ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ОсвобождениеОтНДС;
                //	КонецЕсли; 
                //	
                //	Новая_Строка_ЭСЧФ.СтавкаНДСОбъект = СтрокаОснования.СтавкаНДС;
                //	
                //Иначе
                //	РасчетныйНДС = 0;
                //	
                //	Запрос = Новый Запрос;			
                //	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Основание.Дата));
                //	
                //	Запрос.Текст = "ВЫБРАТЬ
                //	|					НДС					
                //	|				ИЗ
                //	|					РегистрСведений.СВ_РасчетныйНДС.СрезПоследних(&ДатаКон)";
                //	
                //	РезЗпр = Запрос.Выполнить().Выбрать();
                //	Пока РезЗпр.Следующий() Цикл
                //		РасчетныйНДС = РезЗпр.НДС;		
                //	КонецЦикла;
                //	
                //	Новая_Строка_ЭСЧФ.СтавкаНДС = РасчетныйНДС;
                //	Новая_Строка_ЭСЧФ.РасчетнаяСтавкаНДС = РасчетныйНДС; 
                //	Новая_Строка_ЭСЧФ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.Расчетная;
                //	//Новая_Строка_ЭСЧФ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ОсвобождениеОтНДС;
                //    
                //    
                //    
                //    
                //	
                //КонецЕсли;  
				
				
				//Новая_Строка_ЭСЧФ.ТНВЭД = СтрокаОснования.КодТНВЭД;
				
				
				//Новая_Строка_ЭСЧФ.ТМЦ = СтрокаОснования.Номенклатура;
				Страна = "";
				Страна = ?(ЗначениеЗаполнено(СтрокаОснования.Номенклатура.СтранаПроисхождения), СтрокаОснования.Номенклатура.СтранаПроисхождения, СтрокаОснования.Номенклатура.СтранаВвоза);
				Новая_Строка_ЭСЧФ.ТМЦ = ""+СокрЛП(СтрокаОснования.Номенклатура.НаименованиеПолное)+", "+СокрЛП(Страна);
				
				
				Новая_Строка_ЭСЧФ.ЕдиницаИзмерения = СокрЛП(СтрокаОснования.Номенклатура.ЕдиницаИзмерения.Наименование);
				Новая_Строка_ЭСЧФ.СуммаБезНДС =  СтрокаОснования.Сумма;
			КонецЦикла; 
			
			Новая_ЭСЧФ.ДокументОснование = Основание;  
			
			Попытка
				Новая_ЭСЧФ.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить("Создан ЭСЧФ "+Новая_ЭСЧФ.Ссылка);
				
				//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				
				//ВыгрузитьЭСЧФ(Новая_ЭСЧФ);
				
				СтрокаЭСЧФ = Новая_ЭСЧФ;			
				СчетФактура = СтрокаЭСЧФ.Ссылка;
				Текст = Новый ТекстовыйДокумент;
				Текст.ДобавитьСтроку("<issuance xmlns=""http://www.w3schools.com"" "+
				" sender="""+СокрЛП(СчетФактура.Организация.ИНН)+""">");
				//общие
				Текст.ДобавитьСтроку("  <general>");
				Если СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исходный Тогда
					ТипЭСФ ="ORIGINAL";
				ИначеЕсли СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.ДополнительныйБезЭСЧФ Тогда
					ТипЭСФ ="ADD_NO_REFERENCE";
				ИначеЕсли СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исправленный Тогда
					ТипЭСФ ="FIXED";
				ИначеЕсли СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Дополнительный Тогда
					ТипЭСФ ="ADDITIONAL";
				КонецЕсли; 
				
				//Если СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Дополнительный Тогда
				//	//Текст.ДобавитьСтроку("    <description>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ДополнительныеСведения)+"</description>");
				//	
				//	Текст.ДобавитьСтроку("    </contract>");
				//	Текст.ДобавитьСтроку("    <description>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ДополнительныеСведения)+"</description>");
				//	Текст.ДобавитьСтроку("  </deliveryCondition>");
				//	
				//КонецЕсли;    ////////77w qaws  для возвратов  нужно куда то в другое место.
				
				
				Текст.ДобавитьСтроку("    <number>"+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+"</number>");
				//Текст.ДобавитьСтроку("    <dateIssuance>"+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+"</dateIssuance>");
				Текст.ДобавитьСтроку("    <dateTransaction>"+Формат(СчетФактура.ДатаОперации,"ДФ=yyyy-MM-dd")+"</dateTransaction>");
				Текст.ДобавитьСтроку("    <documentType>"+ТипЭСФ+"</documentType>");
				Если СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исправленный Тогда
					Текст.ДобавитьСтроку("    <invoice>"+СокрЛП(СчетФактура.НомерИсходногоЭСЧФ)+"</invoice>");
					Текст.ДобавитьСтроку("    <dateCancelled>"+Формат(СчетФактура.ДатаАннулированияЭСЧФ,"ДФ=yyyy-MM-dd")+"</dateCancelled>");		
				ИначеЕсли СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Дополнительный Тогда
					Текст.ДобавитьСтроку("    <invoice>"+СокрЛП(СчетФактура.НомерИсходногоЭСЧФ)+"</invoice>");
					Текст.ДобавитьСтроку("    <sendToRecipient>true</sendToRecipient>");		
				КонецЕсли;                      
				
				Текст.ДобавитьСтроку("  </general>");
				
				
				Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ или СтрокаЭСЧФ.Ссылка.ФлагВозвратаПоАктуНедостачи Тогда  ///////77w 07-05-2020
					
					Если СтрокаЭСЧФ.ТипЭСЧФ <> Перечисления.ТипыЭСЧФ.ДополнительныйБезЭСЧФ Тогда   ///////77w 07-05-2020
						
						//Условия поставки
						Текст.ДобавитьСтроку("  <deliveryCondition>");
						Текст.ДобавитьСтроку("    <contract>");
						Если Не обПустоеЗначение(СчетФактура.НомерДоговора) Тогда
							Если НРег(СокрЛП(СчетФактура.НомерДоговора)) = "оферта" Тогда
								Текст.ДобавитьСтроку("      <number>public_offer</number>");
							ИначеЕсли НРег(СокрЛП(СчетФактура.НомерДоговора)) = "без договора" Тогда
								Текст.ДобавитьСтроку("      <number>no_contract</number>");
							Иначе	
								Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерДоговора)+"</number>");
							КонецЕсли;	
							Если Не обПустоеЗначение(СчетФактура.ДатаДоговора) Тогда
								Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаДоговора,"ДФ=yyyy-MM-dd")+"</date>");
							КонецЕсли;	
						Иначе
							Текст.ДобавитьСтроку("      <number>no_contract</number>");
						КонецЕсли;	
						Если обПустоеЗначение(СчетФактура.ВидДокументаПоставки) И
							НЕ обПустоеЗначение(СчетФактура.УНППоставщика) И
							СчетФактура.СтатусПоставщика <> Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация И
							НЕ СчетФактура.ФлагНеВыставлятьПолучателю Тогда
							// С 15.01.2018 г. добавлен контроль при выставлении ЭСЧФ обязательности заполнения данных первичного документа,
							// если поле 17. "УНП поставщика" непустое и не равно УНП составителя ЭСЧФ.
							// Если поле "Вид документа поставки" пустое, то поставляем код документа 600, что соответствует виду документа "Без документа"
							Текст.ДобавитьСтроку("      <documents>");
							Текст.ДобавитьСтроку("        <document>");
							Текст.ДобавитьСтроку("          <docType>");			
							Текст.ДобавитьСтроку("            <code>"+"600"+"</code>");
							Текст.ДобавитьСтроку("          </docType>");
							Текст.ДобавитьСтроку("	        <blankCode></blankCode>");
							Текст.ДобавитьСтроку("	        <seria></seria>");
							Текст.ДобавитьСтроку("	        <number></number>");
							Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ тогда
								Текст.ДобавитьСтроку("	        <refund>true</refund>");
							Иначе
								Текст.ДобавитьСтроку("	        <refund>false</refund>");
							Конецесли;	
							Текст.ДобавитьСтроку("        </document>");
							Текст.ДобавитьСтроку("      </documents>");
						Иначе	
							Если Не обПустоеЗначение(СчетФактура.ВидДокументаПоставки) ИЛИ
								Не обПустоеЗначение(СчетФактура.ДатаДокументаПоставки) ИЛИ
								Не обПустоеЗначение(СчетФактура.НомерДокументаПоставки) Тогда		
								
								Текст.ДобавитьСтроку("      <documents>");
								Текст.ДобавитьСтроку("        <document>");
								Текст.ДобавитьСтроку("          <docType>");
								Если Не обПустоеЗначение(СчетФактура.ВидДокументаПоставки) Тогда
									Текст.ДобавитьСтроку("            <code>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ВидДокументаПоставки.Код)+"</code>");
								КонецЕсли;
								Если Не обПустоеЗначение(СчетФактура.НазваниеДокументаПоставки) и СокрЛП(СчетФактура.ВидДокументаПоставки.Код="601")Тогда
									Текст.ДобавитьСтроку("            <value>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НазваниеДокументаПоставки)+"</value>");
								КонецЕсли;
								Текст.ДобавитьСтроку("          </docType>");
								Если  Не обПустоеЗначение(СчетФактура.ДатаДокументаПоставки) Тогда
									Текст.ДобавитьСтроку("          <date>"+Формат(СчетФактура.ДатаДокументаПоставки,"ДФ=yyyy-MM-dd")+"</date>");
								КонецЕсли;
								Текст.ДобавитьСтроку("          <blankCode>"+СокрЛП(СчетФактура.КодТипаБланка)+"</blankCode>");
								Текст.ДобавитьСтроку("          <seria>"+СокрЛП(СчетФактура.СерияДокументаПоставки)+"</seria>");
								Текст.ДобавитьСтроку("          <number>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НомерДокументаПоставки)+"</number>");
								//Текст.ДобавитьСтроку("	        <refund>true</refund>");
								Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ тогда
									Текст.ДобавитьСтроку("	        <refund>true</refund>");
								Иначе
									Текст.ДобавитьСтроку("	        <refund>false</refund>");
								Конецесли;	
								Текст.ДобавитьСтроку("        </document>");
								Текст.ДобавитьСтроку("      </documents>");
							КонецЕсли;
						КонецЕсли;	
						Текст.ДобавитьСтроку("    </contract>");
						Текст.ДобавитьСтроку("    <description>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ДополнительныеСведения)+"</description>");
						Текст.ДобавитьСтроку("  </deliveryCondition>");
						
					КонецЕсли; 
					
				КонецЕсли;  ///////77w 07-05-2020
				
				Если СтрокаЭСЧФ.ТипЭСЧФ <> Перечисления.ТипыЭСЧФ.Дополнительный Тогда
					
					
					//поставщик
					
					Текст.ДобавитьСтроку("  <provider>");
					Текст.ДобавитьСтроку("    <providerStatus>"+ПолучитьСтатусПоставщика(СчетФактура.СтатусПоставщика)+"</providerStatus>");
					Текст.ДобавитьСтроку("    <dependentPerson>"+?(СчетФактура.ФлагВзаимозависимоеЛицоПоставщик,"true","false")+"</dependentPerson>");
					Текст.ДобавитьСтроку("    <residentsOfOffshore>"+?(СчетФактура.ФлагРезидентОффшорныйЗоныПоставщик,"true","false")+"</residentsOfOffshore>");
					Текст.ДобавитьСтроку("    <specialDealGoods>"+?(СчетФактура.ФлагСделкаСТоварамиПоПеречнюПравительствРБПолучатель,"true","false")+"</specialDealGoods>");
					Текст.ДобавитьСтроку("    <bigCompany>"+?(СчетФактура.ФлагКрупныйПлательщикПоставщик,"true","false")+"</bigCompany>");
					Если Не обПустоеЗначение(СчетФактура.КодСтраныПоставщика) Тогда
						Текст.ДобавитьСтроку("    <countryCode>"+СокрЛП(СчетФактура.КодСтраныПоставщика)+"</countryCode>");
					КонецЕсли;
					
					Текст.ДобавитьСтроку("    <unp>"+СокрЛП(СчетФактура.УНППоставщика)+"</unp>");
					
					Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ = Ложь Тогда  ///////77w 07-05-2020
						Текст.ДобавитьСтроку("    <branchCode>"+Формат(СчетФактура.КодФилиалаПоставщика,"ЧГ=0")+"</branchCode>");
					КонецЕсли;
					
					Текст.ДобавитьСтроку("    <name>"+ ЗаменитьНедопустимыеСимволы(СчетФактура.НаименованиеПоставщика)+"</name>");
					Текст.ДобавитьСтроку("    <address>"+ЗаменитьНедопустимыеСимволы(СчетФактура.АдресПоставщика)+"</address>");
					
					Если Не обПустоеЗначение(СчетФактура.НомерЭСЧФКомитента) ИЛИ
						Не обПустоеЗначение(СчетФактура.ДатаЭСЧФКомитента) Тогда
						Текст.ДобавитьСтроку("    <principal>");
						Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерЭСЧФКомитента)+"</number>");
						Если Не обПустоеЗначение(СчетФактура.ДатаЭСЧФКомитента) Тогда	
							Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаЭСЧФКомитента,"ДФ=yyyy-MM-dd")+"</date>");
						КонецЕсли;	
						Текст.ДобавитьСтроку("    </principal>");
					КонецЕсли;
					Если Не обПустоеЗначение(СчетФактура.НомерЭСЧФПродавца) ИЛИ
						Не обПустоеЗначение(СчетФактура.ДатаЭСЧФПродавца) Тогда
						Текст.ДобавитьСтроку("    <vendor>");
						Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерЭСЧФПродавца)+"</number>");
						Если Не обПустоеЗначение(СчетФактура.ДатаЭСЧФПродавца) Тогда	
							Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаЭСЧФПродавца,"ДФ=yyyy-MM-dd")+"</date>");
						КонецЕсли;
						Текст.ДобавитьСтроку("    </vendor>");
					КонецЕсли;
					
					Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ = Ложь Тогда  ///////77w 07-05-2020
						Текст.ДобавитьСтроку("    <declaration>"+СокрЛП(СчетФактура.НомерГТД)+"</declaration>");
					КонецЕсли;
					
					
					Если Не обПустоеЗначение(СчетФактура.ДатаВыпускаТоваров) Тогда	
						Текст.ДобавитьСтроку("    <dateRelease>"+Формат(СчетФактура.ДатаВыпускаТоваров,"ДФ=yyyy-MM-dd")+"</dateRelease>");
					КонецЕсли;
					Если  Не обПустоеЗначение(СчетФактура.ДатаРазрешенияНаУбытиеТоваров) Тогда		
						Текст.ДобавитьСтроку("    <dateActualExport>"+Формат(СчетФактура.ДатаРазрешенияНаУбытиеТоваров,"ДФ=yyyy-MM-dd")+"</dateActualExport>");
					КонецЕсли;
					
					Если Не обПустоеЗначение(СчетФактура.НомерЗаявленияОВвозеТоваров) ИЛИ
						Не обПустоеЗначение(СчетФактура.ДатаЗаявленияОВвозеТоваров) Тогда	
						Текст.ДобавитьСтроку("    <taxes>");
						Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерЗаявленияОВвозеТоваров)+"</number>");
						Если  Не обПустоеЗначение(СчетФактура.ДатаЗаявленияОВвозеТоваров) Тогда			
							Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаЗаявленияОВвозеТоваров,"ДФ=yyyy-MM-dd")+"</date>");
						КонецЕсли;	
						Текст.ДобавитьСтроку("    </taxes>");
					КонецЕсли; 
					Текст.ДобавитьСтроку("  </provider>");	
					
					//Получатель
					Текст.ДобавитьСтроку("  <recipient>");
					Текст.ДобавитьСтроку("    <recipientStatus>"+ПолучитьСтатусПолучателя(СчетФактура.СтатусПолучателя)+"</recipientStatus>");
					Текст.ДобавитьСтроку("    <dependentPerson>"+?(СчетФактура.ФлагВзаимозависимоеЛицоПолучатель,"true","false")+"</dependentPerson>");
					Текст.ДобавитьСтроку("    <residentsOfOffshore>"+?(СчетФактура.ФлагРезидентОффшорныйЗоныПолучатель,"true","false")+"</residentsOfOffshore>");
					Текст.ДобавитьСтроку("    <specialDealGoods>"+?(СчетФактура.ФлагСделкаСТоварамиПоПеречнюПравительствРБПолучатель,"true","false")+"</specialDealGoods>");
					Текст.ДобавитьСтроку("    <bigCompany>"+?(СчетФактура.ФлагКрупныйПлательщикПолучатель,"true","false")+"</bigCompany>");
					// Для статуса поставщика "Иностранная организация" или ЭСЧФ выставляется получателю выгружаем код страны, УНП и код филиала
					Если СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация ИЛИ
						НЕ СчетФактура.ФлагНеВыставлятьПолучателю Тогда
						Если Не обПустоеЗначение(СчетФактура.КодСтраныПолучателя) Тогда
							Текст.ДобавитьСтроку("    <countryCode>"+СокрЛП(СчетФактура.КодСтраныПолучателя)+"</countryCode>");
						КонецЕсли;	
						Текст.ДобавитьСтроку("    <unp>"+СокрЛП(СчетФактура.УНППолучателя)+"</unp>");
						Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ = Ложь Тогда  ///////77w 07-05-2020
							Текст.ДобавитьСтроку("    <branchCode>"+СчетФактура.КодФилиалаПолучателя+"</branchCode>");
						КонецЕсли;	
					Иначе	
						// Правило 59. Если заполнен реквизит 6.1 Взаимозависимое лицо и реквизит 16. Код страны получателя - РБ, то реквизит 17. УНП получателя обязательно для заполнения,
						// поэтому при установленном флажке "ФлагНеВыставлятьПолучателю" код страны получателя не выгружаем
						Если Не обПустоеЗначение(СчетФактура.КодСтраныПолучателя) И
							(СчетФактура.КодСтраныПолучателя<>"112" ИЛИ
							(СчетФактура.КодСтраныПолучателя="112" И
							НЕ СчетФактура.ФлагВзаимозависимоеЛицоПоставщик)) Тогда	
							Текст.ДобавитьСтроку("    <countryCode>"+СокрЛП(СчетФактура.КодСтраныПолучателя)+"</countryCode>");
						КонецЕсли;
					КонецЕсли;	
					Текст.ДобавитьСтроку("    <name>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НаименованиеПолучателя)+"</name>");
					Текст.ДобавитьСтроку("    <address>"+ЗаменитьНедопустимыеСимволы(СчетФактура.АдресПолучателя)+"</address>");
					
					Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ = Ложь Тогда  ///////77w 07-05-2020
						Текст.ДобавитьСтроку("    <declaration>"+СокрЛП(СчетФактура.НомерГТДПриВвозе)+"</declaration>");
					КонецЕсли;
					
					Если Не обПустоеЗначение(СчетФактура.НомерЗаявленияОВвозеТоваровПриВвозе) ИЛИ
						Не обПустоеЗначение(СчетФактура.ДатаЗаявленияОВвозеТоваровПриВвозе) Тогда	
						Текст.ДобавитьСтроку("    <taxes>");
						Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерЗаявленияОВвозеТоваровПриВвозе)+"</number>");
						Если Не обПустоеЗначение(СчетФактура.ДатаЗаявленияОВвозеТоваровПриВвозе) Тогда	
							Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаЗаявленияОВвозеТоваровПриВвозе,"ДФ=yyyy-MM-dd")+"</date>");
						КонецЕсли;	
						Текст.ДобавитьСтроку("    </taxes>");
					КонецЕсли;
					Если Не обПустоеЗначение(СчетФактура.ДатаВвозаТоваров) Тогда				
						Текст.ДобавитьСтроку("    <dateImport>"+Формат(СчетФактура.ДатаВвозаТоваров,"ДФ=yyyy-MM-dd")+"</dateImport>");
					КонецЕсли; 	
					Текст.ДобавитьСтроку("  </recipient>");
					
					//Реквизиты грузопоотправителя и грузополучателя
					Текст.ДобавитьСтроку("  <senderReceiver>");
					//грузоотправители
					Текст.ДобавитьСтроку("    <consignors>");
					Если (СчетФактура.ВидДокументаПоставки = Справочники.ВидыДокументовЭСЧФ.ТТН1) ИЛИ
						(Не обПустоеЗначение(СчетФактура.КодСтраныГрузоотправителя) И
						Не обПустоеЗначение(СчетФактура.НаименованиеГрузоотправителя) И
						Не обПустоеЗначение(СчетФактура.АдресОтправки) И
						(СчетФактура.ВидДокументаПоставки = Справочники.ВидыДокументовЭСЧФ.ТН2 ИЛИ
						СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация)) Тогда
						Текст.ДобавитьСтроку("      <consignor>");
						Если Не обПустоеЗначение(СчетФактура.КодСтраныГрузоотправителя) Тогда
							Текст.ДобавитьСтроку("        <countryCode>"+СокрЛП(СчетФактура.КодСтраныГрузоотправителя)+"</countryCode>");
						КонецЕсли;
						Текст.ДобавитьСтроку("        <unp>"+СокрЛП(СчетФактура.УНПГрузоотправителя)+"</unp>");
						Текст.ДобавитьСтроку("        <name>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НаименованиеГрузоотправителя)+"</name>");
						Текст.ДобавитьСтроку("        <address>"+ЗаменитьНедопустимыеСимволы(СчетФактура.АдресОтправки)+"</address>");
						Текст.ДобавитьСтроку("      </consignor>");
					КонецЕсли;
					Текст.ДобавитьСтроку("    </consignors>");
					//грузополучатели
					Текст.ДобавитьСтроку("    <consignees>");
					Если (СчетФактура.ВидДокументаПоставки = Справочники.ВидыДокументовЭСЧФ.ТТН1) ИЛИ
						(Не обПустоеЗначение(СчетФактура.КодСтраныГрузополучателя) И
						Не обПустоеЗначение(СчетФактура.НаименованиеГрузополучателя) И
						Не обПустоеЗначение(СчетФактура.АдресДоставки) И
						(СчетФактура.ВидДокументаПоставки = Справочники.ВидыДокументовЭСЧФ.ТН2 ИЛИ
						СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация)) Тогда
						Текст.ДобавитьСтроку("      <consignee>");
						Если Не обПустоеЗначение(СчетФактура.КодСтраныГрузополучателя) Тогда
							Текст.ДобавитьСтроку("        <countryCode>"+СокрЛП(СчетФактура.КодСтраныГрузополучателя)+"</countryCode>");
						КонецЕсли;
						Текст.ДобавитьСтроку("        <unp>"+СокрЛП(СчетФактура.УНПГрузополучателя)+"</unp>");
						Текст.ДобавитьСтроку("        <name>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НаименованиеГрузополучателя)+"</name>");
						Текст.ДобавитьСтроку("        <address>"+ЗаменитьНедопустимыеСимволы(СчетФактура.АдресДоставки)+"</address>");
						Текст.ДобавитьСтроку("      </consignee>");
					КонецЕсли;
					Текст.ДобавитьСтроку("    </consignees>");
					Текст.ДобавитьСтроку("  </senderReceiver>");
					
					//Условия поставки
					Текст.ДобавитьСтроку("  <deliveryCondition>");
					Текст.ДобавитьСтроку("    <contract>");
					Если Не обПустоеЗначение(СчетФактура.НомерДоговора) Тогда
						Если НРег(СокрЛП(СчетФактура.НомерДоговора)) = "оферта" Тогда
							Текст.ДобавитьСтроку("      <number>public_offer</number>");
						ИначеЕсли НРег(СокрЛП(СчетФактура.НомерДоговора)) = "без договора" Тогда
							Текст.ДобавитьСтроку("      <number>no_contract</number>");
						Иначе	
							Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерДоговора)+"</number>");
						КонецЕсли;	
						Если Не обПустоеЗначение(СчетФактура.ДатаДоговора) Тогда
							Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаДоговора,"ДФ=yyyy-MM-dd")+"</date>");
						КонецЕсли;	
					Иначе
						//Текст.ДобавитьСтроку("      <number>no_contract</number>");
						Текст.ДобавитьСтроку("      <number></number>");
						
					КонецЕсли;	
					Если обПустоеЗначение(СчетФактура.ВидДокументаПоставки) И
						НЕ обПустоеЗначение(СчетФактура.УНППоставщика) И
						СчетФактура.СтатусПоставщика <> Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация И
						НЕ СчетФактура.ФлагНеВыставлятьПолучателю Тогда
						// С 15.01.2018 г. добавлен контроль при выставлении ЭСЧФ обязательности заполнения данных первичного документа,
						// если поле 17. "УНП поставщика" непустое и не равно УНП составителя ЭСЧФ.
						// Если поле "Вид документа поставки" пустое, то поставляем код документа 600, что соответствует виду документа "Без документа"
						
						Если ЗначениеЗаполнено(СчетФактура.ДокументОснование) Тогда
							Если ТипЗнч(СчетФактура.ДокументОснование) <> Тип("ДокументСсылка.СборкаТоваров") Тогда 	
								
								Текст.ДобавитьСтроку("      <documents>");
								Текст.ДобавитьСтроку("        <document>");
								Текст.ДобавитьСтроку("          <docType>");			
								Текст.ДобавитьСтроку("            <code>"+"600"+"</code>");
								Текст.ДобавитьСтроку("          </docType>");
								Текст.ДобавитьСтроку("	        <blankCode></blankCode>");
								Текст.ДобавитьСтроку("	        <seria></seria>");
								Текст.ДобавитьСтроку("	        <number></number>");			
								Текст.ДобавитьСтроку("        </document>");
								Текст.ДобавитьСтроку("      </documents>");
							КонецЕсли; 
						КонецЕсли; 
						
					Иначе	
						Если Не обПустоеЗначение(СчетФактура.ВидДокументаПоставки) ИЛИ
							Не обПустоеЗначение(СчетФактура.ДатаДокументаПоставки) ИЛИ
							Не обПустоеЗначение(СчетФактура.НомерДокументаПоставки) Тогда		
							
							Текст.ДобавитьСтроку("      <documents>");
							Текст.ДобавитьСтроку("        <document>");
							Текст.ДобавитьСтроку("          <docType>");
							Если Не обПустоеЗначение(СчетФактура.ВидДокументаПоставки) Тогда
								Текст.ДобавитьСтроку("            <code>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ВидДокументаПоставки.Код)+"</code>");
							КонецЕсли;
							Если Не обПустоеЗначение(СчетФактура.НазваниеДокументаПоставки) и СокрЛП(СчетФактура.ВидДокументаПоставки.Код="601")Тогда
								Текст.ДобавитьСтроку("            <value>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НазваниеДокументаПоставки)+"</value>");
							КонецЕсли;
							Текст.ДобавитьСтроку("          </docType>");
							Если  Не обПустоеЗначение(СчетФактура.ДатаДокументаПоставки) Тогда
								Текст.ДобавитьСтроку("          <date>"+Формат(СчетФактура.ДатаДокументаПоставки,"ДФ=yyyy-MM-dd")+"</date>");
							КонецЕсли;
							Текст.ДобавитьСтроку("          <blankCode>"+СокрЛП(СчетФактура.КодТипаБланка)+"</blankCode>");
							Текст.ДобавитьСтроку("          <seria>"+СокрЛП(СчетФактура.СерияДокументаПоставки)+"</seria>");
							Текст.ДобавитьСтроку("          <number>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НомерДокументаПоставки)+"</number>");
							
							Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ или СтрокаЭСЧФ.Ссылка.ФлагВозвратаПоАктуНедостачи Тогда  ///////77w 07-05-2020
								Если СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.ДополнительныйБезЭСЧФ Тогда   ///////77w 07-05-2020
									Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ тогда
										Текст.ДобавитьСтроку("	        <refund>true</refund>");
									Иначе
										Текст.ДобавитьСтроку("	        <refund>false</refund>");
									Конецесли;	
									//Текст.ДобавитьСтроку("          <refund>true</refund>");       ///////77w 29-06-2020
									//Текст.ДобавитьСтроку("	        <refund>true</refund>");
								КонецЕсли;	
							КонецЕсли;
							
							Текст.ДобавитьСтроку("        </document>");
							Текст.ДобавитьСтроку("      </documents>");
						КонецЕсли;
					КонецЕсли;	
					Текст.ДобавитьСтроку("    </contract>");
					Текст.ДобавитьСтроку("    <description>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ДополнительныеСведения)+"</description>");
					Текст.ДобавитьСтроку("  </deliveryCondition>");
				КонецЕсли;
				
				//Товары
				СуммаСНДС = ФорматДляВыгрузки(СчетФактура.Номенклатура.Итог("СуммаСНДС"));
				СуммаАкциза = ФорматДляВыгрузки(СчетФактура.Номенклатура.Итог("СуммаАкциза"));
				СуммаНДС = ФорматДляВыгрузки(СчетФактура.Номенклатура.Итог("СуммаНДС"));
				СуммаБезНДС = ФорматДляВыгрузки(СчетФактура.Номенклатура.Итог("СуммаБезНДС"));
				
				
				
				
				
				
				
				
				
				
				
				Текст.ДобавитьСтроку("  <roster totalCostVat="""+СуммаСНДС+""" totalExcise="""+СуммаАкциза+""" totalVat="""+СуммаНДС+
				""" totalCost="""+СуммаБезНДС+""">");
				Для каждого СтрокаТМЦ Из СчетФактура.Номенклатура Цикл
					
					Попытка
						СтрТМЦ = СокрЛП(?(Не ПустаяСтрока(СтрокаТМЦ.ТМЦ.ПолноеНаименование), СокрЛП(СтрокаТМЦ.ТМЦ.ПолноеНаименование), СокрЛП(СтрокаТМЦ.ТМЦ.Наименование)));	
						Страна = "";
						Страна = ?(ЗначениеЗаполнено(СтрокаТМЦ.ТМЦ.СтранаПроисхождения), СтрокаТМЦ.ТМЦ.СтранаПроисхождения, СтрокаТМЦ.ТМЦ.СтранаВвоза);
						СтрТМЦ = СтрТМЦ + ", " +СокрЛП(Страна);       //////////77w qaws
					Исключение
						СтрТМЦ = СокрЛП(СтрокаТМЦ.ТМЦ);			
					КонецПопытки;
					Если СчетФактура.ФлагВыводитьХарактеристикиТМЦ = Истина И
						НЕ обПустоеЗначение(СтрокаТМЦ.ХарактеристикаТМЦ) Тогда
						СтрТМЦ = СтрТМЦ + " " + СокрЛП(СтрокаТМЦ.ХарактеристикаТМЦ.Наименование);	
					КонецЕсли;	
					
					
					ТНВЭД="";
					ФлагВыводитьТНВЭД = Истина;
					// При выгрузке ЭСЧФ на Портал не выгружается код ТНВЭД в следующих случаях:
					// - Если в строке табличной части «Данные по ТМЦ» установлена ставка 20 (25) % или расчетная и статус поставщика «Иностранная организация» и
					//	не заполнены реквизиты ЭСЧФ «20. Регистрационный номер выпуска товаров», «21. Реквизиты заявления о ввозе товаров» или статус поставщика отличен от «Иностранная организация»
					// - Если вид операции выставления ЭСЧФ «Реализация физическим лицам».
					
					//Если ((СтрокаТМЦ.СтавкаНДС > 10 ИЛИ
					//	СтрокаТМЦ.СтавкаНДС.РасчетнаяСтавка) И
					//	НЕ СчетФактура.ФлагВзаимозависимоеЛицоПоставщик И
					//	НЕ СчетФактура.ФлагВзаимозависимоеЛицоПолучатель И
					//	((СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация И
					//	ПустаяСтрока(СчетФактура.НомерГТДПриВвозе) И
					//	ПустаяСтрока(СчетФактура.НомерЗаявленияОВвозеТоваровПриВвозе)) ИЛИ
					//	СчетФактура.СтатусПоставщика <> Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация)) ИЛИ
					//	СчетФактура.ВидОперацииВыставленияЭСЧФ = Перечисления.ВидыОперацийВыставленияЭСЧФ.ФизическиеЛица Тогда
					//	ФлагВыводитьТНВЭД = Ложь;
					//КонецЕсли;  
					
					
					Если СтрокаТМЦ.СтавкаНДС > 10 Тогда
						//СтрокаТМЦ.СтавкаНДС.РасчетнаяСтавка) И
						//НЕ СчетФактура.ФлагВзаимозависимоеЛицоПоставщик И
						//НЕ СчетФактура.ФлагВзаимозависимоеЛицоПолучатель И
						//((СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация И
						//ПустаяСтрока(СчетФактура.НомерГТДПриВвозе) И
						//ПустаяСтрока(СчетФактура.НомерЗаявленияОВвозеТоваровПриВвозе)) ИЛИ
						//СчетФактура.СтатусПоставщика <> Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация)) ИЛИ
						//СчетФактура.ВидОперацииВыставленияЭСЧФ = Перечисления.ВидыОперацийВыставленияЭСЧФ.ФизическиеЛица Тогда
						ФлагВыводитьТНВЭД = Истина;
					КонецЕсли;  
					
					
					
					Если ФлагВыводитьТНВЭД И
						Не обПустоеЗначение(СтрокаТМЦ.ТНВЭД) Тогда
						Попытка
							ТНВЭД = СокрЛП(СтрокаТМЦ.ТНВЭД);
						Исключение
							ТНВЭД = СокрЛП(СтрокаТМЦ.ТНВЭД);			
						КонецПопытки;
					КонецЕсли;
					ОКЭД="";
					Если Не обПустоеЗначение(СтрокаТМЦ.ОКЭД) Тогда
						Попытка
							ОКЭД = СокрЛП(СтрокаТМЦ.ОКЭД.Код);
						Исключение
							ОКЭД = СокрЛП(СтрокаТМЦ.ОКЭД);			
						КонецПопытки;
					КонецЕсли;
					
					СтавкаНДС = "";
					СтавкаНДС = СтрокаТМЦ.СтавкаНДС;
					
					Если СтрокаТМЦ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.НДС0 Тогда				
						ТипСтавки ="ZERO"; 
					ИначеЕсли СтрокаТМЦ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.БезНДС Тогда				
						ТипСтавки ="NO_VAT"; 
						СтавкаНДС = "0";      /////// тут ставка Без НДС
					ИначеЕсли СтрокаТМЦ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.Расчетная Тогда				
						ТипСтавки ="CALCULATED";
						Если СтрокаТМЦ.РасчетнаяСтавкаНДС > 0 Тогда
							СтавкаНДС = СтрокаТМЦ.РасчетнаяСтавкаНДС;
						КонецЕсли;	
					Иначе
						ТипСтавки ="DECIMAL";
					КонецЕсли;
					ДопДаные="";
					
					Если СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ВвознойНДС Тогда
						ДопДаные  = "IMPORT_VAT"; 
					ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ВычетВПолномОбъеме Тогда
						ДопДаные  = "DEDUCTION_IN_FULL";
					ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ОсвобождениеОтНДС Тогда
						ДопДаные  = "VAT_EXEMPTION";
					ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.РеализацияЗаПределамиРБ Тогда
						ДопДаные  = "OUTSIDE_RB";
					ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ПродукцияРастениеводстваПчеловодства Тогда
						ДопДаные  = "FARMING_PRODUCTS"; 
					ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ПродовольственныеТоварыИТоварыДляДетей Тогда
						ДопДаные  = "KID_GOODS"; 
					ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ЛекарственныеСредстваИМедицинскиеИзделия Тогда
						ДопДаные  = "MEDICINE_DRUG"; 
					КонецЕсли;	
					
					Текст.ДобавитьСтроку("    <rosterItem>");
					Текст.ДобавитьСтроку("      <number>"+ФорматДляВыгрузки(СтрокаТМЦ.НомерСтроки)+"</number>");
					Текст.ДобавитьСтроку("      <name>"+ЗаменитьНедопустимыеСимволы(СтрТМЦ)+"</name>");			
					Текст.ДобавитьСтроку("      <code>"+ТНВЭД+"</code>");			
					Если Не обПустоеЗначение(ОКЭД) Тогда                                
						Текст.ДобавитьСтроку("      <code_oced>"+ОКЭД+"</code_oced>");
					КонецЕсли;
					
					
					
					КодЕдИзм = "";           ////////77w qaws
					
					Запрос1 = Новый Запрос;
					Запрос1.Текст = 
					"ВЫБРАТЬ
					|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
					|	УпаковкиЕдиницыИзмерения.Код КАК Код,
					|	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
					|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
					|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияЕдиницаИзмеренияКод
					|ИЗ
					|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
					|ГДЕ
					|	УпаковкиЕдиницыИзмерения.Владелец = &ВладелецНоменклатура
					|	И УпаковкиЕдиницыИзмерения.Наименование = &НаименованиеЕдИзм";
					
					//|	И УпаковкиЕдиницыИзмерения.Владелец = &ВладелецНаборУпаковак";
					
					Запрос1.УстановитьПараметр("ВладелецНаборУпаковак", Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры);
					Запрос1.УстановитьПараметр("ВладелецНоменклатура", СтрокаТМЦ.ТМЦ);
					Запрос1.УстановитьПараметр("НаименованиеЕдИзм", СтрокаТМЦ.ЕдиницаИзмерения);
					
					РезультатЗапроса1 = Запрос1.Выполнить();
					
					ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
						КодЕдИзм =  ВыборкаДетальныеЗаписи1.Ссылка.ЕдиницаИзмерения.ЕдиницаИзмерения.Код;
					КонецЦикла;
					
					
					
					Если Не обПустоеЗначение(КодЕдИзм) Тогда
						Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
					Иначе
						
						Если СтрНайти(СтрокаТМЦ.ЕдиницаИзмерения,"тыс") > 0 Тогда
							КодЕдИзм = "798";
							Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
						КонецЕсли; 
						
						Если обПустоеЗначение(КодЕдИзм) Тогда
							Если СтрНайти(СтрокаТМЦ.ЕдиницаИзмерения,"шт") > 0 Тогда
								КодЕдИзм = "796";
								Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
							КонецЕсли; 
						КонецЕсли; 
						
						Если СтрНайти(СтрокаТМЦ.ЕдиницаИзмерения,"кг") > 0 Тогда
							КодЕдИзм = "166";
							Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
						КонецЕсли; 
						
						Если СтрНайти(СтрокаТМЦ.ЕдиницаИзмерения,"пак") > 0 Тогда
							КодЕдИзм = "796";
							Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
						КонецЕсли; 
						
						
					КонецЕсли;
					
					Текст.ДобавитьСтроку("      <count>"+ФорматДляВыгрузки(СтрокаТМЦ.Количество)+"</count>");
					Текст.ДобавитьСтроку("      <price>"+ФорматДляВыгрузки(СтрокаТМЦ.Цена)+"</price>");
					Если СтрокаТМЦ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.Расчетная Тогда
						// Для расчетной ставки сумма без НДС = сумме с НДС
						Текст.ДобавитьСтроку("      <cost>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаСНДС)+"</cost>");
					Иначе
						Текст.ДобавитьСтроку("      <cost>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаБезНДС)+"</cost>");
					КонецЕсли;	
					
					Текст.ДобавитьСтроку("      <summaExcise>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаАкциза)+"</summaExcise>");
					Текст.ДобавитьСтроку("      <vat>");
					Текст.ДобавитьСтроку("        <rate>"+ФорматДляВыгрузки(СтавкаНДС)+"</rate>");
					Текст.ДобавитьСтроку("        <rateType>"+ТипСтавки+"</rateType>");
					Текст.ДобавитьСтроку("        <summaVat>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаНДС)+"</summaVat>");
					Текст.ДобавитьСтроку("      </vat>");
					Текст.ДобавитьСтроку("      <costVat>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаСНДС)+"</costVat>");
					Если СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация Тогда //////И        77w qaws
						//(СтрокаТМЦ.СтавкаНДС = Справочники.СтавкиНДС._0 ИЛИ
						//СтрокаТМЦ.СтавкаНДС = Справочники.СтавкиНДС.БезНДС) Тогда
						Текст.ДобавитьСтроку("      <descriptions>");
						Текст.ДобавитьСтроку("        <description>"+ДопДаные+"</description>");
						//Текст.ДобавитьСтроку("        <description>IMPORT_VAT</description>");
						//Текст.ДобавитьСтроку("        <description>VAT_EXEMPTION</description>");	
						Текст.ДобавитьСтроку("      </descriptions>");
					Иначе	
						Если Не обПустоеЗначение(ДопДаные) Тогда
							Текст.ДобавитьСтроку("      <descriptions>");
							Текст.ДобавитьСтроку("        <description>"+ДопДаные+"</description>");
							Текст.ДобавитьСтроку("      </descriptions>");
						КонецЕсли;
					КонецЕсли;
					Текст.ДобавитьСтроку("    </rosterItem>");
				КонецЦикла;
				Текст.ДобавитьСтроку("  </roster>");
				Текст.ДобавитьСтроку("</issuance>");
				
				ИмяФайла = "invoice_"+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ);
				//СтрокаЭСЧФ.ИмяФайла = ИмяФайла;
				лФайл = Новый Файл(КаталогРазмещенияФайлов+"\in\");	
				Если Не лФайл.Существует() Тогда
					СоздатьКаталог(КаталогРазмещенияФайлов+"\in\");
				КонецЕсли;
				
				Попытка
					Текст.Записать(КаталогРазмещенияФайлов+"\in\"+ИмяФайла+".xml","CESU-8");
					
					
					//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
					//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
					//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
					
					
					////ПодписатьОтправить(ИмяФайла,СтрокаЭСЧФ);
					
					//Чтение файла
					InvVatXml = EVatService.CreateEDoc; 
					Если InvVatXml.Document.LoadFromFile(КаталогРазмещенияФайлов+"\in\"+ИмяФайла+".xml") <> 0 Тогда
						Сообщить("Ошибка чтения файла: " + EVatService.LastError);
						//Возврат;
						Продолжить;
					КонецЕсли;
					
					////Проверка XML файла на соответствие  xsd -схеме
					//InvVatType = InvVatXml.Document.GetXmlNodeValue("issuance/general/documentType");
					//Если InvVatType = "ORIGINAL" ИЛИ 
					//	InvVatType = "ADD_NO_REFERENCE" Тогда
					//	xsd = "MNSATI_original.xsd";
					//ИначеЕсли  InvVatType =  "FIXED" Тогда
					//	xsd = "MNSATI_fixed.xsd";
					//ИначеЕсли InvVatType = "ADDITIONAL" Тогда
					//	xsd = "MNSATI_additional.xsd";
					//Иначе
					//	Сообщить("Файл " + ИмяФайла+".xml содержит неверный тип документа");	  
					//	//возврат;
					//	Продолжить;
					//КонецЕсли;
					
					//////// 77w qaws   07-07-2020
					
					//Проверка XML файла на соответствие  xsd -схеме
					InvVatType = InvVatXml.Document.GetXmlNodeValue("issuance/general/documentType");
					Если InvVatType = "ORIGINAL" Тогда 
						//ИЛИ InvVatType = "ADD_NO_REFERENCE" Тогда
						xsd = "MNSATI_original.xsd";
					ИначеЕсли  InvVatType =  "FIXED" Тогда
						xsd = "MNSATI_fixed.xsd";
					ИначеЕсли InvVatType = "ADDITIONAL" Тогда
						xsd = "MNSATI_additional.xsd";
					ИначеЕсли InvVatType = "ADD_NO_REFERENCE" Тогда
						xsd = "MNSATI_add_no_reference.xsd";
					Иначе
						Сообщить("Файл " + ИмяФайла+".xml содержит неверный тип документа");	  
						//Возврат;
						Продолжить;
					КонецЕсли;
					
					
					лФайл = Новый Файл(КаталогРазмещенияФайлов+"\xsd\" + xsd); 
					
					
					
					Если Не лФайл.Существует() Тогда
						Сообщить( "Отсутствует файл " + КаталогРазмещенияФайлов+"\xsd\" + xsd+".Скачайте актуальные схемы на портале и положите их в папку "+КаталогРазмещенияФайлов+"\xsd\");
						//Возврат;
						Продолжить;
					КонецЕсли;//
					
					res = InvVatXml.Document.ValidateXML(КаталогРазмещенияФайлов+"\xsd\" + xsd, 0);
					
					Если res <> 0 Тогда
						Сообщить( EVatService.LastError + " Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ) +" не соответствует требуемой схеме xsd");
							Заметка = Справочники.Заметки.СоздатьЭлемент();
							Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
							Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
							Заметка.ТекстСодержания =  EVatService.LastError + " Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ) +" не соответствует требуемой схеме xsd";
							
							//Заметка.Содержание = ОписаниеОшибки();
							//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
							Заметка.ТекстЗаметки =  EVatService.LastError + " Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ) +" не соответствует требуемой схеме xsd";
							Заметка.ДляРабочегоСтола = Истина;
							Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
							Заметка.Записать();
						//Возврат;
						Продолжить;
					КонецЕсли;
					
					
					
					
					
					
					//Выработка подписи
					res = InvVatXml.Sign(0);
					Если res <> 0 Тогда
						Сообщить("Ошибка выработки подписи: " + EVatService.LastError);
						//Возврат;
						Продолжить;
					КонецЕсли;
					
					//Сохранение подписанного файла с расширением ".edoc.xml"
					лФайл = Новый Файл(КаталогРазмещенияФайлов+"\out\");	
					Если Не лФайл.Существует() Тогда
						СоздатьКаталог(КаталогРазмещенияФайлов+"\out\");
					КонецЕсли;
					
					fn = КаталогРазмещенияФайлов+"\out\"+ИмяФайла+ ".edoc.xml";
					res = InvVatXml.SaveToFile(fn);
					Если res <> 0 Тогда
						Сообщить("Ошибка сохранения подписанного документа: " + EVatService.LastError);
						//Возврат;
						Продолжить;
					КонецЕсли;
					
					//Отправка подписанного документа на портал ЭСФЧ               /////// 77w qaws    ТУТ ОТПРАВКА ПОЛНАЯ
					res = EVatService.SendEDoc(InvVatXml);
					Если res <> 0 Тогда
						Сообщить("Ошибка отправки: " + EVatService.LastError);
						//Возврат;
						Продолжить;
					Иначе
						//Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" отправлен");
					КонецЕсли;
					
					//Ответ от портала ЭСФЧ будет сохранен в фале с расширением ".ticket.error.xml" в случае 
					// ошибки  и с   ".ticket.xml"  в случае успешного принятия файла сервисом
					
					InvVatTicket = EVatService.Ticket;
					Если InvVatTicket.Accepted <> 0 Тогда
						Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят: " + InvVatTicket.Message);
						
							Заметка = Справочники.Заметки.СоздатьЭлемент();
							Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
							Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
							Заметка.ТекстСодержания =  "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят: " + InvVatTicket.Message;
							
							//Заметка.Содержание = ОписаниеОшибки();
							//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
							Заметка.ТекстЗаметки =  "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят: " + InvVatTicket.Message;
							Заметка.ДляРабочегоСтола = Истина;
							Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
							Заметка.Записать();
						
						fn = КаталогРазмещенияФайлов+"\out\"+ИмяФайла+ ".ticket.error.xml";
					Иначе
						
						Попытка
							InvVatStatus = EVatService.GetStatus(СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ));
							Если InvVatStatus.Verify() = 0 Тогда 
								//Сообщить("Message: " + InvVatStatus.Message); 
								Статус = InvVatStatus.Status;
								//Сообщить("Status : " + Статус);
								Если Статус="COMPLETED" Тогда
									СтрокаЭСЧФ.СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен");	
									СтрокаЭСЧФ.НовыйСтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен");
									Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
									
								ИначеЕсли Статус="COMPLETED_SIGNED" Тогда  
									СтрокаЭСЧФ.СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен_Подписан");
									Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
								ИначеЕсли Статус="ON_AGREEMENT" Тогда  
									СтрокаЭСЧФ.СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.НаСогласовании");
									Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
								ИначеЕсли Статус="IN_PROGRESS" Тогда
									СтрокаЭСЧФ.СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.ВРазработке");
									
								ИначеЕсли Статус="CANCELLED" Тогда
									СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Аннулирован");
								ИначеЕсли Статус="ON_AGREEMENT_CANCEL" Тогда
									СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен_Аннулирование");
									
								ИначеЕсли Статус="ERROR" Тогда
									//Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status);
									Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
									Заметка = Справочники.Заметки.СоздатьЭлемент();
									Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
									Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
									Заметка.ТекстСодержания = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
									
									//Заметка.Содержание = ОписаниеОшибки();
									//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
									Заметка.ТекстЗаметки = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
									Заметка.ДляРабочегоСтола = Истина;
									Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
									Заметка.Записать();
								Иначе
									//Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status);
									Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
									
									//Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status);
									Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
									Заметка = Справочники.Заметки.СоздатьЭлемент();
									Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
									Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
									Заметка.ТекстСодержания = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
									
									//Заметка.Содержание = ОписаниеОшибки();
									//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
									Заметка.ТекстЗаметки = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
									Заметка.ДляРабочегоСтола = Истина;
									Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
									Заметка.Записать();
									
									
									//	Возврат;
								КонецЕсли;
								
								
								//ЭСЧФ_Объект = СтрокаЭСЧФ.Ссылка.ПолучитьОбъект();
								//
								//Если ЭСЧФ_Объект <> Документы.ЭСЧФИсходящий.ПустаяСсылка()  Тогда
								//	Если ЭСЧФ_Объект.НовыйСтатусЭСЧФ <> Перечисления.СтатусыЭСЧФ.ПустаяСсылка()  Тогда
								//		Если ЭСЧФ_Объект.НовыйСтатусЭСЧФ <> ЭСЧФ_Объект.СтатусЭСЧФ Тогда
								//			ЭСЧФ_Объект.СтатусЭСЧФ = ЭСЧФ_Объект.НовыйСтатусЭСЧФ;
								//			ЭСЧФ_Объект.ДатаИзмененияСтатуса = ЭСЧФ_Объект.ДатаИзмененияСтатуса;
								//			ЭСЧФ_Объект.Записать();
								//		КонецЕсли; 
								//	КонецЕсли; 
								//КонецЕсли;
								//
								//
								//
								//Если ((СтрокаЭСЧФ.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен)
								//	или (СтрокаЭСЧФ.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен_Подписан)
								//	или (СтрокаЭСЧФ.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.НаСогласовании)
								//	) Тогда
								//	
								//		 ДокРеализ = СтрокаЭСЧФ.Ссылка.ДокументОснование.ПолучитьОбъект();		
								//		 ДокРеализ.ЭСЧФ = СтрокаЭСЧФ.Ссылка;
								//		 Попытка
								//		 ДокРеализ.Записать();	
								//		 Исключение
								//		     //ОписаниеОшибки()
								//		 КонецПопытки; 
								//КонецЕсли; 
															
								
							Иначе 
								Сообщить("Ошибка статуса: " + InvVatStatus.LastError+"   "+"Message: " + InvVatStatus.Message); 
								//Возврат; 
							КонецЕсли;
						Исключение
							Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
							Заметка = Справочники.Заметки.СоздатьЭлемент();
							Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
							Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
							Заметка.ТекстСодержания = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
							
							//Заметка.Содержание = ОписаниеОшибки();
							//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
							Заметка.ТекстЗаметки = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
							Заметка.ДляРабочегоСтола = Истина;
							Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
							Заметка.Записать();
							//Возврат;
						КонецПопытки;
						
						//Сообщить("Message: " + InvVatStatus.Message); 
						
						//Заметка = Справочники.Заметки.СоздатьЭлемент();
						//Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Труханович Марина");
						//Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
						//Заметка.ТекстСодержания = "Message: " + InvVatStatus.Message;
						//
						////Заметка.Содержание = ОписаниеОшибки();
						////Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
						//Заметка.ТекстЗаметки = "" + "Message: " + InvVatStatus.Message;
						//Заметка.ДляРабочегоСтола = Истина;
						//Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
						//Заметка.Записать();
						
						
						//ИЗМЕНИТЬ_СТАТУС_ЭСЧФ(СтрокаЭСЧФ.Ссылка,СтрокаЭСЧФ.СтатусЭСЧФ,СтрокаЭСЧФ.ДатаИзмененияСтатуса);
						//СВЯЗАТЬ_РЕАЛИЗАЦИЮ_ИЗМЕНИТЬ_СТАТУС_ЭСЧФ(СтрокаЭСЧФ.Ссылка,СтрокаЭСЧФ.СтатусЭСЧФ,СтрокаЭСЧФ.ДатаИзмененияСтатуса);
						
						
						

						
						
					КонецЕсли;  
					
					
					
					
					//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
					//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
					//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
					
					
					
					
					//Если ИзменятьСтатусЭСЧФ  Тогда    ////////77w qaws
					//	СтрокаЭСЧФ.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен;
					//КонецЕсли;
					
				Исключение
					Сообщить("Ошибка записи файла!"+Символы.ПС+ОписаниеОшибки());
					СтрокаЭСЧФ.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.ВРазработке_Ошибка;
				КонецПопытки;
				
				
				//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
				
				
				
				
				
				
				
				
				
				
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
			//ОснованиеОбъект = Основание.ПолучитьОбъект();
			//ОснованиеОбъект.ЭСЧФ = Новая_ЭСЧФ.Ссылка;
			//ОснованиеОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	 //ПроверитьСтатусыНаСервере();
	
	
КонецПроцедуры


&НаСервере
Процедура ПроверитьСтатусыНаСервере() Экспорт
	
	
	КомандаОбновитьСОС= "C:\Program Files (x86)\Avest\AvPCM_nces\get_crl.bat";
	         
	Shell = Новый COMОбъект("WScript.Shell");
	WshExec = Shell.Exec(КомандаОбновитьСОС);
	OutStream = WshExec.StdOut;  
	    
	Str = "";
	Пока Не OutStream.AtEndOfStream Цикл
	   Str = СокрЛП(OutStream.ReadLine());
	КонецЦикла;
		
	КаталогРазмещенияФайлов = "\\192.168.0.111\eInvVat";
	
	Соединение = Неопределено;
	Отказ = ложь;
	ТекстОшибки = "";
	СтрокаСоединения = "";
	
	//СтрокаСоедиенения = "PUB_KEY_ID=" + СокрЛП(СтрЗаменить(НастройкиПодключенияОрг.Ключ, " ", "")) + ";PASSWORD_KEY=" + НастройкиПодключенияОрг.Пароль;
	СтрокаСоединения = "UNP=600052664" + ";PASSWORD_KEY=293358595";
	
	
	Соединение = ПолучитьСоединениеМНС(СтрокаСоединения, ТекстОшибки, Отказ);
	
	Если Соединение <> Неопределено Тогда
		
		ПараметрыПодключения = Новый Соответствие;
		ПараметрыПодключения.Вставить("Соединение",Соединение);
		
		EVatService = ПараметрыПодключения.Получить("Соединение");
	Иначе
		Возврат;
	КонецЕсли;	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭСЧФИсходящий.Ссылка КАК Ссылка,
	|	ЭСЧФИсходящий.ДокументОснование КАК ДокументОснование
	|ИЗ
	|	Документ.ЭСЧФИсходящий КАК ЭСЧФИсходящий
	|ГДЕ
	|	ЭСЧФИсходящий.ДокументОснование.Проведен = &Проведен
	|	И ЭСЧФИсходящий.ДокументОснование.Дата МЕЖДУ &ДатаНач И &ДатаКон
	//|	И ТИПЗНАЧЕНИЯ(ЭСЧФИсходящий.ДокументОснование.Ссылка) = ТИП(Документ.РеализацияТоваровУслуг)
	|	И ЭСЧФИсходящий.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ЭСЧФИсходящий.Проведен = &Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭСЧФИсходящий.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(ТекущаяДата()-3296000));   
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКонОст", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Проведен", Истина);                     
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	
	Если РезультатЗапроса.Пустой() Тогда
		//Сообщить("Нет данных для формирования ЭСЧФ.");
		Возврат;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Основание = Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Основание = ВыборкаДетальныеЗаписи.ДокументОснование;
		
		//Если ТипЗнч(Основание.ссылка) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		//	Продолжить;
		//КонецЕсли; 	
		
		СтрокаЭСЧФ = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

		
		InvVatStatus = EVatService.GetStatus(СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.НомерЭСЧФ));
		Попытка
			
			Если InvVatStatus.Verify() = 0 Тогда 
				//Сообщить("Message: " + InvVatStatus.Message); 
				Статус = InvVatStatus.Status;
				//Сообщить("Status : " + Статус);
				СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.ПустаяСсылка();
				Если Статус="COMPLETED" Тогда
					СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен");	
					Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
					
				ИначеЕсли Статус="COMPLETED_SIGNED" Тогда  
					СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен_Подписан");
					Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
				ИначеЕсли Статус="ON_AGREEMENT" Тогда  
					СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.НаСогласовании");
					Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
				ИначеЕсли Статус="IN_PROGRESS" Тогда
					СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.ВРазработке");
					
				ИначеЕсли Статус="CANCELLED" Тогда
					СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Аннулирован");
				ИначеЕсли Статус="ON_AGREEMENT_CANCEL" Тогда
					СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен_Аннулирование");
					
				ИначеЕсли Статус="ERROR" Тогда
					Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status);
					Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
				Иначе
					Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status);
					Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
					//	Возврат;
				КонецЕсли;
				
				
				
			Иначе 
				Сообщить("Ошибка статуса: " + InvVatStatus.LastError+"   "+"Message: " + InvVatStatus.Message); 
				//Возврат; 
			КонецЕсли;
			
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		
		Если СтрокаЭСЧФ <> Документы.ЭСЧФИсходящий.ПустаяСсылка()  Тогда
			Если СтатусЭСЧФ <> Перечисления.СтатусыЭСЧФ.ПустаяСсылка()  Тогда
				Если СтатусЭСЧФ <> СтрокаЭСЧФ.СтатусЭСЧФ Тогда
					СтрокаЭСЧФ.СтатусЭСЧФ = СтатусЭСЧФ;
					//ЭСЧФ_Объект.ДатаИзмененияСтатуса = ЭСЧФ_Объект.ДатаИзмененияСтатуса;
					СтрокаЭСЧФ.Записать();
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;                 
		
		
		Если ТипЗнч(Основание.ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если ((ВыборкаДетальныеЗаписи.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен)
				или (ВыборкаДетальныеЗаписи.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен_Подписан)
				или (ВыборкаДетальныеЗаписи.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.НаСогласовании)
				) Тогда
				
				ДокРеализ = ВыборкаДетальныеЗаписи.Ссылка.ДокументОснование.ПолучитьОбъект();		
				ДокРеализ.ЭСЧФ = ВыборкаДетальныеЗаписи.Ссылка;
				Попытка
					ДокРеализ.ОбменДанными.Загрузка = Истина;
					ДокРеализ.Записать();	
				Исключение
					//ОписаниеОшибки()
				КонецПопытки; 
			КонецЕсли; 
		КонецЕсли;
		
		
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьСтатусы(Команда)
	ПроверитьСтатусыНаСервере();
КонецПроцедуры

Функция ПолучитьПуть() 
	Возврат (Константы.ПутьОбменаСБухгалтерией.Получить());	
КонецФункции	


Процедура ПроверитьСуммыПереоценкиРозницы() Экспорт
	
		ДанныеДатаНачалаВыгрузки = Дата(1,1,1);
		ДанныеДатаКонцаВыгрузки = Дата(1,1,1);
		
		ЧислоДняТекДаты = Число(День(ТекущаяДата()));
		ДанныеДатаКонцаВыгрузки = КонецДня(ТекущаяДата());
		
		Если ЧислоДняТекДаты > Константы.яЧислоПредыдущихДнейДляВыгрузкиВБух.Получить() Тогда
			ДанныеДатаНачалаВыгрузки = НачалоМесяца(ТекущаяДата());
		Иначе
			ДанныеДатаНачалаВыгрузки = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
		КонецЕсли; 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Регистратор КАК ДокументПереоценки
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	ЦеныНоменклатуры.Период МЕЖДУ &НачДата И &КонДата
		|	И ЦеныНоменклатуры.ВидЦены = &ВидЦены
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатуры.Регистратор,
		|	ЦеныНоменклатуры.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныНоменклатуры.Период";
		
		//"ВЫБРАТЬ
		//|	СуммыПереоценкиРозницы.ДокументПереоценки КАК ДокументПереоценки
		//|ИЗ
		//|	РегистрСведений.СуммыПереоценкиРозницы КАК СуммыПереоценкиРозницы
		//|ГДЕ
		//|	СуммыПереоценкиРозницы.ДатаПереоценки МЕЖДУ &НачДата И &КонДата
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	СуммыПереоценкиРозницы.ДокументПереоценки
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	СуммыПереоценкиРозницы.ДокументПереоценки.Дата";
		Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
		Запрос.УстановитьПараметр("НачДата", ДанныеДатаНачалаВыгрузки);
		Запрос.УстановитьПараметр("КонДата", ДанныеДатаКонцаВыгрузки);
		
		РезультатЗапроса = Запрос.Выполнить();
		//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		А = 1;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Наименование", "Фоновое заполнение РС Суммы переоценки розницы");
			Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);

			ЗаданияВФоне = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);

			Пока ЗаданияВФоне.Количество() > 4 Цикл
				ДатаКон = ТекущаяДата() + 3;//1 секундой больше
			    Пока ТекущаяДата() < ДатаКон Цикл
			        //пока выполняется цикл поток прерван
				КонецЦикла;
				ЗаданияВФоне = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
			КонецЦикла;

			
			Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПереоценки) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда 
					ДокУстЦен = ВыборкаДетальныеЗаписи.ДокументПереоценки.ПолучитьОбъект();
					ДокУстЦен.Записать(РежимЗаписиДокумента.Проведение);
			ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПереоценки) = Тип("ДокументСсылка.ЗаказКлиента") Тогда  
	 				ДокУстЦен = ВыборкаДетальныеЗаписи.ДокументПереоценки.ПолучитьОбъект();
					ДокУстЦен.Записать(РежимЗаписиДокумента.Проведение);	
			КонецЕсли;
			
		КонецЦИКЛА;
	
КонецПроцедуры



///////Тест многопоточности обработки данных
Процедура ПроверитьСуммыПереоценкиРозницы_УДАЛИТЬ() Экспорт
	
		ДанныеДатаНачалаВыгрузки = Дата(1,1,1);
		ДанныеДатаКонцаВыгрузки = Дата(1,1,1);
		
		ЧислоДняТекДаты = Число(Формат(ТекущаяДата(),"ДФ=dd"));
		ДанныеДатаКонцаВыгрузки = КонецДня(ТекущаяДата());
		
		Если ЧислоДняТекДаты > Константы.яЧислоПредыдущихДнейДляВыгрузкиВБух.Получить() Тогда
			ДанныеДатаНачалаВыгрузки = НачалоМесяца(ТекущаяДата());
		Иначе
			ДанныеДатаНачалаВыгрузки = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(),-1));
		КонецЕсли; 
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СуммыПереоценкиРозницы.ДокументПереоценки КАК ДокументПереоценки
		|ИЗ
		|	РегистрСведений.СуммыПереоценкиРозницы КАК СуммыПереоценкиРозницы
		|ГДЕ
		|	СуммыПереоценкиРозницы.ДатаПереоценки МЕЖДУ &НачДата И &КонДата
		|
		|СГРУППИРОВАТЬ ПО
		|	СуммыПереоценкиРозницы.ДокументПереоценки
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммыПереоценкиРозницы.ДокументПереоценки.Дата";
		
		Запрос.УстановитьПараметр("НачДата", ДанныеДатаНачалаВыгрузки);
		Запрос.УстановитьПараметр("КонДата", ДанныеДатаКонцаВыгрузки);
		
		РезультатЗапроса = Запрос.Выполнить();
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		КоличествоДокументов = 0;
		КоличествоДокументов = РезультатЗапроса.Количество();
		
		КоличествоДокументовВПорции = 7;          		
		ДокументовВТекПорции = 0;
		
		//ДокументовВТекПорции = Окр(КоличествоДокументов/КоличествоДокументовВПорции,0);
		
		ТЗСвязиВПорции = РезультатЗапроса.Скопировать();
		ТЗСвязиВПорции.Очистить();
		
		НомерПорции = 0;
		Для каждого СтрокаСвязи Из РезультатЗапроса Цикл
			

		//Если количество документов равно размеру порции, выполняем обработку данных
            Если ДокументовВТекПорции = КоличествоДокументовВПорции Тогда
                НомерПорции = НомерПорции + 1;
                ОбработатьПорциюДокументов(ТЗСвязиВПорции,НомерПорции);
				//ДлительныеОперации.СообщитьПрогресс(Формат(КоличествоДокументовВПорции*НомерПорции/ВсегоДокументов*100, "ЧЦ=3; ЧДЦ="), "Выполняется проведение документов, порция: "+Строка(НомерПорции+1));
				
				ДокументовВТекПорции = 0;
                ТекущийДокумент = Неопределено;
				ТЗСвязиВПорции.Очистить();
            КонецЕсли;
				
            ТекущийДокумент = СтрокаСвязи.ДокументПереоценки;
			
			НовЗначениеПорции = ТЗСвязиВПорции.Добавить();
			ЗаполнитьЗначенияСвойств(НовЗначениеПорции,СтрокаСвязи);
            ДокументовВТекПорции = ДокументовВТекПорции + 1;
			
		КонецЦикла; 
		
		НомерПорции = НомерПорции + 1;

		//Обработка последней порции документов
    	ОбработатьПорциюДокументов(ТЗСвязиВПорции,НомерПорции);
		

		
		
		А = 1;

	
КонецПроцедуры
 
Процедура ОбработатьПорциюДокументов(ТЗСвязиВПорции, НомерПорции)
	
		ПараметрыЗадания = Новый Структура;
				
		//ПараметрыЗадания.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
		ПараметрыЗадания.Вставить("ПорцияМассив", ТЗСвязиВПорции);     //Параметры
			 
		//ТекстФоновойПроцедуры = "
		//|ОбщийМодуль77w.ПроведениеДокументовПереоценки(ПорцияМассив)";
		
		ТекстФоновойПроцедуры = "
		|ОбщийМодуль77w.ПроведениеДокументовПереоценки(ПорцияМассив)";
		
		
		НаименованиеЗадания =""+НСтр("ru = 'Многопоточное проведение переоценки розницы'")+" (поток "+НомерПорции+")";
		
		Результат = МССО_ФоновоеВыполнениеМногопоточность.ЗапуститьФоновоеВыполнение(ТекстФоновойПроцедуры,ПараметрыЗадания,НаименованиеЗадания);
//СформироватьПечатнуюФормуПереоценкиТоваровВРозницеБД

		
КонецПроцедуры

Процедура ПроведениеДокументовПереоценки(ТЗСвязиВПорции)  Экспорт
	
	Для каждого ВыборкаДетальныеЗаписи Из ТЗСвязиВПорции Цикл
		
		
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПереоценки) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда 
				ДокУстЦен = ВыборкаДетальныеЗаписи.ДокументПереоценки.ПолучитьОбъект();
				ДокУстЦен.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить("   "+ДокУстЦен.Ссылка);	
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ДокументПереоценки) = Тип("ДокументСсылка.ЗаказКлиента") Тогда  
				ДокУстЦен = ВыборкаДетальныеЗаписи.ДокументПереоценки.ПолучитьОбъект();
				ДокУстЦен.Записать(РежимЗаписиДокумента.Проведение);
				Сообщить("   "+ДокУстЦен.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
////////








/////////////////////  ПРОВЕРКИ НА БАНКРОТСТВО
Функция ПроверитьВхождениеВРеесстрОБанкротсве(УНП) Экспорт 
	
	Хост = "bankrot.gov.by";
	ХостПостФиксКоличество = "/Debtors/GetDebtorsCount";
	ХостПостФиксДанные = "/Debtors/GetDebtors";
	
	Соединение = Новый HTTPСоединение(Хост,443,,,,60,Новый ЗащищенноеСоединениеOpenSSL());
	
	Заголовки = Новый Соответствие; 
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");    
	
	СтруктураJSON = Новый Структура;
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("Name","");
	ДанныеЗапроса.Вставить("RegionId","0");
	ДанныеЗапроса.Вставить("Manager","");
	ДанныеЗапроса.Вставить("DateFrom");
	ДанныеЗапроса.Вставить("DateTo");
	ДанныеЗапроса.Вставить("Unp",СокрЛП(УНП));
	ДанныеЗапроса.Вставить("FileNumber","");
	ДанныеЗапроса.Вставить("FileStatusId","-1");
	ДанныеЗапроса.Вставить("DebtorCategoryId","0");
	ДанныеЗапроса.Вставить("ProcedureId","0");
	СтруктураJSON.Вставить("Filters",ДанныеЗапроса);
	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
	JSONСтрока = ЗаписьJSON.Закрыть();
	
	Попытка	
		Запрос = Новый HTTPЗапрос(ХостПостФиксКоличество, Заголовки);
		Запрос.УстановитьТелоИзСтроки(JSONСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		Результат = Соединение.ОтправитьДляОбработки(Запрос);
		СообщениеСайт = Результат.ПолучитьТелоКакСтроку();
		
		Если Результат.КодСостояния = 200 И СообщениеСайт <> "0" Тогда
			
			Возврат Истина;
			
			//СтруктураJSON.Вставить("Page",1);
			//СтруктураJSON.Вставить("PageSize",20);
			//СтруктураJSON.Вставить("SortOrder","DESC");
			//СтруктураJSON.Вставить("SortBy","DateStart");
			//
			//ЗаписьJSON = Новый ЗаписьJSON;
			//ЗаписьJSON.УстановитьСтроку();
			//ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
			//JSONСтрока = ЗаписьJSON.Закрыть();
			//
			//Запрос = Новый HTTPЗапрос(ХостПостФиксДанные, Заголовки);
			//Запрос.УстановитьТелоИзСтроки(JSONСтрока, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			//
			//Результат = Соединение.ОтправитьДляОбработки(Запрос);
			//СообщениеСайт = Результат.ПолучитьТелоКакСтроку();
			//
			//Если Результат.КодСостояния = 200  Тогда
			//     ЧтениеJSON = Новый ЧтениеJSON;
			//	 ЧтениеJSON.ОткрытьПоток(Результат.ПолучитьТелоКакПоток());
			//	 ДанныеПортала = ПрочитатьJSON(ЧтениеJSON); 
			//	 ЧтениеJSON.Закрыть();
			//	 
			//	 Если ДанныеПортала.Количество() <> 0  Тогда
			//	      ДанныеКонтрагента = ДанныеПортала[0];
			//	 КонецЕсли;					 
			//КонецЕсли;
		КонецЕсли;
		
	Исключение
		Инфо = ИнформацияОбОшибке();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Инфо.Причина.Описание);
	КонецПопытки;
	Возврат Ложь;
	
КонецФункции


Функция ПроверитьВхождениеВРеесстрОБанкротсвеИзРегистра(УНП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрПравонарушений_Локализация.УНП КАК УНП,
		|	РеестрПравонарушений_Локализация.Контрагент КАК Контрагент,
		|	РеестрПравонарушений_Локализация.Статус КАК Статус,
		|	РеестрПравонарушений_Локализация.Банкрот КАК Банкрот,
		|	РеестрПравонарушений_Локализация.ПовышенныйРиск КАК ПовышенныйРиск
		|ИЗ
		|	РегистрСведений.РеестрПравонарушений_Локализация КАК РеестрПравонарушений_Локализация
		|ГДЕ
		|	РеестрПравонарушений_Локализация.УНП = &УНП";
	
	Запрос.УстановитьПараметр("УНП", УНП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ИСТИНА;
	КонецЦикла;
	
	Возврат ЛОЖЬ;

КонецФункции // ()
 

Функция ЧтениеИзJSON(jsonФайл, ИменаСвойствСоЗначениямиДата = "") 
	
	тЧтение = Новый ЧтениеJSON;
	тЧтение.ОткрытьФайл(jsonФайл);
	тДанные = ПрочитатьJSON(тЧтение, Ложь, ИменаСвойствСоЗначениямиДата);
	
	//тДатаJSON = ПрочитатьДатуJSON(тДанные.ДатаJSON, ФорматДатыJSON.ISO);
	
	тЧтение.Закрыть();
	Возврат тДанные;
	
КонецФункции




&НаСервере
Функция ДанныеКонтрагентаПоУНП(ЮрЛицо, УНП) Экспорт
	
	аргУНП = УНП;
	
	СтрКонтрагент = Новый Структура;
	СтрКонтрагент.Вставить("НаименованиеПолное","");
	СтрКонтрагент.Вставить("Наименование","");
	СтрКонтрагент.Вставить("Адрес","");
	СтрКонтрагент.Вставить("Статус","");
	СтрКонтрагент.Вставить("ДатаЛиквидации");
	СтрКонтрагент.Вставить("Основание");
	СтрКонтрагент.Вставить("ТекстРезультата");
	СтрКонтрагент.Вставить("ОписаниеОшибки");
	СтрКонтрагент.Вставить("НаименованиеСокращенное");
	СтрКонтрагент.Вставить("КПП");
	СтрКонтрагент.Вставить("СостояниеНалогоплательщика");
	СтрКонтрагент.Вставить("ИНН");
	СтрКонтрагент.Вставить("ЮридическийАдрес");
	СтрКонтрагент.Вставить("Телефон");

	СтруктураЮридическийАдрес = Новый Структура;
	СтруктураЮридическийАдрес.Вставить("Представление");
	СтруктураЮридическийАдрес.Вставить("КонтактнаяИнформация");
	
	СтруктураКонтактнаяИнформация = Новый Структура;
	СтруктураКонтактнаяИнформация.Вставить("Тип");
	СтруктураКонтактнаяИнформация.Вставить("Вид");
	СтруктураКонтактнаяИнформация.Вставить("Представление");
	СтруктураКонтактнаяИнформация.Вставить("Страна");
	СтруктураКонтактнаяИнформация.Вставить("Регион");
	СтруктураКонтактнаяИнформация.Вставить("Город");
	СтруктураКонтактнаяИнформация.Вставить("АдресЭП");
	СтруктураКонтактнаяИнформация.Вставить("ДоменноеИмяСервера");
	СтруктураКонтактнаяИнформация.Вставить("НомерТелефона");
	СтруктураКонтактнаяИнформация.Вставить("НомерТелефонаБезКодов");
	СтруктураКонтактнаяИнформация.Вставить("ВидДляСписка");

	
	СтруктураТелефон = Новый Структура;
	СтруктураТелефон.Вставить("Тип");
	СтруктураТелефон.Вставить("Вид");
	СтруктураТелефон.Вставить("Представление");
	СтруктураТелефон.Вставить("Страна");
	СтруктураТелефон.Вставить("Регион");
	СтруктураТелефон.Вставить("Город");
	СтруктураТелефон.Вставить("АдресЭП");
	СтруктураТелефон.Вставить("ДоменноеИмяСервера");
	СтруктураТелефон.Вставить("НомерТелефона");
	СтруктураТелефон.Вставить("НомерТелефонаБезКодов");
	СтруктураТелефон.Вставить("ВидДляСписка");


	
	Соединение = Новый HTTPСоединение(
        "lkfl.portal.nalog.gov.by", // сервер (хост)
        443, // порт, по умолчанию для http используется 80, для https 443
        , // пользователь для доступа к серверу (если он есть)
        , // пароль для доступа к серверу (если он есть)
        , // здесь указывается прокси, если он есть
        60, // таймаут в секундах, 0 или пусто - не устанавливать
       Новый ЗащищенноеСоединениеOpenSSL()
    );

		
	Запрос = Новый HTTPЗапрос("/grp/getData?unp="+СокрЛП(УНП)+"&charset=UTF-8&type=json");
	
	//Запрос.Заголовки.Вставить("Content-type", "application/json");
	Результат = Соединение.Получить(Запрос);
	
	Попытка
    Ответ = Соединение.ОтправитьДляОбработки(Запрос);
  Исключение
    Сообщить("Ошибка при обращении к серверу (https://lkfl.portal.nalog.gov.by): "+ОписаниеОшибки());
    Возврат Неопределено;
  КонецПопытки;
  
  КодСостояния = Ответ.КодСостояния;
  
  // проверим редирект на второй сайт
  Если КодСостояния = 301 Тогда
    // посмотрим новый URL в заголовке location
    Если Ответ.Заголовки["Location"] = Неопределено Тогда
      Сообщить("Информация с сервера не получена. УНП: "+аргУНП+". Код ответа сайта: "+КодСостояния);
      Возврат КодСостояния;
    Иначе  
      Новый_URL = Ответ.Заголовки["Location"];
      мПротокол = Лев(Новый_URL, 5);
      Если мПротокол = "https" Тогда
        Новый_URL = Сред(Новый_URL, 9);
        ПозицияСлеша = СтрНайти(Новый_URL, "/");
        Новый_URL_1 = Лев(Новый_URL, ПозицияСлеша-1);
        Новый_URL = Сред(Новый_URL, ПозицияСлеша);
        ПозицияВопроса = СтрНайти(Новый_URL, "?");
        Новый_URL_2 = Лев(Новый_URL, ПозицияВопроса);
        //
        SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
        Соединение = Новый HTTPСоединение(Новый_URL_1,,,,,,SSL);
        Запрос = Новый HTTPЗапрос(Новый_URL_2 + "unp=" + СокрЛП(аргУНП) + "&charset=UTF-8&type=xml");
        Попытка
          Ответ = Соединение.ОтправитьДляОбработки(Запрос);
        Исключение
          Сообщить("Ошибка при обращении к серверу (" + Ответ.Заголовки["Location"] + "): "+ОписаниеОшибки());
          Возврат Неопределено;
        КонецПопытки;
        КодСостояния = Ответ.КодСостояния;
      Иначе
        Новый_URL = Сред(Новый_URL, 8);
        ПозицияСлеша = СтрНайти(Новый_URL, "/");
        Новый_URL_1 = Лев(Новый_URL, ПозицияСлеша-1);
        Новый_URL = Сред(Новый_URL, ПозицияСлеша);
        ПозицияВопроса = СтрНайти(Новый_URL, "?");
        Новый_URL_2 = Лев(Новый_URL, ПозицияВопроса);
        //
        Соединение = Новый HTTPСоединение(Новый_URL_1);
        Запрос = Новый HTTPЗапрос(Новый_URL_2 + "unp=" + СокрЛП(аргУНП) + "&charset=UTF-8&type=json");
        Попытка
          Ответ = Соединение.Получить(Запрос);
        Исключение
          Сообщить("Ошибка при обращении к серверу (" + Ответ.Заголовки["Location"] + "): "+ОписаниеОшибки());
          Возврат Неопределено;
        КонецПопытки;
        КодСостояния = Ответ.КодСостояния;
      КонецЕсли;  
    КонецЕсли;  
  КонецЕсли;  
  
  Если КодСостояния = 400 Тогда
    Сообщить("По УНП "+аргУНП + " данные не найдены.");
    Возврат КодСостояния;
  Иначе  
    Если КодСостояния <> 200 Тогда      
      Если КодСостояния <> 403 Тогда
        // 403 = Forbidden, возникает, когда сервер считает, что превышено число запросов с ip
        // его отрабатываем отдельно и соответсвенно не сообщаем пользователю
        Сообщить("Информация с сервера не получена. УНП: "+аргУНП+". Код ответа сайта: "+КодСостояния);
      КонецЕсли;
      Возврат КодСостояния;      
    Иначе
      //Сообщить("ОК. УНП: "+аргУНП);
    КонецЕсли;
  КонецЕсли;
  
  ТекстОтвета = Ответ.ПолучитьТелоКакСтроку("UTF-8"); 
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстОтвета);
		Ответ = ПрочитатьJSON(ЧтениеJSON);	
		ЧтениеJSON.Закрыть();
		
		
		Если ТипЗнч(Ответ) = Тип("Структура")  Тогда
			СтрокаДанные = Ответ.ROW;
			СтрКонтрагент.ИНН = УНП;
			
			СтрКонтрагент.НаименованиеПолное = СтрокаДанные.VNAIMP;
			СтрКонтрагент.Наименование = СтрокаДанные.VNAIMK;
			СтрКонтрагент.НаименованиеСокращенное = СтрКонтрагент.НаименованиеПолное;

			СтрКонтрагент.Адрес = СтрокаДанные.VPADRES;
			
			СтатусКонтрагента = СтрокаДанные.VKODS;
			
			Если СокрЛП(СтатусКонтрагента) = "Действующий" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.Действующий;
			ИначеЕсли СокрЛП(СтатусКонтрагента) = "Ликвидирован" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.Ликвидирован;
			ИначеЕсли СокрЛП(СтатусКонтрагента) = "В процессе ликвидации" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.ВПроцессеЛиквидации;
			ИначеЕсли СокрЛП(СтатусКонтрагента) = "В процессе санации" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.ВПроцессеСанации;	
			ИначеЕсли СокрЛП(СтатусКонтрагента) = "В процедуре банкротства" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.ВПроцедуреБанкротства;
			КонецЕсли;

			СтрКонтрагент.Статус = СтатусНалогоплательщиков;
			СтрКонтрагент.СостояниеНалогоплательщика = СтатусНалогоплательщиков;

			
			ДатаЛиквидации = "";
			ДатаЛиквидации = СтрокаДанные.DLIKV;
			Если ЗначениеЗаполнено(ДатаЛиквидации) Тогда
			    ДатаЛиквидации = СтрЗаменить(ДатаЛиквидации,"-","");
				СтрКонтрагент.ДатаЛиквидации = Дата(ДатаЛиквидации);
			Иначе
				СтрКонтрагент.ДатаЛиквидации = Дата(1,1,1);
			
			КонецЕсли; 
			СтрКонтрагент.Основание = СтрокаДанные.VLIKV;
			
			    СтруктураЮридическийАдрес.Представление = СтрКонтрагент.Адрес;

				СтруктураКонтактнаяИнформация.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
				СтруктураКонтактнаяИнформация.Вид = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
				СтруктураКонтактнаяИнформация.Представление = СтрКонтрагент.Адрес;
				СтруктураКонтактнаяИнформация.ВидДляСписка = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
				
				ЗначениеПолейЮридическийАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(СтруктураКонтактнаяИнформация,СтруктураЮридическийАдрес.Представление,СтруктураКонтактнаяИнформация.Вид);

				СтруктураЮридическийАдрес.КонтактнаяИнформация = ЗначениеПолейЮридическийАдрес;

			СтрКонтрагент.ЮридическийАдрес = СтруктураЮридическийАдрес;
			
			
			//СтруктураТелефон.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			//СтруктураТелефон.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			//СтруктураТелефон.Представление;
			//СтруктураТелефон.Вставить("Страна");
			//СтруктураТелефон.Вставить("Регион");
			//СтруктураТелефон.Вставить("Город");
			//СтруктураТелефон.Вставить("АдресЭП");
			//СтруктураТелефон.Вставить("ДоменноеИмяСервера");
			//СтруктураТелефон.Вставить("НомерТелефона");
			//СтруктураТелефон.Вставить("НомерТелефонаБезКодов");
			//СтруктураТелефон.Вставить("ВидДляСписка");
			
			СтрКонтрагент.Телефон = Неопределено;

			
			
			Возврат СтрКонтрагент;
			
		КонецЕсли;
	//Иначе
		СтрКонтрагент.ОписаниеОшибки = ""+Результат.КодСостояния;
	//КонецЕсли; 
	
	Возврат Неопределено;
А = 1;
КонецФункции



Процедура ПроверитьПравонарушенияНаСервере() Экспорт
	
	
	
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Контрагенты.ИНН КАК ИНН,
        |	Контрагенты.Ссылка КАК Ссылка
        |ИЗ
        |	Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |	Контрагенты.ПометкаУдаления = ЛОЖЬ
        |	И Контрагенты.ИНН <> """"";
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    
    РегистрРеестрПравонарушений = РегистрыСведений.РеестрПравонарушений_Локализация;
  	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УНП = "";
        УНП = ВыборкаДетальныеЗаписи.ИНН;
				
        Если СтрДлина(УНП) <> 9 Тогда
            Продолжить;
        КонецЕсли;	
		
				
		СтатусНалогоплательщиков = Неопределено;
    	Статус_ЕГР = Неопределено;
		
		ЮрЛицо = Истина;
		Статус_ЕГР =ДанныеКонтрагентаПоУНП(ЮрЛицо, УНП);
		
		
		Если Статус_ЕГР = Неопределено Тогда
			Продолжить;	
		КонецЕсли; 
		
		Если Статус_ЕГР = 400 Тогда
			Сообщить("По УНП "+УНП+ " данные не найдены.");
			Продолжить;	
		КонецЕсли;

		
		
		
		Если Статус_ЕГР <> Неопределено 
			  И ТипЗнч(Статус_ЕГР) = Тип("Структура") Тогда
			
			Если СокрЛП(Статус_ЕГР.Статус) = "Действующий" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.Действующий;
			ИначеЕсли СокрЛП(Статус_ЕГР.Статус) = "Ликвидирован" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.Ликвидирован;
			ИначеЕсли СокрЛП(Статус_ЕГР.Статус) = "В процессе ликвидации" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.ВПроцессеЛиквидации;
			ИначеЕсли СокрЛП(Статус_ЕГР.Статус) = "В процессе санации" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.ВПроцессеСанации;	
			ИначеЕсли СокрЛП(Статус_ЕГР.Статус) = "В процедуре банкротства" Тогда
				СтатусНалогоплательщиков = Перечисления.СостоянияНалогоплательщиков.ВПроцедуреБанкротства;
			КонецЕсли;

			Если Статус_ЕГР.ДатаЛиквидации <> "01.01.0001" Тогда
				ДатаЛиквидации = Статус_ЕГР.ДатаЛиквидации;
			Иначе
				ДатаЛиквидации = "";
			КонецЕсли;
            
            //Если СокрЛП(Статус_ЕГР.Статус) <> "Действующий" Тогда
			Если СокрЛП(Статус_ЕГР.Статус) = "Ликвидирован" 
				или СокрЛП(Статус_ЕГР.Статус) = "В процессе ликвидации" Тогда
				
				Сообщить(""+Статус_ЕГР.Наименование+"  "+Статус_ЕГР.Статус);
				
				Запись = РегистрРеестрПравонарушений.СоздатьМенеджерЗаписи();
				Запись.Статус = СтатусНалогоплательщиков;
				Запись.УНП = УНП;
				Запись.ДатаПроверки = ТекущаяДата();
				Запись.ДатаЛиквидации = ДатаЛиквидации;
				Запись.Контрагент = ВыборкаДетальныеЗаписи.Ссылка;
				Запись.Записать(ИСТИНА);
		
			КонецЕсли; 
        КонецЕсли; 
		
		Банкрот = Ложь;
		Банкрот = ОбщийМодуль77w.ПроверитьВхождениеВРеесстрОБанкротсве(УНП);
		
		Если Статус_ЕГР <> Неопределено 
			И ТипЗнч(Статус_ЕГР) = Тип("Структура") Тогда
			
			Если СокрЛП(Статус_ЕГР.Статус) = "Действующий" Тогда
				
				//Банкрот = ОбщийМодуль77w.ПроверитьВхождениеВРеесстрОБанкротсве(УНП);
				
				Если Банкрот = ИСТИНА Тогда
					Сообщить( "Внимание! Контрагент включен в ""Единый государственный реестр сведений о банкротстве!""");
					
					Запись = РегистрРеестрПравонарушений.СоздатьМенеджерЗаписи();
					Запись.Контрагент = ВыборкаДетальныеЗаписи.Ссылка;
					Запись.Статус = СтатусНалогоплательщиков;
					Запись.УНП = УНП;
					Запись.ДатаЛиквидации = ДатаЛиквидации;
					Запись.ДатаПроверки = ТекущаяДата();
					Запись.Банкрот = Истина;
					Запись.ПовышенныйРиск = Истина;
					
					Запись.Записать(ИСТИНА);
				КонецЕсли; 
			Иначе
				//Банкрот = ОбщийМодуль77w.ПроверитьВхождениеВРеесстрОБанкротсве(УНП);
				
				Если Банкрот = ИСТИНА Тогда
					Сообщить( "Внимание! Контрагент включен в ""Единый государственный реестр сведений о банкротстве!""");
					
					Запись = РегистрРеестрПравонарушений.СоздатьМенеджерЗаписи();
					Запись.Контрагент = ВыборкаДетальныеЗаписи.Ссылка;
					Запись.Статус = СтатусНалогоплательщиков;
					Запись.УНП = УНП;
					Запись.ДатаЛиквидации = ДатаЛиквидации;
					Запись.ДатаПроверки = ТекущаяДата();
					Запись.Банкрот = Истина;	
					Запись.Записать(ИСТИНА);
				КонецЕсли; 

			КонецЕсли;
		Иначе
				Если Банкрот = ИСТИНА Тогда
					Сообщить( "Внимание! Контрагент включен в ""Единый государственный реестр сведений о банкротстве!""");
					
					Запись = РегистрРеестрПравонарушений.СоздатьМенеджерЗаписи();
					Запись.Контрагент = ВыборкаДетальныеЗаписи.Ссылка;
					Запись.Статус = СтатусНалогоплательщиков;
					Запись.УНП = УНП;
					Запись.ДатаЛиквидации = "";
					Запись.ДатаПроверки = ТекущаяДата();
					Запись.Банкрот = Истина;
					
					Запись.Записать(ИСТИНА);
				КонецЕсли; 

		КонецЕсли;
		
				
		Если СтатусНалогоплательщиков <> Неопределено Тогда
			
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			КонтрагентОбъект.СостояниеНалогоплательщика = СтатусНалогоплательщиков;
			
			Попытка
				КонтрагентОбъект.ОбменДанными.Загрузка = ИСТИНА;
				КонтрагентОбъект.Записать();
				
			Исключение
				
			КонецПопытки;	
			
		КонецЕсли; 		
		
	КонецЦикла;
	
КонецПроцедуры




Функция ПроверитьБСОНаПортале(ТипБСО,СерияБСО,НомерБСО) Экспорт
	
	СтрОтветБСО = Новый Структура;
	СтрОтветБСО.Вставить("НекорректныйЗапрос",Ложь);
	СтрОтветБСО.Вставить("НайденБСО",0);
	СтрОтветБСО.Вставить("НаименованиеОрганизации","");
	СтрОтветБСО.Вставить("ДатаРеализацииБСО","");
	СтрОтветБСО.Вставить("УНПОрганизации","");
	СтрОтветБСО.Вставить("ТекстОшибки","");

	
	
	  //http://ws.blank.bisc.by/FindBlankWSHttp.aspx?method=FindBlankWS&pTB=402961&pSB=ФЕ&pNB=6871292
	Соединение = Новый HTTPСоединение(
		"ws.blank.bisc.by", // сервер (хост)
		80, // порт, по умолчанию для http используется 80, для https 443
		, // пользователь для доступа к серверу (если он есть)
		, // пароль для доступа к серверу (если он есть)
		, // здесь указывается прокси, если он есть
		30, // таймаут в секундах, 0 или пусто - не устанавливать
		);
	
	Запрос = Новый HTTPЗапрос("/FindBlankWSHttp.aspx?method=FindBlankWS&pTB=" + ТипБСО + "&pSB=" + ПереобразоватьЮникод(СерияБСО)+ "&pNB=" + НомерБСО);
	
	Попытка
	
		Результат = Соединение.Получить(Запрос);
	
	
	//ожидание jadmin
	ДатаКон = ТекущаяДата() + 2;//1 секундой больше
	Пока ТекущаяДата() < ДатаКон Цикл
		 //пока выполняется цикл поток прерван
	КонецЦикла;
	
	Если Результат.КодСостояния = 200 Тогда
		
		//ЧтениеJSON = Новый ЧтениеJSON;
		//ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8"));
		//Ответ = ПрочитатьJSON(ЧтениеJSON);	
		//ЧтениеJSON.Закрыть();
		
		
		
		
		
		ЧтениеXML = Новый ЧтениеXML;
		
		ЧтениеXML.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку("UTF-8")); 
		
		Пока ЧтениеXML.Прочитать() Цикл
			
			Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				
				
				Если ЧтениеXML.Имя = "IsFound" Тогда
					ЧтениеXML.Прочитать();
					СтрОтветБСО.НайденБСО = Число(ЧтениеXML.Значение);
					Если СтрОтветБСО.НайденБСО = 0  Тогда
						Возврат СтрОтветБСО;
					КонецЕсли;
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "error" Тогда
					СтрОтветБСО.НекорректныйЗапрос = Истина;
					Возврат СтрОтветБСО;
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "Date" Тогда
					ЧтениеXML.Прочитать();
					СтрОтветБСО.ДатаРеализацииБСО = ЧтениеXML.Значение;
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "Name" Тогда
					ЧтениеXML.Прочитать();
					СтрОтветБСО.НаименованиеОрганизации = ЧтениеXML.Значение;
				КонецЕсли;
				
				Если ЧтениеXML.Имя = "UNP" Тогда
					ЧтениеXML.Прочитать();
					СтрОтветБСО.УНПОрганизации = ЧтениеXML.Значение;
				КонецЕсли;
			КонецЕсли ;
		КонецЦикла;

	КонецЕсли ;
	
	Исключение
	    СтрОтветБСО.Вставить("ТекстОшибки",ОписаниеОшибки());
	КонецПопытки;
	
	Возврат СтрОтветБСО;
	
КонецФункции // ()
 

Функция ПереобразоватьЮникод(ВхСтрока) 

    Строка = ВхСтрока;
    ГотововаяСтрока = "" ;
    
    МасУкр = Новый Массив(66) ;
    
    МасУкр[0]="А";   МасУкр[1]="Б";  МасУкр[2]="В";  МасУкр[3]="Г";  МасУкр[4]="Ґ";  МасУкр[5]="Д";
    МасУкр[6]="Е";   МасУкр[7]="Є";  МасУкр[8]="Ж";  МасУкр[9]="З";  МасУкр[10]="И"; МасУкр[11]="І";
    МасУкр[12]="Ї";  МасУкр[13]="Й"; МасУкр[14]="К"; МасУкр[15]="Л"; МасУкр[16]="М"; МасУкр[17]="Н";
    МасУкр[18]="О";  МасУкр[19]="П"; МасУкр[20]="Р"; МасУкр[21]="С"; МасУкр[22]="Т"; МасУкр[23]="У";
    МасУкр[24]="Ф";  МасУкр[25]="Х"; МасУкр[26]="Ц"; МасУкр[27]="Ч"; МасУкр[28]="Ш"; МасУкр[29]="Щ";
    МасУкр[30]="Ь";  МасУкр[31]="Ю"; МасУкр[32]="Я";  

    МасУкр[33]="а";  МасУкр[34]="б"; МасУкр[35]="в"; МасУкр[36]="г"; МасУкр[37]="ґ"; МасУкр[38]="д";
    МасУкр[39]="е";  МасУкр[40]="є"; МасУкр[41]="ж"; МасУкр[42]="з"; МасУкр[43]="и"; МасУкр[44]="і";
    МасУкр[45]="ї";  МасУкр[46]="й"; МасУкр[47]="к"; МасУкр[48]="л"; МасУкр[49]="м"; МасУкр[50]="н";
    МасУкр[51]="о";  МасУкр[52]="п"; МасУкр[53]="р"; МасУкр[54]="с"; МасУкр[55]="т"; МасУкр[56]="у";
    МасУкр[57]="ф";  МасУкр[58]="х"; МасУкр[59]="ц"; МасУкр[60]="ч"; МасУкр[61]="ш"; МасУкр[62]="щ";
    МасУкр[63]="ь";  МасУкр[31]="ю"; МасУкр[65]="я";  
        
    
    МасКод = Новый Массив(66) ;
    
    МасКод[0]="0410";   МасКод[1]="0411";  МасКод[2]="0412";  МасКод[3]="0413";  МасКод[4]="0490";  МасКод[5]="0414";
    МасКод[6]="0415";   МасКод[7]="0404";  МасКод[8]="0416";  МасКод[9]="0417";  МасКод[10]="0418"; МасКод[11]="0406";
    МасКод[12]="0407";  МасКод[13]="0419"; МасКод[14]="041A"; МасКод[15]="041B"; МасКод[16]="041C"; МасКод[17]="041D";
    МасКод[18]="041E";  МасКод[19]="041F"; МасКод[20]="0420"; МасКод[21]="0421"; МасКод[22]="0422"; МасКод[23]="0423";
    МасКод[24]="0424";  МасКод[25]="0425"; МасКод[26]="0426"; МасКод[27]="0427"; МасКод[28]="0428"; МасКод[29]="0429";
    МасКод[30]="042C";  МасКод[31]="042E"; МасКод[32]="042F";  

    МасКод[33]="0430";  МасКод[34]="0431"; МасКод[35]="0432"; МасКод[36]="0413"; МасКод[37]="0491"; МасКод[38]="0434";
    МасКод[39]="0435";  МасКод[40]="0454"; МасКод[41]="0436"; МасКод[42]="0437"; МасКод[43]="0438"; МасКод[44]="0456";
    МасКод[45]="0457";  МасКод[46]="0439"; МасКод[47]="043A"; МасКод[48]="043B"; МасКод[49]="043C"; МасКод[50]="043D";
    МасКод[51]="043E";  МасКод[52]="043F"; МасКод[53]="0440"; МасКод[54]="0441"; МасКод[55]="0442"; МасКод[56]="0443";
    МасКод[57]="0444";  МасКод[58]="0445"; МасКод[59]="0446"; МасКод[60]="0447"; МасКод[61]="0448"; МасКод[62]="0449";
    МасКод[63]="044C";  МасКод[31]="044E"; МасКод[65]="044F";  
    
    
    тмпСтрока = "" ;
    Для Счетчик = 1 По СтрДлина(Строка) Цикл      
        Если Лев(Строка, 1) = "\" Тогда
            Если Лев(Строка, 2) = "\u" Тогда
                
                тмпСтрока = Прав(Лев(Строка, 6),4) ;
                Если МасКод.Найти(тмпСтрока) = Неопределено Тогда
                    СтрокаЗамены = Прав(тмпСтрока, 1) ;
                    тмпСтрока = СтрЗаменить(тмпСтрока,СтрокаЗамены,ТРег(СтрокаЗамены)); 
                    Если МасКод.Найти(тмпСтрока) = Неопределено Тогда
                        Сообщить("Код символа не найден: " + тмпСтрока) ;
                    Иначе                      
                        ГотововаяСтрока = ГотововаяСтрока + МасУкр[МасКод.Найти(тмпСтрока)] ;                                   
                    КонецЕсли;
                Иначе
                    ГотововаяСтрока = ГотововаяСтрока + МасУкр[МасКод.Найти(тмпСтрока)] ;               
                КонецЕсли;
                
                Строка = Прав(Строка, (СтрДлина(Строка)-6)) ; 
            Иначе  
                Строка = Прав(Строка, (СтрДлина(Строка)-2)) ;
            КонецЕсли;
        Иначе
            ГотововаяСтрока = ГотововаяСтрока + Лев(Строка, 1) ;
            Строка = Прав(Строка, (СтрДлина(Строка)-1)) ;     
        КонецЕсли;         
    КонецЦикла;   

    Возврат ГотововаяСтрока ;
        
КонецФункции



/////СКИДКА СЕЗОН МССО  jadmin
Процедура РасчитатьСкидкуКлиента(Контрагент,Регистратор,СуммаОборотаМССО = 0, СкидкаОборот = 0,СкидкаОбщая = 0)  Экспорт


	Если Контрагент.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
        ИЛИ Контрагент.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			 ИЛИ Контрагент.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
             ИЛИ Контрагент.Партнер.ИндивидуальныеСкидки = ИСТИНА  Тогда
        Возврат;
		
    КонецЕсли; 
    
	//Если Регистратор.КартошкаЕсть Тогда  /////77w
	//    Возврат;
	//КонецЕсли;
	
	Если ПроверитьСегментПартнеров(Контрагент.Партнер)=ИСТИНА Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Если Регистратор = Неопределено Тогда
		Регистратор = Документы.ЗаказКлиента.ПустаяСсылка();
		ДатаОкончания = ТекущаяДата();
	ИначеЕсли Регистратор.Дата = Дата(1,1,1) Тогда
		ДатаОкончания = ТекущаяДата()-1;
	Иначе	 
		ДатаОкончания = Регистратор.Дата-1;	
	КонецЕсли; 
	
	Если ДатаОкончания < Дата("20221024") Тогда
		
		Если Месяц(ДатаОкончания) = 10 
			ИЛИ Месяц(ДатаОкончания) = 11
			ИЛИ Месяц(ДатаОкончания) = 12 Тогда
			ПредГод = Год(ДатаОкончания)-2;       //jadmin надо уменьшить на 1
			ПредГод = СтрЗаменить(ПредГод,Символы.НПП,"");
			ДатаНачала = Дата(ПредГод, 10, 01);
		Иначе
			ПредГод = Год(ДатаОкончания)-3;       //jadmin надо уменьшить на 1
			ПредГод = СтрЗаменить(ПредГод,Символы.НПП,"");
			ДатаНачала = Дата(ПредГод, 10, 01);
		КонецЕсли;
		
	ИначеЕсли ДатаОкончания > Дата("20221024") И ДатаОкончания< Дата("20231001") Тогда
		
		Если Месяц(ДатаОкончания) = 10 
			ИЛИ Месяц(ДатаОкончания) = 11
			ИЛИ Месяц(ДатаОкончания) = 12 Тогда
			ПредГод = Год(ДатаОкончания)-2;       //jadmin надо уменьшить на 1
			ПредГод = СтрЗаменить(ПредГод,Символы.НПП,"");
			ДатаНачала = Дата(ПредГод, 10, 01);
		Иначе
			ПредГод = Год(ДатаОкончания)-3;       //jadmin надо уменьшить на 1
			ПредГод = СтрЗаменить(ПредГод,Символы.НПП,"");
			ДатаНачала = Дата(ПредГод, 10, 01);
		КонецЕсли;
		
	Иначе //актуальные условия
		
		Если Месяц(ДатаОкончания) = 10 
			ИЛИ Месяц(ДатаОкончания) = 11
			ИЛИ Месяц(ДатаОкончания) = 12 Тогда
			ПредГод = Год(ДатаОкончания)-1;       //jadmin  пред год
			ПредГод = СтрЗаменить(ПредГод,Символы.НПП,"");
			ДатаНачала = Дата(ПредГод, 10, 01);
		Иначе
			ПредГод = Год(ДатаОкончания)-2;       //jadmin  пред год
			ПредГод = СтрЗаменить(ПредГод,Символы.НПП,"");
			ДатаНачала = Дата(ПредГод, 10, 01);
		КонецЕсли;

	КонецЕсли;

	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	РегистрСведенийАналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	//	|	РегистрСведенийАналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	//	|	ЕСТЬNULL(РегистрСведенийАналитикаУчетаНаборов.НоменклатураНабора, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураНабора,
	//	|	ЕСТЬNULL(РегистрСведенийАналитикаУчетаНаборов.ХарактеристикаНабора, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНабора,
	//	|	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот КАК Количество,
	//	|	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот,0) КАК Сумма
	//	|ПОМЕСТИТЬ ИТОГ
	//	|ИЗ
	//	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	//	|			&ДатаНачала,
	//	|			&ДатаОкончания,
	//	|			Авто,
	//	|			АналитикаУчетаПоПартнерам В
	//	|				(ВЫБРАТЬ
	//	|					АналитикаУчетаПоПартнерам.КлючАналитики
	//	|				ИЗ
	//	|					РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	//	|				ГДЕ
	//	|					АналитикаУчетаПоПартнерам.Партнер = &Партнер
	//	|					И АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))) КАК ВыручкаИСебестоимостьПродажОбороты
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК РегистрСведенийАналитикаУчетаНоменклатуры
	//	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры = РегистрСведенийАналитикаУчетаНоменклатуры.КлючАналитики
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНаборов КАК РегистрСведенийАналитикаУчетаНаборов
	//	|		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНаборов = РегистрСведенийАналитикаУчетаНаборов.КлючАналитики
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	РегистрСведенийАналитикаУчетаНоменклатуры.Номенклатура,
	//	|	РегистрСведенийАналитикаУчетаНоменклатуры.Характеристика,
	//	|	ЕСТЬNULL(РегистрСведенийАналитикаУчетаНаборов.НоменклатураНабора, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	//	|	ЕСТЬNULL(РегистрСведенийАналитикаУчетаНаборов.ХарактеристикаНабора, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	//	|	-ВыручкаИСебестоимостьПродаж.Количество,
	//	|	ЕСТЬNULL(-ВыручкаИСебестоимостьПродаж.СуммаВыручки,0)
	//	|ИЗ
	//	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК РегистрСведенийАналитикаУчетаНоменклатуры
	//	|		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = РегистрСведенийАналитикаУчетаНоменклатуры.КлючАналитики
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНаборов КАК РегистрСведенийАналитикаУчетаНаборов
	//	|		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов = РегистрСведенийАналитикаУчетаНаборов.КлючАналитики
	//	|ГДЕ
	//	|	ВыручкаИСебестоимостьПродаж.Регистратор = &Регистратор
	//	|	И ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ПроданныеТовары.Номенклатура,
	//	|	ПроданныеТовары.Характеристика,
	//	|	ПроданныеТовары.НоменклатураНабора,
	//	|	ПроданныеТовары.ХарактеристикаНабора,
	//	|	ПроданныеТовары.Количество,
	//	|	ЕСТЬNULL(ПроданныеТовары.Сумма,0)
	//	|ИЗ
	//	|	Документ.ЧекККМ.Товары КАК ПроданныеТовары
	//	|ГДЕ
	//	|	ПроданныеТовары.Ссылка В
	//	|			(ВЫБРАТЬ
	//	|				Т.Ссылка
	//	|			ИЗ
	//	|				Документ.ЧекККМ КАК Т
	//	|			ГДЕ
	//	|				Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|				И Т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	//	|				И Т.КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	//	|				И Т.Партнер = &Партнер
	//	|				И Т.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ПроданныеТовары.Номенклатура,
	//	|	ПроданныеТовары.Характеристика,
	//	|	ПроданныеТовары.НоменклатураНабора,
	//	|	ПроданныеТовары.ХарактеристикаНабора,
	//	|	-ПроданныеТовары.Количество,
	//	|	ЕСТЬNULL(-ПроданныеТовары.Сумма,0)
	//	|ИЗ
	//	|	Документ.ЧекККМВозврат.Товары КАК ПроданныеТовары
	//	|ГДЕ
	//	|	ПроданныеТовары.Ссылка В
	//	|			(ВЫБРАТЬ
	//	|				Т.Ссылка
	//	|			ИЗ
	//	|				Документ.ЧекККМВозврат КАК Т
	//	|			ГДЕ
	//	|				Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	//	|				И Т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	//	|				И Т.КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	//	|				И Т.Партнер = &Партнер
	//	|				И Т.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(ЕСТЬNULL(ИТОГ.Количество,0)) КАК Количество,
	//	|	СУММА(ЕСТЬNULL(ИТОГ.Сумма,0)) КАК Сумма
	//	|ИЗ
	//	|	ИТОГ КАК ИТОГ";  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	РегистрСведенийАналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	 |	РегистрСведенийАналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	 |	ЕСТЬNULL(РегистрСведенийАналитикаУчетаНаборов.НоменклатураНабора, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураНабора,
	 |	ЕСТЬNULL(РегистрСведенийАналитикаУчетаНаборов.ХарактеристикаНабора, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНабора,
	 |	ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот КАК Количество,
	 |	ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.СуммаВыручкиОборот, 0) КАК Сумма
	 |ПОМЕСТИТЬ ИТОГ
	 |ИЗ
	 |	РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(
	 |			&ДатаНачала,
	 |			&ДатаОкончания,
	 |			Авто,
	 |			АналитикаУчетаПоПартнерам В
	 |				(ВЫБРАТЬ
	 |					АналитикаУчетаПоПартнерам.КлючАналитики
	 |				ИЗ
	 |					РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	 |				ГДЕ
	 |					АналитикаУчетаПоПартнерам.Партнер = &Партнер
	 |					И АналитикаУчетаПоПартнерам.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))) КАК ВыручкаИСебестоимостьПродажОбороты
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК РегистрСведенийАналитикаУчетаНоменклатуры
	 |		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры = РегистрСведенийАналитикаУчетаНоменклатуры.КлючАналитики
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНаборов КАК РегистрСведенийАналитикаУчетаНаборов
	 |		ПО ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНаборов = РегистрСведенийАналитикаУчетаНаборов.КлючАналитики
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	РегистрСведенийАналитикаУчетаНоменклатуры.Номенклатура,
	 |	РегистрСведенийАналитикаУчетаНоменклатуры.Характеристика,
	 |	ЕСТЬNULL(РегистрСведенийАналитикаУчетаНаборов.НоменклатураНабора, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	 |	ЕСТЬNULL(РегистрСведенийАналитикаУчетаНаборов.ХарактеристикаНабора, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	 |	-ВыручкаИСебестоимостьПродаж.Количество,
	 |	ЕСТЬNULL(-ВыручкаИСебестоимостьПродаж.СуммаВыручки, 0)
	 |ИЗ
	 |	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК РегистрСведенийАналитикаУчетаНоменклатуры
	 |		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНоменклатуры = РегистрСведенийАналитикаУчетаНоменклатуры.КлючАналитики
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНаборов КАК РегистрСведенийАналитикаУчетаНаборов
	 |		ПО ВыручкаИСебестоимостьПродаж.АналитикаУчетаНаборов = РегистрСведенийАналитикаУчетаНаборов.КлючАналитики
	 |ГДЕ
	 |	ВыручкаИСебестоимостьПродаж.Регистратор = &Регистратор
	 |	И ВыручкаИСебестоимостьПродаж.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПроданныеТовары.Номенклатура,
	 |	ПроданныеТовары.Характеристика,
	 |	ПроданныеТовары.НоменклатураНабора,
	 |	ПроданныеТовары.ХарактеристикаНабора,
	 |	ПроданныеТовары.Количество,
	 |	ЕСТЬNULL(ПроданныеТовары.Сумма, 0)
	 |ИЗ
	 |	Документ.ЧекККМ.Товары КАК ПроданныеТовары
	 |ГДЕ
	 |	ПроданныеТовары.Ссылка В
	 |			(ВЫБРАТЬ
	 |				Т.Ссылка
	 |			ИЗ
	 |				Документ.ЧекККМ КАК Т
	 |			ГДЕ
	 |				Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |				И Т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	 |				И Т.КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	 |				И Т.Партнер = &Партнер
	 |				И Т.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	ПроданныеТовары.Номенклатура,
	 |	ПроданныеТовары.Характеристика,
	 |	ПроданныеТовары.НоменклатураНабора,
	 |	ПроданныеТовары.ХарактеристикаНабора,
	 |	-ПроданныеТовары.Количество,
	 |	ЕСТЬNULL(-ПроданныеТовары.Сумма, 0)
	 |ИЗ
	 |	Документ.ЧекККМВозврат.Товары КАК ПроданныеТовары
	 |ГДЕ
	 |	ПроданныеТовары.Ссылка В
	 |			(ВЫБРАТЬ
	 |				Т.Ссылка
	 |			ИЗ
	 |				Документ.ЧекККМВозврат КАК Т
	 |			ГДЕ
	 |				Т.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |				И Т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	 |				И Т.КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	 |				И Т.Партнер = &Партнер
	 |				И Т.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СУММА(ЕСТЬNULL(ИТОГ.Количество, 0)) КАК Количество,
	 |	СУММА(ЕСТЬNULL(ИТОГ.Сумма, 0)) КАК Сумма
	 |ПОМЕСТИТЬ ТАБИТОГ
	 |ИЗ
	 |	ИТОГ КАК ИТОГ
	 |
	 |ОБЪЕДИНИТЬ ВСЕ
	 |
	 |ВЫБРАТЬ
	 |	0,
	 |	МССО_ОборотыКлиентов.Оборот
	 |ИЗ
	 |	РегистрСведений.МССО_ОборотыКлиентов КАК МССО_ОборотыКлиентов
	 |ГДЕ
	 |	МССО_ОборотыКлиентов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	 |	И МССО_ОборотыКлиентов.Контрагент.Партнер = &Партнер
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СУММА(ТАБИТОГ.Количество) КАК Количество,
	 |	СУММА(ТАБИТОГ.Сумма) КАК Сумма
	 |ИЗ
	 |	ТАБИТОГ КАК ТАБИТОГ";
	
	
	Запрос.УстановитьПараметр("Партнер", Контрагент.Партнер);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);

	
	РезЗпр = Запрос.Выполнить().Выгрузить();
		СуммаОборотаМССО = 0;
		
		Если РезЗпр.Количество() > 0 Тогда
			СуммаОборотаМССО = РезЗпр.Итог("Сумма");
		КонецЕсли;
			
		СкидкаОборот = 0;
		
		Если СуммаОборотаМССО >= 2000 и СуммаОборотаМССО < 10000 Тогда
			СкидкаОборот = 5;
		ИначеЕсли СуммаОборотаМССО >= 10000 и СуммаОборотаМССО < 20000 Тогда
			СкидкаОборот = 7;
		ИначеЕсли СуммаОборотаМССО >= 20000  Тогда
			СкидкаОборот = 10;
		КонецЕсли; 

	
		СкидкаОктябрьЯнварь = 0;
		//Если Месяц(ДатаОкончания) = 10 
		//	ИЛИ Месяц(ДатаОкончания) = 11 
		//		ИЛИ Месяц(ДатаОкончания) = 12 
		//			ИЛИ (Месяц(ДатаОкончания) = 1 И День(ДатаОкончания)< 10) Тогда  
		//				 СкидкаОктябрьЯнварь = 5;
		//КонецЕсли; 
	
	СкидкаОбщая = СкидкаОктябрьЯнварь+СкидкаОборот;
	
КонецПроцедуры
///
Функция ПроверитьСегментПартнеров(Партнер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартнерыСегмента.Партнер КАК Партнер,
		|	ПартнерыСегмента.Сегмент КАК Сегмент
		|ИЗ
		|	РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|ГДЕ
		|	ПартнерыСегмента.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = ЛОЖЬ;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Сегмент = Справочники.СегментыПартнеров.НайтиПоНаименованию("Клиенты на реализации (отключены скидки)",ИСТИНА) Тогда
		
			 Результат = ИСТИНА;
		
		КонецЕсли; 
	КонецЦикла;
	
	Возврат Результат;


КонецФункции // ()
///



//////////////////////////УСУШКА ЛУКА И ЧЕСНОКА 
&НаСервере
Процедура УсушкаЛука() Экспорт
    
    //КоэфУсушки = 0.004167;
    КоэфУсушки = Константы.КоэфУсушкиЛука.Получить();
    
    СписокНоменклатуры = Новый СписокЗначений;
    СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00000017"));
    СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00000018"));
    СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00015446"));
    
    ВыборкаСкладов = Справочники.Склады.Выбрать();
    Пока ВыборкаСкладов.Следующий() Цикл
        
        Если ВыборкаСкладов.ТипСклада <> Перечисления.ТипыСкладов.РозничныйМагазин ИЛИ ВыборкаСкладов.ЭтоГруппа Тогда
        	Продолжить;
        КонецЕсли; 
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   КалендарныеГрафики.ДатаГрафика КАК ДатаКалендаря
        |ПОМЕСТИТЬ Дни
        |ИЗ
        |   РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
        |ГДЕ
        |   КалендарныеГрафики.ДатаГрафика МЕЖДУ &НачалоПериода И &КонецПериода
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   Движения.Номенклатура КАК Номенклатура,
        |   Движения.Серия КАК Серия,
        |   ДНИ.ДатаКалендаря КАК ДатаКалендаря,
        |   СУММА(ВЫБОР
        |           КОГДА Движения.Период = &НачалоПериода
        |               ТОГДА Движения.ВНаличииКонечныйОстаток
        |           ИНАЧЕ ВЫБОР
        |                   КОГДА Движения.Период <= ДНИ.ДатаКалендаря
        |                       ТОГДА Движения.ВНаличииОборот
        |                   ИНАЧЕ 0
        |               КОНЕЦ
        |       КОНЕЦ) КАК КоличествоКонечныйОстаток,
        |   Движения.Склад КАК Склад
        |ПОМЕСТИТЬ ТАБОСТАТКИ
        |ИЗ
        |   Дни КАК ДНИ
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК Движения
        |       ПО (Движения.Период <= ДНИ.ДатаКалендаря)
        |ГДЕ
        |   Движения.Номенклатура В ИЕРАРХИИ(&СписокНоменклатуры)
        |   И Движения.Склад = &Склад
        |
        |СГРУППИРОВАТЬ ПО
        |   Движения.Номенклатура,
        |   ДНИ.ДатаКалендаря,
        |   Движения.Серия,
        |   Движения.Склад
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ТАБОСТАТКИ.Номенклатура КАК Номенклатура,
        |   ТАБОСТАТКИ.Серия КАК Серия,
        |   ТАБОСТАТКИ.ДатаКалендаря КАК ДатаКалендаря,
        |   ТАБОСТАТКИ.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
        |   ВЫРАЗИТЬ(ТАБОСТАТКИ.КоличествоКонечныйОстаток * &КоэфУсушки КАК ЧИСЛО(15, 3)) КАК УСУШКА,
        |   ВЫРАЗИТЬ(ТАБОСТАТКИ.КоличествоКонечныйОстаток - ТАБОСТАТКИ.КоличествоКонечныйОстаток * &КоэфУсушки КАК ЧИСЛО(15, 3)) КАК ОСТАТОК,
        |   ТАБОСТАТКИ.Склад КАК Склад
        |ИЗ
        |   ТАБОСТАТКИ КАК ТАБОСТАТКИ";
        
        Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
        Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
        Запрос.УстановитьПараметр("КоэфУсушки", КоэфУсушки);
        
        Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
        //Запрос.УстановитьПараметр("Серия", Серия);
        Запрос.УстановитьПараметр("Склад", ВыборкаСкладов.Ссылка);
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ТЗ_Усушка = РезультатЗапроса.Выгрузить();
        Счет = 0;
        Повтор = 1;
        
        Для Счет = 0 По ТЗ_Усушка.Количество()-1 Цикл
            Номенклатура = ТЗ_Усушка[Счет].Номенклатура;
            Серия = ТЗ_Усушка[Счет].Серия;
            Склад = ТЗ_Усушка[Счет].Склад;	
            Период = ТЗ_Усушка[Счет].ДатаКалендаря;
            
            Если ТЗ_Усушка[Счет].КоличествоКонечныйОстаток > 0  Тогда
                
                //Если Счет > 0 И ТЗ_Усушка[Счет].КоличествоКонечныйОстаток = ТЗ_Усушка[Счет-1].КоличествоКонечныйОстаток Тогда
                //	Остаток = ТЗ_Усушка[Счет].ОСТАТОК - Повтор * КоэфУсушки;
                //	Усушка = Остаток * КоэфУсушки;
                //	Повтор = Повтор + 1;
                //	
                //Иначе
                Остаток = ТЗ_Усушка[Счет].ОСТАТОК;
                Усушка = ТЗ_Усушка[Счет].УСУШКА;
                //КонецЕсли; 
                
                ИтогоУсушки = ПолучитьИтого(Номенклатура,Серия,Склад,Период) + Усушка;
                
                МенеджерЗаписи = РегистрыСведений.УсушкаЛукЧеснок.СоздатьМенеджерЗаписи();
                МенеджерЗаписи.Номенклатура = Номенклатура;
                МенеджерЗаписи.Серия = Серия;
                МенеджерЗаписи.Склад = Склад;
                МенеджерЗаписи.ОстатокКоличество = Остаток;
                МенеджерЗаписи.КоличествоУсушки = Усушка;
                МенеджерЗаписи.Период =  Период;
                МенеджерЗаписи.ИтогоУсушки = ИтогоУсушки;
                МенеджерЗаписи.Записать(ИСТИНА);
                
            КонецЕсли; 
            
        КонецЦикла; 	
    КонецЦикла; 
    
КонецПроцедуры

&НаСервере
Процедура УсушкаЧеснока() Экспорт
    
    //КоэфУсушки = 0.004167;
    КоэфУсушки = Константы.КоэфУсушкиЧеснока.Получить();
    СписокНоменклатуры = Новый СписокЗначений;
    СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоКоду("00-00000019"));
    
    
    
    ВыборкаСкладов = Справочники.Склады.Выбрать();
    Пока ВыборкаСкладов.Следующий() Цикл
        
        Если ВыборкаСкладов.ТипСклада <> Перечисления.ТипыСкладов.РозничныйМагазин ИЛИ ВыборкаСкладов.ЭтоГруппа Тогда
        	Продолжить;
        КонецЕсли; 
        
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   КалендарныеГрафики.ДатаГрафика КАК ДатаКалендаря
        |ПОМЕСТИТЬ Дни
        |ИЗ
        |   РегистрСведений.КалендарныеГрафики КАК КалендарныеГрафики
        |ГДЕ
        |   КалендарныеГрафики.ДатаГрафика МЕЖДУ &НачалоПериода И &КонецПериода
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   Движения.Номенклатура КАК Номенклатура,
        |   Движения.Серия КАК Серия,
        |   ДНИ.ДатаКалендаря КАК ДатаКалендаря,
        |   СУММА(ВЫБОР
        |           КОГДА Движения.Период = &НачалоПериода
        |               ТОГДА Движения.ВНаличииКонечныйОстаток
        |           ИНАЧЕ ВЫБОР
        |                   КОГДА Движения.Период <= ДНИ.ДатаКалендаря
        |                       ТОГДА Движения.ВНаличииОборот
        |                   ИНАЧЕ 0
        |               КОНЕЦ
        |       КОНЕЦ) КАК КоличествоКонечныйОстаток,
        |   Движения.Склад КАК Склад
        |ПОМЕСТИТЬ ТАБОСТАТКИ
        |ИЗ
        |   Дни КАК ДНИ
        |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, , ) КАК Движения
        |       ПО (Движения.Период <= ДНИ.ДатаКалендаря)
        |ГДЕ
        |   Движения.Номенклатура В ИЕРАРХИИ(&СписокНоменклатуры)
        |   И Движения.Склад = &Склад
        |
        |СГРУППИРОВАТЬ ПО
        |   Движения.Номенклатура,
        |   ДНИ.ДатаКалендаря,
        |   Движения.Серия,
        |   Движения.Склад
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ
        |   ТАБОСТАТКИ.Номенклатура КАК Номенклатура,
        |   ТАБОСТАТКИ.Серия КАК Серия,
        |   ТАБОСТАТКИ.ДатаКалендаря КАК ДатаКалендаря,
        |   ТАБОСТАТКИ.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
        |   ВЫРАЗИТЬ(ТАБОСТАТКИ.КоличествоКонечныйОстаток * &КоэфУсушки КАК ЧИСЛО(15, 3)) КАК УСУШКА,
        |   ВЫРАЗИТЬ(ТАБОСТАТКИ.КоличествоКонечныйОстаток - ТАБОСТАТКИ.КоличествоКонечныйОстаток * &КоэфУсушки КАК ЧИСЛО(15, 3)) КАК ОСТАТОК,
        |   ТАБОСТАТКИ.Склад КАК Склад
        |ИЗ
        |   ТАБОСТАТКИ КАК ТАБОСТАТКИ";
        
        Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ТекущаяДата()));
        Запрос.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
        Запрос.УстановитьПараметр("КоэфУсушки", КоэфУсушки);
        
        Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
        //Запрос.УстановитьПараметр("Серия", Серия);
        Запрос.УстановитьПараметр("Склад", ВыборкаСкладов.Ссылка);
        
        РезультатЗапроса = Запрос.Выполнить();
        
        ТЗ_Усушка = РезультатЗапроса.Выгрузить();
        Счет = 0;
        Повтор = 1;
        
        Для Счет = 0 По ТЗ_Усушка.Количество()-1 Цикл
            Номенклатура = ТЗ_Усушка[Счет].Номенклатура;
            Серия = ТЗ_Усушка[Счет].Серия;
            Склад = ТЗ_Усушка[Счет].Склад;	
            Период = ТЗ_Усушка[Счет].ДатаКалендаря;
            
            Если ТЗ_Усушка[Счет].КоличествоКонечныйОстаток > 0  Тогда
                
                //Если Счет > 0 И ТЗ_Усушка[Счет].КоличествоКонечныйОстаток = ТЗ_Усушка[Счет-1].КоличествоКонечныйОстаток Тогда
                //	Остаток = ТЗ_Усушка[Счет].ОСТАТОК - Повтор * КоэфУсушки;
                //	Усушка = Остаток * КоэфУсушки;
                //	Повтор = Повтор + 1;
                //	
                //Иначе
                Остаток = ТЗ_Усушка[Счет].ОСТАТОК;
                Усушка = ТЗ_Усушка[Счет].УСУШКА;
                //КонецЕсли; 
                
                ИтогоУсушки = ПолучитьИтого(Номенклатура,Серия,Склад,Период) + Усушка;
                
                МенеджерЗаписи = РегистрыСведений.УсушкаЛукЧеснок.СоздатьМенеджерЗаписи();
                МенеджерЗаписи.Номенклатура = Номенклатура;
                МенеджерЗаписи.Серия = Серия;
                МенеджерЗаписи.Склад = Склад;
                МенеджерЗаписи.ОстатокКоличество = Остаток;
                МенеджерЗаписи.КоличествоУсушки = Усушка;
                МенеджерЗаписи.Период =  Период;
                МенеджерЗаписи.ИтогоУсушки = ИтогоУсушки;
                МенеджерЗаписи.Записать(ИСТИНА);
                
            КонецЕсли; 
            
        КонецЦикла; 	
    КонецЦикла; 
    
КонецПроцедуры


Функция ПолучитьИтого(Номенклатура,Серия,Склад,Период)
	Итого = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УсушкаЛукЧеснок.Номенклатура КАК Номенклатура,
		|	УсушкаЛукЧеснок.Серия КАК Серия,
		|	УсушкаЛукЧеснок.Склад КАК Склад,
		|	СУММА(УсушкаЛукЧеснок.КоличествоУсушки) КАК КоличествоУсушки
		|ИЗ
		|	РегистрСведений.УсушкаЛукЧеснок КАК УсушкаЛукЧеснок
		|ГДЕ
		|	УсушкаЛукЧеснок.Период < &Период
		|	И УсушкаЛукЧеснок.Номенклатура = &Номенклатура
		|	И УсушкаЛукЧеснок.Серия = &Серия
		|	И УсушкаЛукЧеснок.Склад = &Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	УсушкаЛукЧеснок.Номенклатура,
		|	УсушкаЛукЧеснок.Серия,
		|	УсушкаЛукЧеснок.Склад";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Итого = ВыборкаДетальныеЗаписи.КоличествоУсушки;
	КонецЦикла;
	
	Возврат Итого;
	

КонецФункции // ()




/////////////ОбработкаИнтЗаказовПриПеремещении Подписка на событие

Процедура ОбработкаИнтЗаказовПриПеремещенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Источник.Статус = Перечисления.СтатусыПеремещенийТоваров.Принято Тогда
		Если Источник.ОбработанПредзаказ = ЛОЖЬ Тогда
			Источник.ОбработанПредзаказ = ИСТИНА;  
			Источник.Записать();
		КонецЕсли;	
	КонецЕсли; 

КонецПроцедуры

Процедура ЗаполнитьИнтЗаказыТЧЗаказНаПеремещениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	//Если Источник.Ссылка.СкладПолучатель = Справочники.Склады.НайтиПоНаименованию("Интернет магазин",Истина) Тогда     
	//	Если Источник.Ссылка.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению Тогда
	//		ИсточникОбъект = Источник.Ссылка.ПолучитьОбъект();
	//		ИсточникОбъект.ИнтернетЗаказыРозничные.Очистить();
	//		Для каждого стрДвижение Из Источник.Движения.ОбеспечениеЗаказовИнтМаг Цикл
	//			стр = ИсточникОбъект.ИнтернетЗаказыРозничные.Добавить();
	//			стр.ИнтернетЗаказРозничный = стрДвижение.Назначение;
	//			стр.Номенклатура = стрДвижение.Номенклатура;
	//			стр.Количество = стрДвижение.КЗаказу + стрДвижение.Отменено;
	//		КонецЦикла;

	//		ИсточникОбъект.Записать();      //jadmnin дублировалась запись     

	//	КонецЕсли;

	//КонецЕсли; 
КонецПроцедуры

	
Процедура СебестоимостьПоСтавкамНДСБлаготворительность(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.Благотворительность ИЛИ Источник.БезвозмезднаяПередача Тогда
		
		
		Движения = РегистрыНакопления.ВыручкаИСебестоимостьПродаж.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Значение = Источник.Ссылка;
		Движения.Прочитать(); 
		
		ТЗ_Марина = Движения.Выгрузить();
		
		ТЗ_Марина.Колонки.Добавить("ВидТМЦНаименование");
		ТЗ_Марина.Колонки.Добавить("ВидТМЦСчет");
		
		ТЗ_Марина.Колонки.Добавить("СтавкаНДС");
		
		Для каждого Строка_ТЗ_Марина Из ТЗ_Марина Цикл
			Строка_ТЗ_Марина.СтавкаНДС = ""+СокрЛП(Строка_ТЗ_Марина.АналитикаУчетаНоменклатуры.Номенклатура.СтавкаНДС);
			Строка_ТЗ_Марина.ВидТМЦНаименование = ""+СокрЛП(Строка_ТЗ_Марина.АналитикаУчетаНоменклатуры.Номенклатура.ВидТМЦ.Наименование);
			Строка_ТЗ_Марина.ВидТМЦСчет = ""+СокрЛП(Строка_ТЗ_Марина.АналитикаУчетаНоменклатуры.Номенклатура.ВидТМЦ.Счет); 
		КонецЦикла; 
		
		ТЗ_Марина.Свернуть("ВидТМЦСчет,СтавкаНДС","СуммаВыручкиРегл");
		
		Источник.СебестоимостьПоСтавкамНДСБлаготворительность.Очистить();
		
		Если ТЗ_Марина.Количество() > 0 Тогда
			Для каждого Строка Из ТЗ_Марина Цикл
				//Источник.СебестоимостьПоСтавкамНДСБлаготворительность.Очистить();
				Нов = Источник.СебестоимостьПоСтавкамНДСБлаготворительность.Добавить();
				ЗаполнитьЗначенияСвойств(Нов,Строка);
				Нов.СебестоимостьРегл  = Строка.СуммаВыручкиРегл;
			КонецЦикла; 
		КонецЕсли; 
		
		Источник.Записать();
	КонецЕсли; 
	
КонецПроцедуры	




Процедура ПродажиНижеСебестоимостиПоСтавкамНДС(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник.Ссылка) = ТИП("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		///Заполненение реквизита в заказе ВыписанаНакладаная
		Если Источник.РеализацияПоЗаказам Тогда
				
			ТЗ_Заказов = Источник.Товары.Выгрузить();
			ТЗ_Заказов.Свернуть("ЗаказКлиента","");

		   	Для каждого СтрокаТЗ Из ТЗ_Заказов Цикл
				ЗаказОбъект = СтрокаТЗ.ЗаказКлиента.Ссылка.ПолучитьОбъект();
									
				Если НЕ ЗаказОбъект.ВыписанаНакладная = Источник.Ссылка Тогда				
					ЗаказОбъект.ВыписанаНакладная = Источник.Ссылка;
					ЗаказОбъект.ОбменДанными.Загрузка = Истина;
					ЗаказОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;  
	КонецЕсли;

	/////
	
	Если Источник.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Благотворительность") Тогда
		
		
		Движения = РегистрыНакопления.ВыручкаИСебестоимостьПродаж.СоздатьНаборЗаписей();
		Движения.Отбор.Регистратор.Значение = Источник.Ссылка;
		Движения.Прочитать(); 
		
		
		Источник.ТоварыНижеСебестоимости.Очистить();
		
		Для каждого Строка Из Движения Цикл
			
			НачислятьСебестоимость = ЛОЖЬ;
			
			Если Источник.Ссылка.Дата < Дата("20230901") Тогда		
				Если (Строка.СебестоимостьРегл - Строка.СуммаДополнительныхРасходовБезНДС) > Строка.СуммаВыручкиРегл Тогда
					НачислятьСебестоимость = ИСТИНА;
				КонецЕсли;
			Иначе
				Если (Строка.СебестоимостьРегл) > Строка.СуммаВыручкиРегл Тогда					
					НачислятьСебестоимость = ИСТИНА;					
				КонецЕсли;

			КонецЕсли; 
			
			Если НачислятьСебестоимость = ИСТИНА Тогда				
				
				ДатаПоставкиСерии = Дата(1,1,1);			
				
				Если ТипЗнч(Строка.АналитикаУчетаНоменклатуры.Серия.ДокументПоставки) = Тип("ДокументСсылка.СборкаТоваров") Тогда 
					
					ДокСборки = Строка.АналитикаУчетаНоменклатуры.Серия.ДокументПоставки.Ссылка;
					
					ДатаПоставкиСерии = НачалоДня(ДокСборки.Товары[0].Серия.ДокументПоставки.Дата);
				Иначе
					ДатаПоставкиСерии = НачалоДня(Строка.АналитикаУчетаНоменклатуры.Серия.ДокументПоставки.Дата);
				КонецЕсли;
				
				РазницаВДнях = (НачалоДня(Источник.Дата) - НачалоДня(ДатаПоставкиСерии)) / (60 * 60 * 24);
				
				Если РазницаВДнях > 365 Тогда
					Продолжить;
				КонецЕсли; 
				
				Если Источник.Контрагент <> Справочники.Контрагенты.ПустаяСсылка() Тогда	
					Нов = Источник.ТоварыНижеСебестоимости.Добавить();
					Нов.Номенклатура = Строка.АналитикаУчетаНоменклатуры.Номенклатура;
					Нов.СтавкаНДС =  Строка.АналитикаУчетаНоменклатуры.Номенклатура.СтавкаНДС; 
					Нов.СуммаСебестоимости  = Строка.СебестоимостьРегл;
					Нов.Сумма   = Строка.СуммаВыручкиРегл;
				КонецЕсли;	
			КонецЕсли; 
			
			
		КонецЦикла; 
		
		
		Источник.Записать();
		
		
		Если Источник.ТоварыНижеСебестоимости.Количество() > 0 Тогда
			
				//Если Источник.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад 
				Если Источник.Контрагент <> Справочники.Контрагенты.ПустаяСсылка() Тогда
				
					НаборЗаписей = РегистрыНакопления.ЭСЧФДляВыставленияПродажиНижеСебестоимости.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Регистратор.Установить(Источник.Ссылка);
					
					Запись = НаборЗаписей.ДобавитьПриход();
					Запись.Регистратор = Источник.Ссылка;
					Запись.Период = Источник.Дата;
					Запись.Контрагент   = Источник.Контрагент;
					Запись.ДокументОснование = Источник.Ссылка;
					Запись.Состояние   = 1;
					
					НаборЗаписей.Записать();
									
				КонецЕсли;		
				//КонецЕсли;	
				
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры	


////////////////ЗАПРЕТ ОТГРУЗКИ ///////////////////

Процедура ПроверкаЗапретаОтгрузки(ОбъектСсылка,Отказ)    Экспорт
	
	ЕстьТоварыСЗапретомОтгрузки = Отказ;
	
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") Тогда 
		ТЗ_Товары = ОбъектСсылка.ОтгружаемыеТовары;
	Иначе
		ТЗ_Товары = ОбъектСсылка.Товары;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ПеремещениеТоваров") 
		ИЛИ ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.АктОРасхожденияхПослеПеремещения") 
		ИЛИ ТипЗнч(ОбъектСсылка) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда 
		Если ОбъектСсылка.СкладОтправитель.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад 
					И ОбъектСсылка.СкладПолучатель.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
					
			Склад = ОбъектСсылка.СкладОтправитель;
		    СкладПолучатель = ОбъектСсылка.СкладПолучатель; 
		Иначе
			Склад = ОбъектСсылка.СкладПолучатель;
		    СкладПолучатель = ОбъектСсылка.СкладОтправитель;
		КонецЕсли;

	Иначе
		Склад = ОбъектСсылка.Склад;
	    СкладПолучатель = ОбъектСсылка.Склад;
	КонецЕсли;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументЗапретаОтгрузки.Ссылка КАК Ссылка,
		|	ДокументЗапретаОтгрузки.Склад КАК Склад
		|ИЗ
		|	Документ.ДокументЗапретаОтгрузки КАК ДокументЗапретаОтгрузки
		|ГДЕ
		|	&ТекДата МЕЖДУ ДокументЗапретаОтгрузки.НачалоДействия И ДокументЗапретаОтгрузки.ОкончаниеДействия
		|	И ДокументЗапретаОтгрузки.Проведен = ИСТИНА
		|	И (ДокументЗапретаОтгрузки.Склад = &Склад
		|		ИЛИ ДокументЗапретаОтгрузки.Склад = &СкладПолучатель)";

	
	Запрос.УстановитьПараметр("ТекДата", ОбъектСсылка.Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		Для каждого  стрТовар Из ТЗ_Товары Цикл
	
			Запрос1 = Новый Запрос;
			Запрос1.Текст = 
				"ВЫБРАТЬ
				|	ДокументЗапретаОтгрузкиТовары.Ссылка КАК Ссылка,
				|	ДокументЗапретаОтгрузкиТовары.Номенклатура КАК Номенклатура
				|ИЗ
				|	Документ.ДокументЗапретаОтгрузки.Товары КАК ДокументЗапретаОтгрузкиТовары
				|ГДЕ
				|	ДокументЗапретаОтгрузкиТовары.Номенклатура = &Номенклатура
				|	И &ТекДата МЕЖДУ ДокументЗапретаОтгрузкиТовары.Ссылка.НачалоДействия И ДокументЗапретаОтгрузкиТовары.Ссылка.ОкончаниеДействия
				|	И ДокументЗапретаОтгрузкиТовары.Ссылка.Проведен = ИСТИНА
				|	И (ДокументЗапретаОтгрузкиТовары.Ссылка.Склад = &Склад
				|		ИЛИ ДокументЗапретаОтгрузкиТовары.Ссылка.Склад = &СкладПолучатель)";
			
			Запрос1.УстановитьПараметр("ТекДата", ОбъектСсылка.Дата);
			Запрос1.УстановитьПараметр("Номенклатура", стрТовар.Номенклатура);
			Запрос1.УстановитьПараметр("Склад", Склад);
			Запрос1.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
			
			РезультатЗапроса1 = Запрос1.Выполнить();
			
			Если НЕ РезультатЗапроса1.Пустой() Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Строка " + стрТовар.НомерСтроки + "  " +стрТовар.Номенклатура + " установлен запрет отгрузки!",ОбъектСсылка,,,Отказ);
				ЕстьТоварыСЗапретомОтгрузки = ИСТИНА;
			КонецЕсли;
		
		КонецЦикла; 	
	КонецЦикла;

	Отказ = ЕстьТоварыСЗапретомОтгрузки;
	
КонецПроцедуры


//////////////////////



////////////////ПРОВЕРКА РЕГУЛИРУЕМЫХ ЦЕН ///////////////////

Процедура ПроверкаРегулируемыхЦен(ОбъектСсылка,Отказ) Экспорт
	Если ОбъектСсылка.Соглашение.Наименование = "Благотворительность" Тогда
    	Возврат;
 	КонецЕсли;

	
	Если НачалоДня(ОбъектСсылка.Дата) >= Дата("20221101") Тогда
		
		ЕстьРегулированиеЦен = Ложь;
		НеУстановленыЦены = Ложь;
		
		Для каждого Строка Из ОбъектСсылка.Товары Цикл
			
			ЕстьРегулированиеЦен_Строка = Ложь;
			НеУстановленыЦены_Строка = Ложь;
			
			Если ПроверитьРегулированиеЦенГосударством_Оптовых(Строка.Номенклатура,ОбъектСсылка.Дата) = Истина Тогда
				ЕстьРегулированиеЦен = Истина;
				ЕстьРегулированиеЦен_Строка = Истина;
			КонецЕсли; 
					
			
			Если ЕстьРегулированиеЦен_Строка = Истина Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор КАК Регистратор,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
				|ГДЕ
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена <> 0
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены";
				
				Запрос.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
				Запрос.УстановитьПараметр("Серия", Строка.Серия);
				Запрос.УстановитьПараметр("ВидЦены", Строка.ВидЦены);
				Запрос.УстановитьПараметр("Период", ОбъектСсылка.Дата);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если РезультатЗапроса.Пустой() Тогда
					НеУстановленыЦены = Истина;
					НеУстановленыЦены_Строка = Истина;
				КонецЕсли; 
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если Строка.Цена > ВыборкаДетальныеЗаписи.Цена Тогда
						Сообщить("Строка "+Строка.НомерСтроки+"   "+Строка.Номенклатура+"    Цена продажи = "+Строка.Цена+"    регулированая цена = "+ВыборкаДетальныеЗаписи.Цена);
						НеУстановленыЦены = Истина;
						НеУстановленыЦены_Строка = Истина;
					ИначеЕсли Строка.Цена = ВыборкаДетальныеЗаписи.Цена Тогда	
						НеУстановленыЦены = Ложь;
						НеУстановленыЦены_Строка = Ложь;
					КонецЕсли; 	
				КонецЦикла;
				
			КонецЕсли; 
			
			Если (НеУстановленыЦены_Строка = Истина И ЕстьРегулированиеЦен_Строка = Истина) Тогда
				Сообщить("Строка "+Строка.НомерСтроки+"   "+Строка.Номенклатура+"         по номенклатуре регулируются цены Постановлением Совета Министров N713 и цена не установлена ");
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если (ЕстьРегулированиеЦен = Истина И НеУстановленыЦены = Истина) Тогда
			Сообщить("В документе есть товары попадающие под регулирование цен Постановлением Совета Министров N713 и на них не установлена цена ");
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры


Процедура ПроверкаРегулируемыхЦен_Розница(ОбъектСсылка,Отказ) Экспорт
	
	//jadmin 10-01-2023 добавил условие после И
	Если (НачалоДня(ОбъектСсылка.Дата) >= Дата("20221027") И НачалоДня(ОбъектСсылка.Дата) < Дата("20230111"))
		ИЛИ НачалоДня(ОбъектСсылка.Дата) >= Дата("20230403")  Тогда
		
		ЕстьРегулированиеЦен = Ложь;
		НеУстановленыЦены = Ложь;
		
		Для каждого Строка Из ОбъектСсылка.Товары Цикл
			
			ЕстьРегулированиеЦен_Строка = Ложь;
			НеУстановленыЦены_Строка = Ложь;
			
			Если ПроверитьРегулированиеЦенГосударством_Розничных(Строка.Номенклатура,ОбъектСсылка.Дата) = Истина Тогда
				ЕстьРегулированиеЦен = Истина;
				ЕстьРегулированиеЦен_Строка = Истина;
			КонецЕсли; 
					
			
			Если ЕстьРегулированиеЦен_Строка = Истина Тогда
				УстановленыЦеныПоНоменклатуреПоСериям = ПроверитьУстановкуЦенПоНоменклатуре(Строка.Номенклатура,ОбъектСсылка.Дата) = ИСТИНА;
				Если УстановленыЦеныПоНоменклатуреПоСериям = ИСТИНА Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
					|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор КАК Регистратор,
					|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
					|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
					|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
					|ИЗ
					|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
					|ГДЕ
					|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
					|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия
					|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена <> 0
					|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены";
					
					Запрос.УстановитьПараметр("Номенклатура",Строка.Номенклатура);
					Запрос.УстановитьПараметр("Серия", Строка.Серия);
					Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные"));
					Запрос.УстановитьПараметр("Период", ОбъектСсылка.Дата);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					
					//Если ОбъектСсылка.ЭтоИнтернетЗаказ = Ложь Тогда
						Если РезультатЗапроса.Пустой() Тогда
							НеУстановленыЦены = Истина;
							НеУстановленыЦены_Строка = Истина;
						КонецЕсли; 
					//КонецЕсли; 
				ИначеЕсли УстановленыЦеныПоНоменклатуреПоСериям = ЛОЖЬ И Строка.Серия.ДокументПоставки.Дата >= Дата("20221101") Тогда
					НеУстановленыЦены = Истина;
					НеУстановленыЦены_Строка = Истина;
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если (НеУстановленыЦены_Строка = Истина И ЕстьРегулированиеЦен_Строка = Истина) Тогда
				Сообщить("Строка "+Строка.НомерСтроки+"   "+Строка.Номенклатура+"         по номенклатуре регулируются цены Постановлением Совета Министров N713 и цена не установлена ");
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если (ЕстьРегулированиеЦен = Истина И НеУстановленыЦены = Истина) Тогда
			Сообщить("В документе есть товары попадающие под регулирование цен Постановлением Совета Министров N713 и на них не установлена цена ");
			Отказ = Истина;
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

	
Процедура ПроверкаУстановленныхРегулируемыхЦенПоСериям_Розница(ОбъектСсылка,Отказ) Экспорт

	  Для каждого Строка Из ОбъектСсылка.Товары Цикл
		  Если (ОбъектСсылка.Дата >= Дата("20221027") И ОбъектСсылка.Дата < Дата("20230111")) 
			  ИЛИ ОбъектСсылка.Дата >= Дата("20230403") Тогда
			  Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Розничных(Строка.Номенклатура,ОбъектСсылка.Дата) = ИСТИНА Тогда
				  Если (Строка.Серия.ДокументПоставки.Дата >= Дата("20221101") И Строка.Серия.ДокументПоставки.Дата < Дата("20230111"))
					  ИЛИ Строка.Серия.ДокументПоставки.Дата >= Дата("20230331") Тогда
					  
					  Если ПроверитьУстановкуЦенПоСериям(Строка.Номенклатура,Строка.Серия, ОбъектСсылка.Дата) = ЛОЖЬ Тогда    //Цена не установлена
						  Сообщить("В строке "+Строка.НомерСтроки+ " "+Строка.Номенклатура+" серия " + Строка.Серия+ " не установлена Розничная цена на серию (цены регулируются государством)");
						  Отказ = ИСТИНА;
					  КонецЕсли;
					  
				  КонецЕсли;
			  КонецЕсли; 
		  КонецЕсли; 

			
			Если ПроверитьНедоступностьТоваров_Розница(Строка.Номенклатура,ОбъектСсылка.Дата) = ИСТИНА Тогда
				Сообщить("В строке "+Строка.НомерСтроки+ " "+Строка.Номенклатура+" установлен признак недоступно для розницы!");
				Если НЕ РольДоступна("АдминистраторСистемы") Тогда
					Отказ = ИСТИНА;	
				КонецЕсли; 
 				//Отказ = ИСТИНА;	
			КонецЕсли; 

			
			Если ПроверитьУстановкуЦенПоНоменклатуреСтандарт(Строка.Номенклатура, ОбъектСсылка.Дата) = ЛОЖЬ Тогда
				Сообщить("В строке "+Строка.НомерСтроки+ " "+Строка.Номенклатура+" не установлена розничная цена на номенклатуру!");
				Отказ = ИСТИНА;				
			КонецЕсли; 
			
	  КонецЦикла; 

КонецПроцедуры
 
Функция ПроверитьНедоступностьТоваров_Розница(Номенклатура,Дата)

	Недоступно = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура КАК Номенклатура,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.НедоступноОпт КАК НедоступноРозница
		|ИЗ
		|	РегистрСведений.РегулируемыеЦеныНаНоменклатуре.СрезПоследних(&Дата, ) КАК РегулируемыеЦеныНаНоменклатуреСрезПоследних
		|ГДЕ
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.НедоступноРозница = ИСТИНА
		|	И РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
	
		Недоступно = ИСТИНА;
	
	КонецЕсли;

	Возврат Недоступно;

КонецФункции // ()
 
Функция ПроверитьНедоступностьТоваров_Опт(Номенклатура,Дата)

	Недоступно = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура КАК Номенклатура,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.НедоступноОпт КАК НедоступноОпт
		|ИЗ
		|	РегистрСведений.РегулируемыеЦеныНаНоменклатуре.СрезПоследних(&Дата, ) КАК РегулируемыеЦеныНаНоменклатуреСрезПоследних
		|ГДЕ
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.НедоступноОпт = ИСТИНА";
	
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
	
		Недоступно = ИСТИНА;
	
	КонецЕсли;

	Возврат Недоступно;

КонецФункции // ()


Функция ПроверитьРегулированиеЦенГосударством_Оптовых(Номенклатура,Период)  ЭКСПОРТ

	ЦеныРегулируютсяГосударством = ЛОЖЬ;
	
	//Если Номенклатура.РегулированиеЦенОпт = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.РегулированиеЦенОпт = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.Родитель.РегулированиеЦенОпт = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель.РегулированиеЦенОпт = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель.РегулированиеЦенОпт = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.РегулированиеЦенОпт = ИСТИНА
	//	Тогда
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.Период КАК Период,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура КАК Номенклатура,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт КАК РегЦена_Опт,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница КАК РегЦена_Розница,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.РегулируемыеЦеныНаНоменклатуре.СрезПоследних(&Период) КАК РегулируемыеЦеныНаНоменклатуреСрезПоследних
		|ГДЕ
		|	(РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &Номенклатура
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель1
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель2
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель3
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель4
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель5)
		|	И РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт = ИСТИНА";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НоменклатураРодитель1", Номенклатура.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель2", Номенклатура.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель3", Номенклатура.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель4", Номенклатура.Родитель.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель5", Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель);

	Запрос.УстановитьПараметр("Период", Период);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда

	
			ЦеныРегулируютсяГосударством = ИСТИНА;
	
	КонецЕсли;
	
	Возврат ЦеныРегулируютсяГосударством;
	
КонецФункции // ()


Функция ПроверитьРегулированиеЦенГосударством_Розничных(Номенклатура,Период)  ЭКСПОРТ

	ЦеныРегулируютсяГосударством = ЛОЖЬ;
	
	//Если Номенклатура.РегулированиеЦенРозница = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.РегулированиеЦенРозница = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.Родитель.РегулированиеЦенРозница = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель.РегулированиеЦенРозница = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель.РегулированиеЦенРозница = ИСТИНА
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.РегулированиеЦенРозница = ИСТИНА
		//Тогда
		
		  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.Период КАК Период,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура КАК Номенклатура,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт КАК РегЦена_Опт,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница КАК РегЦена_Розница,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.РегулируемыеЦеныНаНоменклатуре.СрезПоследних(&Период) КАК РегулируемыеЦеныНаНоменклатуреСрезПоследних
		|ГДЕ
		|	(РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &Номенклатура
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель1
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель2
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель3
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель4
		|			ИЛИ РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура = &НоменклатураРодитель5)
		|	И РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница = ИСТИНА";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НоменклатураРодитель1", Номенклатура.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель2", Номенклатура.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель3", Номенклатура.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель4", Номенклатура.Родитель.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель5", Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель);

	Запрос.УстановитьПараметр("Период", Период);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
			
			ЦеныРегулируютсяГосударством = ИСТИНА;
	
	КонецЕсли;
	
	Возврат ЦеныРегулируютсяГосударством;
	
КонецФункции // ()


//Для инв   jadmin 10-01-2023 
Процедура ПроверкаСерийДляИнвентаризацииРегулируемыхЦен_Розница(ОбъектСсылка,Отказ) Экспорт
	
	 // jadmin 10-01-2023 добавил условие
	Если (НачалоДня(ОбъектСсылка.Дата) >= Дата("20221027") И ОбъектСсылка.Дата < Дата("20230111"))
		ИЛИ НачалоДня(ОбъектСсылка.Дата) >= Дата("20230403") Тогда
				
		Для каждого Строка Из ОбъектСсылка.Товары Цикл
			
			ЕстьРегулированиеЦен = Ложь;
			
			Если ПроверитьРегулированиеЦенГосударством_Розничных(Строка.Номенклатура,ОбъектСсылка.Дата) = Истина Тогда
				ЕстьРегулированиеЦен = Истина;
			КонецЕсли; 
					
			
			Если ЕстьРегулированиеЦен = Истина Тогда
				УстановленыЦеныПоНоменклатуреПоСериям = ПроверитьУстановкуЦенПоНоменклатуре(Строка.Номенклатура,ОбъектСсылка.Дата) = ИСТИНА;
				Если УстановленыЦеныПоНоменклатуреПоСериям = ИСТИНА Тогда	
					 Если НЕ ЗначениеЗаполнено(Строка.Серия) Тогда
					 	  Сообщить("Строка " + Строка.НомерСтроки + " " + Строка.Номенклатура + " не заполнена серия (цены регулируются госудаством и установлены цены на серию)");	
						  Отказ = ИСТИНА;
					 КонецЕсли; 
				КонецЕсли; 	
			КонецЕсли; 
						
		КонецЦикла; 
				
	КонецЕсли; 
	
КонецПроцедуры

//////////////////////
Функция ПроверитьВозможностьПримененияСкидок_Опт(Номенклатура,Период) ЭКСПОРТ
	
	МожноПрименятьСкидки = ЛОЖЬ;
	Если ПроверитьРегулированиеЦенГосударством_Оптовых(Номенклатура,Период) = ИСТИНА
		//ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")
		//ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") 
		//ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") 
		//ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")
		//ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") // скидка картошка
		Тогда	 
	 		МожноПрименятьСкидки = ЛОЖЬ;
		Иначе 
			МожноПрименятьСкидки = ИСТИНА;
	 КонецЕсли;	 
	 
	 Возврат МожноПрименятьСкидки;
	 
КонецФункции // ()


Функция ПроверитьВозможностьПримененияСкидок_Розница(Номенклатура) Экспорт
	
	СкидкиМожноПрименять = ИСТИНА;
	
	Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Розничных(Номенклатура,ТекущаяДата()) = ИСТИНА Тогда
		Возврат СкидкиМожноПрименять = ЛОЖЬ;
	КонецЕсли;
	
	//Если Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000022")       // Грунты
	//	ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000022") 
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000022")    
	//	
	//	ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000031")      // Горшки посуда ведра 
	//	ИЛИ Номенклатура.Родитель.Родитель  = Справочники.Номенклатура.НайтиПоКоду("00-00000031")   
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель  = Справочники.Номенклатура.НайтиПоКоду("00-00000031")   
	//	
	//	ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000961")      // СМС мыло парфюмерия
	//	ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000961") 
	//	ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000961") 
	//	
	//	Тогда
	//	
	//	Возврат СкидкиМожноПрименять = ЛОЖЬ;		
	//	
	//КонецЕсли;
	
	
	Возврат СкидкиМожноПрименять;
	
КонецФункции // ()




Функция ПроверитьУстановкуЦенПоСериям(Номенклатура,Серия,Период)
	
	ЦенаНаСериюУстановлена = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
		|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия
		|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены
		|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена > 0";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));


	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()> 0 Тогда
	
		ЦенаНаСериюУстановлена = ИСТИНА;
	
	КонецЕсли; 

	Возврат ЦенаНаСериюУстановлена;

КонецФункции // ()
 
 
Функция ПроверитьУстановкуЦенПоНоменклатуре(Номенклатура,Период)
	
	ЦенаНаНоменклатуруУстановлена = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
		|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены
		|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена > 0";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
	Запрос.УстановитьПараметр("Период", Период);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()> 0 Тогда
	
		ЦенаНаНоменклатуруУстановлена = ИСТИНА;
	
	КонецЕсли; 

	Возврат ЦенаНаНоменклатуруУстановлена;

КонецФункции // ()
///////////////////
Функция ПроверитьУстановкуЦенПоНоменклатуреСтандарт(Номенклатура,Период)

	 ЦенаНаНоменклатуруУстановлена = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
		|	И ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
		|	И ЦеныНоменклатурыСрезПоследних.Цена > 0";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА));
	Запрос.УстановитьПараметр("Период", Период);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()> 0 Тогда
	
		ЦенаНаНоменклатуруУстановлена = ИСТИНА;
	
	КонецЕсли; 

	Возврат ЦенаНаНоменклатуруУстановлена;


КонецФункции // ()
 

Процедура ПроверитьЗаказКлиента(ОбъектСсылка,ЗаказТовары,Отказ, Режим, ТЧ_Товары = Неопределено) Экспорт
	
	
	Если ОбъектСсылка.Соглашение.Наименование = "Благотворительность" Тогда
    	Возврат;	
	КонецЕсли;

	Если ОбъектСсылка.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
	    ДатаДок = ОбъектСсылка.Дата;
		//ВидЦены = ОбъектСсылка.Соглашение.ВидЦен;
		Ссылка =  ОбъектСсылка;	
		ТипСклада = ОбъектСсылка.Склад.ТипСклада;
	ИначеЕсли ОбъектСсылка.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин  Тогда
		ДатаДок = ОбъектСсылка.Дата;
		//ВидЦены = ОбъектСсылка.Соглашение.ВидЦен;
		Ссылка =  ОбъектСсылка;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТ_ТЗ_ТОВАРЫ
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|ВЫБРАТЬ 
		//|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
		|	ЗаказКлиентаТовары.Цена КАК Цена,
		|	ЗаказКлиентаТовары.Сумма КАК Сумма,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
		|	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
		|	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
		|	ЗаказКлиентаТовары.Отменено КАК Отменено,
		|	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
		|	ЗаказКлиентаТовары.Склад КАК Склад,
		|	ЗаказКлиентаТовары.СрокПоставки КАК СрокПоставки,
		|	ЗаказКлиентаТовары.Содержание КАК Содержание,
		|	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ЗаказКлиентаТовары.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора,
		|	ЗаказКлиентаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ЗаказКлиентаТовары.КолВоГрузовыхМест КАК КолВоГрузовыхМест,
		|	ЗаказКлиентаТовары.КратностьУпаковки КАК КратностьУпаковки,
		|	ЗаказКлиентаТовары.Ном КАК Ном,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.НедоступноДляОпта = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НедоступноДляОпта,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НедоступноДляРозницы
		|ПОМЕСТИТЬ ТАБЗАКАЗ
		|ИЗ
		|	ВТ_ТЗ_ТОВАРЫ КАК ЗаказКлиентаТовары
		//|ГДЕ
		//|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		//|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	ЗаказКлиентаТовары.КратностьУпаковки КАК КратностьУпаковки,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт КАК РегЦена_Опт,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница КАК РегЦена_Розница
		|ПОМЕСТИТЬ ТАБРеГ
		|ИЗ
		|	ВТ_ТЗ_ТОВАРЫ КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегулируемыеЦеныНаНоменклатуре.СрезПоследних(&ДатаДок, ) КАК РегулируемыеЦеныНаНоменклатуреСрезПоследних
		|		ПО (ЗаказКлиентаТовары.Номенклатура = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура)
		|ГДЕ
		//|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|	 ВЫБОР
		|			КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
		|				ТОГДА РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт = ИСТИНА
		|			ИНАЧЕ РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница = ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЕСТЬNULL(ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена, 0) КАК Цена,
		|	0 КАК ЦенаНоменклатуры
		|ПОМЕСТИТЬ ТАБЦеныПоСериям
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(
		|			&ДатаДок,
		|			(ВидЦены, Номенклатура, Характеристика, Серия) В
		|				(ВЫБРАТЬ
		|					Таблица.ВидЦены,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Серия
		|				ИЗ
		|					ТАБЗАКАЗ КАК Таблица)) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаДок,
		|			(ВидЦены, Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					Таблица.ВидЦены,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика
		|				ИЗ
		|					ТАБЗАКАЗ КАК Таблица)) КАК ЦеныНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//|	ТабЗаказ.Ссылка КАК Ссылка,
		|	ТабЗаказ.НомерСтроки КАК НомерСтроки,
		|	ТабЗаказ.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ТабЗаказ.Номенклатура КАК Номенклатура,
		|	ТабЗаказ.Характеристика КАК Характеристика,
		|	ТабЗаказ.Упаковка КАК Упаковка,
		|	ТабЗаказ.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТабЗаказ.Количество КАК Количество,
		|	ТабЗаказ.ВидЦены КАК ВидЦены,
		|	ВЫБОР
		|		КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
		|			ТОГДА ВЫБОР
		|					КОГДА ТАБРеГ.РегЦена_Опт = ИСТИНА
		|						ТОГДА ЕСТЬNULL(ТАБЦеныПоСериям.Цена, 0)
		|					ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|				КОНЕЦ
		//jadmin 10-01-2023  берем цены номенклатуры
		//|       ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|       ИНАЧЕ ВЫБОР КОГДА (&ДатаДок >= ДАТАВРЕМЯ(2022,10,27,0,0,0) И &ДатаДок < ДАТАВРЕМЯ(2023,1,11,6,0,0)) ИЛИ &ДатаДок >= ДАТАВРЕМЯ(2023,4,3,0,0,0)
		|			ТОГДА  ВЫБОР
		|				КОГДА ТАБРеГ.РегЦена_Розница = ИСТИНА
		|					ТОГДА ВЫБОР
		|							КОГДА ЕСТЬNULL(ТАБЦеныПоСериям.Цена, 0) <> 0
		|								ТОГДА ЕСТЬNULL(ТАБЦеныПоСериям.Цена, 0)
		|							ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|						КОНЕЦ
		|					ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|				КОНЕЦ
		|         	ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КОНЕЦ
		|		КОНЕЦ КАК Цена,
		|	ТабЗаказ.Сумма КАК Сумма,
		|	ТабЗаказ.СтавкаНДС КАК СтавкаНДС,
		|	ТабЗаказ.СуммаНДС КАК СуммаНДС,
		|	ТабЗаказ.СуммаСНДС КАК СуммаСНДС,
		|	ВЫБОР
		|		КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
		|			ТОГДА ВЫБОР
		|					КОГДА ТАБРеГ.РегЦена_Опт = ИСТИНА
		|						ТОГДА 0
		|					ИНАЧЕ ТабЗаказ.ПроцентРучнойСкидки
		|				КОНЕЦ
		|		ИНАЧЕ ТабЗаказ.ПроцентРучнойСкидки
		|	КОНЕЦ КАК ПроцентРучнойСкидки,
		|	ТабЗаказ.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ВЫБОР
		|		КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
		|			ТОГДА ВЫБОР
		|					КОГДА ТАБРеГ.РегЦена_Опт = ИСТИНА
		|						ТОГДА 0
		|					ИНАЧЕ ТабЗаказ.ПроцентАвтоматическойСкидки
		|				КОНЕЦ
		|		ИНАЧЕ ТабЗаказ.ПроцентАвтоматическойСкидки
		|	КОНЕЦ КАК ПроцентАвтоматическойСкидки,
		|	ТабЗаказ.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ТабЗаказ.ПричинаОтмены КАК ПричинаОтмены,
		|	ТабЗаказ.КодСтроки КАК КодСтроки,
		|	ТабЗаказ.Отменено КАК Отменено,
		|	ТабЗаказ.КлючСвязи КАК КлючСвязи,
		|	ТабЗаказ.Склад КАК Склад,
		|	ТабЗаказ.СрокПоставки КАК СрокПоставки,
		|	ТабЗаказ.Содержание КАК Содержание,
		|	ТабЗаказ.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ТабЗаказ.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ТабЗаказ.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
		|	ТабЗаказ.Серия КАК Серия,
		|	ТабЗаказ.НоменклатураНабора КАК НоменклатураНабора,
		|	ТабЗаказ.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ТабЗаказ.КолВоГрузовыхМест КАК КолВоГрузовыхМест,
		|	ТАБРеГ.РегЦена_Опт КАК РегЦена_Опт,
		|	ТАБРеГ.РегЦена_Розница КАК РегЦена_Розница,
		|	ТабЗаказ.НедоступноДляОпта КАК НедоступноДляОпта,
		|	ТабЗаказ.НедоступноДляРозницы КАК НедоступноДляРозницы,
		|	ТабЗаказ.КратностьУпаковки КАК КратностьУпаковки,
		|	ТабЗаказ.Ном КАК Ном
		|ИЗ
		|	ТАБЗАКАЗ КАК ТабЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБЦеныПоСериям КАК ТАБЦеныПоСериям
		|		ПО ТабЗаказ.Номенклатура = ТАБЦеныПоСериям.Номенклатура
		|			И ТабЗаказ.Характеристика = ТАБЦеныПоСериям.Характеристика
		|			И ТабЗаказ.Серия = ТАБЦеныПоСериям.Серия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТабЗаказ.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И ТабЗаказ.Характеристика = ЦеныНоменклатуры.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБРеГ КАК ТАБРеГ
		|		ПО (ТАБРеГ.Номенклатура = ТабЗаказ.Номенклатура)
		|			И (ТАБРеГ.Серия = ТабЗаказ.Серия)
		|			И (ТАБРеГ.НомерСтроки = ТабЗаказ.НомерСтроки)";
	
	Запрос.Текст = ТекстЗапроса;
	//Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Запрос.УстановитьПараметр("ТЗ_Товары", ЗаказТовары);
	Запрос.УстановитьПараметр("ТипСклада", ТипСклада);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если Режим = "Проверка" Тогда
		Для каждого Строка Из РезультатЗапроса Цикл
		
			// Проверки !!!
			Номенклатура = Строка.Номенклатура;
			НедоступноДляОпта = Строка.НедоступноДляОпта;
			НедоступноДляРозницы = Строка.НедоступноДляРозницы;
			РегЦена_Опт = Строка.РегЦена_Опт;
			РегЦена_Розница = Строка.РегЦена_Розница;
			НомерСтроки = Строка.НомерСтроки;
			СерияНедоступноДляОпта = Строка.Серия.НедоступноДляОпта;
			СерияНедоступноДляРозницы = Строка.Серия.НедоступноДляРозницы;
			
			
			Если Строка.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук Тогда
				Если Строка.КоличествоУпаковок <> ЦЕЛ(Строка.КоличествоУпаковок) Тогда
					Если Строка.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000046") 
						ИЛИ Строка.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000046")
						 	ИЛИ Строка.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000046")Тогда
						
					Иначе	
						Сообщить("Строка № "+Строка.НомерСтроки +" "+Строка.Номенклатура+ " указано дробное количество. ");
						Отказ = Истина;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли; 
			
			Если ОбъектСсылка.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда	
				Если НедоступноДляОпта = ИСТИНА Тогда		
					Сообщить("Строка "+ НомерСтроки+ " "+Номенклатура+" установлен признак недоступно для опта");
					Если ОбъектСсылка.Склад = Справочники.Склады.НайтиПоНаименованию("Склад N 3а",ИСТИНА) Тогда
						
					Иначе
						Отказ = ИСТИНА;	
					КонецЕсли; 
				КонецЕсли;
				
				Если РегЦена_Опт = ИСТИНА И Строка.Цена = 0 Тогда
				    Сообщить("Строка "+ НомерСтроки+ " "+Номенклатура+" не установлена цена на серию (цены регулируются государством)");
					Отказ = ИСТИНА;
				КонецЕсли;
				
				Если СерияНедоступноДляОпта = ИСТИНА Тогда
					Сообщить("Строка "+ НомерСтроки+ " "+Номенклатура+" на серию установлен признак недоступно для ОПТА");
					Отказ = ИСТИНА;
				КонецЕсли;
				
			Иначе	
				Если НедоступноДляРозницы = ИСТИНА Тогда		
					Сообщить("Строка "+ НомерСтроки+ " "+Номенклатура+" установлен признак недоступно для розницы");
					Если НЕ РольДоступна("АдминистраторСистемы") Тогда
						Отказ = ИСТИНА;	
					КонецЕсли; 
				КонецЕсли;
				
				Если СерияНедоступноДляРозницы = ИСТИНА Тогда
					Сообщить("Строка "+ НомерСтроки+ " "+Номенклатура+" на серию установлен признак недоступно для Розницы");
					Если НЕ РольДоступна("АдминистраторСистемы") Тогда
						Отказ = ИСТИНА;	
					КонецЕсли; 
				КонецЕсли;

				//Если РегЦена_Розница = ИСТИНА И Строка.Цена = 0 Тогда
				//    Сообщить("Строка "+ НомерСтроки+ " "+Номенклатура+" не установлена цена на серию (цены регулируются государством)");
				//	Отказ = ИСТИНА;
				//КонецЕсли;

			КонецЕсли; 		
		КонецЦикла;
		
	ИначеЕсли Режим = "Пересчет" Тогда	
		

		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ОбъектСсылка);
		КэшированныеЗначения = Неопределено;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				
		ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(РезультатЗапроса, СтруктураДействий, КэшированныеЗначения);

		ТЧ_Товары = РезультатЗапроса;		
	КонецЕсли;

		

КонецПроцедуры


Процедура ЗаполнитьЗаказНаПеремещение(ОбъектСсылка,ЗаказТовары,Отказ,ТЧ_Товары = Неопределено) Экспорт

	Если  ЗначениеЗаполнено(ОбъектСсылка.ЖелаемаяДатаПоступления)Тогда
	  ДатаОтгрузки = ОбъектСсылка.ЖелаемаяДатаПоступления;
 	Иначе
	  ДатаОтгрузки = ОбъектСсылка.Дата;
  	КонецЕсли;
  
    ДатаДок = ОбъектСсылка.Дата;
	ВидЦены = Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор","Розничные");
	Склад =  ОбъектСсылка.СкладПолучатель;  
  
		
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТ_ТЗ_ТОВАРЫ
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;   		
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	0 КАК КолВоВБ
		|ПОМЕСТИТЬ ТАБВБ
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Склад = &Склад
		|	И РеализацияТоваровУслугТовары.Ссылка.Партнер = &ПартнерИМ
		|	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаОкон
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
		|	И РеализацияТоваровУслугТовары.Номенклатура В
		|			(ВЫБРАТЬ
		|				ВТ_ТЗ_ТОВАРЫ.Номенклатура
		|			ИЗ
		|				ВТ_ТЗ_ТОВАРЫ)
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Номенклатура
		|;
		|ВЫБРАТЬ
		|	ГрафикПоступленияТоваров.Номенклатура КАК Номенклатура,
		|	СУММА(ГрафикПоступленияТоваров.КоличествоИзЗаказов) КАК КоличествоИзЗаказов
		|	ПОМЕСТИТЬ ТАБПОСТУПЛЕНИЯ
		|ИЗ
		|	РегистрНакопления.ГрафикПоступленияТоваров КАК ГрафикПоступленияТоваров
		|ГДЕ
		|	ГрафикПоступленияТоваров.Склад = &Склад
		|	И ГрафикПоступленияТоваров.Регистратор <> &Регистратор

		|СГРУППИРОВАТЬ ПО
		|	ГрафикПоступленияТоваров.Номенклатура 
		|;
		|ВЫБРАТЬ
		|	ЗаказНаПеремещениеТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказНаПеремещениеТовары.Номенклатура.Наименование КАК Наименование,
		|	ЗаказНаПеремещениеТовары.НачалоОтгрузки КАК НачалоОтгрузки,
		|	ЗаказНаПеремещениеТовары.ОкончаниеПоступления КАК ОкончаниеПоступления,
		|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНаПеремещениеТовары.Упаковка КАК Упаковка,
		|	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
		|	ЗаказНаПеремещениеТовары.Отменено КАК Отменено,
		|	ЗаказНаПеремещениеТовары.КодСтроки КАК КодСтроки,
		|	ЗаказНаПеремещениеТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ЗаказНаПеремещениеТовары.Назначение КАК Назначение,
		|	ЗаказНаПеремещениеТовары.Серия КАК Серия,
		|	ЗаказНаПеремещениеТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ЗаказНаПеремещениеТовары.РекомендуемыйОстаток_Розница КАК РекомендуемыйОстаток_Розница,
		|	МАКСИМУМ(ЗаказНаПеремещениеТовары.Доступно) КАК Доступно,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена_Ном,
		|	ЗаказНаПеремещениеТовары.Количество КАК Количество,
		|	ЗаказНаПеремещениеТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказНаПеремещениеТовары.Родитель КАК Родитель,
		|	ЗаказНаПеремещениеТовары.КолВоГрузовыхМест КАК КолВоГрузовыхМест,
		|	МАКСИМУМ(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0)) КАК Остаток_Розница,
		|	СУММА(ЕСТЬNULL(ВыручкаИСебестоимостьПродажОбороты.КоличествоОборот, 0)+ЕСТЬNULL(ТАБВБ.Количество,0)) КАК ПродажиЗаПериод,
		//|	СУММА(ЕСТЬNULL(ТоварыКОтгрузкеОстатки.ВРезервеОстаток, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток, 0)) - СУММА(-(ЕСТЬNULL(ТоварыКОтгрузкеОстаткиВозврат.ВРезервеОстаток, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстаткиВозврат.КОтгрузкеОстаток, 0))) КАК Резерв_Розница
		|   СУММА(ЕСТЬNULL(ТАБПОСТУПЛЕНИЯ.КоличествоИзЗаказов,0)) - СУММА(-(ЕСТЬNULL(ТоварыКОтгрузкеОстаткиВозврат.ВРезервеОстаток, 0) + ЕСТЬNULL(ТоварыКОтгрузкеОстаткиВозврат.КОтгрузкеОстаток, 0))) КАК Резерв_Розница
		|ИЗ
		|	ВТ_ТЗ_ТОВАРЫ КАК ЗаказНаПеремещениеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СвободныеОстатки.Остатки(&ДатаДок, ) КАК СвободныеОстатки
		|		ПО (СвободныеОстатки.Номенклатура = ЗаказНаПеремещениеТовары.Номенклатура)
		|			И (СвободныеОстатки.Склад = &Склад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж.Обороты(&ДатаНач, &ДатаОкон, , ) КАК ВыручкаИСебестоимостьПродажОбороты
		|		ПО (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Номенклатура = ЗаказНаПеремещениеТовары.Номенклатура)
		|			И (ВыручкаИСебестоимостьПродажОбороты.АналитикаУчетаНоменклатуры.Склад = &Склад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(&ДатаДок, ) КАК ТоварыКОтгрузкеОстатки
		|		ПО (ТоварыКОтгрузкеОстатки.Номенклатура = ЗаказНаПеремещениеТовары.Номенклатура)
		|			И (ТоварыКОтгрузкеОстатки.Получатель = &Склад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки КАК ТоварыКОтгрузкеОстаткиВозврат
		|		ПО (ТоварыКОтгрузкеОстатки.Номенклатура = ЗаказНаПеремещениеТовары.Номенклатура)
		|			И (ТоварыКОтгрузкеОстатки.Склад = &Склад)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаДок, ВидЦены = &ВидЦены) КАК ЦеныНоменклатуры
		|		ПО (ЗаказНаПеремещениеТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ 	ТАБПОСТУПЛЕНИЯ КАК ТАБПОСТУПЛЕНИЯ
		|			ПО (ЗаказНаПеремещениеТовары.Номенклатура = ТАБПОСТУПЛЕНИЯ.Номенклатура)
	    |		ЛЕВОЕ СОЕДИНЕНИЕ ТАБВБ КАК ТАБВБ
		|			ПО (ЗаказНаПеремещениеТовары.Номенклатура = ТАБВБ.Номенклатура) 
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаПеремещениеТовары.НомерСтроки, 
		|	ЗаказНаПеремещениеТовары.Номенклатура.Наименование,
		|	ЗаказНаПеремещениеТовары.НачалоОтгрузки,
		|	ЗаказНаПеремещениеТовары.ОкончаниеПоступления,
		|	ЗаказНаПеремещениеТовары.Номенклатура,
		|	ЗаказНаПеремещениеТовары.Упаковка,
		|	ЗаказНаПеремещениеТовары.Характеристика,
		|	ЗаказНаПеремещениеТовары.Отменено,
		|	ЗаказНаПеремещениеТовары.КодСтроки,
		|	ЗаказНаПеремещениеТовары.ВариантОбеспечения,
		|	ЗаказНаПеремещениеТовары.Назначение,
		|	ЗаказНаПеремещениеТовары.Серия,
		|	ЗаказНаПеремещениеТовары.СтатусУказанияСерий,
		|	ЗаказНаПеремещениеТовары.РекомендуемыйОстаток_Розница,
		|	ЗаказНаПеремещениеТовары.Количество,
		|	ЗаказНаПеремещениеТовары.КоличествоУпаковок,
		|	ЗаказНаПеремещениеТовары.Родитель,
		|	ЗаказНаПеремещениеТовары.КолВоГрузовыхМест,
		|	ЗаказНаПеремещениеТовары.ПродажиЗаПериод,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|УПОРЯДОЧИТЬ ПО 
		|	ЗаказНаПеремещениеТовары.НомерСтроки
		|";
	
	Запрос.Текст = ТекстЗапроса;
	    
	Запрос.УстановитьПараметр("Регистратор",ОбъектСсылка);      
	
	ПартнерИМ = Справочники.Партнеры.НайтиПоКоду("00-00022133");
	Запрос.УстановитьПараметр("ПартнерИМ",ПартнерИМ);
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаДок - 86400 * 8));
	Запрос.УстановитьПараметр("ДатаОкон", КонецДня(ДатаДок - 86400 * 1));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Запрос.УстановитьПараметр("ДатаОтгрузки", ДатаОтгрузки);
	
	Запрос.УстановитьПараметр("ТЗ_Товары", ЗаказТовары);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	ТЧ_Товары = РезультатЗапроса;
	
КонецПроцедуры
 
///////////


///РегЦены. Если рег.цена и установлена на серию выбираем её, если нет - то цену номенклатуры.
&НаСервере
Функция ПолучитьЦенуНаСервере_Розница(Номенклатура, Серия, Дата, ВидЦены = Неопределено) Экспорт

	Если ВидЦены = Неопределено Тогда
	
	
		Если Дата >= Дата("20221027") И Дата < Дата("20230111060000") 
			ИЛИ Дата >= Дата("20230403") Тогда
			
			
			ДатаНачалаРегулированияЦенГосударством = Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",Истина).ДатаНачалаРегулированияЦенГосударством;
			Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Розничных(Номенклатура,Дата) = Ложь Тогда
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныНоменклатурыСрезПоследних.Период,
				|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
				|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
				|	ЦеныНоменклатурыСрезПоследних.Валюта,
				|	ЦеныНоменклатурыСрезПоследних.Цена
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
				|ГДЕ
				|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
				|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
				
				Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",Истина));
				Запрос.УстановитьПараметр("НаДату", Дата);
				Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					НайденаяЦена = ВыборкаДетальныеЗаписи.Цена;
					Возврат (НайденаяЦена);
				КонецЦикла;
				
				Сообщить("На номенклатуру " + Номенклатура + " не установлена розничная цена!");
				Возврат 0;
				
			Иначе
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор КАК Регистратор,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
				|ГДЕ
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена <> 0
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены";
				
				Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
				Запрос.УстановитьПараметр("Серия", Серия);
				Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные"));
				Запрос.УстановитьПараметр("Период", Дата);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Цена = 0;
				
				Если РезультатЗапроса.Пустой() Тогда
					Цена = 0;
				КонецЕсли; 
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Цена = ВыборкаДетальныеЗаписи.Цена;
				КонецЦикла;
				
				Если Цена = 0 Тогда	
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЦеныНоменклатурыСрезПоследних.Период,
					|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
					|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
					|	ЦеныНоменклатурыСрезПоследних.Валюта,
					|	ЦеныНоменклатурыСрезПоследних.Цена
					|ИЗ
					|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
					|ГДЕ
					|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
					|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
					
					Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",Истина));
					Запрос.УстановитьПараметр("НаДату", Дата);
					Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						НайденаяЦена = ВыборкаДетальныеЗаписи.Цена;
						Возврат НайденаяЦена;
					КонецЦикла;				
					
				КонецЕсли; 
				
				Возврат Цена;
				
			КонецЕсли; 
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныНоменклатурыСрезПоследних.Период,
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
			|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
			|	ЦеныНоменклатурыСрезПоследних.Валюта,
			|	ЦеныНоменклатурыСрезПоследних.Цена
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
			|ГДЕ
			|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
			|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
			
			Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",Истина));
			Запрос.УстановитьПараметр("НаДату", Дата);
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НайденаяЦена = ВыборкаДетальныеЗаписи.Цена;
				Возврат (НайденаяЦена);
			КонецЦикла;
			
			Сообщить("На номенклатуру " + Номенклатура + " не установлена розничная цена!");
			Возврат 0;
			
		КонецЕсли;  
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Период,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
		|	ЦеныНоменклатурыСрезПоследних.Валюта,
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
		|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
		Запрос.УстановитьПараметр("НаДату", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НайденаяЦена = ВыборкаДетальныеЗаписи.Цена;
			Возврат НайденаяЦена;
		КонецЦикла;				

		Сообщить("На номенклатуру " + Номенклатура + " не установлена розничная цена!");
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

Процедура ПолучитьЦенуИУстановкуЦен_Розница(Номенклатура,Серия, Дата,НомерУстановкаЦен,ЕдИзмТовара, Цена)   Экспорт

	   Цена = 0;
	   ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",Истина);
	   
	   
	   Если Дата >= Дата("20221027") и Дата < Дата("20230111") 
		   ИЛИ Дата >= Дата("20230403") Тогда
		   
		   
		   Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Розничных(Номенклатура,Дата) = Ложь Тогда
			   
			   Запрос = Новый Запрос;
			   Запрос.Текст = 
			   "ВЫБРАТЬ
			   |	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
			   |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
			   |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
			   |	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
			   |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
			   |	ЦеныНоменклатурыСрезПоследних.Регистратор.Номер КАК РегистраторНомер,
			   |	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
			   |ИЗ
			   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
			   |ГДЕ
			   |	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
			   |	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
			   
			   
			   
			   Запрос.УстановитьПараметр("НаДату", Дата);
			   Запрос.УстановитьПараметр("Номенклатура", Номенклатура); // если поле на форме так называется       
			   Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
			   
			   
			   РезультатЗапроса = Запрос.Выполнить();
			   
			   Выборка = РезультатЗапроса.Выбрать();
			   Выборка.Следующий();
			   
			   Цена = Выборка.Цена;
			   
			   ЦенаТовараВременная = Выборка.Цена;		   
			   НомерУстЦен = Выборка.РегистраторНомер; 
			   ЕдИзмТовара = Выборка.Упаковка;	

		   Иначе
			   
			   
			   Запрос = Новый Запрос;
			   Запрос.Текст = 
			   "ВЫБРАТЬ
			   |	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
			   |	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор.Номер КАК РегистраторНомер,
			   |	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
			   |	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
			   |	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена,
			   |	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Упаковка КАК Упаковка
			   |ИЗ
			   |	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
			   |ГДЕ
			   |	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
			   |	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия
			   |	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена <> 0
			   |	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены";
			   
			   
			   Запрос.УстановитьПараметр("Серия", Серия);
			   Запрос.УстановитьПараметр("Период", Дата);
			   Запрос.УстановитьПараметр("Номенклатура", Номенклатура); // если поле на форме так называется       
			   Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
			   
			   
			   РезультатЗапроса = Запрос.Выполнить();
			   
			   ЦенаТовараВременная = 0;
			   
			   Если РезультатЗапроса.Пустой() Тогда
				   Цена = 0;
			   Иначе
				   Выборка = РезультатЗапроса.Выбрать();
				   Выборка.Следующий();
				   
				   Цена = Выборка.Цена;
				   
				   ЦенаТовараВременная = Выборка.Цена;		   
			   	   НомерУстЦен = Выборка.РегистраторНомер; 
			   	   ЕдИзмТовара = Выборка.Упаковка;	

			   КонецЕсли; 
			   
			   
			   Если Цена = 0 Тогда
				   
				   Запрос = Новый Запрос;
				   Запрос.Текст = 
				   "ВЫБРАТЬ
				   |	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
				   |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
				   |	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
				   |	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта,
				   |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
				   |	ЦеныНоменклатурыСрезПоследних.Регистратор.Номер КАК РегистраторНомер,
				   |	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка
				   |ИЗ
				   |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
				   |ГДЕ
				   |	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
				   |	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
				   
				   
				   
				   Запрос.УстановитьПараметр("НаДату", Дата);
				   Запрос.УстановитьПараметр("Номенклатура", Номенклатура); // если поле на форме так называется       
				   Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
				   
				   
				   РезультатЗапроса = Запрос.Выполнить();
				   
				   Выборка = РезультатЗапроса.Выбрать();
				   Выборка.Следующий();
				   
				   Цена = Выборка.Цена;
				   	ЦенаТовараВременная = Выборка.Цена;		   
			   		НомерУстЦен = Выборка.РегистраторНомер; 
			   		ЕдИзмТовара = Выборка.Упаковка;	

				   
			   КонецЕсли;  
			   
		   КонецЕсли;
		   
	   Иначе
		   
		   Запрос = Новый Запрос;
		   Запрос.Текст = 
		   "ВЫБРАТЬ
		   |    ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		   |    ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
		   |    ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		   |    ЦеныНоменклатурыСрезПоследних.Регистратор.Номер КАК РегистраторНомер
		   |ИЗ
		   |    РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
		   |ГДЕ
		   |    ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены"; 
		   
		   Запрос.УстановитьПараметр("Период", Дата);
		   Запрос.УстановитьПараметр("Номенклатура", Номенклатура); // если поле на форме так называется       
		   Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
		   
		   
		   Выборка = Запрос.Выполнить().Выбрать();
		   Выборка.Следующий();
		   
		   НомерУстЦен = "";
		   НомерУстЦен = Выборка.РегистраторНомер;       
		   //УстЦен = УбратьЛидирующиеНули(НомерУстЦен);
		   
		   ЦенаТовараВременная = Выборка.Цена;
		   		
		   ЕдИзмТовара = Выборка.Упаковка;	
		   
	   КонецЕсли;

	   Цена    =  ЦенаТовараВременная;
	   НомерУстановкаЦен  = НомерУстЦен;
	   ЕдИзмТовара = ЕдИзмТовара; 
	               
КонецПроцедуры


Функция ПолучитьЦену_Опт(Номенклатура,Серия,Дата) Экспорт
	
	ЦеныРегулируются = ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(Номенклатура,Дата);
	
	ЦенаОптовая = 0;
	Если ЦеныРегулируются = ИСТИНА Тогда
		Если Серия = Справочники.СерииНоменклатуры.ПустаяСсылка() Тогда
		    Сообщить("Необходимо указать серию. "+Номенклатура+" цены регулируются государством");
			Возврат 0;
		
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор КАК Регистратор,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены КАК ВидЦены,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Характеристика КАК Характеристика,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ЦенаИзготовителя КАК ЦенаИзготовителя,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ЦенаИмпортера КАК ЦенаИмпортера,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Себестоимость КАК Себестоимость,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Упаковка КАК Упаковка,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Валюта КАК Валюта
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Дата, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
			|ГДЕ
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
			|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены
			|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия";
		
		Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые"));
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Серия", Серия);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЦенаОптовая = ВыборкаДетальныеЗаписи.Цена;
		КонецЦикла;
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
			|	ЦеныНоменклатурыСрезПоследних.Регистратор КАК Регистратор,
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
			|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
			|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
			|	ЦеныНоменклатурыСрезПоследних.Упаковка КАК Упаковка,
			|	ЦеныНоменклатурыСрезПоследних.Валюта КАК Валюта
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ) КАК ЦеныНоменклатурыСрезПоследних
			|ГДЕ
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
			|	И ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены";
		
		Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые"));
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЦенаОптовая = ВыборкаДетальныеЗаписи.Цена;
		КонецЦикла;
	
	КонецЕсли; 	

	Возврат ЦенаОптовая;
	
КонецФункции // ()


Процедура BKP_ЗаполнитьЛимитыПоСкладамПоДнямНедели() Экспорт
	Склад3 = Справочники.Склады.Склад3;
	Склад5 = Справочники.Склады.Склад5; 
	Склад3опт = Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА);
	
	СкладыСписок = Новый СписокЗначений;
	СкладыСписок.Добавить(Склад3);
	СкладыСписок.Добавить(Склад5); 
	СкладыСписок.Добавить(Склад3опт);
		
	стрДень = 0;
	КолВоДней = 30;
	Для стрДень=1 По КолВоДней Цикл
		Для каждого стр Из СкладыСписок Цикл
			
			Период = ТекущаяДата()+ 86400 * стрДень;

			ЛимитСтрокОпт = 0;
			ЛимитСтрокРозница = 0;

			склад = стр.Значение;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЛимитыСборкиСклада.Период КАК Период,
			|	ЛимитыСборкиСклада.Склад КАК Склад,
			|	ЛимитыСборкиСклада.ЛимитСтрокВсего КАК ЛимитСтрокВсего,
			|	ЛимитыСборкиСклада.ЛимитСтрокОпт КАК ЛимитСтрокОпт,
			|	ЛимитыСборкиСклада.ЛимитСтрокРозница КАК ЛимитСтрокРозница
			|ИЗ
			|	РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
			|ГДЕ
			|	ЛимитыСборкиСклада.Склад = &Склад
			|	И ЛимитыСборкиСклада.Период = &Период";
			
			Запрос.УстановитьПараметр("Период", Период);
			Запрос.УстановитьПараметр("Склад", склад);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				
				НаборЗаписейЛимитыПоДнямНедели = РегистрыСведений.ЛимитыЗагрузкиСкладаПоДнямНедели.СоздатьНаборЗаписей();
				НаборЗаписейЛимитыПоДнямНедели.Отбор.Склад.Установить(склад);
				НаборЗаписейЛимитыПоДнямНедели.Прочитать();
				
				Если НаборЗаписейЛимитыПоДнямНедели.Количество() > 0 Тогда
					
					Для каждого Запись Из НаборЗаписейЛимитыПоДнямНедели Цикл
						Если ДеньНедели(Период) = 1 Тогда
							ЛимитСтрокРозница = Запись.ПонедельникРозница;
							ЛимитСтрокОпт = Запись.ПонедельникОпт;
						ИначеЕсли ДеньНедели(Период) = 2 Тогда
							ЛимитСтрокРозница = Запись.ВторникРозница;
							ЛимитСтрокОпт = Запись.ВторникОпт;
						ИначеЕсли ДеньНедели(Период) = 3 Тогда
							ЛимитСтрокРозница = Запись.СредаРозница;
							ЛимитСтрокОпт = Запись.СредаОпт;
						ИначеЕсли ДеньНедели(Период) = 4 Тогда
							ЛимитСтрокРозница = Запись.ЧетвергРозница;
							ЛимитСтрокОпт = Запись.ЧетвергОпт;
						ИначеЕсли ДеньНедели(Период) = 5 Тогда
							ЛимитСтрокРозница = Запись.ПятницаРозница;
							ЛимитСтрокОпт = Запись.ПятницаОпт;
						ИначеЕсли ДеньНедели(Период) = 6 Тогда
							ЛимитСтрокРозница = Запись.СубботаРозница;
							ЛимитСтрокОпт = Запись.СубботаОпт;
						ИначеЕсли ДеньНедели(Период) = 7 Тогда
							ЛимитСтрокРозница = Запись.ВоскресениеРозница;
							ЛимитСтрокОпт = Запись.ВоскресениеОпт;
						КонецЕсли;
					КонецЦикла; 
				КонецЕсли;
				
				//Если ЛимитСтрокРозница <> 0 И ЛимитСтрокОпт <> 0 Тогда
					МенеджерЗаписи = РегистрыСведений.ЛимитыСборкиСклада.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.ЛимитСтрокОпт = ЛимитСтрокОпт; 
					МенеджерЗаписи.ЛимитСтрокРозница = ЛимитСтрокРозница;
					МенеджерЗаписи.ЛимитСтрокВсего = ЛимитСтрокОпт + ЛимитСтрокРозница; 
					МенеджерЗаписи.Период = Период;
					МенеджерЗаписи.Склад = склад;  
					МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
					
					//СтрокЗапланировано = 0;
					//СтрокЗапланировано = ОбщийМодуль77w.ПолучитьКолВоЗапланированныхСтрокВЭкв(Период,склад);
					//
					//Если МенеджерЗаписи.ЛимитСтрокВсего < СтрокЗапланировано Тогда		
					//	Сообщить("Нельзя устанавливать лимиты меньше запланированного количества." + Период +" " + склад+ " - данные не изменены.");		
					//	Продолжить;
					//КонецЕсли;

					
					МенеджерЗаписи.Записать(ИСТИНА);
				//КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
	
	///jadmin следующая операция регламентного задания
	ЗаполнитьГрафикДоставкиПоДнямНедели();
	///
	
КонецПроцедуры

Процедура ЗаполнитьЛимитыПоСкладамПоДнямНедели() Экспорт
	//Склад3 = Справочники.Склады.Склад3;
	//Склад5 = Справочники.Склады.Склад5; 
	//Склад3опт = Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА);

	//
	//СкладыСписок = Новый СписокЗначений;
	//СкладыСписок.Добавить(Склад3);
	//СкладыСписок.Добавить(Склад5);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.Склад КАК Склад,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ГруппаТовара КАК ГруппаТовара,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ПонедельникОпт КАК ПонедельникОпт,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ВторникОпт КАК ВторникОпт,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.СредаОпт КАК СредаОпт,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ЧетвергОпт КАК ЧетвергОпт,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ПятницаОпт КАК ПятницаОпт,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.СубботаОпт КАК СубботаОпт,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ВоскресениеОпт КАК ВоскресениеОпт,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ПонедельникРозница КАК ПонедельникРозница,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ВторникРозница КАК ВторникРозница,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.СредаРозница КАК СредаРозница,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ЧетвергРозница КАК ЧетвергРозница,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ПятницаРозница КАК ПятницаРозница,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.СубботаРозница КАК СубботаРозница,
		|	ЛимитыЗагрузкиСкладаПоДнямНедели.ВоскресениеРозница КАК ВоскресениеРозница
		|ИЗ
		|	РегистрСведений.ЛимитыЗагрузкиСкладаПоДнямНедели КАК ЛимитыЗагрузкиСкладаПоДнямНедели";
	
	РезультатЗапросаДниНедели = Запрос.Выполнить().Выгрузить();

	
	
	





	стрДень = 0;
	КолВоДней = 30;
	Для стрДень=1 По КолВоДней Цикл
		//Для каждого стр Из СкладыСписок Цикл
		//	
			Период = ТекущаяДата()+ 86400 * стрДень;

		//	ЛимитСтрокОпт = 0;
		//	ЛимитСтрокРозница = 0;

		//	склад = стр.Значение;
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ЛимитыСборкиСклада.Период КАК Период,
		//	|	ЛимитыСборкиСклада.Склад КАК Склад,
		//	|	ЛимитыСборкиСклада.ЛимитСтрокВсего КАК ЛимитСтрокВсего,
		//	|	ЛимитыСборкиСклада.ЛимитСтрокОпт КАК ЛимитСтрокОпт,
		//	|	ЛимитыСборкиСклада.ЛимитСтрокРозница КАК ЛимитСтрокРозница,
		//	|	ЛимитыСборкиСклада.ГруппаТовара КАК ГруппаТовара
		//	|ИЗ
		//	|	РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
		//	|ГДЕ
		//	|	ЛимитыСборкиСклада.Склад = &Склад
		//	|	И ЛимитыСборкиСклада.Период = &Период
		//	|	И ЛимитыСборкиСклада.ГруппаТовара = &ГруппаТовара";
		//	
		//	Запрос.УстановитьПараметр("Период", Период);
		//	Запрос.УстановитьПараметр("Склад", склад);
		//	Запрос.УстановитьПараметр("ГруппаТовара", Справочники.Номенклатура.ПустаяСсылка());
		//	
		//	РезультатЗапроса = Запрос.Выполнить();
		//	
		//	Если РезультатЗапроса.Пустой() Тогда
		//		
		//		НаборЗаписейЛимитыПоДнямНедели = РегистрыСведений.ЛимитыЗагрузкиСкладаПоДнямНедели.СоздатьНаборЗаписей();
		//		НаборЗаписейЛимитыПоДнямНедели.Отбор.Склад.Установить(склад); 
		//		//НаборЗаписейЛимитыПоДнямНедели.Отбор.Склад.Установить(ГруппаТовара);
		//		НаборЗаписейЛимитыПоДнямНедели.Прочитать();
		//		
		//		Если НаборЗаписейЛимитыПоДнямНедели.Количество() > 0 Тогда
		//			
		
					Для каждого Запись Из РезультатЗапросаДниНедели Цикл
						Если ДеньНедели(Период) = 1 Тогда
							ЛимитСтрокРозница = Запись.ПонедельникРозница;
							ЛимитСтрокОпт = Запись.ПонедельникОпт;
						ИначеЕсли ДеньНедели(Период) = 2 Тогда
							ЛимитСтрокРозница = Запись.ВторникРозница;
							ЛимитСтрокОпт = Запись.ВторникОпт;
						ИначеЕсли ДеньНедели(Период) = 3 Тогда
							ЛимитСтрокРозница = Запись.СредаРозница;
							ЛимитСтрокОпт = Запись.СредаОпт;
						ИначеЕсли ДеньНедели(Период) = 4 Тогда
							ЛимитСтрокРозница = Запись.ЧетвергРозница;
							ЛимитСтрокОпт = Запись.ЧетвергОпт;
						ИначеЕсли ДеньНедели(Период) = 5 Тогда
							ЛимитСтрокРозница = Запись.ПятницаРозница;
							ЛимитСтрокОпт = Запись.ПятницаОпт;
						ИначеЕсли ДеньНедели(Период) = 6 Тогда
							ЛимитСтрокРозница = Запись.СубботаРозница;
							ЛимитСтрокОпт = Запись.СубботаОпт;
						ИначеЕсли ДеньНедели(Период) = 7 Тогда
							ЛимитСтрокРозница = Запись.ВоскресениеРозница;
							ЛимитСтрокОпт = Запись.ВоскресениеОпт;
						КонецЕсли;
					 
				//КонецЕсли;
				
				//Если ЛимитСтрокРозница <> 0 И ЛимитСтрокОпт <> 0 Тогда
					МенеджерЗаписи = РегистрыСведений.ЛимитыСборкиСклада.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.ЛимитСтрокОпт = ЛимитСтрокОпт; 
					МенеджерЗаписи.ЛимитСтрокРозница = ЛимитСтрокРозница;
					МенеджерЗаписи.ЛимитСтрокВсего = ЛимитСтрокОпт + ЛимитСтрокРозница; 
					МенеджерЗаписи.Период = Период;
					МенеджерЗаписи.Склад = Запись.Склад;  
					МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь; 
					МенеджерЗаписи.ГруппаТовара = Запись.ГруппаТовара;
					
					//СтрокЗапланировано = 0;
					//СтрокЗапланировано = ОбщийМодуль77w.ПолучитьКолВоЗапланированныхСтрокВЭкв(Период,склад);
					//
					//Если МенеджерЗаписи.ЛимитСтрокВсего < СтрокЗапланировано Тогда		
					//	Сообщить("Нельзя устанавливать лимиты меньше запланированного количества." + Период +" " + склад+ " - данные не изменены.");		
					//	Продолжить;
					//КонецЕсли;

					
					МенеджерЗаписи.Записать(ИСТИНА);    
					
					КонецЦикла;
				//КонецЕсли; 
			//КонецЕсли;
		КонецЦикла;
	//КонецЦикла; 
	
	
	
	///jadmin следующая операция регламентного задания
	ЗаполнитьГрафикДоставкиПоДнямНедели();
	///
	
КонецПроцедуры


///вызывается в ЗаполнитьЛимитыПоСкладамПоДнямНедели
Процедура ЗаполнитьГрафикДоставкиПоДнямНедели() Экспорт
		
	стрДень = 0;
	КолВоДней = 14;
	Для стрДень=1 По КолВоДней Цикл
		
		Период = НачалоДня(ТекущаяДата())+ 86400 * стрДень;
		
		НаборЗаписей = РегистрыСведений.ГрафикДоставкиТоваровПоКалендарю.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Период);
		НаборЗаписей.Записать();
		//			
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ГрафикДоставкиТоваровПоКалендарюСрезПоследних.Период КАК Период,
		//|	ГрафикДоставкиТоваровПоКалендарюСрезПоследних.Склад КАК Склад
		//|ИЗ
		//|	РегистрСведений.ГрафикДоставкиТоваровПоКалендарю.СрезПоследних(, ) КАК ГрафикДоставкиТоваровПоКалендарюСрезПоследних
		//|ГДЕ
		//|	ГрафикДоставкиТоваровПоКалендарюСрезПоследних.Период = &Период
		//|	И ГрафикДоставкиТоваровПоКалендарюСрезПоследних.Склад = &Склад";
		//
		//Запрос.УстановитьПараметр("Период", Период);
		//Запрос.УстановитьПараметр("Склад", Склад);
		//
		//РезультатЗапроса = Запрос.Выполнить();
		//
		//Если РезультатЗапроса.Пустой() Тогда
		
		НаборЗаписейГрафикДоставки = РегистрыСведений.ГрафикДоставкиТоваров.СоздатьНаборЗаписей();
		//НаборЗаписейГрафикДоставки.Отбор.Склад.Установить(Склад);
		НаборЗаписейГрафикДоставки.Прочитать();
		
		Если НаборЗаписейГрафикДоставки.Количество() > 0 Тогда
			
			Для каждого Запись Из НаборЗаписейГрафикДоставки Цикл
					
				Если (ДеньНедели(Период) = 1 И Запись.Понедельник = ИСТИНА) 
					ИЛИ (ДеньНедели(Период) = 2 И Запись.Вторник = ИСТИНА)
					ИЛИ (ДеньНедели(Период) = 3 И Запись.Среда = ИСТИНА)
					ИЛИ (ДеньНедели(Период) = 4 И Запись.Четверг = ИСТИНА)
					ИЛИ (ДеньНедели(Период) = 5 И Запись.Пятница = ИСТИНА)
					ИЛИ (ДеньНедели(Период) = 6 И Запись.Суббота = ИСТИНА)
					ИЛИ (ДеньНедели(Период) = 7 И Запись.Воскресение = ИСТИНА) Тогда	
					
					МенеджерЗаписи = РегистрыСведений.ГрафикДоставкиТоваровПоКалендарю.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Склад = Запись.Склад; 
					МенеджерЗаписи.Период = Период;
					МенеджерЗаписи.Записать(ИСТИНА);
				КонецЕсли;			
			КонецЦикла; 
			//	КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры
 

Функция ПолучитьКолВоЗапланированныхСтрокВЭкв(Период,Склад) Экспорт
    КолВоСтрокЭкв = 0;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	
		 "ВЫБРАТЬ
		 |	ЗаказКлиентаТовары.КоличествоСтрокВЭквиваленте КАК КолВоСтрок,
		 |	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
		 |	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		 |			КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		 |				ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
		 |			ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
		 |		КОНЕЦ) КАК ДатаОтгрузки,
		 |	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки, ДЕНЬ)) КАК ДатаОтг
		 |ПОМЕСТИТЬ ТАБСВОДНАЯ
		 |ИЗ
		 |	Документ.ЗаказКлиента КАК ЗаказКлиентаТовары
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		 |		ПО ЗаказКлиентаТовары.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
		 |ГДЕ
		 |	ЗаказКлиентаТовары.Ссылка.Проведен = ИСТИНА
		 |	И ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		 |				КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		 |					ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
		 |				ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
		 |			КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
		 |	И ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ЗаказНаПеремещениеТовары.КоличествоСтрокВЭквиваленте,
		 |	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
		 |	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		 |			КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		 |				ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
		 |			ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
		 |		КОНЕЦ),
		 |	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ))
		 |ИЗ
		 |	Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещениеТовары
		 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		 |		ПО ЗаказНаПеремещениеТовары.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
		 |ГДЕ
		 |	ЗаказНаПеремещениеТовары.Ссылка.Проведен = ИСТИНА
		 |	И ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		 |				КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		 |					ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
		 |				ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
		 |			КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
		 |	И ЗаказНаПеремещениеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению)
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	СУММА(ТАБСВОДНАЯ.КолВоСтрок) КАК КолВоСтрокЭквивалент,
		 |	ТАБСВОДНАЯ.Склад КАК Склад,
		 |	ТАБСВОДНАЯ.ДатаОтгрузки КАК ДатаОтгрузки
		 |ИЗ
		 |	ТАБСВОДНАЯ КАК ТАБСВОДНАЯ
		 |ГДЕ
		 |	ТАБСВОДНАЯ.Склад = &Склад
		 |
		 |СГРУППИРОВАТЬ ПО
		 |	ТАБСВОДНАЯ.Склад,
		 |	ТАБСВОДНАЯ.ДатаОтгрузки";
	
		//"ВЫБРАТЬ
		//|	1 КАК КолВоСтрок,
		//|	1 КАК КолВоСтрокОпт,
		//|	0 КАК КолВоСтрокРозница,
		//|	1 КАК ЗапланированоОпт,
		//|	0 КАК ЗапланированоРозница,
		//|	1 КАК ЗапланированоИтого,
		//|	0 КАК ОсталосьСобратьОпт,
		//|	0 КАК ОсталосьСобратьРозница,
		//|	0 КАК ОсталосьСобратьИтого,
		//|	0 КАК СобраноОпт,
		//|	0 КАК СобраноРозница,
		//|	0 КАК СобраноИтого,
		//|	ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
		//|	ЗаказКлиентаТовары.Ссылка КАК Регистратор,
		//|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		//|			КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
		//|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
		//|		КОНЕЦ) КАК ДатаОтгрузки,
		//|	""Запланировано"" КАК Заказы,
		//|	ЗаказКлиентаТовары.Ссылка.Партнер КАК Клиент,
		//|	ЗаказКлиентаТовары.Ссылка.ВремяГотовности КАК ВремяГотовности,
		//|	NULL КАК ОрдерСсылка,
		//|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки, ДЕНЬ)) КАК ДатаОтг,
		//|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		//|	ВЫБОР
		//|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
		//|			ТОГДА NULL
		//|		ИНАЧЕ ЗаказКлиентаТовары.Серия
		//|	КОНЕЦ КАК Серия
		//|ПОМЕСТИТЬ ТАБСВОДНАЯ
		//|ИЗ
		//|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		//|		ПО ЗаказКлиентаТовары.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
		//|ГДЕ
		//|	ЗаказКлиентаТовары.Ссылка.Проведен = ИСТИНА
		//|	И ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		//|				КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		//|					ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
		//|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
		//|			КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
		//|	И ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЗаказКлиентаТовары.Ссылка.Склад,
		//|	ЗаказКлиентаТовары.Ссылка,
		//|	ЗаказКлиентаТовары.Ссылка.Партнер,
		//|	ЗаказКлиентаТовары.Ссылка.ВремяГотовности,
		//|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		//|			КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
		//|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
		//|		КОНЕЦ),
		//|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки, ДЕНЬ)),
		//|	ЗаказКлиентаТовары.Номенклатура,
		//|	ВЫБОР
		//|		КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
		//|			ТОГДА NULL
		//|		ИНАЧЕ ЗаказКлиентаТовары.Серия
		//|	КОНЕЦ
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	1,
		//|	0,
		//|	1,
		//|	0,
		//|	1,
		//|	1,
		//|	0,
		//|	0,
		//|	0,
		//|	0,
		//|	0,
		//|	0,
		//|	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
		//|	ЗаказНаПеремещениеТовары.Ссылка,
		//|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		//|			КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
		//|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
		//|		КОНЕЦ),
		//|	""Запланировано"",
		//|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
		//|	ЗаказНаПеремещениеТовары.Ссылка.ВремяГотовности,
		//|	NULL,
		//|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)),
		//|	ЗаказНаПеремещениеТовары.Номенклатура,
		//|	ВЫБОР
		//|		КОГДА ЗаказНаПеремещениеТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
		//|			ТОГДА NULL
		//|		ИНАЧЕ ЗаказНаПеремещениеТовары.Серия
		//|	КОНЕЦ
		//|ИЗ
		//|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		//|		ПО ЗаказНаПеремещениеТовары.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
		//|ГДЕ
		//|	ЗаказНаПеремещениеТовары.Ссылка.Проведен = ИСТИНА
		//|	И ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		//|				КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		//|					ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
		//|				ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
		//|			КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
		//|	И ЗаказНаПеремещениеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
		//|	ЗаказНаПеремещениеТовары.Ссылка,
		//|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
		//|	ЗаказНаПеремещениеТовары.Ссылка.ВремяГотовности,
		//|	ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
		//|			КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
		//|				ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
		//|			ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
		//|		КОНЕЦ),
		//|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)),
		//|	ЗаказНаПеремещениеТовары.Номенклатура,
		//|	ВЫБОР
		//|		КОГДА ЗаказНаПеремещениеТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
		//|			ТОГДА NULL
		//|		ИНАЧЕ ЗаказНаПеремещениеТовары.Серия
		//|	КОНЕЦ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.КолВоСтрок * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.КолВоСтрокОпт * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокОптЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.КолВоСтрокРозница * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокРозницаЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.ЗапланированоОпт * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ЗапланированоОптЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.ЗапланированоРозница * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ЗапланированоРозницаЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.ЗапланированоИтого * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ЗапланированоИтогоЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.ОсталосьСобратьОпт * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ОсталосьСобратьОптЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.ОсталосьСобратьРозница * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ОсталосьСобратьРозницаЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.ОсталосьСобратьИтого * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ОсталосьСобратьИтогоЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.СобраноОпт * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК СобраноОптЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.ОсталосьСобратьРозница * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК СобраноРозницаЭквивалент,
		//|	ВЫРАЗИТЬ(ТАБСВОДНАЯ.СобраноИтого * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК СобраноИтогоЭквивалент,
		//|	ТАБСВОДНАЯ.КолВоСтрок КАК КолВоСтрок,
		//|	ТАБСВОДНАЯ.КолВоСтрокОпт КАК КолВоСтрокОпт,
		//|	ТАБСВОДНАЯ.КолВоСтрокРозница КАК КолВоСтрокРозница,
		//|	ТАБСВОДНАЯ.ЗапланированоОпт КАК ЗапланированоОпт,
		//|	ТАБСВОДНАЯ.ЗапланированоРозница КАК ЗапланированоРозница,
		//|	ТАБСВОДНАЯ.ЗапланированоИтого КАК ЗапланированоИтого,
		//|	ТАБСВОДНАЯ.ОсталосьСобратьОпт КАК ОсталосьСобратьОпт,
		//|	ТАБСВОДНАЯ.ОсталосьСобратьРозница КАК ОсталосьСобратьРозница,
		//|	ТАБСВОДНАЯ.ОсталосьСобратьИтого КАК ОсталосьСобратьИтого,
		//|	ТАБСВОДНАЯ.СобраноОпт КАК СобраноОпт,
		//|	ТАБСВОДНАЯ.СобраноРозница КАК СобраноРозница,
		//|	ТАБСВОДНАЯ.СобраноИтого КАК СобраноИтого,
		//|	ТАБСВОДНАЯ.Склад КАК Склад,
		//|	ТАБСВОДНАЯ.Регистратор КАК Регистратор,
		//|	ТАБСВОДНАЯ.ДатаОтгрузки КАК ДатаОтгрузки,
		//|	ТАБСВОДНАЯ.Заказы КАК Заказы,
		//|	ТАБСВОДНАЯ.Клиент КАК Клиент,
		//|	ТАБСВОДНАЯ.ВремяГотовности КАК ВремяГотовности,
		//|	ТАБСВОДНАЯ.ОрдерСсылка КАК ОрдерСсылка,
		//|	ТАБСВОДНАЯ.ДатаОтг КАК ДатаОтг,
		//|	ТАБСВОДНАЯ.Номенклатура КАК Номенклатура,
		//|	ТАБСВОДНАЯ.Серия КАК Серия
		//|ИЗ
		//|	ТАБСВОДНАЯ КАК ТАБСВОДНАЯ
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
		//|		ПО (ТАБСВОДНАЯ.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		//|				ИЛИ ТАБСВОДНАЯ.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		//|				ИЛИ ТАБСВОДНАЯ.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		//|				ИЛИ ТАБСВОДНАЯ.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		//|				ИЛИ ТАБСВОДНАЯ.Номенклатура = РасценкиКладовщикиСрезПоследних.Номенклатура),
		//|	РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
		//|ГДЕ
		//|	РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
		//|	И ТАБСВОДНАЯ.Склад = &Склад";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Период));
	Запрос.УстановитьПараметр("ДатаОкон", КонецДня(Период));  
	//Если Склад = Справочники.Склады.Склад3 Тогда	
	//	Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  //    семена
	//ИначеЕсли Склад = Справочники.Склады.Склад5 Тогда
	//	Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  //);
	//КонецЕсли; 
	
	Запрос.УстановитьПараметр("Склад", Склад); 
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество()>0 Тогда
	
	КолВоСтрокЭкв = РезультатЗапроса.Итог("КолВоСтрокЭквивалент");	
	
	КонецЕсли;	
	 Возврат КолВоСтрокЭкв;

КонецФункции // ()
 
 

////ОБМЕН ЗАЯВКИ НА РАСХОДОВАНИЕ ДС
&НаСервере
Процедура ОбменНаРасходДС()  Экспорт
		    //////////////////////////////////////////////////////////////////////////////////////////////////
		СоединениеБУХ = ОбщийМодуль77w.ПодключитьБД_БУХ();
		
			
		Если ТипЗнч(СоединениеБУХ) <> Тип("Неопределено") Тогда
	        
	    Запрос = СоединениеБУХ.NewObject("Запрос");
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Обмен_ЗаявкиНаРасходДС.ПлатежноеПоручениеСсылка,
			|	Обмен_ЗаявкиНаРасходДС.Статус,
			|	Обмен_ЗаявкиНаРасходДС.СуммаПлатежа,
			|	Обмен_ЗаявкиНаРасходДС.ПометкаУдаления,
			|	Обмен_ЗаявкиНаРасходДС.ПризнакОбработано,
			|	Обмен_ЗаявкиНаРасходДС.ДатаПлатежа,
			|	Обмен_ЗаявкиНаРасходДС.УНП,
			|	Обмен_ЗаявкиНаРасходДС.UID_DOC			
			|ИЗ
			|	РегистрСведений.Обмен_ЗаявкиНаРасходДС КАК Обмен_ЗаявкиНаРасходДС
			|ГДЕ
			|	Обмен_ЗаявкиНаРасходДС.ПризнакОбработано = 0";
			
			
			//Запрос.УстановитьПараметр("UID_DOC_ЗаявкаНаРасходДС_УТ", СокрЛП(ЭтотОбъект.Ссылка.УникальныйИдентификатор()));
			
			РезультатЗапроса = Запрос.Выполнить();
	        
	        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	        
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
				
				UID_DOC = СокрЛП(ВыборкаДетальныеЗаписи.UID_DOC);
				
				Попытка
	                НовыйUID = Новый УникальныйИдентификатор(СокрЛП(ВыборкаДетальныеЗаписи.UID_DOC));
	                ДокументВвода_Объект = Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПолучитьСсылку(НовыйUID);
	            Исключение
	                ДокументВвода_Объект = Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка();
	            КонецПопытки; 

				Если ДокументВвода_Объект <> Документы.ЗаявкаНаРасходованиеДенежныхСредств.ПустаяСсылка() Тогда
				
					ДокументВвода_Объект = ДокументВвода_Объект.ПолучитьОбъект();
					
					
	        	    ИндексЗначения = СоединениеБУХ.Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Индекс(ВыборкаДетальныеЗаписи.Статус);
	            	ИмяЗначенияПеречисленияCOM = Метаданные.Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.ЗначенияПеречисления[ИндексЗначения].Имя;          
					
					
					Если ИмяЗначенияПеречисленияCOM = "НеСогласована" Тогда
						СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована;
					ИначеЕсли ИмяЗначенияПеречисленияCOM = "НаПодтверждение" Тогда
						СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НаПодтверждение;	
					ИначеЕсли ИмяЗначенияПеречисленияCOM = "НаСогласование" Тогда
						СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НаСогласование;
					ИначеЕсли ИмяЗначенияПеречисленияCOM = "Согласована" Тогда
						СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована;
					ИначеЕсли ИмяЗначенияПеречисленияCOM = "КОплате" Тогда
						СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
					ИначеЕсли ИмяЗначенияПеречисленияCOM = "Оплачена" Тогда
						СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
					ИначеЕсли ИмяЗначенияПеречисленияCOM = "Отклонена" Тогда
						СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена;
					КонецЕсли; 

					СтатусЗаявкиВДокументе = ДокументВвода_Объект.Статус;
					
					Если СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована Тогда
						Если СтатусЗаявкиВДокументе = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НаСогласование Тогда	 
							ДокументВвода_Объект.Статус = СтатусЗаявки;	 
							
							//стрИстория = ДокументВвода_Объект.ИсторияСменыСтатусов.Добавить();
							//стрИстория.Дата = ТекущаяДата();
							//стрИстория.Статус = СтатусЗаявки;

						КонецЕсли;	
					ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате Тогда
						ДокументВвода_Объект.Статус = СтатусЗаявки;
	
					ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена Тогда
						ДокументВвода_Объект.Статус = СтатусЗаявки;

						//стрИстория = ДокументВвода_Объект.ИсторияСменыСтатусов.Добавить();
						//стрИстория.Дата = ТекущаяДата();
						//стрИстория.Статус = СтатусЗаявки;
						
						ДокументВвода_Объект.Оплачено = Истина;
					ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена Тогда
						ДокументВвода_Объект.Статус = СтатусЗаявки;
					КонецЕсли;
					ДокументВвода_Объект.СтатусПриВходе = СтатусЗаявки;	
					ДокументВвода_Объект.СуммаДокумента = ВыборкаДетальныеЗаписи.СуммаПлатежа;

					
					//сравнение и загрузка ТЧ
					ТЗ_Общая = ДокументВвода_Объект.ИсторияСменыСтатусов.Выгрузить();
					
					Для каждого стр Из ТЗ_Общая Цикл
						стр.Дата = Строка(стр.Дата);
						стр.Статус = Строка(стр.Статус);
						стр.Заметка = Строка(стр.Заметка);
						
						Если стр.Заметка = "0" Тогда
							стр.Заметка = "";
						КонецЕсли;
						
						стр.Пользователь = Строка(стр.Пользователь);
					КонецЦикла; 
					
					ТЗ_COM = ВыборкаДетальныеЗаписи.ПлатежноеПоручениеСсылка.ИсторияСменыСтатусов.Выгрузить();   //БУХ
					
					ДокументВвода_Объект.НазначениеПлатежа = ВыборкаДетальныеЗаписи.ПлатежноеПоручениеСсылка.НазначениеПлатежа;
					
					Для каждого стрCOM Из ТЗ_COM Цикл
						
						СтатусВТЧ = Неопределено;
						
						стр_Новая = ТЗ_Общая.Добавить();
						стр_Новая.Дата = стрCOM.Дата;
						
						Если ТипЗнч(стрCOM.Статус) = Тип("COMОбъект") Тогда
							
							ИмяЗначенияПеречисленияCOMВТЧ = СоединениеБУХ.XMLстрока(стрCOM.Статус);
							
							Если ИмяЗначенияПеречисленияCOMВТЧ = "НеСогласована" Тогда
								СтатусВТЧ = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована;
							ИначеЕсли ИмяЗначенияПеречисленияCOMВТЧ = "НаПодтверждение" Тогда
								СтатусВТЧ = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НаПодтверждение;
							ИначеЕсли ИмяЗначенияПеречисленияCOMВТЧ = "НаСогласование" Тогда
								СтатусВТЧ = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НаСогласование;
							ИначеЕсли ИмяЗначенияПеречисленияCOMВТЧ = "Согласована" Тогда
								СтатусВТЧ = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована;
							ИначеЕсли ИмяЗначенияПеречисленияCOMВТЧ = "КОплате" Тогда
								СтатусВТЧ = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате;
							ИначеЕсли ИмяЗначенияПеречисленияCOMВТЧ = "Отклонена" Тогда
								СтатусВТЧ = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена;
							ИначеЕсли ИмяЗначенияПеречисленияCOMВТЧ = "Оплачена" Тогда
								СтатусВТЧ = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Оплачена;
							КонецЕсли; 
							
							стр_Новая.Статус = "" + СтатусВТЧ;	
						Иначе
							стр_Новая.Статус = стрCOM.Статус;
						КонецЕсли;
						
						Если стрCOM.Заметка = "0" Тогда
							стрCOM.Заметка = "";
						КонецЕсли;
						
						
						Если ЗначениеЗаполнено(стрCOM.Заметка) Тогда
							стр_Новая.Заметка = стрCOM.Заметка;
						Иначе	
						    стр_Новая.Заметка = "";
						КонецЕсли; 
								
						Если ТипЗнч(стрCOM.Пользователь) = Тип("COMОбъект") Тогда
							стр_Новая.Пользователь = стрCOM.Пользователь.Description;
						Иначе
							стр_Новая.Пользователь = "" + стрCOM.Пользователь;
						КонецЕсли;
						
					КонецЦикла;
					
					ТЗ_Общая.Свернуть("Дата,Статус,Пользователь,Заметка");
					ТЗ_Общая.Сортировать("Дата");
					
					ДокументВвода_Объект.ИсторияСменыСтатусов.Загрузить(ТЗ_Общая);
					
					////

					
					ДокументВвода_Объект.ДатаПлатежногоПорученияБух = ВыборкаДетальныеЗаписи.ДатаПлатежа;
					
					СтатусВРегистр = ДокументВвода_Объект.Статус;
					
					ДокументВвода_Объект.Записать(РежимЗаписиДокумента.Запись);
					
					Если ВыборкаДетальныеЗаписи.ПометкаУдаления = 1 Тогда
						Если ДокументВвода_Объект.Проведен = ИСТИНА Тогда				        
							ДокументВвода_Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);				                
						КонецЕсли; 
						
						ДокументВвода_Объект.УстановитьПометкуУдаления(ИСТИНА);
						ПомУдаления = 1;
					Иначе
						ПомУдаления = 0;
						Если ДокументВвода_Объект.ПометкаУдаления = Истина Тогда
							ДокументВвода_Объект.УстановитьПометкуУдаления(ЛОЖЬ);
						КонецЕсли;	
					КонецЕсли;
					
					Если ДокументВвода_Объект.ПометкаУдаления = Истина Тогда
						ДокументВвода_Объект.Записать(РежимЗаписиДокумента.Запись);
					Иначе
					    ДокументВвода_Объект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;


					
					
					НаборЗаписейБУХ = СоединениеБУХ.РегистрыСведений.Обмен_ЗаявкиНаРасходДС.СоздатьНаборЗаписей();
        			НаборЗаписейБУХ.Отбор.ПлатежноеПоручениеСсылка.Установить(ВыборкаДетальныеЗаписи.ПлатежноеПоручениеСсылка);
			        НаборЗаписейБУХ.Прочитать();
			        
			        Для каждого СтрокаНабора Из НаборЗаписейБУХ Цикл
			            СтрокаНабора.ПризнакОбработано = 1;
			        КонецЦикла; 
			        
			        НаборЗаписейБУХ.Записать(Истина);
					
					
					НаборЗаписей = РегистрыСведений.Обмен_ЗаявкиНаОплату.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ЗаявкаСсылка.Установить(ДокументВвода_Объект.Ссылка);
					НаборЗаписей.Прочитать();
					
					Для каждого Запись Из НаборЗаписей Цикл
					    Запись.Статус = СтатусЗаявки;
						Запись.ПризнакОбработано = 1;
					
					КонецЦикла; 
					НаборЗаписей.Записать();
					
				КонецЕсли;

	        КонецЦикла;
	        
	        СоединениеБУХ = Неопределено;
	        
	    КонецЕсли;

КонецПроцедуры

Функция ПодключитьБД_БУХ() Экспорт
	
	Пользователь = "Администратор";
	Пароль = "123qwe";
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	
	//Если СтрокаСоединения = "Srvr=""VSRV-1CS"";Ref=""test"";" Тогда
	Если Найти(НРЕГ(СтрокаСоединения),"ref=""test""")>0 Тогда
		Сервер = "VSRV-1CS";
		База = "buh";
	Иначе
		Сервер = "VSRV-1CD";
		База = 	"buh_dev";
		Сообщить("Подключение к тестовой базе");
	КонецЕсли;
	
	ПараметрыПодключения = "Srvr="+Символ(34)+Сервер+Символ(34)+";Ref="+Символ(34)+База+Символ(34)+";Usr="+Символ(34)+Пользователь+Символ(34)+";Pwd="+Символ(34)+Пароль+Символ(34)+"";
	//ПараметрыПодключения = СтрокаСоединения+"Usr="+Символ(34)+Пользователь+Символ(34)+";Pwd="+Символ(34)+Пароль+Символ(34)+"";

	////ПараметрыПодключения = "Srvr=""VSRV-1CD"";Ref=""buh_dev"";Usr=""Администратор"";Pwd=""123qwe""";
    
	V83COMConnector= Новый COMОбъект("V83.COMConnector");
	
	Попытка
		Возврат V83COMConnector.Connect(ПараметрыПодключения);
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

КонецФункции




Процедура КонтрольСрокаДействияЗаказовКлиента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.Проведен КАК Проведен,
		|	ЗаказКлиента.Статус КАК Статус,
		|	ЗаказКлиента.Партнер.ВидПартнераКонтрагента КАК ПартнерВидПартнераКонтрагента,
		|	ЗаказКлиента.СрокДействияЗаказа КАК СрокДействияЗаказа,
		|	ЗаказКлиента.ПорядокРасчетов КАК ПорядокРасчетов,
		|	ЗаказКлиента.Склад.ТипСклада КАК СкладТипСклада
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Проведен = ИСТИНА
		|	И ЗаказКлиента.Статус = &Статус
		|	И ЗаказКлиента.СрокДействияЗаказа < &СрокДействияЗаказа
		|	И ЗаказКлиента.Партнер.ВидПартнераКонтрагента <> &ПартнерВидПартнераКонтрагента
		|	И ЗаказКлиента.Соглашение <> &Соглашение
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента.СрокДействияЗаказа";
	
	Запрос.УстановитьПараметр("СрокДействияЗаказа", ТекущаяДата());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовКлиентов.КОбеспечению);
	//Запрос.УстановитьПараметр("ТипСклада", Перечисления.ТипыСкладов.ОптовыйСклад);
	Запрос.УстановитьПараметр("ПартнерВидПартнераКонтрагента", Справочники.ВидПартнераКонтрагента.НайтиПоКоду("000000007"));     //Торговые сети
	Запрос.УстановитьПараметр("Соглашение", Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Благотворительность",ИСТИНА));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаказСсылка = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Если ВыборкаДетальныеЗаписи.СкладТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		    ЗаказСсылка.Статус = Перечисления.СтатусыЗаказовКлиентов.Отменен;
			ЗаказСсылка.ДатаОтменыЗаказа = ТекущаяДата();
			Попытка
			
				ЗаказСсылка.Записать(РежимЗаписиДокумента.Проведение);
			
			Исключение
			
			КонецПопытки;
		Иначе
			Если ВыборкаДетальныеЗаписи.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда
				
				Оплачено = ПроверкаСуммОплат(ЗаказСсылка.Ссылка);
	
				Если Оплачено > 0 Тогда
					Продолжить;
				Иначе
					Попытка
					
						ЗаказСсылка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					
					Исключение
					
					КонецПопытки;
				КонецЕсли;
			Иначе
				Попытка
					
					ЗаказСсылка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					
				Исключение
					
				КонецПопытки;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры







Функция ПроверкаСуммОплат(ЗаказСсылка) //jadmin

	Оплачено = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
		|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
		|	СостоянияЗаказовКлиентов.ДатаСобытия КАК ДатаСобытия,
		|	СостоянияЗаказовКлиентов.СуммаОплаты КАК СуммаОплаты,
		|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты,
		|	СостоянияЗаказовКлиентов.СуммаОтгрузки КАК СуммаОтгрузки,
		|	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузки,
		|	СостоянияЗаказовКлиентов.СуммаДолга КАК СуммаДолга,
		|	СостоянияЗаказовКлиентов.ПроцентДолга КАК ПроцентДолга,
		|	СостоянияЗаказовКлиентов.ЕстьРасхожденияОрдерНакладная КАК ЕстьРасхожденияОрдерНакладная
		|ИЗ
		|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|ГДЕ
		|	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Оплачено =  Оплачено + ВыборкаДетальныеЗаписи.СуммаОплаты; 
	КонецЦикла;
	
	Возврат Оплачено;
	
КонецФункции // ()



///----------------
 
Функция ДобавитьРабочиеДни(Дата,КолВоДнейВперед) Экспорт
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	НоваяДата = Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 30
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.Год КАК Год,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата >= &Дата
		|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И (ДанныеПроизводственногоКалендаря.ВидДня = &ВидДня
		|		ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = &ВидДняПредпраздничный)";
	
	Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("ВидДняПредпраздничный", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РБ"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	НоваяДата = РезультатЗапроса[КолВоДнейВперед].Дата;
	
	Возврат НоваяДата;

КонецФункции

 


Функция ПроверкаНаСрокАнализовДляЛука(Объект,ТоварыТЧ) Экспорт
	///////////77w qaws
	Отказов = 0;
	
	СекундДоСрока = Константы.СрокКонтроляДействияАнализа.Получить() *60 * 60 * 24;
	ПодошелСрокДатыАнализа = Дата(1, 1, 1);
	СрокДействияАнализа = Дата(1, 1, 1);	
	
	Если ТоварыТЧ.Количество() > 0 Тогда
		
		Для каждого ВыборкаПоТовару Из ТоварыТЧ Цикл
			
			СрокДействияАнализа = "";
			Партия_МССО_Ссылка = ВыборкаПоТовару.Серия.Партия_МССО;
			Если ВыборкаПоТовару.Номенклатура.ВесКонтроль = ИСТИНА Тогда
			
				Если Партия_МССО_Ссылка.Анализы.Количество() > 0 Тогда
					
					Для Каждого СтрокаАнализы Из Партия_МССО_Ссылка.Анализы Цикл
						
						СрокДействияАнализаЕсть = СтрокаАнализы.СрокДействияАнализа;
						
						Если НЕ ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
							Продолжить;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
							СрокДействияАнализа = СрокДействияАнализаЕсть;
						Иначе
							СрокДействияАнализа = Дата(1, 1, 1);
						КонецЕсли;
						
					КонецЦикла;
				Иначе
					СрокДействияАнализаЕсть = Партия_МССО_Ссылка.СрокДействияАнализа;
					
						Если НЕ ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
						   	Отказов = Отказов +1;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
							СрокДействияАнализа = СрокДействияАнализаЕсть;
						Иначе
							СрокДействияАнализа = Дата(1, 1, 1);
						   	Отказов = Отказов +1;
						КонецЕсли;
					
				КонецЕсли;
			
							
			
			КонецЕсли; 
			
			Попытка
				ПодошелСрокДатыАнализа = НачалоДня(СрокДействияАнализа - СекундДоСрока);
				Если Объект.Соглашение.Наименование <> "Благотворительность" Тогда
					Если (СрокДействияАнализа - Объект.Дата)<=(СрокДействияАнализа - ПодошелСрокДатыАнализа) Тогда
						Сообщить("Строка № "+ВыборкаПоТовару.НомерСтроки+"  СРОК АНАЛИЗА ИСТЕК (ИСТЕКАЕТ): "+ВыборкаПоТовару.Номенклатура+"  ПАРТИЯ  "+ВыборкаПоТовару.Серия);
						Если ВыборкаПоТовару.Номенклатура.ВесКонтроль = ИСТИНА Тогда  //////лук
							Отказов = Отказов +1;
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли;
			
			Исключение
				
			КонецПопытки; 
		КонецЦикла; 
		
		
	КонецЕсли; 
	
	Если Отказов > 0 Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли; 
	

КонецФункции




Функция BKP_ПолучитьКолВоСтрокЭквивалент(ТЧ_Товары,Склад,ДатаДок) Экспорт
	СтрокВЭквиваленте = 0;
	
	Запрос = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ_Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ТЗ_ТОВАРЫ
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыТЧ.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТАБЗаказ
		|ИЗ
		|	ВТ_ТЗ_ТОВАРЫ КАК ТоварыТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасценкиКладовщикиСрезПоследних.Цена КАК Цена,
		|	РасценкиКладовщикиСрезПоследних.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РасценкиКладовщикиСрезПоследних.Номенклатура) КАК КолВоСтрок,
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЦенаЭкв,
		|	РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК Коэф,
		|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(РасценкиКладовщикиСрезПоследних.Номенклатура) * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокЭквивалент
		|ИЗ
		|	ТАБЗаказ КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних(&ДатаДок, ) КАК РасценкиКладовщикиСрезПоследних
		|		ПО (ЗаказКлиентаТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
		|	РегистрСведений.РасценкиКладовщики.СрезПоследних(&ДатаДок, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
		|ГДЕ
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &БазоваяНоменклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	РасценкиКладовщикиСрезПоследних.Цена,
		|	РасценкиКладовщикиСрезПоследних.Номенклатура,
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Цена";
	
	Запрос.Текст = ТекстЗапроса;
	Если Склад = Справочники.Склады.Склад3 Тогда
		Запрос.УстановитьПараметр("БазоваяНоменклатура", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  ///1. Семена овощей
	Иначе
		Запрос.УстановитьПараметр("БазоваяНоменклатура", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  ///8.удобрения
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Запрос.УстановитьПараметр("ТЗ_Товары", ТЧ_Товары);
	//Запрос.УстановитьПараметр("ТипСклада", ТипСклада);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	

	СтрокВЭквиваленте = Окр(РезультатЗапроса.Итог("КолВоСтрокЭквивалент"),0);
	Возврат СтрокВЭквиваленте;
	
КонецФункции

Функция BKP_ДоступноСтрокКСборке(Склад, ДатаОтгрузки, ДатаДок, ПриоритетСборки = Неопределено,СпособДоставки) Экспорт
	

	
	
	ДоступноСтрок = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  	
	///v5
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДАТА,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокВсего
	|	КОНЕЦ КАК ЛимитСтрокВсего,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) < 34200
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокОпт
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокОпт
	|	КОНЕЦ КАК ЛимитСтрокОпт,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) < 34200
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокРозница
	|	КОНЕЦ КАК ЛимитСтрокРозница,
	|	ЛимитыСборкиСклада.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБДАТЫЛИМИТЫ
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
	|		ПО (ЛимитыСборкиСклада.Период = ДанныеПроизводственногоКалендаря.Дата)
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И ЛимитыСборкиСклада.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК Распоряжение,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад КАК Склад,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение КАК Помещение,
	|	СУММА(ВЫРАЗИТЬ(1 * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1))) КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБПОМЕЩЕНИЯ
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
	|		ПО (ЗаказКлиентаТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
	|	РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
	|	И НЕ ЗаказКлиентаТовары.Номенклатура.Родитель В ИЕРАРХИИ (&Лук)
	|	И РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
	|	И ЗаказКлиентаТовары.Ссылка.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение,
	|	СУММА(ВЫРАЗИТЬ(1 * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)))
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
	|		ПО (ЗаказНаПеремещениеТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
	|	РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
	|	И НЕ ЗаказНаПеремещениеТовары.Номенклатура.Родитель В ИЕРАРХИИ (&Лук)
	|	И РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
	|	И ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
	|	ВложенныйЗапрос.Получатель КАК Получатель,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ КАК Состояние
	|ПОМЕСТИТЬ РаспоряженияИСостояния
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
	|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
	|		РаспоряженияКОтгрузке.Серия КАК Серия,
	|		ВЫБОР
	|			КОГДА &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|					ИЛИ НЕ &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|				ТОГДА 0
	|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	|				ТОГДА 1
	|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|				ТОГДА 2
	|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	|				ТОГДА 3
	|			ИНАЧЕ 404
	|		КОНЕЦ КАК Состояние
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки({() КАК Поле2}, {(Склад = &Склад) КАК Поле2}) КАК РаспоряженияКОтгрузке
	|	ГДЕ
	|		(РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	|				ИЛИ (&ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|					ИЛИ НЕ &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0)
	|				ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	|				ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0)) КАК ВложенныйЗапрос
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказНаПеремещение)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ДокументОтгрузки,
	|	ВложенныйЗапрос.Получатель
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
	|	РаспоряженияИСостояния.Получатель КАК Получатель,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) КАК ТипДокумента,
	|	РаспоряженияИСостояния.Состояние КАК Состояние,
	|	0 КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ КАК ЖелаемаяДатаОтгрузки,
	|	ТАБПОМЕЩЕНИЯ.Помещение КАК Помещение,
	|	ТАБПОМЕЩЕНИЯ.КолВоСтрок КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБОбщая
	|ИЗ
	|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ПО РаспоряженияИСостояния.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБПОМЕЩЕНИЯ КАК ТАБПОМЕЩЕНИЯ
	|		ПО РаспоряженияИСостояния.Распоряжение = ТАБПОМЕЩЕНИЯ.Распоряжение
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) <> ТИП(Документ.СборкаТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияИСостояния.Распоряжение,
	|	РаспоряженияИСостояния.Получатель,
	|	РаспоряженияИСостояния.Состояние,
	|	ТАБПОМЕЩЕНИЯ.Помещение,
	|	ТАБПОМЕЩЕНИЯ.КолВоСтрок,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБОБЩАЯ.Распоряжение КАК Распоряжение,
	|	ТАБОБЩАЯ.Помещение КАК Помещение,
	|	ТАБОБЩАЯ.КолВоСтрок КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБВСЕЗАКАЗЫ
	|ИЗ
	|	ТАБОбщая КАК ТАБОБЩАЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБВСЕЗАКАЗЫ.Распоряжение КАК Распоряжение,
	|	ТАБВСЕЗАКАЗЫ.Помещение КАК Помещение,
	|	ТАБВСЕЗАКАЗЫ.КолВоСтрок КАК КолВоСтрок,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ КАК ДатаОтгрузкиОчередь,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладОтправитель
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Склад
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Склад,
	|	ТАБВСЕЗАКАЗЫ.Распоряжение.Приоритет КАК Приоритет,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладПолучатель
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Партнер
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Получатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Клиенты)
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Магазины)
	|	КОНЕЦ КАК ПриоритетСборки,
	|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Номер, NULL) КАК НомерЗаданияНаПеревозку
	|ПОМЕСТИТЬ ТАБИТОГОВАЯ
	|ИЗ
	|	ТАБВСЕЗАКАЗЫ КАК ТАБВСЕЗАКАЗЫ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ПО ТАБВСЕЗАКАЗЫ.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБИТОГОВАЯ.Распоряжение КАК Распоряжение,
	|	ТАБИТОГОВАЯ.Помещение КАК Помещение,
	|	ТАБИТОГОВАЯ.КолВоСтрок КАК КолВоСтрок,
	|	ТАБИТОГОВАЯ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	|	ТАБИТОГОВАЯ.Склад КАК Склад,
	|	ТАБИТОГОВАЯ.Приоритет КАК Приоритет,
	|	ТАБИТОГОВАЯ.Получатель КАК Получатель,
	|	ТАБИТОГОВАЯ.ПриоритетСборки КАК ПриоритетСборки,
	|	ТАБИТОГОВАЯ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку
	|ПОМЕСТИТЬ ТАБ
	|ИЗ
	|	ТАБИТОГОВАЯ КАК ТАБИТОГОВАЯ
	|ГДЕ
	|	ТАБИТОГОВАЯ.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБ.Распоряжение КАК Распоряжение,
	|	ТАБ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	|	ТАБ.Приоритет КАК Приоритет,
	|	ТАБ.КолВоСтрок КАК НомерСтроки,
	|	ТАБ.Помещение КАК СсылкаПомещение,
	|	ТАБ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку,
	|	ТАБ.Склад КАК Склад,
	|	ТАБ.КолВоСтрок КАК КоличествоСтрокВЭквиваленте,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБ.КолВоСтрок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеОпт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБ.КолВоСтрок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеРозница
	|ПОМЕСТИТЬ ТАБИТОГ
	|ИЗ
	|	ТАБ КАК ТАБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) КАК Дата,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквиваленте, 0)) КАК КоличествоСтрокВЭквиваленте,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК КоличествоСтрокВЭквивалентеОпт,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБИТОГ.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБПРОМ1
	|ИЗ
	|	ТАБИТОГ КАК ТАБИТОГ
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) <= &ДатаОкон
	|	И ТАБИТОГ.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ),
	|	ТАБИТОГ.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата,
	|	0,
	|	0,
	|	0,
	|	&Склад
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|			ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБПРОМ1.Дата КАК Дата,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквиваленте) КАК КоличествоСтрокВЭквиваленте,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеОпт) КАК КоличествоСтрокВЭквивалентеОпт,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеРозница) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ1.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБПРОМ
	|ИЗ
	|	ТАБПРОМ1 КАК ТАБПРОМ1
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБПРОМ1.Дата,
	|	ТАБПРОМ1.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБПРОМ.Дата КАК Дата,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквиваленте, 0)) КАК ВсегоСтрокВЭквиваленте,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК ВсегоСтрокВЭквивалентеОпт,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК ВсегоСтрокВЭквивалентеРозница
	|ПОМЕСТИТЬ ТАБКОЛВОСТРОК
	|ИЗ
	|	ТАБПРОМ КАК ТАБПРОМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБПРОМ КАК ТАБСУММАЭКВ
	|		ПО ТАБПРОМ.Дата >= ТАБСУММАЭКВ.Дата
	|			И ТАБПРОМ.Склад = ТАБСУММАЭКВ.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБПРОМ.Дата,
	|	ТАБПРОМ.КоличествоСтрокВЭквиваленте,
	|	ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт,
	|	ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБДАТЫЛИМИТЫ.ДАТА КАК ДАТА,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	|	ТАБДАТЫЛИМИТЫ.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокВсего, 0)) КАК ВсегоЛимит,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокОпт, 0)) КАК ВсегоЛимитОпт,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокРозница, 0)) КАК ВсегоЛимитРозница
	|ПОМЕСТИТЬ ТАБЛИМИТЫСУММА
	|ИЗ
	|	ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫСУММА
	|		ПО ТАБДАТЫЛИМИТЫ.ДАТА >= ТАБДАТЫЛИМИТЫСУММА.ДАТА
	|			И ТАБДАТЫЛИМИТЫ.Склад = ТАБДАТЫЛИМИТЫСУММА.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБДАТЫЛИМИТЫ.ДАТА,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница,
	|	ТАБДАТЫЛИМИТЫ.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБЛИМИТЫСУММА.ДАТА КАК ДАТА,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	|	ТАБЛИМИТЫСУММА.Склад КАК Склад,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимит, 0) КАК ВсегоЛимит,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитОпт, 0) КАК ВсегоЛимитОпт,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитРозница, 0) КАК ВсегоЛимитРозница,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквиваленте, 0) КАК ВсегоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеОпт, 0) КАК ВсегоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеРозница, 0) КАК ВсегоСтрокВЭквивалентеРозница,             	
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800            
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|	КОНЕЦ КАК ДоступноСтрок,
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800            
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0)
	|	КОНЕЦ КАК ДоступноСтрокОпт,
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5  - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0)
	|	КОНЕЦ КАК ДоступноСтрокРозница
	|ИЗ
	|	ТАБЛИМИТЫСУММА КАК ТАБЛИМИТЫСУММА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБКОЛВОСТРОК КАК ТАБКОЛВОСТРОК
	|		ПО ТАБЛИМИТЫСУММА.Склад = ТАБКОЛВОСТРОК.Склад
	|			И ТАБЛИМИТЫСУММА.ДАТА = ТАБКОЛВОСТРОК.Дата
	|ГДЕ
	|	ТАБЛИМИТЫСУММА.Склад = &Склад";
	
	
	///////v4
	//"ВЫБРАТЬ
	//|	ДанныеПроизводственногоКалендаря.Дата КАК ДАТА,
	//|	ВЫБОР  
	////Тек дата до 10.30
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) <= 37800
	//|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего    
	////Тек дата после 10.30
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) > 37800
	//|			ТОГДА 0  
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|			ТОГДА 0
	//|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокВсего
	//|	КОНЕЦ КАК ЛимитСтрокВсего,
	//|	ВЫБОР
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) < 34200  
	//|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокОпт
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) >= 34200  
	//|				И  РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) <= 37800
	//|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) > 37800
	//|			ТОГДА 0  
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|			ТОГДА 0
	//|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокОпт
	//|	КОНЕЦ КАК ЛимитСтрокОпт,
	//|	ВЫБОР
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) < 34200
	//|			ТОГДА 0
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) >= 34200  
	//|				И  РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) <= 37800
	//|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего  
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) > 37800
	//|			ТОГДА 0 
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|			ТОГДА 0
	//|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокРозница
	//|	КОНЕЦ КАК ЛимитСтрокРозница,
	//|	ЛимитыСборкиСклада.Склад КАК Склад
	//|ПОМЕСТИТЬ ТАБДАТЫЛИМИТЫ
	//|ИЗ
	//|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
	//|		ПО (ЛимитыСборкиСклада.Период = ДанныеПроизводственногоКалендаря.Дата)
	//|ГДЕ
	//|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	//|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Помещение КАК Помещение
	//|ПОМЕСТИТЬ ТАБ1
	//|ИЗ
	//|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	//|ГДЕ
	//|	(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлено)
	//|			ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
	//|			ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КПроверке))
	//|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
	//|	И НЕ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель = &Лук
	//|				ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель.Родитель = &Лук
	//|				ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель.Родитель.Родитель = &Лук)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Помещение
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаказКлиентаТовары.Ссылка КАК Распоряжение,
	//|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад КАК Склад,
	//|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение КАК Помещение,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Номенклатура) КАК КолВоСтрок
	//|ПОМЕСТИТЬ ТАБПОМЕЩЕНИЯ
	//|ИЗ
	//|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	//|ГДЕ
	//|	ЗаказКлиентаТовары.Ссылка.ВзятВРаботу = ЛОЖЬ
	//|	И ЗаказКлиентаТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, ГОД), ГОД, -1)
	//|	И НЕ(ЗаказКлиентаТовары.Номенклатура.Родитель = &Лук
	//|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = &Лук
	//|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = &Лук)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказКлиентаТовары.Ссылка,
	//|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад,
	//|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗаказНаПеремещениеТовары.Ссылка,
	//|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	//|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказНаПеремещениеТовары.Номенклатура)
	//|ИЗ
	//|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	//|ГДЕ
	//|	ЗаказНаПеремещениеТовары.Ссылка.ВзятВРаботу = ЛОЖЬ
	//|	И ЗаказНаПеремещениеТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, ГОД), ГОД, -1)
	//|	И НЕ(ЗаказНаПеремещениеТовары.Номенклатура.Родитель = &Лук
	//|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель = &Лук
	//|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель = &Лук)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказНаПеремещениеТовары.Ссылка,
	//|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	//|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБ1.Ссылка КАК ССылка,
	//|	ТАБ1.Распоряжение КАК Распоряжение,
	//|	ТАБ1.Помещение КАК Помещение,
	//|	ТАБ1.Ссылка.КоличествоСтрокВЭквиваленте КАК КолВоСтрок
	//|ПОМЕСТИТЬ ТАБОРДЕРА
	//|ИЗ
	//|	ТАБ1 КАК ТАБ1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
	//|	ВложенныйЗапрос.Получатель КАК Получатель,
	//|	ВЫБОР
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	//|	КОНЕЦ КАК Состояние
	//|ПОМЕСТИТЬ РаспоряженияИСостояния
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	//|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
	//|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	//|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	//|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
	//|		РаспоряженияКОтгрузке.Серия КАК Серия,
	//|		ВЫБОР
	//|			КОГДА &ОформлятьСначалаНакладные
	//|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	//|					ИЛИ НЕ &ОформлятьСначалаНакладные
	//|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	//|				ТОГДА 0
	//|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	//|				ТОГДА 1
	//|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
	//|				ТОГДА 2
	//|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	//|				ТОГДА 3
	//|			ИНАЧЕ 404
	//|		КОНЕЦ КАК Состояние
	//|	ИЗ
	//|		РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК РаспоряженияКОтгрузке
	//|	ГДЕ
	//|		(РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	//|				ИЛИ (&ОформлятьСначалаНакладные
	//|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	//|					ИЛИ НЕ &ОформлятьСначалаНакладные
	//|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0)
	//|				ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	//|				ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0)) КАК ВложенныйЗапрос
	//|ГДЕ
	//|	ВложенныйЗапрос.ДокументОтгрузки.ВзятВРаботу = ЛОЖЬ
	//|	И (ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ИЛИ ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВложенныйЗапрос.ДокументОтгрузки,
	//|	ВложенныйЗапрос.Получатель
	//|
	//|ИМЕЮЩИЕ
	//|	ВЫБОР
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	//|	КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
	//|	РаспоряженияИСостояния.Получатель КАК Получатель,
	//|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
	//|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	//|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) КАК ТипДокумента,
	//|	РаспоряженияИСостояния.Состояние КАК Состояние,
	//|	0 КАК ИндексКартинки,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	//|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	//|			ТОГДА ВЫБОР
	//|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	//|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|						ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	//|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	//|				КОНЕЦ
	//|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	//|	КОНЕЦ КАК ЖелаемаяДатаОтгрузки,
	//|	ТАБПОМЕЩЕНИЯ.Помещение КАК Помещение,
	//|	ТАБПОМЕЩЕНИЯ.КолВоСтрок КАК КолВоСтрок
	//|ПОМЕСТИТЬ ТАБОбщая
	//|ИЗ
	//|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	//|		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
	//|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	//|		ПО РаспоряженияИСостояния.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	//|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	//|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБПОМЕЩЕНИЯ КАК ТАБПОМЕЩЕНИЯ
	//|		ПО РаспоряженияИСостояния.Распоряжение = ТАБПОМЕЩЕНИЯ.Распоряжение
	//|ГДЕ
	//|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) <> ТИП(Документ.СборкаТоваров)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	NULL КАК Ссылка,
	//|	ТАБОБЩАЯ.Распоряжение КАК Распоряжение,
	//|	ТАБОБЩАЯ.Помещение КАК Помещение,
	//|	ТАБОБЩАЯ.КолВоСтрок КАК КолВоСтрок
	//|ПОМЕСТИТЬ ТАБВСЕЗАКАЗЫ
	//|ИЗ
	//|	ТАБОбщая КАК ТАБОБЩАЯ
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ТАБОРДЕРА.ССылка,
	//|	ТАБОРДЕРА.Распоряжение,
	//|	ТАБОРДЕРА.Помещение,
	//|	ТАБОРДЕРА.КолВоСтрок
	//|ИЗ
	//|	ТАБОРДЕРА КАК ТАБОРДЕРА
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБВСЕЗАКАЗЫ.Ссылка КАК Ссылка,
	//|	ТАБВСЕЗАКАЗЫ.Распоряжение КАК Распоряжение,
	//|	ТАБВСЕЗАКАЗЫ.Помещение КАК Помещение,
	//|	ТАБВСЕЗАКАЗЫ.КолВоСтрок КАК КолВоСтрок,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	//|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	//|			ТОГДА ВЫБОР
	//|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	//|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|						ТОГДА КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	//|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	//|				КОНЕЦ
	//|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	//|	КОНЕЦ КАК ДатаОтгрузкиОчередь,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладОтправитель
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Склад
	//|		ИНАЧЕ NULL
	//|	КОНЕЦ КАК Склад,
	//|	ТАБВСЕЗАКАЗЫ.Распоряжение.Приоритет КАК Приоритет,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладПолучатель
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Партнер
	//|		ИНАЧЕ NULL
	//|	КОНЕЦ КАК Получатель,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказКлиента)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Клиенты)
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Магазины)
	//|	КОНЕЦ КАК ПриоритетСборки,
	//|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Номер, NULL) КАК НомерЗаданияНаПеревозку
	//|ПОМЕСТИТЬ ТАБИТОГОВАЯ
	//|ИЗ
	//|	ТАБВСЕЗАКАЗЫ КАК ТАБВСЕЗАКАЗЫ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	//|		ПО ТАБВСЕЗАКАЗЫ.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	//|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	//|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБИТОГОВАЯ.Ссылка КАК Ссылка,
	//|	ТАБИТОГОВАЯ.Распоряжение КАК Распоряжение,
	//|	ТАБИТОГОВАЯ.Помещение КАК Помещение,
	//|	ТАБИТОГОВАЯ.КолВоСтрок КАК КолВоСтрок,
	//|	ТАБИТОГОВАЯ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	//|	ТАБИТОГОВАЯ.Склад КАК Склад,
	//|	ТАБИТОГОВАЯ.Приоритет КАК Приоритет,
	//|	ТАБИТОГОВАЯ.Получатель КАК Получатель,
	//|	ТАБИТОГОВАЯ.ПриоритетСборки КАК ПриоритетСборки,
	//|	ТАБИТОГОВАЯ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку
	//|ПОМЕСТИТЬ ТАБ
	//|ИЗ
	//|	ТАБИТОГОВАЯ КАК ТАБИТОГОВАЯ
	//|ГДЕ
	//|	ТАБИТОГОВАЯ.Склад = &Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБ.Ссылка КАК Ссылка,
	//|	ТАБ.Распоряжение КАК Распоряжение,
	//|	ТАБ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	//|	ТАБ.Приоритет КАК Приоритет,
	//|	ТАБ.КолВоСтрок КАК НомерСтроки,
	//|	ТАБ.Помещение КАК СсылкаПомещение,
	//|	ТАБ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку,
	//|	ТАБ.Склад КАК Склад,
	//|	ТАБ.КолВоСтрок КАК КоличествоСтрокВЭквиваленте,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|			ТОГДА ТАБ.КолВоСтрок
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеОпт,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ТОГДА ТАБ.КолВоСтрок
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеРозница
	//|ПОМЕСТИТЬ ТАБИТОГ
	//|ИЗ
	//|	ТАБ КАК ТАБ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) КАК Дата,
	//|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквиваленте, 0)) КАК КоличествоСтрокВЭквиваленте,
	//|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК КоличествоСтрокВЭквивалентеОпт,
	//|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК КоличествоСтрокВЭквивалентеРозница,
	//|	ТАБИТОГ.Склад КАК Склад
	//|ПОМЕСТИТЬ ТАБПРОМ1
	//|ИЗ
	//|	ТАБИТОГ КАК ТАБИТОГ
	//|ГДЕ
	//|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) <= &ДатаОкон
	//|	И ТАБИТОГ.Склад = &Склад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ),
	//|	ТАБИТОГ.Склад
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ДанныеПроизводственногоКалендаря.Дата,
	//|	0,
	//|	0,
	//|	0,
	//|	&Склад
	//|ИЗ
	//|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	//|ГДЕ
	//|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	//|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	//|	И (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	//|			ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБПРОМ1.Дата КАК Дата,
	//|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквиваленте) КАК КоличествоСтрокВЭквиваленте,
	//|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеОпт) КАК КоличествоСтрокВЭквивалентеОпт,
	//|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеРозница) КАК КоличествоСтрокВЭквивалентеРозница,
	//|	ТАБПРОМ1.Склад КАК Склад
	//|ПОМЕСТИТЬ ТАБПРОМ
	//|ИЗ
	//|	ТАБПРОМ1 КАК ТАБПРОМ1
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТАБПРОМ1.Дата,
	//|	ТАБПРОМ1.Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБПРОМ.Дата КАК Дата,
	//|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	//|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	//|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	//|	ТАБПРОМ.Склад КАК Склад,
	//|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквиваленте, 0)) КАК ВсегоСтрокВЭквиваленте,
	//|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК ВсегоСтрокВЭквивалентеОпт,
	//|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК ВсегоСтрокВЭквивалентеРозница
	//|ПОМЕСТИТЬ ТАБКОЛВОСТРОК
	//|ИЗ
	//|	ТАБПРОМ КАК ТАБПРОМ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБПРОМ КАК ТАБСУММАЭКВ
	//|		ПО ТАБПРОМ.Дата >= ТАБСУММАЭКВ.Дата
	//|			И ТАБПРОМ.Склад = ТАБСУММАЭКВ.Склад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТАБПРОМ.Дата,
	//|	ТАБПРОМ.КоличествоСтрокВЭквиваленте,
	//|	ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт,
	//|	ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница,
	//|	ТАБПРОМ.Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБДАТЫЛИМИТЫ.ДАТА КАК ДАТА,
	//|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	//|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	//|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	//|	ТАБДАТЫЛИМИТЫ.Склад КАК Склад,
	//|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокВсего, 0)) КАК ВсегоЛимит,
	//|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокОпт, 0)) КАК ВсегоЛимитОпт,
	//|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокРозница, 0)) КАК ВсегоЛимитРозница
	//|ПОМЕСТИТЬ ТАБЛИМИТЫСУММА
	//|ИЗ
	//|	ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫСУММА
	//|		ПО ТАБДАТЫЛИМИТЫ.ДАТА >= ТАБДАТЫЛИМИТЫСУММА.ДАТА
	//|			И ТАБДАТЫЛИМИТЫ.Склад = ТАБДАТЫЛИМИТЫСУММА.Склад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТАБДАТЫЛИМИТЫ.ДАТА,
	//|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего,
	//|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт,
	//|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница,
	//|	ТАБДАТЫЛИМИТЫ.Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБЛИМИТЫСУММА.ДАТА КАК ДАТА,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	//|	ТАБЛИМИТЫСУММА.Склад КАК Склад,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимит, 0) КАК ВсегоЛимит,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитОпт, 0) КАК ВсегоЛимитОпт,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитРозница, 0) КАК ВсегоЛимитРозница,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквиваленте, 0) КАК ВсегоСтрокВЭквиваленте,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеОпт, 0) КАК ВсегоСтрокВЭквивалентеОпт,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеРозница, 0) КАК ВсегоСтрокВЭквивалентеРозница,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) КАК ДоступноСтрок,  
	//|	ВЫБОР
	//|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) >= 34200  
	//|				И  РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) <= 37800
	//|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	//|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0)
	//|	КОНЕЦ КАК ДоступноСтрокОпт, 

	////|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0) КАК ДоступноСтрокОпт,
	//
	//|	ВЫБОР
	//|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) >= 34200  
	//|				И  РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, Секунда) <= 37800
	//|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	//|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0)
	//|	КОНЕЦ КАК ДоступноСтрокРозница 

	////|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0) КАК ДоступноСтрокРозница
	//|ИЗ
	//|	ТАБЛИМИТЫСУММА КАК ТАБЛИМИТЫСУММА
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБКОЛВОСТРОК КАК ТАБКОЛВОСТРОК
	//|		ПО ТАБЛИМИТЫСУММА.Склад = ТАБКОЛВОСТРОК.Склад
	//|			И ТАБЛИМИТЫСУММА.ДАТА = ТАБКОЛВОСТРОК.Дата
	//|ГДЕ
	//|	ТАБЛИМИТЫСУММА.Склад = &Склад";

	//
	
	
	//
	///////v3
	//"ВЫБРАТЬ
	//|	ДанныеПроизводственногоКалендаря.Дата КАК ДАТА,
	//|	ВЫБОР
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И ЧАС(&ДатаТек) >= 7
	//|				И ЧАС(&ДатаТек) < 15
	//|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего / 8 * (15 - ЧАС(&ДатаТек))
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И ЧАС(&ДатаТек) >= 15
	//|			ТОГДА 0
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|			ТОГДА 0
	//|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокВсего
	//|	КОНЕЦ КАК ЛимитСтрокВсего,
	//|	ВЫБОР
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И ЧАС(&ДатаТек) >= 7
	//|				И ЧАС(&ДатаТек) < 10
	//|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокОпт 
	////|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокОпт / 8 * (15 - ЧАС(&ДатаТек))
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И ЧАС(&ДатаТек) >= 10
	//|				И ЧАС(&ДатаТек) < 15
	//|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего / 8 * (15 - ЧАС(&ДатаТек))
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И ЧАС(&ДатаТек) >= 15
	//|			ТОГДА 0
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|			ТОГДА 0
	//|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокОпт
	//|	КОНЕЦ КАК ЛимитСтрокОпт,
	//|	ВЫБОР
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|				И ЧАС(&ДатаТек) > 10
	//|			ТОГДА 0
	//|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	//|			ТОГДА 0
	//|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокРозница
	//|	КОНЕЦ КАК ЛимитСтрокРозница,
	//|	ЛимитыСборкиСклада.Склад КАК Склад
	//|ПОМЕСТИТЬ ТАБДАТЫЛИМИТЫ
	//|ИЗ
	//|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
	//|		ПО (ЛимитыСборкиСклада.Период = ДанныеПроизводственногоКалендаря.Дата)
	//|ГДЕ
	//|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	//|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Помещение КАК Помещение
	//|ПОМЕСТИТЬ ТАБ1
	//|ИЗ
	//|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
	//|ГДЕ
	//|	(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Подготовлено)
	//|			ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтбору)
	//|			ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КПроверке))
	//|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
	//|	И НЕ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель = &Лук
	//|				ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель.Родитель = &Лук
	//|				ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель.Родитель.Родитель = &Лук)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
	//|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Помещение
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаказКлиентаТовары.Ссылка КАК Распоряжение,
	//|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад КАК Склад,
	//|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение КАК Помещение,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Номенклатура) КАК КолВоСтрок
	//|ПОМЕСТИТЬ ТАБПОМЕЩЕНИЯ
	//|ИЗ
	//|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	//|ГДЕ
	//|	ЗаказКлиентаТовары.Ссылка.ВзятВРаботу = ЛОЖЬ
	//|	И ЗаказКлиентаТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, ГОД), ГОД, -1)
	//|	И НЕ(ЗаказКлиентаТовары.Номенклатура.Родитель = &Лук
	//|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = &Лук
	//|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = &Лук)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказКлиентаТовары.Ссылка,
	//|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад,
	//|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ЗаказНаПеремещениеТовары.Ссылка,
	//|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	//|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказНаПеремещениеТовары.Номенклатура)
	//|ИЗ
	//|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	//|ГДЕ
	//|	ЗаказНаПеремещениеТовары.Ссылка.ВзятВРаботу = ЛОЖЬ
	//|	И ЗаказНаПеремещениеТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, ГОД), ГОД, -1)
	//|	И НЕ(ЗаказНаПеремещениеТовары.Номенклатура.Родитель = &Лук
	//|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель = &Лук
	//|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель = &Лук)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаказНаПеремещениеТовары.Ссылка,
	//|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	//|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБ1.Ссылка КАК ССылка,
	//|	ТАБ1.Распоряжение КАК Распоряжение,
	//|	ТАБ1.Помещение КАК Помещение,
	//|	ТАБ1.Ссылка.КоличествоСтрокВЭквиваленте КАК КолВоСтрок
	//|ПОМЕСТИТЬ ТАБОРДЕРА
	//|ИЗ
	//|	ТАБ1 КАК ТАБ1
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
	//|	ВложенныйЗапрос.Получатель КАК Получатель,
	//|	ВЫБОР
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	//|	КОНЕЦ КАК Состояние
	//|ПОМЕСТИТЬ РаспоряженияИСостояния
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	//|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
	//|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	//|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	//|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
	//|		РаспоряженияКОтгрузке.Серия КАК Серия,
	//|		ВЫБОР
	//|			КОГДА &ОформлятьСначалаНакладные
	//|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	//|					ИЛИ НЕ &ОформлятьСначалаНакладные
	//|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	//|				ТОГДА 0
	//|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	//|				ТОГДА 1
	//|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
	//|				ТОГДА 2
	//|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	//|				ТОГДА 3
	//|			ИНАЧЕ 404
	//|		КОНЕЦ КАК Состояние
	//|	ИЗ
	//|		РегистрНакопления.ТоварыКОтгрузке.Остатки(, Склад = &Склад) КАК РаспоряженияКОтгрузке
	//|	ГДЕ
	//|		(РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	//|				ИЛИ (&ОформлятьСначалаНакладные
	//|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	//|					ИЛИ НЕ &ОформлятьСначалаНакладные
	//|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0)
	//|				ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	//|				ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0)) КАК ВложенныйЗапрос
	//|ГДЕ
	//|	ВложенныйЗапрос.ДокументОтгрузки.ВзятВРаботу = ЛОЖЬ
	//|	И (ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ИЛИ ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента))
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВложенныйЗапрос.ДокументОтгрузки,
	//|	ВложенныйЗапрос.Получатель
	//|
	//|ИМЕЮЩИЕ
	//|	ВЫБОР
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	//|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	//|	КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
	//|	РаспоряженияИСостояния.Получатель КАК Получатель,
	//|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """""""""""""""") КАК Номер,
	//|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	//|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) КАК ТипДокумента,
	//|	РаспоряженияИСостояния.Состояние КАК Состояние,
	//|	0 КАК ИндексКартинки,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	//|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	//|			ТОГДА ВЫБОР
	//|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	//|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|						ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	//|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	//|				КОНЕЦ
	//|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	//|	КОНЕЦ КАК ЖелаемаяДатаОтгрузки,
	//|	ТАБПОМЕЩЕНИЯ.Помещение КАК Помещение,
	//|	ТАБПОМЕЩЕНИЯ.КолВоСтрок КАК КолВоСтрок
	//|ПОМЕСТИТЬ ТАБОбщая
	//|ИЗ
	//|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	//|		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
	//|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	//|		ПО РаспоряженияИСостояния.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	//|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	//|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБПОМЕЩЕНИЯ КАК ТАБПОМЕЩЕНИЯ
	//|		ПО РаспоряженияИСостояния.Распоряжение = ТАБПОМЕЩЕНИЯ.Распоряжение
	//|ГДЕ
	//|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) <> ТИП(Документ.СборкаТоваров)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	NULL КАК Ссылка,
	//|	ТАБОБЩАЯ.Распоряжение КАК Распоряжение,
	//|	ТАБОБЩАЯ.Помещение КАК Помещение,
	//|	ТАБОБЩАЯ.КолВоСтрок КАК КолВоСтрок
	//|ПОМЕСТИТЬ ТАБВСЕЗАКАЗЫ
	//|ИЗ
	//|	ТАБОбщая КАК ТАБОБЩАЯ
	//|
	//|ОБЪЕДИНИТЬ
	//|
	//|ВЫБРАТЬ
	//|	ТАБОРДЕРА.ССылка,
	//|	ТАБОРДЕРА.Распоряжение,
	//|	ТАБОРДЕРА.Помещение,
	//|	ТАБОРДЕРА.КолВоСтрок
	//|ИЗ
	//|	ТАБОРДЕРА КАК ТАБОРДЕРА
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБВСЕЗАКАЗЫ.Ссылка КАК Ссылка,
	//|	ТАБВСЕЗАКАЗЫ.Распоряжение КАК Распоряжение,
	//|	ТАБВСЕЗАКАЗЫ.Помещение КАК Помещение,
	//|	ТАБВСЕЗАКАЗЫ.КолВоСтрок КАК КолВоСтрок,
	//|	ВЫБОР
	//|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	//|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	//|			ТОГДА ВЫБОР
	//|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	//|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|						ТОГДА КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	//|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	//|				КОНЕЦ
	//|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	//|	КОНЕЦ КАК ДатаОтгрузкиОчередь,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладОтправитель
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Склад
	//|		ИНАЧЕ NULL
	//|	КОНЕЦ КАК Склад,
	//|	ТАБВСЕЗАКАЗЫ.Распоряжение.Приоритет КАК Приоритет,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладПолучатель
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Партнер
	//|		ИНАЧЕ NULL
	//|	КОНЕЦ КАК Получатель,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказКлиента)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Клиенты)
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Магазины)
	//|	КОНЕЦ КАК ПриоритетСборки,
	//|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Номер, NULL) КАК НомерЗаданияНаПеревозку
	//|ПОМЕСТИТЬ ТАБИТОГОВАЯ
	//|ИЗ
	//|	ТАБВСЕЗАКАЗЫ КАК ТАБВСЕЗАКАЗЫ
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	//|		ПО ТАБВСЕЗАКАЗЫ.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	//|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	//|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБИТОГОВАЯ.Ссылка КАК Ссылка,
	//|	ТАБИТОГОВАЯ.Распоряжение КАК Распоряжение,
	//|	ТАБИТОГОВАЯ.Помещение КАК Помещение,
	//|	ТАБИТОГОВАЯ.КолВоСтрок КАК КолВоСтрок,
	//|	ТАБИТОГОВАЯ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	//|	ТАБИТОГОВАЯ.Склад КАК Склад,
	//|	ТАБИТОГОВАЯ.Приоритет КАК Приоритет,
	//|	ТАБИТОГОВАЯ.Получатель КАК Получатель,
	//|	ТАБИТОГОВАЯ.ПриоритетСборки КАК ПриоритетСборки,
	//|	ТАБИТОГОВАЯ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку
	//|ПОМЕСТИТЬ ТАБ
	//|ИЗ
	//|	ТАБИТОГОВАЯ КАК ТАБИТОГОВАЯ
	//|ГДЕ
	//|	ТАБИТОГОВАЯ.Склад = &Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБ.Ссылка КАК Ссылка,
	//|	ТАБ.Распоряжение КАК Распоряжение,
	//|	ТАБ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	//|	ТАБ.Приоритет КАК Приоритет,
	//|	ТАБ.КолВоСтрок КАК НомерСтроки,
	//|	ТАБ.Помещение КАК СсылкаПомещение,
	//|	ТАБ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку,
	//|	ТАБ.Склад КАК Склад,
	//|	ТАБ.КолВоСтрок КАК КоличествоСтрокВЭквиваленте,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	//|			ТОГДА ТАБ.КолВоСтрок
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеОпт,
	//|	ВЫБОР
	//|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	//|			ТОГДА ТАБ.КолВоСтрок
	//|		ИНАЧЕ 0
	//|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеРозница
	//|ПОМЕСТИТЬ ТАБИТОГ
	//|ИЗ
	//|	ТАБ КАК ТАБ
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) КАК Дата,
	//|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквиваленте, 0)) КАК КоличествоСтрокВЭквиваленте,
	//|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК КоличествоСтрокВЭквивалентеОпт,
	//|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК КоличествоСтрокВЭквивалентеРозница,
	//|	ТАБИТОГ.Склад КАК Склад
	//|ПОМЕСТИТЬ ТАБПРОМ1
	//|ИЗ
	//|	ТАБИТОГ КАК ТАБИТОГ
	//|ГДЕ
	//|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) <= &ДатаОкон
	//|	И ТАБИТОГ.Склад = &Склад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ),
	//|	ТАБИТОГ.Склад
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	ДанныеПроизводственногоКалендаря.Дата,
	//|	0,
	//|	0,
	//|	0,
	//|	&Склад
	//|ИЗ
	//|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	//|ГДЕ
	//|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	//|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	//|	И (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	//|			ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБПРОМ1.Дата КАК Дата,
	//|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквиваленте) КАК КоличествоСтрокВЭквиваленте,
	//|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеОпт) КАК КоличествоСтрокВЭквивалентеОпт,
	//|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеРозница) КАК КоличествоСтрокВЭквивалентеРозница,
	//|	ТАБПРОМ1.Склад КАК Склад
	//|ПОМЕСТИТЬ ТАБПРОМ
	//|ИЗ
	//|	ТАБПРОМ1 КАК ТАБПРОМ1
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТАБПРОМ1.Дата,
	//|	ТАБПРОМ1.Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБПРОМ.Дата КАК Дата,
	//|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	//|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	//|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	//|	ТАБПРОМ.Склад КАК Склад,
	//|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквиваленте, 0)) КАК ВсегоСтрокВЭквиваленте,
	//|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК ВсегоСтрокВЭквивалентеОпт,
	//|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК ВсегоСтрокВЭквивалентеРозница
	//|ПОМЕСТИТЬ ТАБКОЛВОСТРОК
	//|ИЗ
	//|	ТАБПРОМ КАК ТАБПРОМ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБПРОМ КАК ТАБСУММАЭКВ
	//|		ПО ТАБПРОМ.Дата >= ТАБСУММАЭКВ.Дата
	//|			И ТАБПРОМ.Склад = ТАБСУММАЭКВ.Склад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТАБПРОМ.Дата,
	//|	ТАБПРОМ.КоличествоСтрокВЭквиваленте,
	//|	ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт,
	//|	ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница,
	//|	ТАБПРОМ.Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБДАТЫЛИМИТЫ.ДАТА КАК ДАТА,
	//|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	//|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	//|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	//|	ТАБДАТЫЛИМИТЫ.Склад КАК Склад,
	//|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокВсего, 0)) КАК ВсегоЛимит,
	//|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокОпт, 0)) КАК ВсегоЛимитОпт,
	//|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокРозница, 0)) КАК ВсегоЛимитРозница
	//|ПОМЕСТИТЬ ТАБЛИМИТЫСУММА
	//|ИЗ
	//|	ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫ
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫСУММА
	//|		ПО ТАБДАТЫЛИМИТЫ.ДАТА >= ТАБДАТЫЛИМИТЫСУММА.ДАТА
	//|			И ТАБДАТЫЛИМИТЫ.Склад = ТАБДАТЫЛИМИТЫСУММА.Склад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТАБДАТЫЛИМИТЫ.ДАТА,
	//|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего,
	//|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт,
	//|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница,
	//|	ТАБДАТЫЛИМИТЫ.Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТАБЛИМИТЫСУММА.ДАТА КАК ДАТА,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	//|	ТАБЛИМИТЫСУММА.Склад КАК Склад,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимит, 0) КАК ВсегоЛимит,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитОпт, 0) КАК ВсегоЛимитОпт,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитРозница, 0) КАК ВсегоЛимитРозница,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквиваленте, 0) КАК ВсегоСтрокВЭквиваленте,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеОпт, 0) КАК ВсегоСтрокВЭквивалентеОпт,
	//|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеРозница, 0) КАК ВсегоСтрокВЭквивалентеРозница,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) КАК ДоступноСтрок,
	////|	ВЫБОР
	////|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	////|				И ЧАС(&ДатаТек) > 10
	////|				И ЧАС(&ДатаТек) < 15
	////|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	////|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0)
	////|	КОНЕЦ КАК ДоступноСтрокОпт, 
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0) КАК ДоступноСтрокОпт,
	//|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0) КАК ДоступноСтрокРозница
	//|ИЗ
	//|	ТАБЛИМИТЫСУММА КАК ТАБЛИМИТЫСУММА
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБКОЛВОСТРОК КАК ТАБКОЛВОСТРОК
	//|		ПО ТАБЛИМИТЫСУММА.Склад = ТАБКОЛВОСТРОК.Склад
	//|			И ТАБЛИМИТЫСУММА.ДАТА = ТАБКОЛВОСТРОК.Дата
	//|ГДЕ
	//|	ТАБЛИМИТЫСУММА.Склад = &Склад";
	
	ДатаСледРабДня = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),1) + ЧАС(ТекущаяДата())*3600+МИНУТА(ТекущаяДата())*60;
	ДатаНеделяЭквивалент = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),5) + ЧАС(ТекущаяДата())*3600;
	
	//Запрос.УстановитьПараметр("ДатаОкон", ДатаНеделяЭквивалент );
	Запрос.УстановитьПараметр("ДатаОкон", ДатаОтгрузки );
	Запрос.УстановитьПараметр("Склад", Склад);
	//Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	//Запрос.УстановитьПараметр("ВидДня1", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный); 
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()-86400*5));
	
	//Если СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
	//	Запрос.УстановитьПараметр("ДатаТек", ТекущаяДата());  	
	//Иначе	
	   	Запрос.УстановитьПараметр("ДатаТек", ДатаСледРабДня);  
	//КонецЕсли;
	
	
	//Если ПриоритетСборки = Перечисления.ПриоритетСборки.Магазины  Тогда
	//   	Если НачалоДня(ДатаСледРабДня) - НачалоДня(ТекущаяДата()) > 1 Тогда		
	//			Запрос.УстановитьПараметр("ДатаТек", НачалоДня(ДатаСледРабДня)+ ЧАС(ТекущаяДата())*3600);	
	//	КонецЕсли;	
	//КонецЕсли;
       
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РБ"));
	Запрос.УстановитьПараметр("ОформлятьСначалаНакладные", ЛОЖЬ); 
	Запрос.УстановитьПараметр("Лук", Справочники.Номенклатура.НайтиПоКоду("00-00000016"));
		
	Если Склад = Справочники.Склады.Склад3
		ИЛИ Склад = Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА) Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  //    семена
	ИначеЕсли Склад = Справочники.Склады.Склад5 Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  //  удобрения
	КонецЕсли;	    
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЛимитСтрок = 0;
	ЭквивалентНеделя = 0;
	
	Если РезультатЗапроса.Количество()>0 Тогда

		//ЭквивалентНеделя = РезультатЗапроса[0].ЭквивалентНеделя;
		//ЭквивалентНеделя = РезультатЗапроса[0].КоличествоЭквивалентНеделя;

		
		//Для каждого стр Из РезультатЗапроса Цикл
		//	Если стр.Дата <= ДатаОтгрузки Тогда
		//		Если ВидДокумента = "ЗаказОпт" Тогда
		//			
		//			Если стр.Дата = НачалоДня(ДатаСледРабДня) 
		//				И Час(ДатаСледРабДня) <= 10 Тогда
		//				
		//				ЛимитСтрок = ЛимитСтрок + стр.ЛимитСтрокОпт - стр.КоличествоСтрокВЭквивалентеОпт;	//Выделить КолВоСтрокОпт и Розница	
		//				
		//			ИначеЕсли стр.Дата = НачалоДня(ДатаСледРабДня) 
		//				И Час(ДатаСледРабДня) > 10 Тогда
		//				
		//				ЛимитСтрок = ЛимитСтрок + стр.ЛимитСтрокВсего - стр.КоличествоСтрокВЭквиваленте;	
		//			Иначе
		//				ЛимитСтрок = ЛимитСтрок + стр.ЛимитСтрокОпт - стр.КоличествоСтрокВЭквивалентеОпт;	//Выделить КолВоСтрокОпт и Розница	
		//			КонецЕсли;
		//		ИначеЕсли ВидДокумента = "ЗаказРозница" Тогда
		//			
		//			ЛимитСтрок =  ЛимитСтрок + стр.ЛимитСтрокРозница - стр.КоличествоСтрокВЭквивалентеРозница;;
		//			
		//		КонецЕсли;
		//	КонецЕсли; 

		////	Если стр.Дата = ДатаОтгрузки
		////		ДоступноСтрок = стр.ДоступноСтрок 0 Тогда			

		////		Прервать;
		////	КонецЕсли;
		//	
		//КонецЦикла; 
		
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Новый Структура("Дата",ДатаОтгрузки));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если ПриоритетСборки = Перечисления.ПриоритетСборки.Клиенты Тогда
				
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрокОпт;
			ИначеЕсли ПриоритетСборки = Перечисления.ПриоритетСборки.Магазины  Тогда
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрокРозница;
			Иначе
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрок;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	

	ДоступноСтрок = ЛимитСтрок;
	
	//Если РезультатЗапроса.Количество()>0 Тогда
	//	Для каждого стр Из РезультатЗапроса Цикл
	//		Если ВидДокумента = "ЗаказОпт" Тогда
	//			Если стр.ДатаОтгрузкиОчередь = НачалоДня(ДатаСледРабДня) 
	//				И Час(ДатаСледРабДня) <= 10 Тогда
	//				
	//				ДоступноСтрок = ДоступноСтрок + стр.ЛимитСтрокОпт - стр.КоличествоСтрокВЭквивалентеОпт;	//Выделить КолВоСтрокОпт и Розница		
	//			ИначеЕсли стр.ДатаОтгрузкиОчередь = НачалоДня(ДатаСледРабДня) 
	//				И Час(ДатаСледРабДня) > 10 Тогда
	//				
	//				ДоступноСтрок = ДоступноСтрок + стр.ЛимитСтрокВсего - стр.КоличествоСтрокВЭквивалентеВсего;	
	//			Иначе
	//				ДоступноСтрок = ДоступноСтрок + стр.ЛимитСтрокОпт - стр.КоличествоСтрокВЭквивалентеОпт;	//Выделить КолВоСтрокОпт и Розница	
	//			КонецЕсли;
	//		ИначеЕсли ВидДокумента = "ЗаказРозница" Тогда
	//			
	//			ДоступноСтрок =  ДоступноСтрок + стр.ЛимитСтрокРозница - стр.КоличествоСтрокВЭквивалентеРозница;
	//			
	//		КонецЕсли;
	//	КонецЦикла; 
	//КонецЕсли;	
	
	Если Константы.ОграничениеПоЭквивалентуСтрок.Получить()=Истина Тогда
	
		ДоступноСтрок = 0 ;
	
	КонецЕсли;
	
	
	Возврат ДоступноСтрок;


КонецФункции // ()


//////ДоступноСтрок 2026-03-15 jadmin
Функция ПолучитьКолВоСтрокЭквивалентОбщий(ТЧ_Товары,Склад,ДатаДок) Экспорт
	СтрокВЭквиваленте = 0;
	
	Запрос = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ_Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ТЗ_ТОВАРЫ
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыТЧ.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТАБЗаказ
		|ИЗ
		|	ВТ_ТЗ_ТОВАРЫ КАК ТоварыТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасценкиКладовщикиСрезПоследних.Цена КАК Цена,
		|	РасценкиКладовщикиСрезПоследних.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РасценкиКладовщикиСрезПоследних.Номенклатура) КАК КолВоСтрок,
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЦенаЭкв,
		|	РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК Коэф,
		|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(РасценкиКладовщикиСрезПоследних.Номенклатура) * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокЭквивалент
		|ИЗ
		|	ТАБЗаказ КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних(&ДатаДок, ) КАК РасценкиКладовщикиСрезПоследних
		|		ПО (ЗаказКлиентаТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
		|	РегистрСведений.РасценкиКладовщики.СрезПоследних(&ДатаДок, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
		|ГДЕ
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &БазоваяНоменклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	РасценкиКладовщикиСрезПоследних.Цена,
		|	РасценкиКладовщикиСрезПоследних.Номенклатура,
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Цена";
	
	Запрос.Текст = ТекстЗапроса;
	Если Склад = Справочники.Склады.Склад3 Тогда
		Запрос.УстановитьПараметр("БазоваяНоменклатура", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  ///1. Семена овощей
	Иначе
		Запрос.УстановитьПараметр("БазоваяНоменклатура", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  ///8.удобрения
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Запрос.УстановитьПараметр("ТЗ_Товары", ТЧ_Товары);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	

	СтрокВЭквиваленте = Окр(РезультатЗапроса.Итог("КолВоСтрокЭквивалент"),0);
	Возврат СтрокВЭквиваленте;
	
КонецФункции

Функция ПолучитьКолВоСтрокЭквивалент(ТЧ_Товары,ГруппыТоваров,Склад,ДатаДок) Экспорт
	СтрокВЭквиваленте = 0;
	
	Запрос = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ_Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ТЗ_ТОВАРЫ
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыТЧ.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТАБЗаказ
		|ИЗ
		|	ВТ_ТЗ_ТОВАРЫ КАК ТоварыТЧ
		|ГДЕ
		|	НЕ ТоварыТЧ.Номенклатура В ИЕРАРХИИ(&ГруппыТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасценкиКладовщикиСрезПоследних.Цена КАК Цена,
		|	РасценкиКладовщикиСрезПоследних.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РасценкиКладовщикиСрезПоследних.Номенклатура) КАК КолВоСтрок,
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЦенаЭкв,
		|	РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК Коэф,
		|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(РасценкиКладовщикиСрезПоследних.Номенклатура) * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокЭквивалент
		|ИЗ
		|	ТАБЗаказ КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних(&ДатаДок, ) КАК РасценкиКладовщикиСрезПоследних
		|		ПО (ЗаказКлиентаТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
		|	РегистрСведений.РасценкиКладовщики.СрезПоследних(&ДатаДок, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
		|ГДЕ
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &БазоваяНоменклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	РасценкиКладовщикиСрезПоследних.Цена,
		|	РасценкиКладовщикиСрезПоследних.Номенклатура,
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Цена";
	
	Запрос.Текст = ТекстЗапроса;
	Если Склад = Справочники.Склады.Склад3 Тогда
		Запрос.УстановитьПараметр("БазоваяНоменклатура", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  ///1. Семена овощей
	Иначе
		Запрос.УстановитьПараметр("БазоваяНоменклатура", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  ///8.удобрения
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Запрос.УстановитьПараметр("ТЗ_Товары", ТЧ_Товары);
	Запрос.УстановитьПараметр("ГруппыТоваров", ГруппыТоваров);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	

	СтрокВЭквиваленте = Окр(РезультатЗапроса.Итог("КолВоСтрокЭквивалент"),0);
	Возврат СтрокВЭквиваленте;
	
КонецФункции

Функция ДоступноСтрокКСборке(Склад, ГруппыТовара, ДатаОтгрузки, ДатаДок, ПриоритетСборки = Неопределено,СпособДоставки) Экспорт
	
	ДоступноСтрок = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  	
	///v5
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДАТА,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокВсего
	|	КОНЕЦ КАК ЛимитСтрокВсего,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) < 34200
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокОпт
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокОпт
	|	КОНЕЦ КАК ЛимитСтрокОпт,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) < 34200
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокРозница
	|	КОНЕЦ КАК ЛимитСтрокРозница,
	|	ЛимитыСборкиСклада.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБДАТЫЛИМИТЫ
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
	|		ПО (ЛимитыСборкиСклада.Период = ДанныеПроизводственногоКалендаря.Дата)  
	|		И ЛимитыСборкиСклада.ГруппаТовара = &ГруппаТовараПустая
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И ЛимитыСборкиСклада.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК Распоряжение,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад КАК Склад,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение КАК Помещение,
	|	СУММА(ВЫРАЗИТЬ(1 * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1))) КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБПОМЕЩЕНИЯ
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
	|		ПО (ЗаказКлиентаТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
	|	РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
	|	И НЕ ЗаказКлиентаТовары.Номенклатура.Родитель В ИЕРАРХИИ (&ГруппыТовара)
	|	И РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
	|	И ЗаказКлиентаТовары.Ссылка.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение,
	|	СУММА(ВЫРАЗИТЬ(1 * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)))
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
	|		ПО (ЗаказНаПеремещениеТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
	|	РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
	|	И НЕ ЗаказНаПеремещениеТовары.Номенклатура.Родитель В ИЕРАРХИИ (&ГруппыТовара)
	|	И РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
	|	И ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
	|	ВложенныйЗапрос.Получатель КАК Получатель,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ КАК Состояние
	|ПОМЕСТИТЬ РаспоряженияИСостояния
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
	|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
	|		РаспоряженияКОтгрузке.Серия КАК Серия,
	|		ВЫБОР
	|			КОГДА &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|					ИЛИ НЕ &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|				ТОГДА 0
	|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	|				ТОГДА 1
	|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|				ТОГДА 2
	|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	|				ТОГДА 3
	|			ИНАЧЕ 404
	|		КОНЕЦ КАК Состояние
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки({() КАК Поле2}, {(Склад = &Склад) КАК Поле2}) КАК РаспоряженияКОтгрузке
	|	ГДЕ
	|		(РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	|				ИЛИ (&ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|					ИЛИ НЕ &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0)
	|				ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	|				ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0)) КАК ВложенныйЗапрос
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказНаПеремещение)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ДокументОтгрузки,
	|	ВложенныйЗапрос.Получатель
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
	|	РаспоряженияИСостояния.Получатель КАК Получатель,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) КАК ТипДокумента,
	|	РаспоряженияИСостояния.Состояние КАК Состояние,
	|	0 КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ КАК ЖелаемаяДатаОтгрузки,
	|	ТАБПОМЕЩЕНИЯ.Помещение КАК Помещение,
	|	ТАБПОМЕЩЕНИЯ.КолВоСтрок КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБОбщая
	|ИЗ
	|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ПО РаспоряженияИСостояния.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБПОМЕЩЕНИЯ КАК ТАБПОМЕЩЕНИЯ
	|		ПО РаспоряженияИСостояния.Распоряжение = ТАБПОМЕЩЕНИЯ.Распоряжение
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) <> ТИП(Документ.СборкаТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияИСостояния.Распоряжение,
	|	РаспоряженияИСостояния.Получатель,
	|	РаспоряженияИСостояния.Состояние,
	|	ТАБПОМЕЩЕНИЯ.Помещение,
	|	ТАБПОМЕЩЕНИЯ.КолВоСтрок,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБОБЩАЯ.Распоряжение КАК Распоряжение,
	|	ТАБОБЩАЯ.Помещение КАК Помещение,
	|	ТАБОБЩАЯ.КолВоСтрок КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБВСЕЗАКАЗЫ
	|ИЗ
	|	ТАБОбщая КАК ТАБОБЩАЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБВСЕЗАКАЗЫ.Распоряжение КАК Распоряжение,
	|	ТАБВСЕЗАКАЗЫ.Помещение КАК Помещение,
	|	ТАБВСЕЗАКАЗЫ.КолВоСтрок КАК КолВоСтрок,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ КАК ДатаОтгрузкиОчередь,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладОтправитель
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Склад
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Склад,
	|	ТАБВСЕЗАКАЗЫ.Распоряжение.Приоритет КАК Приоритет,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладПолучатель
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Партнер
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Получатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Клиенты)
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Магазины)
	|	КОНЕЦ КАК ПриоритетСборки,
	|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Номер, NULL) КАК НомерЗаданияНаПеревозку
	|ПОМЕСТИТЬ ТАБИТОГОВАЯ
	|ИЗ
	|	ТАБВСЕЗАКАЗЫ КАК ТАБВСЕЗАКАЗЫ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ПО ТАБВСЕЗАКАЗЫ.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБИТОГОВАЯ.Распоряжение КАК Распоряжение,
	|	ТАБИТОГОВАЯ.Помещение КАК Помещение,
	|	ТАБИТОГОВАЯ.КолВоСтрок КАК КолВоСтрок,
	|	ТАБИТОГОВАЯ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	|	ТАБИТОГОВАЯ.Склад КАК Склад,
	|	ТАБИТОГОВАЯ.Приоритет КАК Приоритет,
	|	ТАБИТОГОВАЯ.Получатель КАК Получатель,
	|	ТАБИТОГОВАЯ.ПриоритетСборки КАК ПриоритетСборки,
	|	ТАБИТОГОВАЯ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку
	|ПОМЕСТИТЬ ТАБ
	|ИЗ
	|	ТАБИТОГОВАЯ КАК ТАБИТОГОВАЯ
	|ГДЕ
	|	ТАБИТОГОВАЯ.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБ.Распоряжение КАК Распоряжение,
	|	ТАБ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	|	ТАБ.Приоритет КАК Приоритет,
	|	ТАБ.КолВоСтрок КАК НомерСтроки,
	|	ТАБ.Помещение КАК СсылкаПомещение,
	|	ТАБ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку,
	|	ТАБ.Склад КАК Склад,
	|	ТАБ.КолВоСтрок КАК КоличествоСтрокВЭквиваленте,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБ.КолВоСтрок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеОпт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБ.КолВоСтрок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеРозница
	|ПОМЕСТИТЬ ТАБИТОГ
	|ИЗ
	|	ТАБ КАК ТАБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) КАК Дата,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквиваленте, 0)) КАК КоличествоСтрокВЭквиваленте,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК КоличествоСтрокВЭквивалентеОпт,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБИТОГ.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБПРОМ1
	|ИЗ
	|	ТАБИТОГ КАК ТАБИТОГ
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) <= &ДатаОкон
	|	И ТАБИТОГ.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ),
	|	ТАБИТОГ.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата,
	|	0,
	|	0,
	|	0,
	|	&Склад
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|			ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБПРОМ1.Дата КАК Дата,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквиваленте) КАК КоличествоСтрокВЭквиваленте,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеОпт) КАК КоличествоСтрокВЭквивалентеОпт,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеРозница) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ1.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБПРОМ
	|ИЗ
	|	ТАБПРОМ1 КАК ТАБПРОМ1
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБПРОМ1.Дата,
	|	ТАБПРОМ1.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБПРОМ.Дата КАК Дата,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквиваленте, 0)) КАК ВсегоСтрокВЭквиваленте,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК ВсегоСтрокВЭквивалентеОпт,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК ВсегоСтрокВЭквивалентеРозница
	|ПОМЕСТИТЬ ТАБКОЛВОСТРОК
	|ИЗ
	|	ТАБПРОМ КАК ТАБПРОМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБПРОМ КАК ТАБСУММАЭКВ
	|		ПО ТАБПРОМ.Дата >= ТАБСУММАЭКВ.Дата
	|			И ТАБПРОМ.Склад = ТАБСУММАЭКВ.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБПРОМ.Дата,
	|	ТАБПРОМ.КоличествоСтрокВЭквиваленте,
	|	ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт,
	|	ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБДАТЫЛИМИТЫ.ДАТА КАК ДАТА,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	|	ТАБДАТЫЛИМИТЫ.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокВсего, 0)) КАК ВсегоЛимит,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокОпт, 0)) КАК ВсегоЛимитОпт,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокРозница, 0)) КАК ВсегоЛимитРозница
	|ПОМЕСТИТЬ ТАБЛИМИТЫСУММА
	|ИЗ
	|	ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫСУММА
	|		ПО ТАБДАТЫЛИМИТЫ.ДАТА >= ТАБДАТЫЛИМИТЫСУММА.ДАТА
	|			И ТАБДАТЫЛИМИТЫ.Склад = ТАБДАТЫЛИМИТЫСУММА.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБДАТЫЛИМИТЫ.ДАТА,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница,
	|	ТАБДАТЫЛИМИТЫ.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБЛИМИТЫСУММА.ДАТА КАК ДАТА,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	|	ТАБЛИМИТЫСУММА.Склад КАК Склад,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимит, 0) КАК ВсегоЛимит,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитОпт, 0) КАК ВсегоЛимитОпт,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитРозница, 0) КАК ВсегоЛимитРозница,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквиваленте, 0) КАК ВсегоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеОпт, 0) КАК ВсегоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеРозница, 0) КАК ВсегоСтрокВЭквивалентеРозница,             	
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800            
	//|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)  
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)

	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|	КОНЕЦ КАК ДоступноСтрок,
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800            
	//|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) 
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0)
	|	КОНЕЦ КАК ДоступноСтрокОпт,
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	//|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5  - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)  - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0)
	|	КОНЕЦ КАК ДоступноСтрокРозница
	|ИЗ
	|	ТАБЛИМИТЫСУММА КАК ТАБЛИМИТЫСУММА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБКОЛВОСТРОК КАК ТАБКОЛВОСТРОК
	|		ПО ТАБЛИМИТЫСУММА.Склад = ТАБКОЛВОСТРОК.Склад
	|			И ТАБЛИМИТЫСУММА.ДАТА = ТАБКОЛВОСТРОК.Дата
	|ГДЕ
	|	ТАБЛИМИТЫСУММА.Склад = &Склад";
		
	ДатаСледРабДня = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),1) + ЧАС(ТекущаяДата())*3600+МИНУТА(ТекущаяДата())*60;
	ДатаНеделяЭквивалент = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),5) + ЧАС(ТекущаяДата())*3600;
	
	//Запрос.УстановитьПараметр("ДатаОкон", ДатаНеделяЭквивалент );
	Запрос.УстановитьПараметр("ДатаОкон", ДатаОтгрузки );
	Запрос.УстановитьПараметр("Склад", Склад);
	//Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	//Запрос.УстановитьПараметр("ВидДня1", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный); 
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()-86400*5));
	
	//Если СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
	//	Запрос.УстановитьПараметр("ДатаТек", ТекущаяДата());  	
	//Иначе	
	   	Запрос.УстановитьПараметр("ДатаТек", ДатаСледРабДня);  
	//КонецЕсли;
	
	
	//Если ПриоритетСборки = Перечисления.ПриоритетСборки.Магазины  Тогда
	//   	Если НачалоДня(ДатаСледРабДня) - НачалоДня(ТекущаяДата()) > 1 Тогда		
	//			Запрос.УстановитьПараметр("ДатаТек", НачалоДня(ДатаСледРабДня)+ ЧАС(ТекущаяДата())*3600);	
	//	КонецЕсли;	
	//КонецЕсли;
       
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РБ"));
	Запрос.УстановитьПараметр("ОформлятьСначалаНакладные", ЛОЖЬ); 
	Запрос.УстановитьПараметр("ГруппаТовараПустая", Справочники.Номенклатура.ПустаяСсылка());
	Запрос.УстановитьПараметр("ГруппыТовара", ГруппыТовара);
		
	Если Склад = Справочники.Склады.Склад3
		ИЛИ Склад = Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА) Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  //    семена
	ИначеЕсли Склад = Справочники.Склады.Склад5 Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  //  удобрения
	КонецЕсли;	    
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЛимитСтрок = 0;
	ЭквивалентНеделя = 0;
	
	Если РезультатЗапроса.Количество()>0 Тогда

		//ЭквивалентНеделя = РезультатЗапроса[0].ЭквивалентНеделя;
		//ЭквивалентНеделя = РезультатЗапроса[0].КоличествоЭквивалентНеделя;

		
		//Для каждого стр Из РезультатЗапроса Цикл
		//	Если стр.Дата <= ДатаОтгрузки Тогда
		//		Если ВидДокумента = "ЗаказОпт" Тогда
		//			
		//			Если стр.Дата = НачалоДня(ДатаСледРабДня) 
		//				И Час(ДатаСледРабДня) <= 10 Тогда
		//				
		//				ЛимитСтрок = ЛимитСтрок + стр.ЛимитСтрокОпт - стр.КоличествоСтрокВЭквивалентеОпт;	//Выделить КолВоСтрокОпт и Розница	
		//				
		//			ИначеЕсли стр.Дата = НачалоДня(ДатаСледРабДня) 
		//				И Час(ДатаСледРабДня) > 10 Тогда
		//				
		//				ЛимитСтрок = ЛимитСтрок + стр.ЛимитСтрокВсего - стр.КоличествоСтрокВЭквиваленте;	
		//			Иначе
		//				ЛимитСтрок = ЛимитСтрок + стр.ЛимитСтрокОпт - стр.КоличествоСтрокВЭквивалентеОпт;	//Выделить КолВоСтрокОпт и Розница	
		//			КонецЕсли;
		//		ИначеЕсли ВидДокумента = "ЗаказРозница" Тогда
		//			
		//			ЛимитСтрок =  ЛимитСтрок + стр.ЛимитСтрокРозница - стр.КоличествоСтрокВЭквивалентеРозница;;
		//			
		//		КонецЕсли;
		//	КонецЕсли; 

		////	Если стр.Дата = ДатаОтгрузки
		////		ДоступноСтрок = стр.ДоступноСтрок 0 Тогда			

		////		Прервать;
		////	КонецЕсли;
		//	
		//КонецЦикла; 
		
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Новый Структура("Дата",ДатаОтгрузки));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если ПриоритетСборки = Перечисления.ПриоритетСборки.Клиенты Тогда
				
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрокОпт;
			ИначеЕсли ПриоритетСборки = Перечисления.ПриоритетСборки.Магазины  Тогда
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрокРозница;
			Иначе
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрок;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	

	ДоступноСтрок = ЛимитСтрок;
	
	//Если РезультатЗапроса.Количество()>0 Тогда
	//	Для каждого стр Из РезультатЗапроса Цикл
	//		Если ВидДокумента = "ЗаказОпт" Тогда
	//			Если стр.ДатаОтгрузкиОчередь = НачалоДня(ДатаСледРабДня) 
	//				И Час(ДатаСледРабДня) <= 10 Тогда
	//				
	//				ДоступноСтрок = ДоступноСтрок + стр.ЛимитСтрокОпт - стр.КоличествоСтрокВЭквивалентеОпт;	//Выделить КолВоСтрокОпт и Розница		
	//			ИначеЕсли стр.ДатаОтгрузкиОчередь = НачалоДня(ДатаСледРабДня) 
	//				И Час(ДатаСледРабДня) > 10 Тогда
	//				
	//				ДоступноСтрок = ДоступноСтрок + стр.ЛимитСтрокВсего - стр.КоличествоСтрокВЭквивалентеВсего;	
	//			Иначе
	//				ДоступноСтрок = ДоступноСтрок + стр.ЛимитСтрокОпт - стр.КоличествоСтрокВЭквивалентеОпт;	//Выделить КолВоСтрокОпт и Розница	
	//			КонецЕсли;
	//		ИначеЕсли ВидДокумента = "ЗаказРозница" Тогда
	//			
	//			ДоступноСтрок =  ДоступноСтрок + стр.ЛимитСтрокРозница - стр.КоличествоСтрокВЭквивалентеРозница;
	//			
	//		КонецЕсли;
	//	КонецЦикла; 
	//КонецЕсли;	
	
	Если Константы.ОграничениеПоЭквивалентуСтрок.Получить()=Истина Тогда
	
		ДоступноСтрок = 0 ;
	
	КонецЕсли;
	
	
	Возврат ДоступноСтрок;


КонецФункции // ()

 Функция ПолучитьКолВоСтрокЭквивалентОтдельныеГруппыТовара(ТЧ_Товары,ГруппыТовара,Склад,ДатаДок) Экспорт
	СтрокВЭквиваленте = 0;
	
	Запрос = Новый Запрос;
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТЗ_Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ТЗ_ТОВАРЫ
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыТЧ.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТАБЗаказ
		|ИЗ
		|	ВТ_ТЗ_ТОВАРЫ КАК ТоварыТЧ
		|ГДЕ
		|	ТоварыТЧ.Номенклатура В ИЕРАРХИИ(&ГруппыТовара)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасценкиКладовщикиСрезПоследних.Цена КАК Цена,
		|	РасценкиКладовщикиСрезПоследних.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РасценкиКладовщикиСрезПоследних.Номенклатура) КАК КолВоСтрок,
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЦенаЭкв,
		|	РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК Коэф,
		|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(РасценкиКладовщикиСрезПоследних.Номенклатура) * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокЭквивалент
		|ИЗ
		|	ТАБЗаказ КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних(&ДатаДок, ) КАК РасценкиКладовщикиСрезПоследних
		|		ПО (ЗаказКлиентаТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
		|	РегистрСведений.РасценкиКладовщики.СрезПоследних(&ДатаДок, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
		|ГДЕ
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &БазоваяНоменклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	РасценкиКладовщикиСрезПоследних.Цена,
		|	РасценкиКладовщикиСрезПоследних.Номенклатура,
		|	РасценкиКладовщикиСрезПоследнихБАЗА.Цена";
	
	Запрос.Текст = ТекстЗапроса;
	Если Склад = Справочники.Склады.Склад3 Тогда
		Запрос.УстановитьПараметр("БазоваяНоменклатура", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  ///1. Семена овощей
	Иначе
		Запрос.УстановитьПараметр("БазоваяНоменклатура", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  ///8.удобрения
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Запрос.УстановитьПараметр("ТЗ_Товары", ТЧ_Товары);
	Запрос.УстановитьПараметр("ГруппыТовара", ГруппыТовара);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	

	СтрокВЭквиваленте = Окр(РезультатЗапроса.Итог("КолВоСтрокЭквивалент"),0);
	Возврат СтрокВЭквиваленте;
	
КонецФункции

Функция ДоступноСтрокКСборкеОтдельныеГруппыТовара(Склад, ГруппаНоменклатуры, ДатаОтгрузки, ДатаДок, ПриоритетСборки = Неопределено,СпособДоставки) Экспорт	

	
	ДоступноСтрок = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  	
	///v5
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата КАК ДАТА,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокВсего
	|	КОНЕЦ КАК ЛимитСтрокВсего,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) < 34200
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокОпт
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокОпт
	|	КОНЕЦ КАК ЛимитСтрокОпт,
	|	ВЫБОР
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) < 34200
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
	|			ТОГДА 0
	|		КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|			ТОГДА 0
	|		ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокРозница
	|	КОНЕЦ КАК ЛимитСтрокРозница,
	|	ЛимитыСборкиСклада.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБДАТЫЛИМИТЫ
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
	|		ПО (ЛимитыСборкиСклада.Период = ДанныеПроизводственногоКалендаря.Дата) 
	|		И ЛимитыСборкиСклада.ГруппаТовара = &ГруппаНоменклатуры
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И ЛимитыСборкиСклада.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК Распоряжение,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад КАК Склад,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение КАК Помещение,
	|	СУММА(ВЫРАЗИТЬ(1 * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1))) КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБПОМЕЩЕНИЯ
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
	|		ПО (ЗаказКлиентаТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
	|	РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
	|	И ЗаказКлиентаТовары.Номенклатура.Родитель В ИЕРАРХИИ (&ГруппаНоменклатуры)
	|	И РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
	|	И ЗаказКлиентаТовары.Ссылка.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.Склад,
	|	ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение,
	|	СУММА(ВЫРАЗИТЬ(1 * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)))
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
	|		ПО (ЗаказНаПеремещениеТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
	|				ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
	|	РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
	|	И ЗаказНаПеремещениеТовары.Номенклатура.Родитель В ИЕРАРХИИ (&ГруппаНоменклатуры)
	|	И РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
	|	И ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
	|	ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
	|	ВложенныйЗапрос.Получатель КАК Получатель,
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ КАК Состояние
	|ПОМЕСТИТЬ РаспоряженияИСостояния
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
	|		РаспоряженияКОтгрузке.Получатель КАК Получатель,
	|		РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
	|		РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
	|		РаспоряженияКОтгрузке.Назначение КАК Назначение,
	|		РаспоряженияКОтгрузке.Серия КАК Серия,
	|		ВЫБОР
	|			КОГДА &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|					ИЛИ НЕ &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|				ТОГДА 0
	|			КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	|				ТОГДА 1
	|			КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|				ТОГДА 2
	|			КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	|				ТОГДА 3
	|			ИНАЧЕ 404
	|		КОНЕЦ КАК Состояние
	|	ИЗ
	|		РегистрНакопления.ТоварыКОтгрузке.Остатки({() КАК Поле2}, {(Склад = &Склад) КАК Поле2}) КАК РаспоряженияКОтгрузке
	|	ГДЕ
	|		(РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
	|				ИЛИ (&ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
	|					ИЛИ НЕ &ОформлятьСначалаНакладные
	|						И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0)
	|				ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
	|				ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0)) КАК ВложенныйЗапрос
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказНаПеремещение)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ДокументОтгрузки,
	|	ВложенныйЗапрос.Получатель
	|
	|ИМЕЮЩИЕ
	|	ВЫБОР
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
	|		КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
	|	КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
	|	РаспоряженияИСостояния.Получатель КАК Получатель,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
	|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) КАК ТипДокумента,
	|	РаспоряженияИСостояния.Состояние КАК Состояние,
	|	0 КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ КАК ЖелаемаяДатаОтгрузки,
	|	ТАБПОМЕЩЕНИЯ.Помещение КАК Помещение,
	|	ТАБПОМЕЩЕНИЯ.КолВоСтрок КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБОбщая
	|ИЗ
	|	РаспоряженияИСостояния КАК РаспоряженияИСостояния
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ПО РаспоряженияИСостояния.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБПОМЕЩЕНИЯ КАК ТАБПОМЕЩЕНИЯ
	|		ПО РаспоряженияИСостояния.Распоряжение = ТАБПОМЕЩЕНИЯ.Распоряжение
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) <> ТИП(Документ.СборкаТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияИСостояния.Распоряжение,
	|	РаспоряженияИСостояния.Получатель,
	|	РаспоряженияИСостояния.Состояние,
	|	ТАБПОМЕЩЕНИЯ.Помещение,
	|	ТАБПОМЕЩЕНИЯ.КолВоСтрок,
	|	ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
	|	ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБОБЩАЯ.Распоряжение КАК Распоряжение,
	|	ТАБОБЩАЯ.Помещение КАК Помещение,
	|	ТАБОБЩАЯ.КолВоСтрок КАК КолВоСтрок
	|ПОМЕСТИТЬ ТАБВСЕЗАКАЗЫ
	|ИЗ
	|	ТАБОбщая КАК ТАБОБЩАЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБВСЕЗАКАЗЫ.Распоряжение КАК Распоряжение,
	|	ТАБВСЕЗАКАЗЫ.Помещение КАК Помещение,
	|	ТАБВСЕЗАКАЗЫ.КолВоСтрок КАК КолВоСтрок,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|						ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
	|					КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|						ТОГДА КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ДатаОтгрузки, ДЕНЬ)
	|					ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
	|	КОНЕЦ КАК ДатаОтгрузкиОчередь,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладОтправитель
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Склад
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Склад,
	|	ТАБВСЕЗАКАЗЫ.Распоряжение.Приоритет КАК Приоритет,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладПолучатель
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Партнер
	|		ИНАЧЕ NULL
	|	КОНЕЦ КАК Получатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Клиенты)
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Магазины)
	|	КОНЕЦ КАК ПриоритетСборки,
	|	ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Номер, NULL) КАК НомерЗаданияНаПеревозку
	|ПОМЕСТИТЬ ТАБИТОГОВАЯ
	|ИЗ
	|	ТАБВСЕЗАКАЗЫ КАК ТАБВСЕЗАКАЗЫ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|		ПО ТАБВСЕЗАКАЗЫ.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
	|			И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
	|			И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБИТОГОВАЯ.Распоряжение КАК Распоряжение,
	|	ТАБИТОГОВАЯ.Помещение КАК Помещение,
	|	ТАБИТОГОВАЯ.КолВоСтрок КАК КолВоСтрок,
	|	ТАБИТОГОВАЯ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	|	ТАБИТОГОВАЯ.Склад КАК Склад,
	|	ТАБИТОГОВАЯ.Приоритет КАК Приоритет,
	|	ТАБИТОГОВАЯ.Получатель КАК Получатель,
	|	ТАБИТОГОВАЯ.ПриоритетСборки КАК ПриоритетСборки,
	|	ТАБИТОГОВАЯ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку
	|ПОМЕСТИТЬ ТАБ
	|ИЗ
	|	ТАБИТОГОВАЯ КАК ТАБИТОГОВАЯ
	|ГДЕ
	|	ТАБИТОГОВАЯ.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБ.Распоряжение КАК Распоряжение,
	|	ТАБ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
	|	ТАБ.Приоритет КАК Приоритет,
	|	ТАБ.КолВоСтрок КАК НомерСтроки,
	|	ТАБ.Помещение КАК СсылкаПомещение,
	|	ТАБ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку,
	|	ТАБ.Склад КАК Склад,
	|	ТАБ.КолВоСтрок КАК КоличествоСтрокВЭквиваленте,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
	|			ТОГДА ТАБ.КолВоСтрок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеОпт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
	|			ТОГДА ТАБ.КолВоСтрок
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоСтрокВЭквивалентеРозница
	|ПОМЕСТИТЬ ТАБИТОГ
	|ИЗ
	|	ТАБ КАК ТАБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) КАК Дата,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквиваленте, 0)) КАК КоличествоСтрокВЭквиваленте,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК КоличествоСтрокВЭквивалентеОпт,
	|	СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБИТОГ.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБПРОМ1
	|ИЗ
	|	ТАБИТОГ КАК ТАБИТОГ
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) <= &ДатаОкон
	|	И ТАБИТОГ.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ),
	|	ТАБИТОГ.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.Дата,
	|	0,
	|	0,
	|	0,
	|	&Склад
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
	|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|			ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБПРОМ1.Дата КАК Дата,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквиваленте) КАК КоличествоСтрокВЭквиваленте,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеОпт) КАК КоличествоСтрокВЭквивалентеОпт,
	|	СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеРозница) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ1.Склад КАК Склад
	|ПОМЕСТИТЬ ТАБПРОМ
	|ИЗ
	|	ТАБПРОМ1 КАК ТАБПРОМ1
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБПРОМ1.Дата,
	|	ТАБПРОМ1.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБПРОМ.Дата КАК Дата,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквиваленте, 0)) КАК ВсегоСтрокВЭквиваленте,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК ВсегоСтрокВЭквивалентеОпт,
	|	СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК ВсегоСтрокВЭквивалентеРозница
	|ПОМЕСТИТЬ ТАБКОЛВОСТРОК
	|ИЗ
	|	ТАБПРОМ КАК ТАБПРОМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБПРОМ КАК ТАБСУММАЭКВ
	|		ПО ТАБПРОМ.Дата >= ТАБСУММАЭКВ.Дата
	|			И ТАБПРОМ.Склад = ТАБСУММАЭКВ.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБПРОМ.Дата,
	|	ТАБПРОМ.КоличествоСтрокВЭквиваленте,
	|	ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт,
	|	ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница,
	|	ТАБПРОМ.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБДАТЫЛИМИТЫ.ДАТА КАК ДАТА,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	|	ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	|	ТАБДАТЫЛИМИТЫ.Склад КАК Склад,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокВсего, 0)) КАК ВсегоЛимит,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокОпт, 0)) КАК ВсегоЛимитОпт,
	|	СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокРозница, 0)) КАК ВсегоЛимитРозница
	|ПОМЕСТИТЬ ТАБЛИМИТЫСУММА
	|ИЗ
	|	ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫСУММА
	|		ПО ТАБДАТЫЛИМИТЫ.ДАТА >= ТАБДАТЫЛИМИТЫСУММА.ДАТА
	|			И ТАБДАТЫЛИМИТЫ.Склад = ТАБДАТЫЛИМИТЫСУММА.Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ТАБДАТЫЛИМИТЫ.ДАТА,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт,
	|	ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница,
	|	ТАБДАТЫЛИМИТЫ.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТАБЛИМИТЫСУММА.ДАТА КАК ДАТА,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
	|	ТАБЛИМИТЫСУММА.Склад КАК Склад,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимит, 0) КАК ВсегоЛимит,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитОпт, 0) КАК ВсегоЛимитОпт,
	|	ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитРозница, 0) КАК ВсегоЛимитРозница,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквиваленте, 0) КАК ВсегоСтрокВЭквиваленте,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеОпт, 0) КАК ВсегоСтрокВЭквивалентеОпт,
	|	ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеРозница, 0) КАК ВсегоСтрокВЭквивалентеРозница,             	
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800            
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|	КОНЕЦ КАК ДоступноСтрок,
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800            
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0)
	|	КОНЕЦ КАК ДоступноСтрокОпт,
	|	ВЫБОР
	|		КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
	|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
	|			ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0)/8*6.5  - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0)
	|	КОНЕЦ КАК ДоступноСтрокРозница
	|ИЗ
	|	ТАБЛИМИТЫСУММА КАК ТАБЛИМИТЫСУММА
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБКОЛВОСТРОК КАК ТАБКОЛВОСТРОК
	|		ПО ТАБЛИМИТЫСУММА.Склад = ТАБКОЛВОСТРОК.Склад
	|			И ТАБЛИМИТЫСУММА.ДАТА = ТАБКОЛВОСТРОК.Дата
	|ГДЕ
	|	ТАБЛИМИТЫСУММА.Склад = &Склад";
	
	
	
	ДатаСледРабДня = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),1) + ЧАС(ТекущаяДата())*3600+МИНУТА(ТекущаяДата())*60;
	ДатаНеделяЭквивалент = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),5) + ЧАС(ТекущаяДата())*3600;
	
	//Запрос.УстановитьПараметр("ДатаОкон", ДатаНеделяЭквивалент );
	Запрос.УстановитьПараметр("ДатаОкон", ДатаОтгрузки );
	Запрос.УстановитьПараметр("Склад", Склад);
	//Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	//Запрос.УстановитьПараметр("ВидДня1", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный); 
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()-86400*5));
	
	//Если СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
	//	Запрос.УстановитьПараметр("ДатаТек", ТекущаяДата());  	
	//Иначе	
	   	Запрос.УстановитьПараметр("ДатаТек", ДатаСледРабДня);  
	//КонецЕсли;
	
	
	//Если ПриоритетСборки = Перечисления.ПриоритетСборки.Магазины  Тогда
	//   	Если НачалоДня(ДатаСледРабДня) - НачалоДня(ТекущаяДата()) > 1 Тогда		
	//			Запрос.УстановитьПараметр("ДатаТек", НачалоДня(ДатаСледРабДня)+ ЧАС(ТекущаяДата())*3600);	
	//	КонецЕсли;	
	//КонецЕсли;
       
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РБ"));
	Запрос.УстановитьПараметр("ОформлятьСначалаНакладные", ЛОЖЬ); 
	Запрос.УстановитьПараметр("ГруппаНоменклатуры", ГруппаНоменклатуры);           //Лук, Картошка
		
	Если Склад = Справочники.Склады.Склад3
		ИЛИ Склад = Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА) Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  //    семена
	ИначеЕсли Склад = Справочники.Склады.Склад5 Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  //  удобрения
	КонецЕсли;	    
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЛимитСтрок = 0;
	ЭквивалентНеделя = 0;
	
	Если РезультатЗапроса.Количество()>0 Тогда
		
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Новый Структура("Дата",ДатаОтгрузки));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если ПриоритетСборки = Перечисления.ПриоритетСборки.Клиенты Тогда
				
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрокОпт;
			ИначеЕсли ПриоритетСборки = Перечисления.ПриоритетСборки.Магазины  Тогда
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрокРозница;
			Иначе
				ЛимитСтрок =  НайденныеСтроки[0].ДоступноСтрок;		
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	

	ДоступноСтрок = ЛимитСтрок;
		
	
	Если Константы.ОграничениеПоЭквивалентуСтрок.Получить()=Истина Тогда
	
		ДоступноСтрок = 0 ;
	
	КонецЕсли;
	
	
	Возврат ДоступноСтрок;


КонецФункции // ()
/////





Функция ДоступноСтрокКСборке_ЗАДАНИЕ_НА_ПЕРЕВОЗКУ(Склад, ДатаОтгрузки, ДатаДок, ПриоритетСборки = Неопределено,СпособДоставки) Экспорт
	

	
	
	ДоступноСтрок = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  	
	///v5
	"ВЫБРАТЬ
    |   ДанныеПроизводственногоКалендаря.Дата КАК ДАТА,
    |   ВЫБОР
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
    |           ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
    |           ТОГДА 0
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |           ТОГДА 0
    |       ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокВсего
    |   КОНЕЦ КАК ЛимитСтрокВсего,
    |   ВЫБОР
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) < 34200
    |           ТОГДА ЛимитыСборкиСклада.ЛимитСтрокОпт
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
    |           ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
    |           ТОГДА 0
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |           ТОГДА 0
    |       ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокОпт
    |   КОНЕЦ КАК ЛимитСтрокОпт,
    |   ВЫБОР
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) < 34200
    |           ТОГДА 0
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
    |           ТОГДА ЛимитыСборкиСклада.ЛимитСтрокВсего
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) > 37800
    |           ТОГДА 0
    |       КОГДА ДанныеПроизводственногоКалендаря.Дата < НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |           ТОГДА 0
    |       ИНАЧЕ ЛимитыСборкиСклада.ЛимитСтрокРозница
    |   КОНЕЦ КАК ЛимитСтрокРозница,
    |   ЛимитыСборкиСклада.Склад КАК Склад
    |ПОМЕСТИТЬ ТАБДАТЫЛИМИТЫ
    |ИЗ
    |   РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
    |       ПО (ЛимитыСборкиСклада.Период = ДанныеПроизводственногоКалендаря.Дата)
    |ГДЕ
    |   ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
    |   И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
    |   И ЛимитыСборкиСклада.Склад = &Склад
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ЗаказКлиентаТовары.Ссылка КАК Распоряжение,
    |   ЗаказКлиентаТовары.Номенклатура.Родитель.Склад КАК Склад,
    |   ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение КАК Помещение,
    |   СУММА(ВЫРАЗИТЬ(1 * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1))) КАК КолВоСтрок
    |ПОМЕСТИТЬ ТАБПОМЕЩЕНИЯ
    |ИЗ
    |   Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
    |       ПО (ЗаказКлиентаТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
    |   РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
    |ГДЕ
    |   ЗаказКлиентаТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
    |   И НЕ ЗаказКлиентаТовары.Номенклатура.Родитель В ИЕРАРХИИ (&Лук)
    |   И РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
    |   И ЗаказКлиентаТовары.Ссылка.Склад = &Склад
    |
    |СГРУППИРОВАТЬ ПО
    |   ЗаказКлиентаТовары.Ссылка,
    |   ЗаказКлиентаТовары.Номенклатура.Родитель.Склад,
    |   ЗаказКлиентаТовары.Номенклатура.Родитель.СкладскоеПомещение
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЗаказНаПеремещениеТовары.Ссылка,
    |   ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
    |   ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение,
    |   СУММА(ВЫРАЗИТЬ(1 * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)))
    |ИЗ
    |   Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
    |       ПО (ЗаказНаПеремещениеТовары.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура),
    |   РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
    |ГДЕ
    |   ЗаказНаПеремещениеТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
    |   И НЕ ЗаказНаПеремещениеТовары.Номенклатура.Родитель В ИЕРАРХИИ (&Лук)
    |   И РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
    |   И ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель = &Склад
    |
    |СГРУППИРОВАТЬ ПО
    |   ЗаказНаПеремещениеТовары.Ссылка,
    |   ЗаказНаПеремещениеТовары.Номенклатура.Родитель.Склад,
    |   ЗаказНаПеремещениеТовары.Номенклатура.Родитель.СкладскоеПомещение
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ВложенныйЗапрос.ДокументОтгрузки КАК Распоряжение,
    |   ВложенныйЗапрос.Получатель КАК Получатель,
    |   ВЫБОР
    |       КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
    |       КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
    |       КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
    |       КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
    |   КОНЕЦ КАК Состояние
    |ПОМЕСТИТЬ РаспоряженияИСостояния
    |ИЗ
    |   (ВЫБРАТЬ
    |       РаспоряженияКОтгрузке.ДокументОтгрузки КАК ДокументОтгрузки,
    |       РаспоряженияКОтгрузке.Получатель КАК Получатель,
    |       РаспоряженияКОтгрузке.Номенклатура КАК Номенклатура,
    |       РаспоряженияКОтгрузке.Характеристика КАК Характеристика,
    |       РаспоряженияКОтгрузке.Назначение КАК Назначение,
    |       РаспоряженияКОтгрузке.Серия КАК Серия,
    |       ВЫБОР
    |           КОГДА &ОформлятьСначалаНакладные
    |                       И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
    |                   ИЛИ НЕ &ОформлятьСначалаНакладные
    |                       И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
    |               ТОГДА 0
    |           КОГДА РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
    |               ТОГДА 1
    |           КОГДА РаспоряженияКОтгрузке.СобраноОстаток <> 0
    |               ТОГДА 2
    |           КОГДА РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
    |               ТОГДА 3
    |           ИНАЧЕ 404
    |       КОНЕЦ КАК Состояние
    |   ИЗ
    |       РегистрНакопления.ТоварыКОтгрузке.Остатки({() КАК Поле2}, {(Склад = &Склад) КАК Поле2}) КАК РаспоряженияКОтгрузке
    |   ГДЕ
    |       (РаспоряженияКОтгрузке.КОформлениюОстаток <> 0
    |               ИЛИ (&ОформлятьСначалаНакладные
    |                       И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.КОформлениюОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0
    |                   ИЛИ НЕ &ОформлятьСначалаНакладные
    |                       И РаспоряженияКОтгрузке.КОтгрузкеОстаток - РаспоряженияКОтгрузке.СобираетсяОстаток - РаспоряженияКОтгрузке.СобраноОстаток <> 0)
    |               ИЛИ РаспоряженияКОтгрузке.СобираетсяОстаток <> 0
    |               ИЛИ РаспоряженияКОтгрузке.СобраноОстаток <> 0)) КАК ВложенныйЗапрос
    |ГДЕ
    |   (ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказНаПеремещение)
    |           ИЛИ ТИПЗНАЧЕНИЯ(ВложенныйЗапрос.ДокументОтгрузки) = ТИП(Документ.ЗаказКлиента))
    |
    |СГРУППИРОВАТЬ ПО
    |   ВложенныйЗапрос.ДокументОтгрузки,
    |   ВложенныйЗапрос.Получатель
    |
    |ИМЕЮЩИЕ
    |   ВЫБОР
    |       КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 0
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор)
    |       КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 1
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ВПроцессеОтбора)
    |       КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 2
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтгрузка)
    |       КОГДА МИНИМУМ(ВложенныйЗапрос.Состояние) = 3
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОформлениеНакладных)
    |       ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ПустаяСсылка)
    |   КОНЕЦ В (ЗНАЧЕНИЕ(Перечисление.СостоянияОтбораТоваров.ОжидаетсяОтбор))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   РаспоряженияИСостояния.Распоряжение КАК Распоряжение,
    |   РаспоряженияИСостояния.Получатель КАК Получатель,
    |   ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """") КАК Номер,
    |   ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата,
    |   ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) КАК ТипДокумента,
    |   РаспоряженияИСостояния.Состояние КАК Состояние,
    |   0 КАК ИндексКартинки,
    |   ВЫБОР
    |       КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
    |               ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
    |           ТОГДА ВЫБОР
    |                   КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |                       ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
    |                   КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |                       ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |                   ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
    |               КОНЕЦ
    |       ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
    |   КОНЕЦ КАК ЖелаемаяДатаОтгрузки,
    |   ТАБПОМЕЩЕНИЯ.Помещение КАК Помещение,
    |   ТАБПОМЕЩЕНИЯ.КолВоСтрок КАК КолВоСтрок
    |ПОМЕСТИТЬ ТАБОбщая
    |ИЗ
    |   РаспоряженияИСостояния КАК РаспоряженияИСостояния
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
    |       ПО РаспоряженияИСостояния.Распоряжение = РеестрДокументов.Ссылка
    |           И (НЕ РеестрДокументов.ДополнительнаяЗапись)
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
    |       ПО РаспоряженияИСостояния.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
    |           И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
    |           И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
    |       ЛЕВОЕ СОЕДИНЕНИЕ ТАБПОМЕЩЕНИЯ КАК ТАБПОМЕЩЕНИЯ
    |       ПО РаспоряженияИСостояния.Распоряжение = ТАБПОМЕЩЕНИЯ.Распоряжение
    |ГДЕ
    |   ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) <> ТИП(Документ.СборкаТоваров)
    |
    |СГРУППИРОВАТЬ ПО
    |   РаспоряженияИСостояния.Распоряжение,
    |   РаспоряженияИСостояния.Получатель,
    |   РаспоряженияИСостояния.Состояние,
    |   ТАБПОМЕЩЕНИЯ.Помещение,
    |   ТАБПОМЕЩЕНИЯ.КолВоСтрок,
    |   ЕСТЬNULL(РеестрДокументов.НомерДокументаИБ, """"),
    |   ЕСТЬNULL(РеестрДокументов.ДатаДокументаИБ, ДАТАВРЕМЯ(1, 1, 1)),
    |   ВЫБОР
    |       КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
    |               ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
    |           ТОГДА ВЫБОР
    |                   КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |                       ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
    |                   КОГДА ТИПЗНАЧЕНИЯ(РаспоряженияИСостояния.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |                       ТОГДА КОНЕЦПЕРИОДА(РаспоряженияИСостояния.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |                   ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
    |               КОНЕЦ
    |       ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
    |   КОНЕЦ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТАБОБЩАЯ.Распоряжение КАК Распоряжение,
    |   ТАБОБЩАЯ.Помещение КАК Помещение,
    |   ТАБОБЩАЯ.КолВоСтрок КАК КолВоСтрок
    |ПОМЕСТИТЬ ТАБВСЕЗАКАЗЫ
    |ИЗ
    |   ТАБОбщая КАК ТАБОБЩАЯ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТАБВСЕЗАКАЗЫ.Распоряжение КАК Распоряжение,
    |   ТАБВСЕЗАКАЗЫ.Помещение КАК Помещение,
    |   ТАБВСЕЗАКАЗЫ.КолВоСтрок КАК КолВоСтрок,
    |   ВЫБОР
    |       КОГДА ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
    |               ИЛИ ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДАТАВРЕМЯ(1, 1, 1)) = 0
    |           ТОГДА ВЫБОР
    |                   КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |                       ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
    |                   КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |                       ТОГДА КОНЕЦПЕРИОДА(ТАБВСЕЗАКАЗЫ.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |                   ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
    |               КОНЕЦ
    |       ИНАЧЕ ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС
    |   КОНЕЦ КАК ДатаОтгрузкиОчередь,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |           ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладОтправитель
    |       КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |           ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Склад
    |       ИНАЧЕ NULL
    |   КОНЕЦ КАК Склад,
    |   ТАБВСЕЗАКАЗЫ.Распоряжение.Приоритет КАК Приоритет,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |           ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.СкладПолучатель
    |       КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |           ТОГДА ТАБВСЕЗАКАЗЫ.Распоряжение.Партнер
    |       ИНАЧЕ NULL
    |   КОНЕЦ КАК Получатель,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказКлиента)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Клиенты)
    |       КОГДА ТИПЗНАЧЕНИЯ(ТАБВСЕЗАКАЗЫ.Распоряжение.Ссылка) = ТИП(Документ.ЗаказНаПеремещение)
    |           ТОГДА ЗНАЧЕНИЕ(Перечисление.ПриоритетСборки.Магазины)
    |   КОНЕЦ КАК ПриоритетСборки,
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Номер, NULL) КАК НомерЗаданияНаПеревозку
    |ПОМЕСТИТЬ ТАБИТОГОВАЯ
    |ИЗ
    |   ТАБВСЕЗАКАЗЫ КАК ТАБВСЕЗАКАЗЫ
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
    |       ПО ТАБВСЕЗАКАЗЫ.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
    |           И (ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА)
    |           И (ЗаданиеНаПеревозкуРаспоряжения.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныНедоставкиТоваров.ПустаяСсылка))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТАБИТОГОВАЯ.Распоряжение КАК Распоряжение,
    |   ТАБИТОГОВАЯ.Помещение КАК Помещение,
    |   ТАБИТОГОВАЯ.КолВоСтрок КАК КолВоСтрок,
    |   ТАБИТОГОВАЯ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
    |   ТАБИТОГОВАЯ.Склад КАК Склад,
    |   ТАБИТОГОВАЯ.Приоритет КАК Приоритет,
    |   ТАБИТОГОВАЯ.Получатель КАК Получатель,
    |   ТАБИТОГОВАЯ.ПриоритетСборки КАК ПриоритетСборки,
    |   ТАБИТОГОВАЯ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку
    |ПОМЕСТИТЬ ТАБ
    |ИЗ
    |   ТАБИТОГОВАЯ КАК ТАБИТОГОВАЯ
    |ГДЕ
    |   ТАБИТОГОВАЯ.Склад = &Склад
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТАБ.Распоряжение КАК Распоряжение,
    |   ТАБ.ДатаОтгрузкиОчередь КАК ДатаОтгрузкиОчередь,
    |   ТАБ.Приоритет КАК Приоритет,
    |   ТАБ.КолВоСтрок КАК НомерСтроки,
    |   ТАБ.Помещение КАК СсылкаПомещение,
    |   ТАБ.НомерЗаданияНаПеревозку КАК НомерЗаданияНаПеревозку,
    |   ТАБ.Склад КАК Склад,
    |   ТАБ.КолВоСтрок КАК КоличествоСтрокВЭквиваленте,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |           ТОГДА ТАБ.КолВоСтрок
    |       ИНАЧЕ 0
    |   КОНЕЦ КАК КоличествоСтрокВЭквивалентеОпт,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(ТАБ.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |           ТОГДА ТАБ.КолВоСтрок
    |       ИНАЧЕ 0
    |   КОНЕЦ КАК КоличествоСтрокВЭквивалентеРозница
    |ПОМЕСТИТЬ ТАБИТОГ
    |ИЗ
    |   ТАБ КАК ТАБ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) КАК Дата,
    |   СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквиваленте, 0)) КАК КоличествоСтрокВЭквиваленте,
    |   СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК КоличествоСтрокВЭквивалентеОпт,
    |   СУММА(ЕСТЬNULL(ТАБИТОГ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК КоличествоСтрокВЭквивалентеРозница,
    |   ТАБИТОГ.Склад КАК Склад
    |ПОМЕСТИТЬ ТАБПРОМ1
    |ИЗ
    |   ТАБИТОГ КАК ТАБИТОГ
    |ГДЕ
    |   НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ) <= &ДатаОкон
    |   И ТАБИТОГ.Склад = &Склад
    |
    |СГРУППИРОВАТЬ ПО
    |   НАЧАЛОПЕРИОДА(ТАБИТОГ.ДатаОтгрузкиОчередь, ДЕНЬ),
    |   ТАБИТОГ.Склад
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ДанныеПроизводственногоКалендаря.Дата,
    |   0,
    |   0,
    |   0,
    |   &Склад
    |ИЗ
    |   РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
    |ГДЕ
    |   ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
    |   И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
    |   И (ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
    |           ИЛИ ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТАБПРОМ1.Дата КАК Дата,
    |   СУММА(ТАБПРОМ1.КоличествоСтрокВЭквиваленте) КАК КоличествоСтрокВЭквиваленте,
    |   СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеОпт) КАК КоличествоСтрокВЭквивалентеОпт,
    |   СУММА(ТАБПРОМ1.КоличествоСтрокВЭквивалентеРозница) КАК КоличествоСтрокВЭквивалентеРозница,
    |   ТАБПРОМ1.Склад КАК Склад
    |ПОМЕСТИТЬ ТАБПРОМ
    |ИЗ
    |   ТАБПРОМ1 КАК ТАБПРОМ1
    |
    |СГРУППИРОВАТЬ ПО
    |   ТАБПРОМ1.Дата,
    |   ТАБПРОМ1.Склад
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТАБПРОМ.Дата КАК Дата,
    |   ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
    |   ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
    |   ЕСТЬNULL(ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
    |   ТАБПРОМ.Склад КАК Склад,
    |   СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквиваленте, 0)) КАК ВсегоСтрокВЭквиваленте,
    |   СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеОпт, 0)) КАК ВсегоСтрокВЭквивалентеОпт,
    |   СУММА(ЕСТЬNULL(ТАБСУММАЭКВ.КоличествоСтрокВЭквивалентеРозница, 0)) КАК ВсегоСтрокВЭквивалентеРозница
    |ПОМЕСТИТЬ ТАБКОЛВОСТРОК
    |ИЗ
    |   ТАБПРОМ КАК ТАБПРОМ
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБПРОМ КАК ТАБСУММАЭКВ
    |       ПО ТАБПРОМ.Дата >= ТАБСУММАЭКВ.Дата
    |           И ТАБПРОМ.Склад = ТАБСУММАЭКВ.Склад
    |
    |СГРУППИРОВАТЬ ПО
    |   ТАБПРОМ.Дата,
    |   ТАБПРОМ.КоличествоСтрокВЭквиваленте,
    |   ТАБПРОМ.КоличествоСтрокВЭквивалентеОпт,
    |   ТАБПРОМ.КоличествоСтрокВЭквивалентеРозница,
    |   ТАБПРОМ.Склад
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТАБДАТЫЛИМИТЫ.ДАТА КАК ДАТА,
    |   ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
    |   ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
    |   ЕСТЬNULL(ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
    |   ТАБДАТЫЛИМИТЫ.Склад КАК Склад,
    |   СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокВсего, 0)) КАК ВсегоЛимит,
    |   СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокОпт, 0)) КАК ВсегоЛимитОпт,
    |   СУММА(ЕСТЬNULL(ТАБДАТЫЛИМИТЫСУММА.ЛимитСтрокРозница, 0)) КАК ВсегоЛимитРозница
    |ПОМЕСТИТЬ ТАБЛИМИТЫСУММА
    |ИЗ
    |   ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫ
    |       ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫСУММА
    |       ПО ТАБДАТЫЛИМИТЫ.ДАТА >= ТАБДАТЫЛИМИТЫСУММА.ДАТА
    |           И ТАБДАТЫЛИМИТЫ.Склад = ТАБДАТЫЛИМИТЫСУММА.Склад
    |
    |СГРУППИРОВАТЬ ПО
    |   ТАБДАТЫЛИМИТЫ.ДАТА,
    |   ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего,
    |   ТАБДАТЫЛИМИТЫ.ЛимитСтрокОпт,
    |   ТАБДАТЫЛИМИТЫ.ЛимитСтрокРозница,
    |   ТАБДАТЫЛИМИТЫ.Склад
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ТАБЛИМИТЫСУММА.ДАТА КАК ДАТА,
    |   ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) КАК ЛимитСтрокВсего,
    |   ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) КАК ЛимитСтрокОпт,
    |   ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) КАК ЛимитСтрокРозница,
    |   ТАБЛИМИТЫСУММА.Склад КАК Склад,
    |   ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимит, 0) КАК ВсегоЛимит,
    |   ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитОпт, 0) КАК ВсегоЛимитОпт,
    |   ЕСТЬNULL(ТАБЛИМИТЫСУММА.ВсегоЛимитРозница, 0) КАК ВсегоЛимитРозница,
    |   ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0) КАК КоличествоСтрокВЭквиваленте,
    |   ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0) КАК КоличествоСтрокВЭквивалентеОпт,
    |   ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0) КАК КоличествоСтрокВЭквивалентеРозница,
    |   ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквиваленте, 0) КАК ВсегоСтрокВЭквиваленте,
    |   ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеОпт, 0) КАК ВсегоСтрокВЭквивалентеОпт,
    |   ЕСТЬNULL(ТАБКОЛВОСТРОК.ВсегоСтрокВЭквивалентеРозница, 0) КАК ВсегоСтрокВЭквивалентеРозница,
    |   ВЫБОР
    |       КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
    |           ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) / 8 * 6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
    |       ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
    |   КОНЕЦ КАК ДоступноСтрок,
    |   ВЫБОР
    |       КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
    |           ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) / 8 * 6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
    |       ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокОпт, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеОпт, 0)
    |   КОНЕЦ КАК ДоступноСтрокОпт,
    |   ВЫБОР
    |       КОГДА ТАБЛИМИТЫСУММА.ДАТА = НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ)
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) >= 34200
    |               И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ДатаТек, ДЕНЬ), &ДатаТек, СЕКУНДА) <= 37800
    |           ТОГДА ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокВсего, 0) / 8 * 6.5 - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквиваленте, 0)
    |       ИНАЧЕ ЕСТЬNULL(ТАБЛИМИТЫСУММА.ЛимитСтрокРозница, 0) - ЕСТЬNULL(ТАБКОЛВОСТРОК.КоличествоСтрокВЭквивалентеРозница, 0)
    |   КОНЕЦ КАК ДоступноСтрокРозница
    |ПОМЕСТИТЬ ТАБДОСТУПНО
    |ИЗ
    |   ТАБЛИМИТЫСУММА КАК ТАБЛИМИТЫСУММА
    |       ЛЕВОЕ СОЕДИНЕНИЕ ТАБКОЛВОСТРОК КАК ТАБКОЛВОСТРОК
    |       ПО ТАБЛИМИТЫСУММА.Склад = ТАБКОЛВОСТРОК.Склад
    |           И ТАБЛИМИТЫСУММА.ДАТА = ТАБКОЛВОСТРОК.Дата
    |ГДЕ
    |   ТАБЛИМИТЫСУММА.Склад = &Склад
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   ДанныеПроизводственногоКалендаря.Дата КАК Дата,
    |   МАКСИМУМ(ЛимитыСборкиСклада.Период) КАК Период
    |ПОМЕСТИТЬ ВЫБОРКА
    |ИЗ
    |   РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
    |       ПО (НАЧАЛОПЕРИОДА(ДанныеПроизводственногоКалендаря.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(ЛимитыСборкиСклада.Период, ДЕНЬ))
    |ГДЕ
    |   ДанныеПроизводственногоКалендаря.Дата МЕЖДУ &ДатаНач И &ДатаОкон
    |
    |СГРУППИРОВАТЬ ПО
    |   ДанныеПроизводственногоКалендаря.Дата
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   1 КАК КолВоСтрок,
    |   1 КАК КолВоСтрокОпт,
    |   0 КАК КолВоСтрокРозница,
    |   1 КАК ЗапланированоОпт,
    |   0 КАК ЗапланированоРозница,
    |   1 КАК ЗапланированоИтого,
    |   0 КАК ОсталосьСобратьОпт,
    |   0 КАК ОсталосьСобратьРозница,
    |   0 КАК ОсталосьСобратьИтого,
    |   0 КАК СобраноОпт,
    |   0 КАК СобраноРозница,
    |   0 КАК СобраноИтого,
    |   ЗаказКлиентаТовары.Ссылка.Склад КАК Склад,
    |   ЗаказКлиентаТовары.Ссылка КАК Регистратор,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
    |       КОНЕЦ) КАК ДатаОтгрузки,
    |   ""Запланировано"" КАК Заказы,
    |   ЗаказКлиентаТовары.Ссылка.Партнер КАК Клиент,
    |   ЗаказКлиентаТовары.Ссылка.ВремяГотовности КАК ВремяГотовности,
    |   NULL КАК ОрдерСсылка,
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки, ДЕНЬ)) КАК ДатаОтг,
    |   ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
    |   ВЫБОР
    |       КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ ЗаказКлиентаТовары.Серия
    |   КОНЕЦ КАК Серия
    |ПОМЕСТИТЬ ТАБСВОДНАЯ
    |ИЗ
    |   Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
    |       ПО ЗаказКлиентаТовары.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
    |ГДЕ
    |   ЗаказКлиентаТовары.Ссылка.Проведен = ИСТИНА
    |   И ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |               КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |                   ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
    |               ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
    |           КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
    |   И ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке)
    |   И ЗаказКлиентаТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
    |
    |СГРУППИРОВАТЬ ПО
    |   ЗаказКлиентаТовары.Ссылка.Склад,
    |   ЗаказКлиентаТовары.Ссылка,
    |   ЗаказКлиентаТовары.Ссылка.Партнер,
    |   ЗаказКлиентаТовары.Ссылка.ВремяГотовности,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
    |       КОНЕЦ),
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки, ДЕНЬ)),
    |   ЗаказКлиентаТовары.Номенклатура,
    |   ВЫБОР
    |       КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ ЗаказКлиентаТовары.Серия
    |   КОНЕЦ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ВЫБОР
    |       КОГДА ТАБДОСТУПНО.ДоступноСтрок < 0
    |           ТОГДА 0
    |       ИНАЧЕ ТАБДОСТУПНО.ДоступноСтрок
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ТАБДОСТУПНО.ДоступноСтрокОпт < 0
    |           ТОГДА 0
    |       ИНАЧЕ ТАБДОСТУПНО.ДоступноСтрокОпт
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ТАБДОСТУПНО.ДоступноСтрокРозница < 0
    |           ТОГДА 0
    |       ИНАЧЕ ТАБДОСТУПНО.ДоступноСтрокРозница
    |   КОНЕЦ,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   ТАБДОСТУПНО.Склад,
    |   NULL,
    |   ТАБДОСТУПНО.ДАТА,
    |   ""Доступно"",
    |   NULL,
    |   NULL,
    |   NULL,
    |   NULL,
    |   &НомБазовая,
    |   NULL
    |ИЗ
    |   ТАБДОСТУПНО КАК ТАБДОСТУПНО
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   1,
    |   0,
    |   1,
    |   0,
    |   1,
    |   1,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
    |   ЗаказНаПеремещениеТовары.Ссылка,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
    |       КОНЕЦ),
    |   ""Запланировано"",
    |   ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
    |   ЗаказНаПеремещениеТовары.Ссылка.ВремяГотовности,
    |   NULL,
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)),
    |   ЗаказНаПеремещениеТовары.Номенклатура,
    |   ВЫБОР
    |       КОГДА ЗаказНаПеремещениеТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ ЗаказНаПеремещениеТовары.Серия
    |   КОНЕЦ
    |ИЗ
    |   Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
    |       ПО ЗаказНаПеремещениеТовары.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
    |ГДЕ
    |   ЗаказНаПеремещениеТовары.Ссылка.Проведен = ИСТИНА
    |   И ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |               КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |                   ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
    |               ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
    |           КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
    |   И ЗаказНаПеремещениеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению)
    |   И ЗаказНаПеремещениеТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
    |
    |СГРУППИРОВАТЬ ПО
    |   ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
    |   ЗаказНаПеремещениеТовары.Ссылка,
    |   ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
    |   ЗаказНаПеремещениеТовары.Ссылка.ВремяГотовности,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
    |       КОНЕЦ),
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)),
    |   ЗаказНаПеремещениеТовары.Номенклатура,
    |   ВЫБОР
    |       КОГДА ЗаказНаПеремещениеТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ ЗаказНаПеремещениеТовары.Серия
    |   КОНЕЦ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   1,
    |   1,
    |   0,
    |   0,
    |   0,
    |   0,
    |   1,
    |   0,
    |   1,
    |   0,
    |   0,
    |   0,
    |   ЗаказКлиентаТовары.Ссылка.Склад,
    |   ЗаказКлиентаТовары.Ссылка,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
    |       КОНЕЦ),
    |   ""Осталось собрать"",
    |   ЗаказКлиентаТовары.Ссылка.Партнер,
    |   ЗаказКлиентаТовары.Ссылка.ВремяГотовности,
    |   NULL,
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки, ДЕНЬ)),
    |   ЗаказКлиентаТовары.Номенклатура,
    |   ВЫБОР
    |       КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ ЗаказКлиентаТовары.Серия
    |   КОНЕЦ
    |ИЗ
    |   Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
    |       ПО ЗаказКлиентаТовары.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
    |ГДЕ
    |   ЗаказКлиентаТовары.Ссылка.Проведен = ИСТИНА
    |   И ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |               КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |                   ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
    |               ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
    |           КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
    |   И ЗаказКлиентаТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовКлиентов.КОтгрузке)
    |   И ЗаказКлиентаТовары.Ссылка.ВзятВРаботу = ЛОЖЬ
    |   И ЗаказКлиентаТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
    |
    |СГРУППИРОВАТЬ ПО
    |   ЗаказКлиентаТовары.Ссылка.Склад,
    |   ЗаказКлиентаТовары.Ссылка,
    |   ЗаказКлиентаТовары.Ссылка.Партнер,
    |   ЗаказКлиентаТовары.Ссылка.ВремяГотовности,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ЗаказКлиентаТовары.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, ДЕНЬ)
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.ДатаОтгрузки, ДЕНЬ)
    |       КОНЕЦ),
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказКлиентаТовары.Ссылка.ДатаОтгрузки, ДЕНЬ)),
    |   ЗаказКлиентаТовары.Номенклатура,
    |   ВЫБОР
    |       КОГДА ЗаказКлиентаТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ ЗаказКлиентаТовары.Серия
    |   КОНЕЦ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   1,
    |   0,
    |   1,
    |   0,
    |   0,
    |   0,
    |   0,
    |   1,
    |   1,
    |   0,
    |   0,
    |   0,
    |   ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
    |   ЗаказНаПеремещениеТовары.Ссылка,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
    |       КОНЕЦ),
    |   ""Осталось собрать"",
    |   ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
    |   ЗаказНаПеремещениеТовары.Ссылка.ВремяГотовности,
    |   NULL,
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)),
    |   ЗаказНаПеремещениеТовары.Номенклатура,
    |   ВЫБОР
    |       КОГДА ЗаказНаПеремещениеТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ ЗаказНаПеремещениеТовары.Серия
    |   КОНЕЦ
    |ИЗ
    |   Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
    |       ПО ЗаказНаПеремещениеТовары.Ссылка = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
    |ГДЕ
    |   ЗаказНаПеремещениеТовары.Ссылка.Проведен = ИСТИНА
    |   И ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |               КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |                   ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
    |               ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
    |           КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
    |   И ЗаказНаПеремещениеТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВнутреннихЗаказов.КВыполнению)
    |   И ЗаказНаПеремещениеТовары.Ссылка.ВзятВРаботу = ЛОЖЬ
    |   И ЗаказНаПеремещениеТовары.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
    |
    |СГРУППИРОВАТЬ ПО
    |   ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
    |   ЗаказНаПеремещениеТовары.Ссылка,
    |   ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
    |   ЗаказНаПеремещениеТовары.Ссылка.ВремяГотовности,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.Дата, ДЕНЬ)
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)
    |       КОНЕЦ),
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, КОНЕЦПЕРИОДА(ЗаказНаПеремещениеТовары.Ссылка.ЖелаемаяДатаПоступления, ДЕНЬ)),
    |   ЗаказНаПеремещениеТовары.Номенклатура,
    |   ВЫБОР
    |       КОГДА ЗаказНаПеремещениеТовары.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ ЗаказНаПеремещениеТовары.Серия
    |   КОНЕЦ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   1,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказКлиента)
    |           ТОГДА 1
    |       ИНАЧЕ 0
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение)
    |           ТОГДА 1
    |       ИНАЧЕ 0
    |   КОНЕЦ,
    |   0,
    |   0,
    |   0,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказКлиента)
    |           ТОГДА 1
    |       ИНАЧЕ 0
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение)
    |           ТОГДА 1
    |       ИНАЧЕ 0
    |   КОНЕЦ,
    |   1,
    |   0,
    |   0,
    |   0,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказКлиента)
    |               ТОГДА ВЫБОР
    |                       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |                           ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата, ДЕНЬ)
    |                       ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |                   КОНЕЦ
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение)
    |               ТОГДА ВЫБОР
    |                       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |                           ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата, ДЕНЬ)
    |                       ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ)
    |                   КОНЕЦ
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ)
    |       КОНЕЦ),
    |   ""Осталось собрать"",
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Получатель,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ВремяГотовности,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка,
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ВЫБОР
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |               ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |               ТОГДА КОНЕЦПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |           ИНАЧЕ 0
    |       КОНЕЦ),
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
    |   ВЫБОР
    |       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия
    |   КОНЕЦ
    |ИЗ
    |   Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
    |       ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
    |ГДЕ
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |               КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказКлиента)
    |                   ТОГДА ВЫБОР
    |                           КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |                               ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата, ДЕНЬ)
    |                           ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |                       КОНЕЦ
    |               КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение)
    |                   ТОГДА ВЫБОР
    |                           КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |                               ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата, ДЕНЬ)
    |                           ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ)
    |                       КОНЕЦ
    |               ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ)
    |           КОНЕЦ) МЕЖДУ &ДатаНач И &ДатаОкон
    |   И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
    |   И (ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказКлиента)
    |           ИЛИ ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение))
    |   И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Проверен)
    |   И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
    |   И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
    |   И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
    |
    |СГРУППИРОВАТЬ ПО
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Получатель,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ВремяГотовности,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка,
    |   ЕСТЬNULL(НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ), ВЫБОР
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказКлиента)
    |               ТОГДА ВЫБОР
    |                       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
    |                           ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата, ДЕНЬ)
    |                       ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |                   КОНЕЦ
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение)
    |               ТОГДА ВЫБОР
    |                       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления = ДАТАВРЕМЯ(1, 1, 1)
    |                           ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.Дата, ДЕНЬ)
    |                       ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ)
    |                   КОНЕЦ
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ДЕНЬ)
    |       КОНЕЦ),
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ВЫБОР
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |               ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |               ТОГДА КОНЕЦПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |           ИНАЧЕ 0
    |       КОНЕЦ),
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
    |   ВЫБОР
    |       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия
    |   КОНЕЦ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   1,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |           ТОГДА 1
    |       ИНАЧЕ 0
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |           ТОГДА 1
    |       ИНАЧЕ 0
    |   КОНЕЦ,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |           ТОГДА 1
    |       ИНАЧЕ 0
    |   КОНЕЦ,
    |   ВЫБОР
    |       КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |           ТОГДА 1
    |       ИНАЧЕ 0
    |   КОНЕЦ,
    |   1,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
    |   ВЫБОР
    |       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ВремяОкончанияСборки = ДАТАВРЕМЯ(1, 1, 1)
    |           ТОГДА ВЫБОР
    |                   КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаСборки = ДАТАВРЕМЯ(1, 1, 1)
    |                       ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаОтгрузки, ДЕНЬ)
    |                   ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаСборки, ДЕНЬ)
    |               КОНЕЦ
    |       ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ВремяОкончанияСборки, ДЕНЬ)
    |   КОНЕЦ,
    |   ""Собрано"",
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Получатель,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ВремяГотовности,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка,
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ВЫБОР
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |               ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |               ТОГДА КОНЕЦПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |           ИНАЧЕ 0
    |       КОНЕЦ),
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
    |   ВЫБОР
    |       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия
    |   КОНЕЦ
    |ИЗ
    |   Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
    |       ПО РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = ЗаданиеНаПеревозкуРаспоряжения.Распоряжение
    |ГДЕ
    |   ВЫБОР
    |           КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ВремяОкончанияСборки = ДАТАВРЕМЯ(1, 1, 1)
    |               ТОГДА ВЫБОР
    |                       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаСборки = ДАТАВРЕМЯ(1, 1, 1)
    |                           ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаОтгрузки, ДЕНЬ)
    |                       ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаСборки, ДЕНЬ)
    |                   КОНЕЦ
    |           ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ВремяОкончанияСборки, ДЕНЬ)
    |       КОНЕЦ МЕЖДУ &ДатаНач И &ДатаОкон
    |   И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
    |   И (ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказКлиента)
    |           ИЛИ ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ЗНАЧЕНИЕ(Документ.ЗаказНаПеремещение))
    |   И (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Проверен)
    |           ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.КОтгрузке)
    |           ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен))
    |   И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Дата >= ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&ДатаОкон, МЕСЯЦ), МЕСЯЦ, -3)
    |
    |СГРУППИРОВАТЬ ПО
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Склад,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Получатель,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ВремяГотовности,
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка,
    |   ВЫБОР
    |       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ВремяОкончанияСборки = ДАТАВРЕМЯ(1, 1, 1)
    |           ТОГДА ВЫБОР
    |                   КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаСборки = ДАТАВРЕМЯ(1, 1, 1)
    |                       ТОГДА НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаОтгрузки, ДЕНЬ)
    |                   ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ДатаСборки, ДЕНЬ)
    |               КОНЕЦ
    |       ИНАЧЕ НАЧАЛОПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.ВремяОкончанияСборки, ДЕНЬ)
    |   КОНЕЦ,
    |   ЕСТЬNULL(ЗаданиеНаПеревозкуРаспоряжения.Ссылка.ДатаВремяРейсаПланС, ВЫБОР
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказНаПеремещение)
    |               ТОГДА ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ЖелаемаяДатаПоступления, ДЕНЬ), СЕКУНДА, -1)
    |           КОГДА ТИПЗНАЧЕНИЯ(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение) = ТИП(Документ.ЗаказКлиента)
    |               ТОГДА КОНЕЦПЕРИОДА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение.ДатаОтгрузки, ДЕНЬ)
    |           ИНАЧЕ 0
    |       КОНЕЦ),
    |   РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура,
    |   ВЫБОР
    |       КОГДА РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Номенклатура.Родитель.ОбъединятьНоменклатуру = ИСТИНА
    |           ТОГДА NULL
    |       ИНАЧЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Серия
    |   КОНЕЦ
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ЛимитыСборкиСклада.ЛимитСтрокВсего,
    |   ЛимитыСборкиСклада.ЛимитСтрокОпт,
    |   ЛимитыСборкиСклада.ЛимитСтрокРозница,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   0,
    |   ЛимитыСборкиСклада.Склад,
    |   NULL,
    |   ВЫБОРКА.Дата,
    |   ""!Лимит загрузки склада"",
    |   NULL,
    |   NULL,
    |   NULL,
    |   NULL,
    |   &НомБазовая,
    |   NULL
    |ИЗ
    |   ВЫБОРКА КАК ВЫБОРКА
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЛимитыСборкиСклада КАК ЛимитыСборкиСклада
    |       ПО (НАЧАЛОПЕРИОДА(ВЫБОРКА.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(ЛимитыСборкиСклада.Период, ДЕНЬ))
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.КолВоСтрок * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.КолВоСтрокОпт * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокОптЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.КолВоСтрокРозница * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК КолВоСтрокРозницаЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.ЗапланированоОпт * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ЗапланированоОптЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.ЗапланированоРозница * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ЗапланированоРозницаЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.ЗапланированоИтого * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ЗапланированоИтогоЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.ОсталосьСобратьОпт * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ОсталосьСобратьОптЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.ОсталосьСобратьРозница * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ОсталосьСобратьРозницаЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.ОсталосьСобратьИтого * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК ОсталосьСобратьИтогоЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.СобраноОпт * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК СобраноОптЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.СобраноРозница * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК СобраноРозницаЭквивалент,
    |   ВЫРАЗИТЬ(ТАБСВОДНАЯ.СобраноИтого * РасценкиКладовщикиСрезПоследних.Цена / РасценкиКладовщикиСрезПоследнихБАЗА.Цена КАК ЧИСЛО(15, 1)) КАК СобраноИтогоЭквивалент,
    |   ТАБСВОДНАЯ.КолВоСтрок КАК КолВоСтрок,
    |   ТАБСВОДНАЯ.КолВоСтрокОпт КАК КолВоСтрокОпт,
    |   ТАБСВОДНАЯ.КолВоСтрокРозница КАК КолВоСтрокРозница,
    |   ТАБСВОДНАЯ.ЗапланированоОпт КАК ЗапланированоОпт,
    |   ТАБСВОДНАЯ.ЗапланированоРозница КАК ЗапланированоРозница,
    |   ТАБСВОДНАЯ.ЗапланированоИтого КАК ЗапланированоИтого,
    |   ТАБСВОДНАЯ.ОсталосьСобратьОпт КАК ОсталосьСобратьОпт,
    |   ТАБСВОДНАЯ.ОсталосьСобратьРозница КАК ОсталосьСобратьРозница,
    |   ТАБСВОДНАЯ.ОсталосьСобратьИтого КАК ОсталосьСобратьИтого,
    |   ТАБСВОДНАЯ.СобраноОпт КАК СобраноОпт,
    |   ТАБСВОДНАЯ.СобраноРозница КАК СобраноРозница,
    |   ТАБСВОДНАЯ.СобраноИтого КАК СобраноИтого,
    |   ТАБСВОДНАЯ.Склад КАК Склад,
    |   ТАБСВОДНАЯ.Регистратор КАК Регистратор,
    |   ТАБСВОДНАЯ.ДатаОтгрузки КАК ДатаОтгрузки,
    |   ТАБСВОДНАЯ.Заказы КАК Заказы,
    |   ТАБСВОДНАЯ.Клиент КАК Клиент,
    |   ТАБСВОДНАЯ.ВремяГотовности КАК ВремяГотовности,
    |   ТАБСВОДНАЯ.ОрдерСсылка КАК ОрдерСсылка,
    |   ТАБСВОДНАЯ.ДатаОтг КАК ДатаОтг,
    |   ТАБСВОДНАЯ.Номенклатура КАК Номенклатура,
    |   ТАБСВОДНАЯ.Серия КАК Серия
    |ПОМЕСТИТЬ ТЗ
    |ИЗ
    |   ТАБСВОДНАЯ КАК ТАБСВОДНАЯ
    |       ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследних
    |       ПО (ТАБСВОДНАЯ.Номенклатура.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ТАБСВОДНАЯ.Номенклатура.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ТАБСВОДНАЯ.Номенклатура.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ТАБСВОДНАЯ.Номенклатура.Родитель.Родитель.Родитель.Родитель = РасценкиКладовщикиСрезПоследних.Номенклатура
    |               ИЛИ ТАБСВОДНАЯ.Номенклатура = РасценкиКладовщикиСрезПоследних.Номенклатура),
    |   РегистрСведений.РасценкиКладовщики.СрезПоследних({(&ДатаОкон)}, ) КАК РасценкиКладовщикиСрезПоследнихБАЗА
    |ГДЕ
    |   РасценкиКладовщикиСрезПоследнихБАЗА.Номенклатура = &НомБазовая
    |   И ТАБСВОДНАЯ.Склад = &Склад
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   СУММА(ТЗ.КолВоСтрокЭквивалент) КАК КолВоСтрокЭквивалент,
    |   СУММА(ТЗ.КолВоСтрокОптЭквивалент) КАК КолВоСтрокОптЭквивалент,
    |   СУММА(ТЗ.КолВоСтрокРозницаЭквивалент) КАК КолВоСтрокРозницаЭквивалент,
    |   СУММА(ТЗ.ЗапланированоОптЭквивалент) КАК ЗапланированоОптЭквивалент,
    |   СУММА(ТЗ.ЗапланированоРозницаЭквивалент) КАК ЗапланированоРозницаЭквивалент,
    |   СУММА(ТЗ.ЗапланированоИтогоЭквивалент) КАК ЗапланированоИтогоЭквивалент,
    |   СУММА(ТЗ.ОсталосьСобратьОптЭквивалент) КАК ОсталосьСобратьОптЭквивалент,
    |   СУММА(ТЗ.ОсталосьСобратьРозницаЭквивалент) КАК ОсталосьСобратьРозницаЭквивалент,
    |   СУММА(ТЗ.ОсталосьСобратьИтогоЭквивалент) КАК ОсталосьСобратьИтогоЭквивалент,
    |   СУММА(ТЗ.СобраноОптЭквивалент) КАК СобраноОптЭквивалент,
    |   СУММА(ТЗ.СобраноРозницаЭквивалент) КАК СобраноРозницаЭквивалент,
    |   СУММА(ТЗ.СобраноИтогоЭквивалент) КАК СобраноИтогоЭквивалент,
    |   СУММА(ТЗ.КолВоСтрок) КАК КолВоСтрок,
    |   СУММА(ТЗ.КолВоСтрокОпт) КАК КолВоСтрокОпт,
    |   СУММА(ТЗ.КолВоСтрокРозница) КАК КолВоСтрокРозница,
    |   СУММА(ТЗ.ЗапланированоОпт) КАК ЗапланированоОпт,
    |   СУММА(ТЗ.ЗапланированоРозница) КАК ЗапланированоРозница,
    |   СУММА(ТЗ.ЗапланированоИтого) КАК ЗапланированоИтого,
    |   СУММА(ТЗ.ОсталосьСобратьОпт) КАК ОсталосьСобратьОпт,
    |   СУММА(ТЗ.ОсталосьСобратьРозница) КАК ОсталосьСобратьРозница,
    |   СУММА(ТЗ.ОсталосьСобратьИтого) КАК ОсталосьСобратьИтого,
    |   СУММА(ТЗ.СобраноОпт) КАК СобраноОпт,
    |   СУММА(ТЗ.СобраноРозница) КАК СобраноРозница,
    |   СУММА(ТЗ.СобраноИтого) КАК СобраноИтого,
    |   ТЗ.Склад КАК Склад,
    |   ТЗ.ДатаОтгрузки КАК ДатаОтгрузки,
    |   ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего КАК ЛимитСтрокВсего
    |ИЗ
    |   ТЗ КАК ТЗ
    |       ЛЕВОЕ СОЕДИНЕНИЕ ТАБДАТЫЛИМИТЫ КАК ТАБДАТЫЛИМИТЫ
    |       ПО ТЗ.Склад = ТАБДАТЫЛИМИТЫ.Склад
    |
    |СГРУППИРОВАТЬ ПО
    |   ТЗ.Склад,
    |   ТЗ.ДатаОтгрузки,
    |   ТАБДАТЫЛИМИТЫ.ЛимитСтрокВсего";
	
	      
	
    //ДатаСледРабДня = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),1) + ЧАС(ТекущаяДата())*3600+МИНУТА(ТекущаяДата())*60;
    //ДатаНеделяЭквивалент = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),5) + ЧАС(ТекущаяДата())*3600;  
    
	ДатаСледРабДня = ОбщийМодуль77w.ДобавитьРабочиеДни(ДатаОтгрузки,1) + ЧАС(ТекущаяДата())*3600+МИНУТА(ТекущаяДата())*60;
	ДатаНеделяЭквивалент = ОбщийМодуль77w.ДобавитьРабочиеДни(ДатаОтгрузки,5) + ЧАС(ТекущаяДата())*3600;  
    
	
	//Запрос.УстановитьПараметр("ДатаОкон", ДатаНеделяЭквивалент );
	Запрос.УстановитьПараметр("ДатаОкон", КонецДня(ДатаОтгрузки));
	Запрос.УстановитьПараметр("Склад", Склад);
	//Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	//Запрос.УстановитьПараметр("ВидДня1", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный); 
    
    //Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()-86400*5));
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ДатаОтгрузки));
    
	//Если СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
	//	Запрос.УстановитьПараметр("ДатаТек", ТекущаяДата());  	
	//Иначе	
          //Запрос.УстановитьПараметр("ДатаТек", ДатаСледРабДня);  
	//КонецЕсли;
	
    
    Запрос.УстановитьПараметр("ДатаТек", КонецДня(ДатаОтгрузки-86400));  
	
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РБ"));
	Запрос.УстановитьПараметр("ОформлятьСначалаНакладные", ЛОЖЬ); 
	Запрос.УстановитьПараметр("Лук", Справочники.Номенклатура.НайтиПоКоду("00-00000016"));
		
	Если Склад = Справочники.Склады.Склад3 Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000001"));  //    семена
	ИначеЕсли Склад = Справочники.Склады.Склад5 Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  //  удобрения
	ИначеЕсли Склад = Справочники.Склады.ПустаяСсылка() Тогда
		Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  //  удобрения 
    Иначе
        Запрос.УстановитьПараметр("НомБазовая", Справочники.Номенклатура.НайтиПоКоду("00-00000024"));  //  удобрения
	КонецЕсли;	    
	
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	ЛимитСтрок = 0;
	ЭквивалентНеделя = 0;
	
	Если РезультатЗапроса.Количество()>0 Тогда
		
		НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Новый Структура("ДатаОтгрузки",НачалоДня(ДатаОтгрузки)));
		Если НайденныеСтроки.Количество() > 0 Тогда
            
            Попытка
                ПлюсКЛимиту = 0;
                ПлюсКЛимиту = НайденныеСтроки[0].ЛимитСтрокВсего *0.03;
                ЛимитСтрок = НайденныеСтроки[0].ЛимитСтрокВсего - НайденныеСтроки[0].ЗапланированоИтого + ПлюсКЛимиту;		
            Исключение
                //ОписаниеОшибки()
            КонецПопытки;

		КонецЕсли;
		
	КонецЕсли;	

	ДоступноСтрок = ЛимитСтрок;
	
	
    //Если Константы.ОграничениеПоЭквивалентуСтрок.Получить()=Истина Тогда
    //
    //	ДоступноСтрок = 0 ;
    //
    //КонецЕсли;
	
	
	Возврат ДоступноСтрок;


КонецФункции // ()




///////Перемещение Сумма документа
Функция ПолучитьСуммуДокументаПеремещения(ОбъектСсылка) Экспорт
	
		
	СуммаДокумента = 0;

	
	Если ОбъектСсылка.СкладПолучатель.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин 
		ИЛИ ОбъектСсылка.СкладОтправитель.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
	    ДатаДок = ОбъектСсылка.Дата;
		//ВидЦены = ОбъектСсылка.Соглашение.ВидЦен;
		Ссылка =  ОбъектСсылка;	
		ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин;
		ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Розничные",ИСТИНА);
	Иначе
		Возврат 0;
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказТовары.Номенклатура КАК Номенклатура,
		|	ЗаказТовары.Характеристика КАК Характеристика,
		|	ЗаказТовары.Упаковка КАК Упаковка,
		|	ЗаказТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказТовары.Количество КАК Количество,
		|	ЗаказТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ЗаказТовары.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА ЗаказТовары.Номенклатура.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказТовары.Номенклатура.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказТовары.Номенклатура.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказТовары.Номенклатура.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		КОГДА ЗаказТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.НедоступноДляРозницы = ИСТИНА
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НедоступноДляРозницы
		|ПОМЕСТИТЬ ТАБЗАКАЗ
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ЗаказТовары
		|ГДЕ
		|	ЗаказТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказТовары.Номенклатура КАК Номенклатура,
		|	ЗаказТовары.Серия КАК Серия,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт КАК РегЦена_Опт,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница КАК РегЦена_Розница
		|ПОМЕСТИТЬ ТАБРеГ
		|ИЗ
		|	ТАБЗАКАЗ КАК ЗаказТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегулируемыеЦеныНаНоменклатуре.СрезПоследних(&ДатаДок, ) КАК РегулируемыеЦеныНаНоменклатуреСрезПоследних
		|		ПО (ЗаказТовары.Номенклатура = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказТовары.Номенклатура.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказТовары.Номенклатура.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказТовары.Номенклатура.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
		|				ТОГДА РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт = ИСТИНА
		|			ИНАЧЕ РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница = ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
		|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЕСТЬNULL(ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена, 0) КАК Цена,
		|	0 КАК ЦенаНоменклатуры
		|ПОМЕСТИТЬ ТАБЦеныПоСериям
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(
		|			&ДатаДок,
		|			(ВидЦены, Номенклатура, Характеристика, Серия) В
		|				(ВЫБРАТЬ
		|					&ВидЦены,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика,
		|					Таблица.Серия
		|				ИЗ
		|					ТАБЗАКАЗ КАК Таблица)) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦены КАК ВидЦены,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаДок,
		|			(ВидЦены, Номенклатура, Характеристика) В
		|				(ВЫБРАТЬ
		|					&ВидЦены,
		|					Таблица.Номенклатура,
		|					Таблица.Характеристика
		|				ИЗ
		|					ТАБЗАКАЗ КАК Таблица)) КАК ЦеныНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЗаказ.НомерСтроки КАК НомерСтроки,
		|	ТабЗаказ.Номенклатура КАК Номенклатура,
		|	ТабЗаказ.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТабЗаказ.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
		|			ТОГДА ВЫБОР
		|					КОГДА ТАБРеГ.РегЦена_Опт = ИСТИНА
		|						ТОГДА ЕСТЬNULL(ТАБЦеныПоСериям.Цена, 0)
		|					ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|				КОНЕЦ
		|		ИНАЧЕ ВЫБОР
		|				КОГДА &ДатаДок >= ДАТАВРЕМЯ(2022, 10, 27, 0, 0, 0)
		|							И &ДатаДок < ДАТАВРЕМЯ(2023, 1, 11, 6, 0, 0)
		|						ИЛИ &ДатаДок >= ДАТАВРЕМЯ(2023, 4, 3, 0, 0, 0)
		|					ТОГДА ВЫБОР
		|							КОГДА ТАБРеГ.РегЦена_Розница = ИСТИНА
		|								ТОГДА ВЫБОР
		|										КОГДА ЕСТЬNULL(ТАБЦеныПоСериям.Цена, 0) <> 0
		|											ТОГДА ЕСТЬNULL(ТАБЦеныПоСериям.Цена, 0)
		|										ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|									КОНЕЦ
		|							ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|						КОНЕЦ
		|				ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|			КОНЕЦ
		|	КОНЕЦ КАК Цена,
		|	ТабЗаказ.Серия КАК Серия,
		|	ТАБРеГ.РегЦена_Опт КАК РегЦена_Опт,
		|	ТАБРеГ.РегЦена_Розница КАК РегЦена_Розница,
		|	ТабЗаказ.НедоступноДляРозницы КАК НедоступноДляРозницы
		|ПОМЕСТИТЬ ТАБИТОГ
		|ИЗ
		|	ТАБЗАКАЗ КАК ТабЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБЦеныПоСериям КАК ТАБЦеныПоСериям
		|		ПО ТабЗаказ.Номенклатура = ТАБЦеныПоСериям.Номенклатура
		|			И ТабЗаказ.Характеристика = ТАБЦеныПоСериям.Характеристика
		|			И ТабЗаказ.Серия = ТАБЦеныПоСериям.Серия
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТабЗаказ.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И ТабЗаказ.Характеристика = ЦеныНоменклатуры.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБРеГ КАК ТАБРеГ
		|		ПО (ТАБРеГ.Номенклатура = ТабЗаказ.Номенклатура)
		|			И (ТАБРеГ.Серия = ТабЗаказ.Серия)
		|			И (ТАБРеГ.НомерСтроки = ТабЗаказ.НомерСтроки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТАБИТОГ.Номенклатура КАК Номенклатура,
		|	СУММА(ТАБИТОГ.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(ТАБИТОГ.Количество) КАК Количество,
		|	ТАБИТОГ.Цена КАК Цена,
		|	ТАБИТОГ.Серия КАК Серия,
		|	ТАБИТОГ.РегЦена_Розница КАК РегЦена_Розница,
		|	ТАБИТОГ.НедоступноДляРозницы КАК НедоступноДляРозницы,
		|	СУММА(ТАБИТОГ.Цена * ТАБИТОГ.Количество) КАК СУММА
		|ПОМЕСТИТЬ ТАБИТОГ2
		|ИЗ
		|	ТАБИТОГ КАК ТАБИТОГ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТАБИТОГ.Номенклатура,
		|	ТАБИТОГ.Цена,
		|	ТАБИТОГ.Серия,
		|	ТАБИТОГ.РегЦена_Розница,
		|	ТАБИТОГ.НедоступноДляРозницы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТАБИТОГ2.Номенклатура КАК Номенклатура,
		|	ТАБИТОГ2.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТАБИТОГ2.Количество КАК Количество,
		|	ТАБИТОГ2.Цена КАК Цена,
		|	ТАБИТОГ2.Серия КАК Серия,
		|	ТАБИТОГ2.РегЦена_Розница КАК РегЦена_Розница,
		|	ТАБИТОГ2.НедоступноДляРозницы КАК НедоступноДляРозницы,
		|	ВЫРАЗИТЬ(ТАБИТОГ2.СУММА КАК ЧИСЛО(15, 2)) КАК СУММА
		|ИЗ
		|	ТАБИТОГ2 КАК ТАБИТОГ2
		|ГДЕ
		|	ТАБИТОГ2.Номенклатура.ВидТМЦ.ПечатьСебестоимость = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТипСклада", ТипСклада);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СуммаДокумента = РезультатЗапроса.Итог("Сумма");
	
	Возврат СуммаДокумента;
	
КонецФункции // ()



///////ПечатьЦенников Розница
&НаСервере
Процедура ПечатьЦенникаНаСервере(ТабДок,Склад, СписокТоваров,Дата,ПечатьАкционныхЦенников=Неопределено,ПечатьСУчетомОстатков=ЛОЖЬ,ПечатьВсехОстатков=ЛОЖЬ) Экспорт
	Перем КомпонентШК;
	НачДата = Дата;
	ВыбСклад = Склад;
	ВыбНоменклатура = СписокТоваров;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	
	ВыбЗначениеЦен = ВыбСклад.РозничныйВидЦены;
	
	
	ВсегоКолонок = 2;
	
	ВсегоСтрок   = 6;  //Для ценников 40x70
	
	ТекКолонка = 1;
	ТекСтрока  = 1;
	
	столбик=1;
	ряд=0;
	
	ТЗ_Товары = Новый ТаблицаЗначений;
	ТЗ_Товары.Колонки.Добавить("НоменклатураСсылка");

	ТЗ_Товары.Колонки.Добавить("Номенклатура");
	ТЗ_Товары.Колонки.Добавить("Номенклатура1");
	
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовара");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСоСкидкой");
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара1шт");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой1шт");

	ТЗ_Товары.Колонки.Добавить("ЦенаТовараСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкойСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСоСкидкойСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара1штСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой1штСтрока");

	
	
	
	ТЗ_Товары.Колонки.Добавить("КолВоВУпак");
	ТЗ_Товары.Колонки.Добавить("КолВоВУпакСтрока");
	ТЗ_Товары.Колонки.Добавить("НоменклатураСтрока1");
	ТЗ_Товары.Колонки.Добавить("НоменклатураСтрока2");
	
	ТЗ_Товары.Колонки.Добавить("ЕдИзмТовара");
	ТЗ_Товары.Колонки.Добавить("Партия");
	ТЗ_Товары.Колонки.Добавить("НомерДок");
	ТЗ_Товары.Колонки.Добавить("ДатаДок");
	ТЗ_Товары.Колонки.Добавить("Страна");
	ТЗ_Товары.Колонки.Добавить("Штрихкод");

	
	
	
	
	ТЗ_ТоварыУпак = ТЗ_Товары.Скопировать();
	ТЗ_ТоварыШТ =  ТЗ_Товары.Скопировать();
	ТЗ_ТоварыУпакСкидка = ТЗ_Товары.Скопировать();
	ТЗ_ТоварыШТСкидка =  ТЗ_Товары.Скопировать();
	
	Для каждого СтрокаТовары Из  ВыбНоменклатура Цикл
		

		Номенклатура = СтрокаТовары.Значение;
		
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Если Номенклатура.ЭтоГруппа Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
			|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("Ссылка", Номенклатура);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрокаТЗ = ТЗ_Товары.Добавить();
				НоваяСтрокаТЗ.Номенклатура =  ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
		Иначе
			НоваяСтрокаТЗ = ТЗ_Товары.Добавить();
			НоваяСтрокаТЗ.Номенклатура =  Номенклатура;
		КонецЕсли; 
	КонецЦикла;
	
	
	Для каждого СтрокаТовары Из ТЗ_Товары Цикл
					
			Если ПечатьСУчетомОстатков = ИСТИНА Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад КАК Склад,
				|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)) КАК ВНаличииОстаток
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, ) КАК ТоварыНаСкладахОстатки
				|ГДЕ
				|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
				|	И ТоварыНаСкладахОстатки.Склад = &Склад 
				//|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0 
				// |	И ТоварыНаСкладахОстатки.Серия = &Серия
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыНаСкладахОстатки.Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад";
				
				Запрос.УстановитьПараметр("ДатаОстатков", Дата-1);
				Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);
				//Запрос.УстановитьПараметр("Серия", СтрокаТовары.Серия);
				Запрос.УстановитьПараметр("Склад", Склад);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ОстатокМеньшеПредела = Ложь; 
				НулевойОстатокНаСкладе = ЛОЖЬ;
				Если НЕ РезультатЗапроса.Пустой() Тогда		
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
						//Проверяем на минимальный остаток на магазине
						Если ПечатьВсехОстатков = ЛОЖЬ Тогда
							
							Если ВыборкаДетальныеЗаписи.ВНаличииОстаток >= 10 Тогда				
								ОстатокМеньшеПредела = ИСТИНА; 		
							КонецЕсли;       
						Иначе
							Если ВыборкаДетальныеЗаписи.ВНаличииОстаток<=0 Тогда	
								НулевойОстатокНаСкладе = Истина;	
							КонецЕсли; 
						КонецЕсли;	
						
					КонецЦикла;  
				Иначе
					НулевойОстатокНаСкладе = ИСТИНА;  
					ОстатокМеньшеПредела = ИСТИНА;
				КонецЕсли;
				
				Если ОстатокМеньшеПредела = ИСТИНА Тогда
					Продолжить;
				КонецЕсли;
				
				Если НулевойОстатокНаСкладе = ИСТИНА Тогда
				    Продолжить;
				КонецЕсли;

			КонецЕсли; 
		
		Номенклатура = СтрокаТовары.Номенклатура;
		СтрокаТовары.НоменклатураСсылка = Номенклатура;
		
		ЦенникПоСериям = ЛОЖЬ;
		Партия = "";
		УстЦен = "";
		Цена = 0;
		ЕдИзмТовара = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		КолВоВУпак = 0 ;  
		
		ЦенаТовара = 0;
		ЦенаУпаковкиТовара = 0;
		ЦенаСоСкидкой = 0;
		ЦенаУпаковкиТовараСоСкидкой =  0;
		
		
		//jadmin 10-01-2023
		ОбщийМодуль77w.ПолучитьЦенуИУстановкуЦен_Розница(СтрокаТовары.Номенклатура,Справочники.СерииНоменклатуры.ПустаяСсылка(),НачДата,УстЦен,ЕдИзмТовара,Цена);
		///
		ЦенаТовара = Цена;
		
		
		Если Цена = Неопределено Тогда
			
			Сообщить("Не найдена цена товара " + СтрокаТовары.Номенклатура);
			Продолжить;
		КонецЕсли;
		//Скидка 	
		sale_percent = 0; //ПроцентСкидки
		sale_price = 0; //ЦенаСоСкидкой
		ЦенаСоСкидкой = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РозничныеСкидкиМССОСрезПоследних.Период КАК Период,
		|	РозничныеСкидкиМССОСрезПоследних.Регистратор КАК Регистратор,
		|	РозничныеСкидкиМССОСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	РозничныеСкидкиМССОСрезПоследних.Активность КАК Активность,
		|	РозничныеСкидкиМССОСрезПоследних.Магазин КАК Магазин,
		|	РозничныеСкидкиМССОСрезПоследних.Номенклатура КАК Номенклатура,
		|	РозничныеСкидкиМССОСрезПоследних.ШтрихКод КАК ШтрихКод,
		|	РозничныеСкидкиМССОСрезПоследних.Скидка КАК Скидка,
		|	РозничныеСкидкиМССОСрезПоследних.РазмерСкидки КАК РазмерСкидки,
		|	РозничныеСкидкиМССОСрезПоследних.ДатаНачала КАК ДатаНачала,
		|	РозничныеСкидкиМССОСрезПоследних.ДатаОкончания КАК ДатаОкончания,
		|	РозничныеСкидкиМССОСрезПоследних.Статус КАК Статус,
		|	РозничныеСкидкиМССОСрезПоследних.РозничнаяЦена КАК РозничнаяЦена,
		|	РозничныеСкидкиМССОСрезПоследних.РозничнаяЦенаСоСкидкой КАК РозничнаяЦенаСоСкидкой,
		|	РозничныеСкидкиМССОСрезПоследних.Скидка.Ссылка КАК СкидкаСсылка
		|ИЗ
		|	РегистрСведений.РозничныеСкидкиМССО.СрезПоследних КАК РозничныеСкидкиМССОСрезПоследних
		|ГДЕ
		|	РозничныеСкидкиМССОСрезПоследних.Номенклатура = &Номенклатура
		|	И РозничныеСкидкиМССОСрезПоследних.ДатаНачала <= &Дата
		|	И РозничныеСкидкиМССОСрезПоследних.ДатаОкончания >= &Дата
		|	И РозничныеСкидкиМССОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
		|	И РозничныеСкидкиМССОСрезПоследних.Магазин = &Магазин
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмерСкидки УБЫВ";
		
		Запрос.УстановитьПараметр("Дата", НачДата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДействияСкидок.Действует);
		Запрос.УстановитьПараметр("Магазин", ВыбСклад);
		
		
		РезЗпрСкидка = Запрос.Выполнить().Выгрузить();
		
		Если РезЗпрСкидка.Количество() > 0 Тогда
			
			Если РезЗпрСкидка[0].СкидкаСсылка = Справочники.РозничныеСкидки_МССО.НайтиПоНаименованию("Специальная цена",ИСТИНА) Тогда    //код 000000003
				
				ЦенаСоСкидкой = РезЗпрСкидка[0].РозничнаяЦенаСоСкидкой;
				ЦенаТовараВременная = ЦенаСоСкидкой;
			ИначеЕсли РезЗпрСкидка[0].СкидкаСсылка = Справочники.РозничныеСкидки_МССО.НайтиПоНаименованию("Скидка (наценка) процентом",ИСТИНА) Тогда    //код 000000002
				
				sale_percent = РезЗпрСкидка[0].РазмерСкидки;
				ЦенаСоСкидкой = Окр(Цена * (1 - sale_percent/100),2,РежимОкругления.Окр15как10);
				ЦенаТовараВременная = ЦенаСоСкидкой;
			КонецЕсли;
		КонецЕсли;
		
		
		КолВоВУпак = 1;
		Если СтрНайти(СтрокаТовары.Номенклатура.ЕдиницаДляОтчетов.Наименование, "упак") > 0  Тогда
			Если СтрокаТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов > 1 Тогда
				КолВоВУпак =  СтрокаТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов;
				
				ЦенаУпаковкиТовараСоСкидкой = ЦенаСоСкидкой * КолВоВУпак;					
				ЦенаУпаковкиТовара = Цена * КолВоВУпак;
			КонецЕсли;
		КонецЕсли; 
		
		
		Если ЦенаТовара <= 0 ИЛИ ЦенаТовара = Неопределено Тогда
			Сообщить("Не найдена цена "+СокрЛП(Номенклатура.НаименованиеПолное));
			Продолжить;
		КонецЕсли; 
		
		СтрокаТовары.ЦенаТовара = ЦенаТовара;
		СтрокаТовары.ЦенаУпаковкиТовара = ЦенаУпаковкиТовара;
		СтрокаТовары.ЦенаСоСкидкой = ЦенаСоСкидкой;
		СтрокаТовары.ЦенаУпаковкиТовараСоСкидкой = ЦенаУпаковкиТовараСоСкидкой;
		
		
		
		СтрокаТовары.ЦенаТовараСтрока = ПолучитьЦенуТовараСтрокой(ЦенаТовара);
		СтрокаТовары.ЦенаСоСкидкойСтрока = ПолучитьЦенуТовараСтрокой(ЦенаСоСкидкой);
		
		
		
		СтрокаТовары.ЦенаСоСкидкой1ШтСтрока ="Цена за шт " + ПолучитьЦенуТовараСтрокой(ЦенаСоСкидкой);
		
		СтрокаТовары.ЦенаУпаковкиТовараСоСкидкойСтрока = "Цена за упаковку " +  ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовараСоСкидкой);
		
		Если ЦенаУпаковкиТовараСоСкидкой > 0 Тогда
			СтрокаТовары.ЦенаТовара1штСтрока ="" + ПолучитьЦенуТовараСтрокой(ЦенаТовара) + " /шт";;
			СтрокаТовары.ЦенаУпаковкиТовараСтрока = "" + ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовара) + " /упак";
		Иначе	
			СтрокаТовары.ЦенаТовара1штСтрока ="Цена за шт " + ПолучитьЦенуТовараСтрокой(ЦенаТовара);
			СтрокаТовары.ЦенаУпаковкиТовараСтрока = "Цена за упак. " + ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовара);
		КонецЕсли;
		
		
		
		
		
		Если КолВоВУпак <> 0 Тогда
			СтрокаТовары.КолВоВУпакСтрока = ""+"Количество в одной упаковке "+КолВоВУпак+" шт";
		КонецЕсли; 
		
		СтрокаТовары.КолВоВУпак = КолВоВУпак;
		
		///////
		
		
		
		Если ЦенникПоСериям = ИСТИНА И ЗначениеЗаполнено(Партия) Тогда
			СтрокаТовары.Партия = ""+ Партия;
		Иначе	
			СтрокаТовары.Партия = ""+ " Уст.цен "+УстЦен;
		КонецЕсли;
		
		
		
		
		///// 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|	И ШтрихкодыНоменклатуры.ОсновнойШК = ИСТИНА";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ШтрихКод = Неопределено;
		ШтрихКод = Выборка.Штрихкод;	
		
		ШКДляДжестори = "";
		ШКДляДжестори = Номенклатура.ШКДляДжестори.Код;
		
		Если ЗначениеЗаполнено(ШКДляДжестори) Тогда
			ШтрихКод = Формат(ШКДляДжестори,"ЧГ=0");
		КонецЕсли; 
		
		Если ШтрихКод = Неопределено Тогда
			Сообщить("Не заполнен штрих-код у номенклатуры: "+СтрокаТовары.Номенклатура);
			Продолжить;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ШтрихКод)Тогда
			Продолжить;
		КонецЕсли; 
		
		
		СтрокаТовары.ШтрихКод = ШтрихКод; 
		
		Если ЗначениеЗаполнено(Номенклатура.СтранаПроисхождения.Наименование) Тогда
			СтрокаТовары.Страна = ""+СокрЛП(Номенклатура.СтранаПроисхождения.Наименование);
		Иначе
			СтрокаТовары.Страна = ""+СокрЛП(Номенклатура.СтранаВвоза.Наименование);
		КонецЕсли; 
		
		СтрокаТовары.ДатаДок = ""+СокрЛП(Формат(НачДата,"ДЛФ=D"));
		
		Если СтрНайти(Номенклатура.ЕдиницаИзмерения.Наименование,"кг") > 0 Тогда
			СтрокаТовары.ЕдИзмТовара = "за 1 "+Номенклатура.ЕдиницаИзмерения.Наименование;
		Иначе
			СтрокаТовары.ЕдИзмТовара = ""+Номенклатура.ЕдиницаИзмерения.Наименование;
		КонецЕсли; 
		
		
		//Если СтрДлина(Лев(СокрЛП(Номенклатура.НаименованиеПолное),31)) = СтрДлина(СокрЛП(Номенклатура.НаименованиеПолное)) Тогда
		//	СтрокаТовары.НоменклатураСтрока1  = Номенклатура.НаименованиеПолное;
		//Иначе
		//	Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.НаименованиеПолное),31) , " " , НаправлениеПоиска.СКонца,,1);
		//	СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения);
		//	СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения+1);
		//КонецЕсли;
		
		
		Если Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") 
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") //Саженцы
			Тогда 
			
			Если СтрДлина(Лев(СокрЛП(Номенклатура.Наименование),31)) = СтрДлина(СокрЛП(Номенклатура.Наименование)) Тогда
				СтрокаТовары.НоменклатураСтрока1  = Номенклатура.Наименование;
			Иначе
				Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.Наименование),31) , " " , НаправлениеПоиска.СКонца,,1);
				СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.Наименование),Вхождения);
				СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.Наименование),Вхождения+1);
			КонецЕсли;
			
		Иначе	
			Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.НаименованиеПолное),31) , " " , НаправлениеПоиска.СКонца,,1); 
			СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения);
			СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения+1);
		КонецЕсли; 

		
		
		
		
		
		Если КолВоВУпак > 1 Тогда 
			Если СтрокаТовары.ЦенаСоСкидкой > 0 Тогда
				стрТЗ_ТоварыУпакСкидка = ТЗ_ТоварыУпакСкидка.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыУпакСкидка,СтрокаТовары);
			Иначе	   
				стрТЗ_ТоварыУпак = ТЗ_ТоварыУпак.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыУпак,СтрокаТовары);
			КонецЕсли;
			
		Иначе
			Если СтрокаТовары.ЦенаСоСкидкой > 0 Тогда
				стрТЗ_ТоварыШТСкидка = ТЗ_ТоварыШТСкидка.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыШТСкидка,СтрокаТовары);
				
			Иначе
				стрТЗ_ТоварыШТ = ТЗ_ТоварыШТ.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыШТ,СтрокаТовары);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	  
	  
	  
	   Макет = ПолучитьОбщийМакет("МакетЦенника");
	   
	   Если ПечатьАкционныхЦенников = ЛОЖЬ Тогда
		   ВыводДанныхНаПечать(ТЗ_ТоварыУпак,ТабДок,Макет);
		   ВыводДанныхНаПечать(ТЗ_ТоварыШТ,ТабДок,Макет);	   
	   ИначеЕсли ПечатьАкционныхЦенников = ИСТИНА Тогда	  
		   ВыводДанныхНаПечать(ТЗ_ТоварыУпакСкидка,ТабДок,Макет);
		   ВыводДанныхНаПечать(ТЗ_ТоварыШТСкидка,ТабДок,Макет); 
	   Иначе
		   ВыводДанныхНаПечать(ТЗ_ТоварыУпак,ТабДок,Макет);
		   ВыводДанныхНаПечать(ТЗ_ТоварыШТ,ТабДок,Макет);	   	  
		   ВыводДанныхНаПечать(ТЗ_ТоварыУпакСкидка,ТабДок,Макет);
		   ВыводДанныхНаПечать(ТЗ_ТоварыШТСкидка,ТабДок,Макет); 
	   КонецЕсли; 
	   	   
	   	// объединение ячеек jadmin
	    ПоследняяCтрока = (ТЗ_Товары.Количество()) * 8 - 1;
		НомерСтроки = 0;
		НомерЯчейки = 2;
		Для Строка=2 По ПоследняяCтрока Цикл
			НомерСтроки = Строка;
			Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки,2).Текст)
			И НЕ ЗначениеЗаполнено(ТабДок.Область(НомерСтроки+1,2).Текст) Тогда 
				ТабДок.Область(НомерСтроки,2,НомерСтроки+1,7).Объединить();
			//Иначе
			//	Продолжить;
			КонецЕсли;	
			
			
			Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки,9).Текст)
			И НЕ ЗначениеЗаполнено(ТабДок.Область(НомерСтроки+1,9).Текст) Тогда 
				ТабДок.Область(НомерСтроки,9,НомерСтроки+1,14).Объединить();
			//Иначе
			//	Продолжить;
			КонецЕсли;	
			Строка = Строка+8;
		КонецЦикла;	
	   
	  
	    ТабДок.Область("C1").ШиринаКолонки = 0;
		ТабДок.Область("C1").Видимость = Ложь;
		
	    ТабДок.Область("C8").ШиринаКолонки = 0;
		ТабДок.Область("C8").Видимость = Ложь;
		//ТабДок.УдалитьОбласть("C1:C1");
КонецПроцедуры


&НаСервере
Процедура ПечатьЦенникаНаСервере_A4(ТабДок,Склад, СписокТоваров,Дата,ПечатьАкционныхЦенников=Неопределено,ПечатьСУчетомОстатков=ЛОЖЬ,ПечатьВсехОстатков=ЛОЖЬ) Экспорт
	Перем КомпонентШК;
	НачДата = Дата;
	ВыбСклад = Склад;
	ВыбНоменклатура = СписокТоваров;
	
	ТабДок = Новый ТабличныйДокумент;
  //ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
  ТабДок.АвтоМасштаб = Истина; 
  ТабДок.ОтображатьЗаголовки = Ложь;
  ТабДок.ОтображатьСетку = Ложь;
  //ТабДок.ПолеСлева = 10;
  //ТабДок.ПолеСправа = 10;
	ВыбЗначениеЦен = ВыбСклад.РозничныйВидЦены;
	
	
	ВсегоКолонок = 1;
	
	ВсегоСтрок   = 1;  //Для ценников 40x70
	
	ТекКолонка = 1;
	ТекСтрока  = 1;
	
	столбик=1;
	ряд=0;
	
	ТЗ_Товары = Новый ТаблицаЗначений;
	ТЗ_Товары.Колонки.Добавить("НоменклатураСсылка");

	ТЗ_Товары.Колонки.Добавить("Номенклатура");
	ТЗ_Товары.Колонки.Добавить("Номенклатура1");
	
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовара");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСоСкидкой");
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара1шт");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой1шт");

	ТЗ_Товары.Колонки.Добавить("ЦенаТовараСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкойСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСоСкидкойСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара1штСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой1штСтрока");

	
	
	
	ТЗ_Товары.Колонки.Добавить("КолВоВУпак");
	ТЗ_Товары.Колонки.Добавить("КолВоВУпакСтрока");
	ТЗ_Товары.Колонки.Добавить("НоменклатураСтрока1");
	ТЗ_Товары.Колонки.Добавить("НоменклатураСтрока2");
	
	ТЗ_Товары.Колонки.Добавить("ЕдИзмТовара");
	ТЗ_Товары.Колонки.Добавить("Партия");
	ТЗ_Товары.Колонки.Добавить("НомерДок");
	ТЗ_Товары.Колонки.Добавить("ДатаДок");
	ТЗ_Товары.Колонки.Добавить("Страна");
	ТЗ_Товары.Колонки.Добавить("Штрихкод");

	
	
	
	
	ТЗ_ТоварыУпак = ТЗ_Товары.Скопировать();
	ТЗ_ТоварыШТ =  ТЗ_Товары.Скопировать();
	ТЗ_ТоварыУпакСкидка = ТЗ_Товары.Скопировать();
	ТЗ_ТоварыШТСкидка =  ТЗ_Товары.Скопировать();
	
	Для каждого СтрокаТовары Из  ВыбНоменклатура Цикл
		

		Номенклатура = СтрокаТовары.Значение;
		
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Если Номенклатура.ЭтоГруппа Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
			|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("Ссылка", Номенклатура);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрокаТЗ = ТЗ_Товары.Добавить();
				НоваяСтрокаТЗ.Номенклатура =  ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
		Иначе
			НоваяСтрокаТЗ = ТЗ_Товары.Добавить();
			НоваяСтрокаТЗ.Номенклатура =  Номенклатура;
		КонецЕсли; 
	КонецЦикла;
	
	
	Для каждого СтрокаТовары Из ТЗ_Товары Цикл
					
			Если ПечатьСУчетомОстатков = ИСТИНА Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад КАК Склад,
				|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)) КАК ВНаличииОстаток
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, ) КАК ТоварыНаСкладахОстатки
				|ГДЕ
				|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
				|	И ТоварыНаСкладахОстатки.Склад = &Склад 
				//|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0 
				// |	И ТоварыНаСкладахОстатки.Серия = &Серия
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыНаСкладахОстатки.Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад";
				
				Запрос.УстановитьПараметр("ДатаОстатков", Дата-1);
				Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);
				//Запрос.УстановитьПараметр("Серия", СтрокаТовары.Серия);
				Запрос.УстановитьПараметр("Склад", Склад);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ОстатокМеньшеПредела = Ложь; 
				НулевойОстатокНаСкладе = ЛОЖЬ;
				Если НЕ РезультатЗапроса.Пустой() Тогда		
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
						//Проверяем на минимальный остаток на магазине
						Если ПечатьВсехОстатков = ЛОЖЬ Тогда
							
							Если ВыборкаДетальныеЗаписи.ВНаличииОстаток >= 10 Тогда				
								ОстатокМеньшеПредела = ИСТИНА; 		
							КонецЕсли;       
						Иначе
							Если ВыборкаДетальныеЗаписи.ВНаличииОстаток<=0 Тогда	
								НулевойОстатокНаСкладе = Истина;	
							КонецЕсли; 
						КонецЕсли;	
						
					КонецЦикла;  
				Иначе
					НулевойОстатокНаСкладе = ИСТИНА;  
					ОстатокМеньшеПредела = ИСТИНА;
				КонецЕсли;
				
				Если ОстатокМеньшеПредела = ИСТИНА Тогда
					Продолжить;
				КонецЕсли;
				
				Если НулевойОстатокНаСкладе = ИСТИНА Тогда
				    Продолжить;
				КонецЕсли;

			КонецЕсли; 
		
		Номенклатура = СтрокаТовары.Номенклатура;
		СтрокаТовары.НоменклатураСсылка = Номенклатура;
		
		ЦенникПоСериям = ЛОЖЬ;
		Партия = "";
		УстЦен = "";
		Цена = 0;
		ЕдИзмТовара = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		КолВоВУпак = 0 ;  
		
		ЦенаТовара = 0;
		ЦенаУпаковкиТовара = 0;
		ЦенаСоСкидкой = 0;
		ЦенаУпаковкиТовараСоСкидкой =  0;
		
		
		//jadmin 10-01-2023
		ОбщийМодуль77w.ПолучитьЦенуИУстановкуЦен_Розница(СтрокаТовары.Номенклатура,Справочники.СерииНоменклатуры.ПустаяСсылка(),НачДата,УстЦен,ЕдИзмТовара,Цена);
		///
		ЦенаТовара = Цена;
		
		
		Если Цена = Неопределено Тогда
			
			Сообщить("Не найдена цена товара " + СтрокаТовары.Номенклатура);
			Продолжить;
		КонецЕсли;
		//Скидка 	
		sale_percent = 0; //ПроцентСкидки
		sale_price = 0; //ЦенаСоСкидкой
		ЦенаСоСкидкой = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РозничныеСкидкиМССОСрезПоследних.Период КАК Период,
		|	РозничныеСкидкиМССОСрезПоследних.Регистратор КАК Регистратор,
		|	РозничныеСкидкиМССОСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	РозничныеСкидкиМССОСрезПоследних.Активность КАК Активность,
		|	РозничныеСкидкиМССОСрезПоследних.Магазин КАК Магазин,
		|	РозничныеСкидкиМССОСрезПоследних.Номенклатура КАК Номенклатура,
		|	РозничныеСкидкиМССОСрезПоследних.ШтрихКод КАК ШтрихКод,
		|	РозничныеСкидкиМССОСрезПоследних.Скидка КАК Скидка,
		|	РозничныеСкидкиМССОСрезПоследних.РазмерСкидки КАК РазмерСкидки,
		|	РозничныеСкидкиМССОСрезПоследних.ДатаНачала КАК ДатаНачала,
		|	РозничныеСкидкиМССОСрезПоследних.ДатаОкончания КАК ДатаОкончания,
		|	РозничныеСкидкиМССОСрезПоследних.Статус КАК Статус,
		|	РозничныеСкидкиМССОСрезПоследних.РозничнаяЦена КАК РозничнаяЦена,
		|	РозничныеСкидкиМССОСрезПоследних.РозничнаяЦенаСоСкидкой КАК РозничнаяЦенаСоСкидкой,
		|	РозничныеСкидкиМССОСрезПоследних.Скидка.Ссылка КАК СкидкаСсылка
		|ИЗ
		|	РегистрСведений.РозничныеСкидкиМССО.СрезПоследних КАК РозничныеСкидкиМССОСрезПоследних
		|ГДЕ
		|	РозничныеСкидкиМССОСрезПоследних.Номенклатура = &Номенклатура
		|	И РозничныеСкидкиМССОСрезПоследних.ДатаНачала <= &Дата
		|	И РозничныеСкидкиМССОСрезПоследних.ДатаОкончания >= &Дата
		|	И РозничныеСкидкиМССОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
		|	И РозничныеСкидкиМССОСрезПоследних.Магазин = &Магазин
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмерСкидки УБЫВ";
		
		Запрос.УстановитьПараметр("Дата", НачДата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДействияСкидок.Действует);
		Запрос.УстановитьПараметр("Магазин", ВыбСклад);
		
		
		РезЗпрСкидка = Запрос.Выполнить().Выгрузить();
		
		Если РезЗпрСкидка.Количество() > 0 Тогда
			
			Если РезЗпрСкидка[0].СкидкаСсылка = Справочники.РозничныеСкидки_МССО.НайтиПоНаименованию("Специальная цена",ИСТИНА) Тогда    //код 000000003
				
				ЦенаСоСкидкой = РезЗпрСкидка[0].РозничнаяЦенаСоСкидкой;
				ЦенаТовараВременная = ЦенаСоСкидкой;
			ИначеЕсли РезЗпрСкидка[0].СкидкаСсылка = Справочники.РозничныеСкидки_МССО.НайтиПоНаименованию("Скидка (наценка) процентом",ИСТИНА) Тогда    //код 000000002
				
				sale_percent = РезЗпрСкидка[0].РазмерСкидки;
				ЦенаСоСкидкой = Окр(Цена * (1 - sale_percent/100),2,РежимОкругления.Окр15как10);
				ЦенаТовараВременная = ЦенаСоСкидкой;
			КонецЕсли;
		КонецЕсли;
		
		
		КолВоВУпак = 1;
		Если СтрНайти(СтрокаТовары.Номенклатура.ЕдиницаДляОтчетов.Наименование, "упак") > 0  Тогда
			Если СтрокаТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов > 1 Тогда
				КолВоВУпак =  СтрокаТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов;
				
				ЦенаУпаковкиТовараСоСкидкой = ЦенаСоСкидкой * КолВоВУпак;					
				ЦенаУпаковкиТовара = Цена * КолВоВУпак;
			КонецЕсли;
		КонецЕсли; 
		
		
		Если ЦенаТовара <= 0 ИЛИ ЦенаТовара = Неопределено Тогда
			Сообщить("Не найдена цена "+СокрЛП(Номенклатура.НаименованиеПолное));
			Продолжить;
		КонецЕсли; 
		
		СтрокаТовары.ЦенаТовара = ЦенаТовара;
		СтрокаТовары.ЦенаУпаковкиТовара = ЦенаУпаковкиТовара;
		СтрокаТовары.ЦенаСоСкидкой = ЦенаСоСкидкой;
		СтрокаТовары.ЦенаУпаковкиТовараСоСкидкой = ЦенаУпаковкиТовараСоСкидкой;
		
		
		
		СтрокаТовары.ЦенаТовараСтрока = ПолучитьЦенуТовараСтрокой(ЦенаТовара);
		СтрокаТовары.ЦенаСоСкидкойСтрока = ПолучитьЦенуТовараСтрокой(ЦенаСоСкидкой);
		
		
		
		СтрокаТовары.ЦенаСоСкидкой1ШтСтрока ="Цена за шт " + ПолучитьЦенуТовараСтрокой(ЦенаСоСкидкой);
		
		СтрокаТовары.ЦенаУпаковкиТовараСоСкидкойСтрока = "Цена за упаковку " +  ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовараСоСкидкой);
		
		Если ЦенаУпаковкиТовараСоСкидкой > 0 Тогда
			СтрокаТовары.ЦенаТовара1штСтрока ="" + ПолучитьЦенуТовараСтрокой(ЦенаТовара) + " /шт";;
			СтрокаТовары.ЦенаУпаковкиТовараСтрока = "" + ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовара) + " /упак";
		Иначе	
			СтрокаТовары.ЦенаТовара1штСтрока ="Цена за шт " + ПолучитьЦенуТовараСтрокой(ЦенаТовара);
			СтрокаТовары.ЦенаУпаковкиТовараСтрока = "Цена за упак. " + ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовара);
		КонецЕсли;
		
		
		
		
		
		Если КолВоВУпак <> 0 Тогда
			СтрокаТовары.КолВоВУпакСтрока = ""+"Количество в одной упаковке "+КолВоВУпак+" шт";
		КонецЕсли; 
		
		СтрокаТовары.КолВоВУпак = КолВоВУпак;
		
		///////
		
		
		
		Если ЦенникПоСериям = ИСТИНА И ЗначениеЗаполнено(Партия) Тогда
			СтрокаТовары.Партия = ""+ Партия;
		Иначе	
			СтрокаТовары.Партия = ""+ " Уст.цен "+УстЦен;
		КонецЕсли;
		
		
		
		
		///// 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|	И ШтрихкодыНоменклатуры.ОсновнойШК = ИСТИНА";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ШтрихКод = Неопределено;
		ШтрихКод = Выборка.Штрихкод;	
		
		ШКДляДжестори = "";
		ШКДляДжестори = Номенклатура.ШКДляДжестори.Код;
		
		Если ЗначениеЗаполнено(ШКДляДжестори) Тогда
			ШтрихКод = Формат(ШКДляДжестори,"ЧГ=0");
		КонецЕсли; 
		
		Если ШтрихКод = Неопределено Тогда
			Сообщить("Не заполнен штрих-код у номенклатуры: "+СтрокаТовары.Номенклатура);
			Продолжить;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ШтрихКод)Тогда
			Продолжить;
		КонецЕсли; 
		
		
		СтрокаТовары.ШтрихКод = ШтрихКод; 
		
		Если ЗначениеЗаполнено(Номенклатура.СтранаПроисхождения.Наименование) Тогда
			СтрокаТовары.Страна = ""+СокрЛП(Номенклатура.СтранаПроисхождения.Наименование);
		Иначе
			СтрокаТовары.Страна = ""+СокрЛП(Номенклатура.СтранаВвоза.Наименование);
		КонецЕсли; 
		
		СтрокаТовары.ДатаДок = ""+СокрЛП(Формат(НачДата,"ДЛФ=D"));
		
		Если СтрНайти(Номенклатура.ЕдиницаИзмерения.Наименование,"кг") > 0 Тогда
			СтрокаТовары.ЕдИзмТовара = "за 1 "+Номенклатура.ЕдиницаИзмерения.Наименование;
		Иначе
			СтрокаТовары.ЕдИзмТовара = ""+Номенклатура.ЕдиницаИзмерения.Наименование;
		КонецЕсли; 
		
		
		//Если СтрДлина(Лев(СокрЛП(Номенклатура.НаименованиеПолное),31)) = СтрДлина(СокрЛП(Номенклатура.НаименованиеПолное)) Тогда
		//	СтрокаТовары.НоменклатураСтрока1  = Номенклатура.НаименованиеПолное;
		//Иначе
		//	Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.НаименованиеПолное),31) , " " , НаправлениеПоиска.СКонца,,1);
		//	СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения);
		//	СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения+1);
		//КонецЕсли;
		
		
    //Если Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") 
    //	ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") 
    //	ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") //Саженцы
    //	Тогда 
    //	
    //	Если СтрДлина(Лев(СокрЛП(Номенклатура.Наименование),31)) = СтрДлина(СокрЛП(Номенклатура.Наименование)) Тогда
    //		СтрокаТовары.НоменклатураСтрока1  = Номенклатура.Наименование;
    //	Иначе
    //		Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.Наименование),31) , " " , НаправлениеПоиска.СКонца,,1);
    //		СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.Наименование),Вхождения);
    //		СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.Наименование),Вхождения+1);
    //	КонецЕсли;
    //	
    //Иначе	
    //	Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.НаименованиеПолное),31) , " " , НаправлениеПоиска.СКонца,,1); 
    //	СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения);
    //	СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения+1);
    //КонецЕсли; 

		
		СтрокаТовары.НоменклатураСтрока1  = Номенклатура.НаименованиеПолное;
		
		
		
		Если КолВоВУпак > 1 Тогда 
			Если СтрокаТовары.ЦенаСоСкидкой > 0 Тогда
				стрТЗ_ТоварыУпакСкидка = ТЗ_ТоварыУпакСкидка.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыУпакСкидка,СтрокаТовары);
			Иначе	   
				стрТЗ_ТоварыУпак = ТЗ_ТоварыУпак.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыУпак,СтрокаТовары);
			КонецЕсли;
			
		Иначе
			Если СтрокаТовары.ЦенаСоСкидкой > 0 Тогда
				стрТЗ_ТоварыШТСкидка = ТЗ_ТоварыШТСкидка.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыШТСкидка,СтрокаТовары);
				
			Иначе
				стрТЗ_ТоварыШТ = ТЗ_ТоварыШТ.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыШТ,СтрокаТовары);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	  
	  
	  
	   Макет = ПолучитьОбщийМакет("МакетЦенника_A4");
	   
	   Если ПечатьАкционныхЦенников = ЛОЖЬ Тогда
		   ВыводДанныхНаПечать_A4(ТЗ_ТоварыУпак,ТабДок,Макет);
		   ВыводДанныхНаПечать_A4(ТЗ_ТоварыШТ,ТабДок,Макет);	   
	   ИначеЕсли ПечатьАкционныхЦенников = ИСТИНА Тогда	  
		   ВыводДанныхНаПечать_A4(ТЗ_ТоварыУпакСкидка,ТабДок,Макет);
		   ВыводДанныхНаПечать_A4(ТЗ_ТоварыШТСкидка,ТабДок,Макет); 
	   Иначе
		   ВыводДанныхНаПечать_A4(ТЗ_ТоварыУпак,ТабДок,Макет);
		   ВыводДанныхНаПечать_A4(ТЗ_ТоварыШТ,ТабДок,Макет);	   	  
		   ВыводДанныхНаПечать_A4(ТЗ_ТоварыУпакСкидка,ТабДок,Макет);
		   ВыводДанныхНаПечать_A4(ТЗ_ТоварыШТСкидка,ТабДок,Макет); 
	   КонецЕсли; 
	   	   
	  // 	// объединение ячеек jadmin
	  //ПоследняяCтрока = (ТЗ_Товары.Количество()) * 8 - 1;
	  //  НомерСтроки = 0;
	  //  НомерЯчейки = 2;
	  //  Для Строка=2 По ПоследняяCтрока Цикл
	  //  	НомерСтроки = Строка;
	  //  	Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки,2).Текст)
	  //  	И НЕ ЗначениеЗаполнено(ТабДок.Область(НомерСтроки+1,2).Текст) Тогда 
	  //  		ТабДок.Область(НомерСтроки,2,НомерСтроки+1,7).Объединить();
	  //  	//Иначе
	  //  	//	Продолжить;
	  //  	КонецЕсли;	
	  //  	
	  //  	
	  //  	Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки,9).Текст)
	  //  	И НЕ ЗначениеЗаполнено(ТабДок.Область(НомерСтроки+1,9).Текст) Тогда 
	  //  		ТабДок.Область(НомерСтроки,9,НомерСтроки+1,14).Объединить();
	  //  	//Иначе
	  //  	//	Продолжить;
	  //  	КонецЕсли;	
	  //  	Строка = Строка+8;
	  //  КонецЦикла;	
	   
	  
    //  ТабДок.Область("C1").ШиринаКолонки = 0;
    //ТабДок.Область("C1").Видимость = Ложь;
    //
    //  ТабДок.Область("C8").ШиринаКолонки = 0;
    //ТабДок.Область("C8").Видимость = Ложь;
		//ТабДок.УдалитьОбласть("C1:C1");
КонецПроцедуры




&НаСервере
Процедура ПечатьЦенникаНаСервере_A5(ТабДок,Склад, СписокТоваров,Дата,ПечатьАкционныхЦенников=Неопределено,ПечатьСУчетомОстатков=ЛОЖЬ,ПечатьВсехОстатков=ЛОЖЬ) Экспорт
	Перем КомпонентШК;
	НачДата = Дата;
	ВыбСклад = Склад;
	ВыбНоменклатура = СписокТоваров;
	
	ТабДок = Новый ТабличныйДокумент;
  //ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
 // ТабДок.АвтоМасштаб = Истина; 
  ТабДок.ОтображатьЗаголовки = Ложь;
  ТабДок.ОтображатьСетку = Ложь;
  //ТабДок.ПолеСлева = 10;
  //ТабДок.ПолеСправа = 10;
	ВыбЗначениеЦен = ВыбСклад.РозничныйВидЦены;
	
	
	ВсегоКолонок = 2;
	
	ВсегоСтрок   = 1;  //Для ценников 40x70
	
	ТекКолонка = 1;
	ТекСтрока  = 1;
	
	столбик=1;
	ряд=0;
	
	ТЗ_Товары = Новый ТаблицаЗначений;
	ТЗ_Товары.Колонки.Добавить("НоменклатураСсылка");

	ТЗ_Товары.Колонки.Добавить("Номенклатура");
	ТЗ_Товары.Колонки.Добавить("Номенклатура1");
	
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовара");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСоСкидкой");
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара1шт");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой1шт");

	ТЗ_Товары.Колонки.Добавить("ЦенаТовараСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкойСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаУпаковкиТовараСоСкидкойСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаТовара1штСтрока");
	ТЗ_Товары.Колонки.Добавить("ЦенаСоСкидкой1штСтрока");

	
	
	
	ТЗ_Товары.Колонки.Добавить("КолВоВУпак");
	ТЗ_Товары.Колонки.Добавить("КолВоВУпакСтрока");
	ТЗ_Товары.Колонки.Добавить("НоменклатураСтрока1");
	ТЗ_Товары.Колонки.Добавить("НоменклатураСтрока2");
	
	ТЗ_Товары.Колонки.Добавить("ЕдИзмТовара");
	ТЗ_Товары.Колонки.Добавить("Партия");
	ТЗ_Товары.Колонки.Добавить("НомерДок");
	ТЗ_Товары.Колонки.Добавить("ДатаДок");
	ТЗ_Товары.Колонки.Добавить("Страна");
	ТЗ_Товары.Колонки.Добавить("Штрихкод");

	
	
	
	
	ТЗ_ТоварыУпак = ТЗ_Товары.Скопировать();
	ТЗ_ТоварыШТ =  ТЗ_Товары.Скопировать();
	ТЗ_ТоварыУпакСкидка = ТЗ_Товары.Скопировать();
	ТЗ_ТоварыШТСкидка =  ТЗ_Товары.Скопировать();
	
	Для каждого СтрокаТовары Из  ВыбНоменклатура Цикл
		

		Номенклатура = СтрокаТовары.Значение;
		
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		
			Продолжить;
		
		КонецЕсли; 
		
		Если Номенклатура.ЭтоГруппа Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка В ИЕРАРХИИ(&Ссылка)
			|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
			|	И Номенклатура.ЭтоГруппа = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("Ссылка", Номенклатура);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрокаТЗ = ТЗ_Товары.Добавить();
				НоваяСтрокаТЗ.Номенклатура =  ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;
		Иначе
			НоваяСтрокаТЗ = ТЗ_Товары.Добавить();
			НоваяСтрокаТЗ.Номенклатура =  Номенклатура;
		КонецЕсли; 
	КонецЦикла;
	
	
	Для каждого СтрокаТовары Из ТЗ_Товары Цикл
					
			Если ПечатьСУчетомОстатков = ИСТИНА Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад КАК Склад,
				|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)) КАК ВНаличииОстаток
				|ИЗ
				|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, ) КАК ТоварыНаСкладахОстатки
				|ГДЕ
				|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
				|	И ТоварыНаСкладахОстатки.Склад = &Склад 
				//|	И ТоварыНаСкладахОстатки.ВНаличииОстаток > 0 
				// |	И ТоварыНаСкладахОстатки.Серия = &Серия
				|
				|СГРУППИРОВАТЬ ПО
				|	ТоварыНаСкладахОстатки.Номенклатура,
				|	ТоварыНаСкладахОстатки.Склад";
				
				Запрос.УстановитьПараметр("ДатаОстатков", Дата-1);
				Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);
				//Запрос.УстановитьПараметр("Серия", СтрокаТовары.Серия);
				Запрос.УстановитьПараметр("Склад", Склад);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ОстатокМеньшеПредела = Ложь; 
				НулевойОстатокНаСкладе = ЛОЖЬ;
				Если НЕ РезультатЗапроса.Пустой() Тогда		
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
						//Проверяем на минимальный остаток на магазине
						Если ПечатьВсехОстатков = ЛОЖЬ Тогда
							
							Если ВыборкаДетальныеЗаписи.ВНаличииОстаток >= 10 Тогда				
								ОстатокМеньшеПредела = ИСТИНА; 		
							КонецЕсли;       
						Иначе
							Если ВыборкаДетальныеЗаписи.ВНаличииОстаток<=0 Тогда	
								НулевойОстатокНаСкладе = Истина;	
							КонецЕсли; 
						КонецЕсли;	
						
					КонецЦикла;  
				Иначе
					НулевойОстатокНаСкладе = ИСТИНА;  
					ОстатокМеньшеПредела = ИСТИНА;
				КонецЕсли;
				
				Если ОстатокМеньшеПредела = ИСТИНА Тогда
					Продолжить;
				КонецЕсли;
				
				Если НулевойОстатокНаСкладе = ИСТИНА Тогда
				    Продолжить;
				КонецЕсли;

			КонецЕсли; 
		
		Номенклатура = СтрокаТовары.Номенклатура;
		СтрокаТовары.НоменклатураСсылка = Номенклатура;
		
		ЦенникПоСериям = ЛОЖЬ;
		Партия = "";
		УстЦен = "";
		Цена = 0;
		ЕдИзмТовара = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		КолВоВУпак = 0 ;  
		
		ЦенаТовара = 0;
		ЦенаУпаковкиТовара = 0;
		ЦенаСоСкидкой = 0;
		ЦенаУпаковкиТовараСоСкидкой =  0;
		
		
		//jadmin 10-01-2023
		ОбщийМодуль77w.ПолучитьЦенуИУстановкуЦен_Розница(СтрокаТовары.Номенклатура,Справочники.СерииНоменклатуры.ПустаяСсылка(),НачДата,УстЦен,ЕдИзмТовара,Цена);
		///
		ЦенаТовара = Цена;
		
		
		Если Цена = Неопределено Тогда
			
			Сообщить("Не найдена цена товара " + СтрокаТовары.Номенклатура);
			Продолжить;
		КонецЕсли;
		//Скидка 	
		sale_percent = 0; //ПроцентСкидки
		sale_price = 0; //ЦенаСоСкидкой
		ЦенаСоСкидкой = 0;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РозничныеСкидкиМССОСрезПоследних.Период КАК Период,
		|	РозничныеСкидкиМССОСрезПоследних.Регистратор КАК Регистратор,
		|	РозничныеСкидкиМССОСрезПоследних.НомерСтроки КАК НомерСтроки,
		|	РозничныеСкидкиМССОСрезПоследних.Активность КАК Активность,
		|	РозничныеСкидкиМССОСрезПоследних.Магазин КАК Магазин,
		|	РозничныеСкидкиМССОСрезПоследних.Номенклатура КАК Номенклатура,
		|	РозничныеСкидкиМССОСрезПоследних.ШтрихКод КАК ШтрихКод,
		|	РозничныеСкидкиМССОСрезПоследних.Скидка КАК Скидка,
		|	РозничныеСкидкиМССОСрезПоследних.РазмерСкидки КАК РазмерСкидки,
		|	РозничныеСкидкиМССОСрезПоследних.ДатаНачала КАК ДатаНачала,
		|	РозничныеСкидкиМССОСрезПоследних.ДатаОкончания КАК ДатаОкончания,
		|	РозничныеСкидкиМССОСрезПоследних.Статус КАК Статус,
		|	РозничныеСкидкиМССОСрезПоследних.РозничнаяЦена КАК РозничнаяЦена,
		|	РозничныеСкидкиМССОСрезПоследних.РозничнаяЦенаСоСкидкой КАК РозничнаяЦенаСоСкидкой,
		|	РозничныеСкидкиМССОСрезПоследних.Скидка.Ссылка КАК СкидкаСсылка
		|ИЗ
		|	РегистрСведений.РозничныеСкидкиМССО.СрезПоследних КАК РозничныеСкидкиМССОСрезПоследних
		|ГДЕ
		|	РозничныеСкидкиМССОСрезПоследних.Номенклатура = &Номенклатура
		|	И РозничныеСкидкиМССОСрезПоследних.ДатаНачала <= &Дата
		|	И РозничныеСкидкиМССОСрезПоследних.ДатаОкончания >= &Дата
		|	И РозничныеСкидкиМССОСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияСкидок.Действует)
		|	И РозничныеСкидкиМССОСрезПоследних.Магазин = &Магазин
		|
		|УПОРЯДОЧИТЬ ПО
		|	РазмерСкидки УБЫВ";
		
		Запрос.УстановитьПараметр("Дата", НачДата);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыДействияСкидок.Действует);
		Запрос.УстановитьПараметр("Магазин", ВыбСклад);
		
		
		РезЗпрСкидка = Запрос.Выполнить().Выгрузить();
		
		Если РезЗпрСкидка.Количество() > 0 Тогда
			
			Если РезЗпрСкидка[0].СкидкаСсылка = Справочники.РозничныеСкидки_МССО.НайтиПоНаименованию("Специальная цена",ИСТИНА) Тогда    //код 000000003
				
				ЦенаСоСкидкой = РезЗпрСкидка[0].РозничнаяЦенаСоСкидкой;
				ЦенаТовараВременная = ЦенаСоСкидкой;
			ИначеЕсли РезЗпрСкидка[0].СкидкаСсылка = Справочники.РозничныеСкидки_МССО.НайтиПоНаименованию("Скидка (наценка) процентом",ИСТИНА) Тогда    //код 000000002
				
				sale_percent = РезЗпрСкидка[0].РазмерСкидки;
				ЦенаСоСкидкой = Окр(Цена * (1 - sale_percent/100),2,РежимОкругления.Окр15как10);
				ЦенаТовараВременная = ЦенаСоСкидкой;
			КонецЕсли;
		КонецЕсли;
		
		
		КолВоВУпак = 1;
		Если СтрНайти(СтрокаТовары.Номенклатура.ЕдиницаДляОтчетов.Наименование, "упак") > 0  Тогда
			Если СтрокаТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов > 1 Тогда
				КолВоВУпак =  СтрокаТовары.Номенклатура.КоэффициентЕдиницыДляОтчетов;
				
				ЦенаУпаковкиТовараСоСкидкой = ЦенаСоСкидкой * КолВоВУпак;					
				ЦенаУпаковкиТовара = Цена * КолВоВУпак;
			КонецЕсли;
		КонецЕсли; 
		
		
		Если ЦенаТовара <= 0 ИЛИ ЦенаТовара = Неопределено Тогда
			Сообщить("Не найдена цена "+СокрЛП(Номенклатура.НаименованиеПолное));
			Продолжить;
		КонецЕсли; 
		
		СтрокаТовары.ЦенаТовара = ЦенаТовара;
		СтрокаТовары.ЦенаУпаковкиТовара = ЦенаУпаковкиТовара;
		СтрокаТовары.ЦенаСоСкидкой = ЦенаСоСкидкой;
		СтрокаТовары.ЦенаУпаковкиТовараСоСкидкой = ЦенаУпаковкиТовараСоСкидкой;
		
		
		
		СтрокаТовары.ЦенаТовараСтрока = ПолучитьЦенуТовараСтрокой(ЦенаТовара);
		СтрокаТовары.ЦенаСоСкидкойСтрока = ПолучитьЦенуТовараСтрокой(ЦенаСоСкидкой);
		
		
		
		СтрокаТовары.ЦенаСоСкидкой1ШтСтрока ="Цена за шт " + ПолучитьЦенуТовараСтрокой(ЦенаСоСкидкой);
		
		СтрокаТовары.ЦенаУпаковкиТовараСоСкидкойСтрока = "Цена за упаковку " +  ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовараСоСкидкой);
		
		Если ЦенаУпаковкиТовараСоСкидкой > 0 Тогда
			СтрокаТовары.ЦенаТовара1штСтрока ="" + ПолучитьЦенуТовараСтрокой(ЦенаТовара) + " /шт";;
			СтрокаТовары.ЦенаУпаковкиТовараСтрока = "" + ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовара) + " /упак";
		Иначе	
			СтрокаТовары.ЦенаТовара1штСтрока ="Цена за шт " + ПолучитьЦенуТовараСтрокой(ЦенаТовара);
			СтрокаТовары.ЦенаУпаковкиТовараСтрока = "Цена за упак. " + ПолучитьЦенуТовараСтрокой(ЦенаУпаковкиТовара);
		КонецЕсли;
		
		
		
		
		
		Если КолВоВУпак <> 0 Тогда
			СтрокаТовары.КолВоВУпакСтрока = ""+"Количество в одной упаковке "+КолВоВУпак+" шт";
		КонецЕсли; 
		
		СтрокаТовары.КолВоВУпак = КолВоВУпак;
		
		///////
		
		
		
		Если ЦенникПоСериям = ИСТИНА И ЗначениеЗаполнено(Партия) Тогда
			СтрокаТовары.Партия = ""+ Партия;
		Иначе	
			СтрокаТовары.Партия = ""+ " Уст.цен "+УстЦен;
		КонецЕсли;
		
		
		
		
		///// 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
		|	И ШтрихкодыНоменклатуры.ОсновнойШК = ИСТИНА";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ШтрихКод = Неопределено;
		ШтрихКод = Выборка.Штрихкод;	
		
		ШКДляДжестори = "";
		ШКДляДжестори = Номенклатура.ШКДляДжестори.Код;
		
		Если ЗначениеЗаполнено(ШКДляДжестори) Тогда
			ШтрихКод = Формат(ШКДляДжестори,"ЧГ=0");
		КонецЕсли; 
		
		Если ШтрихКод = Неопределено Тогда
			Сообщить("Не заполнен штрих-код у номенклатуры: "+СтрокаТовары.Номенклатура);
			Продолжить;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ШтрихКод)Тогда
			Продолжить;
		КонецЕсли; 
		
		
		СтрокаТовары.ШтрихКод = ШтрихКод; 
		
		Если ЗначениеЗаполнено(Номенклатура.СтранаПроисхождения.Наименование) Тогда
			СтрокаТовары.Страна = ""+СокрЛП(Номенклатура.СтранаПроисхождения.Наименование);
		Иначе
			СтрокаТовары.Страна = ""+СокрЛП(Номенклатура.СтранаВвоза.Наименование);
		КонецЕсли; 
		
		СтрокаТовары.ДатаДок = ""+СокрЛП(Формат(НачДата,"ДЛФ=D"));
		
		Если СтрНайти(Номенклатура.ЕдиницаИзмерения.Наименование,"кг") > 0 Тогда
			СтрокаТовары.ЕдИзмТовара = "за 1 "+Номенклатура.ЕдиницаИзмерения.Наименование;
		Иначе
			СтрокаТовары.ЕдИзмТовара = ""+Номенклатура.ЕдиницаИзмерения.Наименование;
		КонецЕсли; 
		
		
		//Если СтрДлина(Лев(СокрЛП(Номенклатура.НаименованиеПолное),31)) = СтрДлина(СокрЛП(Номенклатура.НаименованиеПолное)) Тогда
		//	СтрокаТовары.НоменклатураСтрока1  = Номенклатура.НаименованиеПолное;
		//Иначе
		//	Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.НаименованиеПолное),31) , " " , НаправлениеПоиска.СКонца,,1);
		//	СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения);
		//	СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения+1);
		//КонецЕсли;
		
		
    //Если Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") 
    //	ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") 
    //	ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004") //Саженцы
    //	Тогда 
    //	
    //	Если СтрДлина(Лев(СокрЛП(Номенклатура.Наименование),31)) = СтрДлина(СокрЛП(Номенклатура.Наименование)) Тогда
    //		СтрокаТовары.НоменклатураСтрока1  = Номенклатура.Наименование;
    //	Иначе
    //		Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.Наименование),31) , " " , НаправлениеПоиска.СКонца,,1);
    //		СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.Наименование),Вхождения);
    //		СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.Наименование),Вхождения+1);
    //	КонецЕсли;
    //	
    //Иначе	
    //	Вхождения = СтрНайти (Лев(СокрЛП(Номенклатура.НаименованиеПолное),31) , " " , НаправлениеПоиска.СКонца,,1); 
    //	СтрокаТовары.НоменклатураСтрока1 = Лев(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения);
    //	СтрокаТовары.НоменклатураСтрока2 = Сред(СокрЛП(Номенклатура.НаименованиеПолное),Вхождения+1);
    //КонецЕсли; 

		
		СтрокаТовары.НоменклатураСтрока1  = Номенклатура.НаименованиеПолное;
		
		
		
		Если КолВоВУпак > 1 Тогда 
			Если СтрокаТовары.ЦенаСоСкидкой > 0 Тогда
				стрТЗ_ТоварыУпакСкидка = ТЗ_ТоварыУпакСкидка.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыУпакСкидка,СтрокаТовары);
			Иначе	   
				стрТЗ_ТоварыУпак = ТЗ_ТоварыУпак.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыУпак,СтрокаТовары);
			КонецЕсли;
			
		Иначе
			Если СтрокаТовары.ЦенаСоСкидкой > 0 Тогда
				стрТЗ_ТоварыШТСкидка = ТЗ_ТоварыШТСкидка.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыШТСкидка,СтрокаТовары);
				
			Иначе
				стрТЗ_ТоварыШТ = ТЗ_ТоварыШТ.Добавить();
				ЗаполнитьЗначенияСвойств(стрТЗ_ТоварыШТ,СтрокаТовары);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;	  
	  
	  
	   Макет = ПолучитьОбщийМакет("МакетЦенника_A5");
	   
	   Если ПечатьАкционныхЦенников = ЛОЖЬ Тогда
		   ВыводДанныхНаПечать_A5(ТЗ_ТоварыУпак,ТабДок,Макет);
		   ВыводДанныхНаПечать_A5(ТЗ_ТоварыШТ,ТабДок,Макет);	   
	   ИначеЕсли ПечатьАкционныхЦенников = ИСТИНА Тогда	  
		   ВыводДанныхНаПечать_A5(ТЗ_ТоварыУпакСкидка,ТабДок,Макет);
		   ВыводДанныхНаПечать_A5(ТЗ_ТоварыШТСкидка,ТабДок,Макет); 
	   Иначе
		   ВыводДанныхНаПечать_A5(ТЗ_ТоварыУпак,ТабДок,Макет);
		   ВыводДанныхНаПечать_A5(ТЗ_ТоварыШТ,ТабДок,Макет);	   	  
		   ВыводДанныхНаПечать_A5(ТЗ_ТоварыУпакСкидка,ТабДок,Макет);
		   ВыводДанныхНаПечать_A5(ТЗ_ТоварыШТСкидка,ТабДок,Макет); 
	   КонецЕсли; 
	   	   
    // 	// объединение ячеек jadmin
    //ПоследняяCтрока = (ТЗ_Товары.Количество()) * 8 - 1;
    //НомерСтроки = 0;
    //НомерЯчейки = 2;
    //Для Строка=2 По ПоследняяCтрока Цикл
    //	НомерСтроки = Строка;
    //	Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки,2).Текст)
    //	И НЕ ЗначениеЗаполнено(ТабДок.Область(НомерСтроки+1,2).Текст) Тогда 
    //		ТабДок.Область(НомерСтроки,2,НомерСтроки+1,7).Объединить();
    //	//Иначе
    //	//	Продолжить;
    //	КонецЕсли;	
    //	
    //	
    //	Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки,9).Текст)
    //	И НЕ ЗначениеЗаполнено(ТабДок.Область(НомерСтроки+1,9).Текст) Тогда 
    //		ТабДок.Область(НомерСтроки,9,НомерСтроки+1,14).Объединить();
    //	//Иначе
    //	//	Продолжить;
    //	КонецЕсли;	
    //	Строка = Строка+8;
    //КонецЦикла;	
    // 
	  
    //  ТабДок.Область("C1").ШиринаКолонки = 0;
    //ТабДок.Область("C1").Видимость = Ложь;
    //
    //  ТабДок.Область("C8").ШиринаКолонки = 0;
    //ТабДок.Область("C8").Видимость = Ложь;
		//ТабДок.УдалитьОбласть("C1:C1");
КонецПроцедуры


Функция ПолучитьЦенуТовараСтрокой(ЦенаТовараВременная)
	
	Если ЦенаТовараВременная > 0 Тогда
		ЦенаТовараРуб = Цел(ЦенаТовараВременная);
		ЦенаТовараКопейки = (ЦенаТовараВременная - Цел(ЦенаТовараВременная))*100;
	Иначе
		ЦенаТовараРуб = 0;
		ЦенаТовараКопейки = 0;
	КонецЕсли; 
	
	Если ЦенаТовараРуб <> 0 Тогда
		
		Если ((ЦенаТовараКопейки > 0) и (ЦенаТовараКопейки < 10)) Тогда
			ЦенаТовараКопейки = "0"+ЦенаТовараКопейки;
		КонецЕсли; 			   
		ЦенаТовара = ""+ЦенаТовараРуб+" руб."+ЦенаТовараКопейки+" коп.";
	Иначе    
		ЦенаТовара = "0 руб."+ЦенаТовараКопейки+" коп.";
	КонецЕсли; 
	
	Возврат ЦенаТовара;	
	
КонецФункции // ()

Процедура ВыводДанныхНаПечать(ТЗ,ТабДок,Макет);
	
	 ВсегоКолонок = 2; 
	 ВсегоСтрок = 6;
	
	ТекКолонка = 1;
	ТекСтрока  = 1;


	  Для каждого СтрокаТовары Из ТЗ Цикл
	  
 
		  Если СтрокаТовары.ЦенаСоСкидкой >0 Тогда	   
			  Если СтрокаТовары.КолВоВУпак > 1 Тогда
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоАкцияУпак|ВертТело");
				  
				  //Макет = ПолучитьМакетНаСервере("МакетЦенникаАкционного1");
			  Иначе
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоАкция|ВертТело");
				  
				  //Макет = ПолучитьМакетНаСервере("МакетЦенникаАкционного");
			  КонецЕсли; 
		  Иначе
			  Если СтрокаТовары.КолВоВУпак > 1 Тогда
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоУпак|ВертТело");
			  Иначе
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТело|ВертТело");
				  
			  КонецЕсли;
		  КонецЕсли;   
     
		   
   
		   Фирма = ""+"ОАО ""МинскСортСемОвощ""";
		   ОбластьШапка.Параметры.Фирма = ""+Фирма;
			   
		   
		   
		   ПараметрыШтрихкода = Новый Структура;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод.Высота *3));        ///5   6
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод1.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод1.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод2.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод2.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод3.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод3.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   
		   ПараметрыШтрихкода.Вставить("Штрихкод",СтрокаТовары.ШтрихКод);
		   ПараметрыШтрихкода.Вставить("ТипКода", 1);
		   ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		   ПараметрыШтрихкода.Вставить("РазмерШрифта", 10);  
		   
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод1.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод2.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод3.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 

		      		   
		   ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,СтрокаТовары);

		   
		   Если ТекКолонка > ВсегоКолонок Тогда
			   ТекКолонка = 1;
			   ТекСтрока  = ТекСтрока + 1;
		   КонецЕсли;
		   
		   Если ТекСтрока > ВсегоСтрок Тогда
			   ТекСтрока  = 1;
			   ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		   КонецЕсли;
		   
		   Если ТекКолонка = 1 Тогда
			   ТабДок.Вывести(ОбластьШапка);
		   Иначе
		  	   ТабДок.Присоединить(ОбластьШапка);
		   КонецЕсли;
				
		   ТекКолонка  = ТекКолонка + 1;		   
		   
	  КонецЦикла;


	

КонецПроцедуры

Процедура ВыводДанныхНаПечать_A4(ТЗ,ТабДок,Макет);
	
	ВсегоКолонок = 1; 
	ВсегоСтрок = 1;
	
	ТекКолонка = 1;
	ТекСтрока  = 1;


	  Для каждого СтрокаТовары Из ТЗ Цикл
	  
 
		  Если СтрокаТовары.ЦенаСоСкидкой >0 Тогда	   
			  Если СтрокаТовары.КолВоВУпак > 1 Тогда
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоАкцияУпак|ВертТело");
				  
				  //Макет = ПолучитьМакетНаСервере("МакетЦенникаАкционного1");
			  Иначе
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоАкция|ВертТело");
				  
				  //Макет = ПолучитьМакетНаСервере("МакетЦенникаАкционного");
			  КонецЕсли; 
		  Иначе
			  Если СтрокаТовары.КолВоВУпак > 1 Тогда
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоУпак|ВертТело");
			  Иначе
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТело|ВертТело");
				  
			  КонецЕсли;
		  КонецЕсли;   
     
		   
   
		   Фирма = ""+"ОАО ""МинскСортСемОвощ""";
		   ОбластьШапка.Параметры.Фирма = ""+Фирма;
			   
		   
		   
		   ПараметрыШтрихкода = Новый Структура;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод.Высота *3));        ///5   6
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод1.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод1.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод2.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод2.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод3.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод3.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   
		   ПараметрыШтрихкода.Вставить("Штрихкод",СтрокаТовары.ШтрихКод);
		   ПараметрыШтрихкода.Вставить("ТипКода", 1);
		   ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		   ПараметрыШтрихкода.Вставить("РазмерШрифта", 10);  
		   
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод1.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод2.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод3.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 

		      		   
		   ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,СтрокаТовары);
       
       
       Попытка
       	
         ОбластьШапка.Параметры.Рубли = Цел(СтрокаТовары.ЦенаСоСкидкой); 
         
         Если Цел(СтрокаТовары.ЦенаСоСкидкой) = 0 Тогда
          ОбластьШапка.Параметры.Рубли = "0"; 
         КонецЕсли;  
        
         ОбластьШапка.Параметры.Копейки = (СтрокаТовары.ЦенаСоСкидкой - Цел(СтрокаТовары.ЦенаСоСкидкой)) * 100;  
         
         Если СтрДлина(ОбластьШапка.Параметры.Копейки) = 1 Тогда
            ОбластьШапка.Параметры.Копейки = ""+"0"+Строка((СтрокаТовары.ЦенаСоСкидкой - Цел(СтрокаТовары.ЦенаСоСкидкой)) * 100);
         КонецЕсли;
       
       Исключение
       	//ОписаниеОшибки()
       КонецПопытки;
       
       
       
		   Если ТекКолонка > ВсегоКолонок Тогда
			   ТекКолонка = 1;
			   ТекСтрока  = ТекСтрока + 1;
		   КонецЕсли;
		   
		   Если ТекСтрока > ВсегоСтрок Тогда
			   ТекСтрока  = 1;
			   ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		   КонецЕсли;
		   
		   Если ТекКолонка = 1 Тогда
			   ТабДок.Вывести(ОбластьШапка);
		   Иначе
		  	   ТабДок.Присоединить(ОбластьШапка);
		   КонецЕсли;
				
		   ТекКолонка  = ТекКолонка + 1;		   
		   
	  КонецЦикла;


	

КонецПроцедуры


Процедура ВыводДанныхНаПечать_A5(ТЗ,ТабДок,Макет);
	
	ВсегоКолонок = 1; 
	ВсегоСтрок = 2;
	ВсегоСтрокВыводим = 0;
	ТекКолонка = 1;
	ТекСтрока  = 1;


	  Для каждого СтрокаТовары Из ТЗ Цикл
	  
 
		  Если СтрокаТовары.ЦенаСоСкидкой >0 Тогда	   
			  Если СтрокаТовары.КолВоВУпак > 1 Тогда
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоАкцияУпак|ВертТело");
				  
				  //Макет = ПолучитьМакетНаСервере("МакетЦенникаАкционного1");
			  Иначе
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоАкция|ВертТело");
				  
				  //Макет = ПолучитьМакетНаСервере("МакетЦенникаАкционного");
			  КонецЕсли; 
		  Иначе
			  Если СтрокаТовары.КолВоВУпак > 1 Тогда
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТелоУпак|ВертТело");
			  Иначе
				  ОбластьШапка = Макет.ПолучитьОбласть("ГорТело|ВертТело");
				  
			  КонецЕсли;
		  КонецЕсли;   
     
		   
   
		   Фирма = ""+"ОАО ""МинскСортСемОвощ""";
		   ОбластьШапка.Параметры.Фирма = ""+Фирма;
			   
		   
		   
		   ПараметрыШтрихкода = Новый Структура;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод.Высота *3));        ///5   6
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод1.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод1.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод2.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод2.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   Попытка
			   ПараметрыШтрихкода.Вставить("Ширина", Окр(ОбластьШапка.Рисунки.ШтрихКод3.Ширина *3));       ///5    9
			   ПараметрыШтрихкода.Вставить("Высота", Окр(ОбластьШапка.Рисунки.ШтрихКод3.Высота *3));        ///5   6
			   
			   
		   Исключение
			   
		   КонецПопытки;
		   
		   ПараметрыШтрихкода.Вставить("Штрихкод",СтрокаТовары.ШтрихКод);
		   ПараметрыШтрихкода.Вставить("ТипКода", 1);
		   ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		   ПараметрыШтрихкода.Вставить("РазмерШрифта", 10);  
		   
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод1.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод2.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 
		   Попытка
			   ОбластьШапка.Рисунки.ШтрихКод3.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		   Исключение
			   //Продолжить;
		   КонецПопытки; 

		      		   
		   ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры,СтрокаТовары);
       
       
       Попытка
       	
         ОбластьШапка.Параметры.Рубли = Цел(СтрокаТовары.ЦенаСоСкидкой); 
         
         Если Цел(СтрокаТовары.ЦенаСоСкидкой) = 0 Тогда
          ОбластьШапка.Параметры.Рубли = "0"; 
         КонецЕсли;  
        
         ОбластьШапка.Параметры.Копейки = (СтрокаТовары.ЦенаСоСкидкой - Цел(СтрокаТовары.ЦенаСоСкидкой)) * 100;  
         
         Если СтрДлина(ОбластьШапка.Параметры.Копейки) = 1 Тогда
            ОбластьШапка.Параметры.Копейки = ""+"0"+Строка((СтрокаТовары.ЦенаСоСкидкой - Цел(СтрокаТовары.ЦенаСоСкидкой)) * 100);
         КонецЕсли;
       
       Исключение
       	//ОписаниеОшибки()
       КонецПопытки;
       
       
       
       //Если ТекКолонка > ВсегоКолонок Тогда
       //  ТекКолонка = 1;
       //  ТекСтрока  = ТекСтрока + 1;
       //КонецЕсли;  
       //
       //
       ////
       ////Если ТекСтрока > ВсегоСтрок Тогда
       ////  ТекСтрока  = 1;
       ////  ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
       ////КонецЕсли;
       //
       //Если ТекКолонка = 1 Тогда
       //  ТабДок.Вывести(ОбластьШапка);
       //Иначе
       //    ТабДок.Присоединить(ОбластьШапка);
       //КонецЕсли;
       
       
       //ВсегоСтрокВыводим = ВсегоСтрокВыводим + 1; 
       //Результат = ?(ВсегоСтрокВыводим % 2 = 0, 2, 1);
       //Если Результат = 2 Тогда
       //  ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
       //КонецЕсли;
       
       
       ////////////////////////////////////////////////
       
       
       //Если ТекКолонка > ВсегоКолонок Тогда
       //  ТекКолонка = 1;
       //  ТекСтрока  = ТекСтрока + 1;
       //КонецЕсли;
       //
       //Если ТекСтрока > ВсегоСтрок Тогда
       //  ТекСтрока  = 1;
       //  ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
       //КонецЕсли;
       //
       Если ТекКолонка = 1 Тогда
         ТабДок.Вывести(ОбластьШапка);
       Иначе
           ТабДок.Присоединить(ОбластьШапка);
       КонецЕсли; 
         
       ВсегоСтрокВыводим = ВсегоСтрокВыводим + 1; 
       Результат = ?(ВсегоСтрокВыводим % 2 = 0, 2, 1);
       Если Результат = 2 Тогда
         ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
       КонецЕсли;
         
       // 
       //ТекКолонка  = ТекКолонка + 1;	       
       
       
	  КонецЦикла;


	

КонецПроцедуры


////Сообщить(ГенерацияСлучайногоСимвола(ТекущаяУниверсальнаяДатаВМиллисекундах(),6,ЛОЖЬ)); ПримерВызоваПроцедуры
///ДлинаЗначения - длина генерации случайного числа из 6-ти символов, например "d0c8Yf"   
///СУчетомРегистра - С учетом регистра или без
&НаСервере
Функция ГенерацияСлучайногоСимвола(ДлинаЗначения,СУчетомРегистра = ЛОЖЬ) Экспорт 
	
	
    ГСЧ = Новый ГенераторСлучайныхЧисел(ТекущаяУниверсальнаяДатаВМиллисекундах());    
    СлучайнаяСтрока = "";
    // генерируем случайное число из 6-ти символов, например "d0c8Yf"
	Для Сч = 1 по ДлинаЗначения Цикл    
		
		
		Если СУчетомРегистра = ИСТИНА Тогда
	       Набор = ГСЧ.СлучайноеЧисло(1,3);  
		Иначе
		   Набор = ГСЧ.СлучайноеЧисло(1,2);  
		КонецЕсли; 
		
        Если Набор = 1 Тогда
            // это число
            СлучайныйСимвол = ГСЧ.СлучайноеЧисло(0,9);
		ИначеЕсли Набор = 2 Тогда
            // это маленькая буква латиницы
            СлучайныйСимвол = Символ(ГСЧ.СлучайноеЧисло(97,122));
        ИначеЕсли Набор = 3 Тогда
            // это Большая буква латиницы
            СлучайныйСимвол = Символ(ГСЧ.СлучайноеЧисло(65,90));
        КонецЕсли;
        СлучайнаяСтрока = СлучайнаяСтрока + СлучайныйСимвол;
    КонецЦикла;      
    Возврат(СлучайнаяСтрока);    
КонецФункции

Процедура ИзменениеВремяДокументаПриЗаписи(Источник, Отказ) Экспорт
	А = 1;
	
	Если ЧАС(Источник.Дата) = 23 И Минута(Источник.Дата) = 59 И Секунда(Источник.Дата) = 59 Тогда
		 Источник.Дата = Источник.Дата - 3599;
	КонецЕсли;
	
КонецПроцедуры


/////Вспомогательные функции
&НаСервере
Функция ПолучитьПутьКПринтеру(Склад,Помещение)   Экспорт 
	
	//Если Помещение.Наименование = "Зона1 Овощные культуры" 
	//     ИЛИ Помещение.Наименование = "Зона2 Цветочные культуры" Тогда
	//       Возврат Константы.ИмяПринтераДляСклада3_1.Получить();  
	//   ИначеЕсли Помещение.Наименование = "Зона6 Трава и сидераты" Тогда
	//       Возврат Константы.ИмяПринтераДляСклада3_2.Получить();  
	//   ИначеЕсли Помещение.Наименование = "Зона5 Луковичные"  Тогда
	//         Возврат Константы.ИмяПринтераДляСклада3_3.Получить();  
	//   ИначеЕсли Помещение.Наименование = "Зона4 Розы" Тогда
	//         Возврат Константы.ИмяПринтераДляСклада3_4.Получить();
	//	   
	//   ИначеЕсли Помещение.Наименование = "Зона1 Грунты" Тогда
	//         Возврат Константы.ИмяПринтераДляСклада5_1.Получить();  
	//   ИначеЕсли Помещение.Наименование = "Зона2 Основная" Тогда
	//         Возврат Константы.ИмяПринтераДляСклада5_2.Получить();  
	//   ИначеЕсли Помещение.Наименование = "Зона3 Теплый" Тогда
	//         Возврат Константы.ИмяПринтераДляСклада5_3.Получить();  
	//   ИначеЕсли Помещение.Наименование = "Зона4 Ангар" Тогда
	//         Возврат Константы.ИмяПринтераДляСклада5_4.Получить(); 
	//   ИначеЕсли Помещение.Наименование = "Зона5 Лукохранилище" Тогда
	//         Возврат Константы.ИмяПринтераДляСклада5_5.Получить(); 
	//   ИначеЕсли Помещение.Наименование = "Зона6 Лук" Тогда
	//         Возврат Константы.ИмяПринтераДляСклада5_6.Получить();  
	//	//ИначеЕсли Помещение.Наименование = "Зона7 Химия и средства защиты" Тогда
	//	//     Возврат Константы.ИмяПринтераДляСклада5_7.Получить();    
	//   Иначе
	//	   
	//	   
	//   КонецЕсли; 
	//   

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПринтерыПользователяПринтеры.Ссылка КАК Ссылка,
		|	ПринтерыПользователяПринтеры.ИмяПринтера КАК ИмяПринтера
		|ИЗ
		|	Справочник.ПринтерыПользователя.Принтеры КАК ПринтерыПользователяПринтеры
		|ГДЕ
		|	ПринтерыПользователяПринтеры.Ссылка.Владелец = &Пользователь
		|	И ПринтерыПользователяПринтеры.ТипОборудования = &ТипОборудования
		|	И ПринтерыПользователяПринтеры.Ссылка.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТипОборудования", Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ИмяПринтера;
	КонецЦикла;
	
    ////// Если не нашли принтер берем из справочника принтеров по закрепленным зонам
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПринтерыЭтикеток.Склад КАК Склад,
		|	ПринтерыЭтикеток.Помещение КАК Помещение,
		|	ПринтерыЭтикеток.ПутьКСетевомуПринтеру КАК ПутьКСетевомуПринтеру
		|ИЗ
		|	Справочник.ПринтерыЭтикеток КАК ПринтерыЭтикеток
		|ГДЕ
		|	ПринтерыЭтикеток.Склад = &Склад
		|	И ПринтерыЭтикеток.Помещение = &Помещение
		|	И ПринтерыЭтикеток.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ПутьКСетевомуПринтеру;
	КонецЦикла;
	   
КонецФункции


/////Предоплата МССО

Функция ПроверитьПредоплатуМССО(ЗаказСсылка, ТЗОплаты = Неопределено) Экспорт
	///jadmin СостояниеЗаказов Клиентов при предоплате
	
	    ДокументОплачен = ИСТИНА;
		
    Если ТЗОплаты = Неопределено Тогда
		
		  ТЗОплаты = ЗаказСсылка.ЭтапыГрафикаОплаты.Выгрузить();
	
    КонецЕсли; 
		
		ТЗОплаты.Свернуть("ВариантОплаты","СуммаПлатежа");  
		
		Для каждого стрВарОплаты  Из ТЗОплаты Цикл
			
			Если стрВарОплаты.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = ТекстЗапросаСтатусПредоплатыМССО();
				
				Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказСсылка);
				Запрос.УстановитьПараметр("ДатаОтчета", ТекущаяДата());
				
				
				РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
				Если РезультатЗапроса.Количество()>0 Тогда
					
					Если РезультатЗапроса.Итог("ДолгКлиентаВсегоКонечныйОстаток") > 0 ИЛИ РезультатЗапроса.Итог("КОплатеКонечныйОстаток") > 0  Тогда
						//ДокументОплачен = ЛОЖЬ;
						//Возврат ДокументОплачен; 
						
						
						КОплатеКонечныйОстаток = РезультатЗапроса.Итог("КОплатеКонечныйОстаток");
						СуммаДокумента = ЗаказСсылка.СуммаДокумента;
						СуммаПредоплатыДоОтгрузки = ЗаказСсылка.СуммаПредоплатыДоОтгрузки;
						Оплачено = СуммаДокумента - КОплатеКонечныйОстаток;
						
						//Если СуммаДокумента = СуммаПредоплатыДоОтгрузки Тогда
						//	ДолгРасчетный = СуммаПредоплатыДоОтгрузки;
						//Иначе 
						//    ДолгРасчетный = СуммаДокумента - СуммаПредоплатыДоОтгрузки;
						//КонецЕсли; 
						//
						//Если  ДолгРасчетный <= КОплатеКонечныйОстаток Тогда
						//    ДокументОплачен = ЛОЖЬ;
						//	Возврат ДокументОплачен; 
						//КонецЕсли;
						
						Если Оплачено < СуммаПредоплатыДоОтгрузки - 20 Тогда       //jadmin 17052022 по результатам телеконференции утв.директором
							ДокументОплачен = ЛОЖЬ;
							//Возврат ДокументОплачен; 
						КонецЕсли;
						
					КонецЕсли; 
					
					
				Иначе
					Оплачено = 0;
					ДокументОплачен = ЛОЖЬ;
				КонецЕсли;
				
				
			КонецЕсли;	 
		КонецЦикла; 

	    Возврат ДокументОплачен;
		
КонецФункции // ()
 

Функция ТекстЗапросаСтатусПредоплатыМССО() //jadmin

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасчетыСКлиентами.ЗаказКлиента КАК ЗаказКлиента,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(РасчетыСКлиентами.СуммаКонечныйОстаток, 0) > 0
	|					И ЕСТЬNULL(РасчетыСКлиентами.ОтгружаетсяКонечныйОстаток, 0) <= 0
	|				ТОГДА ЕСТЬNULL(РасчетыСКлиентами.СуммаКонечныйОстаток, 0)
	|			КОГДА ЕСТЬNULL(РасчетыСКлиентами.СуммаКонечныйОстаток, 0) >= 0
	|					И ЕСТЬNULL(РасчетыСКлиентами.ОтгружаетсяКонечныйОстаток, 0) > 0
	|				ТОГДА ЕСТЬNULL(РасчетыСКлиентами.СуммаКонечныйОстаток, 0) + ЕСТЬNULL(РасчетыСКлиентами.ОтгружаетсяКонечныйОстаток, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДолгКлиентаВсегоКонечныйОстаток,
	|	РасчетыСКлиентами.КОплатеКонечныйОстаток КАК КОплатеКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(, , , , ) КАК РасчетыСКлиентами
	|ГДЕ
	|	(РасчетыСКлиентами.СуммаОборот <> 0
	|			ИЛИ РасчетыСКлиентами.ОтгружаетсяОборот <> 0)
	|	И РасчетыСКлиентами.ЗаказКлиента = &ЗаказКлиента
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.ЗаказКлиента,
	|	РасчетыСКлиентами.КОплатеКонечныйОстаток";
	Возврат ТекстЗапроса;

КонецФункции // ()

Функция ПроверкаОбещанногоПлатежа(Заказ) Экспорт

	ЕстьОбещанныйПлатеж = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
        |   ОбещанныйПлатежЗаказы.Заказ.Ссылка КАК ЗаказСсылка,
        |   ОбещанныйПлатежЗаказы.Ссылка КАК Ссылка
        |ИЗ
        |   Документ.ОбещанныйПлатеж.Заказы КАК ОбещанныйПлатежЗаказы
        |ГДЕ
        |   ОбещанныйПлатежЗаказы.Заказ.Ссылка = &Ссылка
        |   И ОбещанныйПлатежЗаказы.Ссылка.Проведен = ИСТИНА
        |   И ОбещанныйПлатежЗаказы.Ссылка.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаказовПоставщикам.Подтвержден);
    
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
	
		ЕстьОбещанныйПлатеж = ИСТИНА;
	
	КонецЕсли; 
	
	Возврат ЕстьОбещанныйПлатеж;

КонецФункции // ПреверкаОбещанногоПлатежа(Заказ)()





/////Помещения
&НаСервере
Функция ПолучитьПомещениеНоменклатуры(Номенклатура,Склад) Экспорт
	
	Помещение = Справочники.СкладскиеПомещения.ПустаяСсылка();

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураПомещения.Номенклатура КАК Номенклатура,
	|	НоменклатураПомещения.Склад КАК Склад,
	|	НоменклатураПомещения.Помещение КАК Помещение
	|ИЗ
	|	РегистрСведений.НоменклатураПомещения КАК НоменклатураПомещения
	|ГДЕ
	|	НоменклатураПомещения.Номенклатура = &Номенклатура
	|	И НоменклатураПомещения.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Помещение = ВыборкаДетальныеЗаписи.Помещение; 
	КонецЦикла;
	
	Возврат Помещение;
КонецФункции

Функция ПолучитьСкладскуюЯчейку(Номенклатура,Помещение,Склад) Экспорт

	Ячейка = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура КАК Номенклатура,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад КАК Склад,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Помещение КАК Помещение,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка КАК ОсновнаяЯчейка
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|ГДЕ
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура = &Номенклатура
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад
		|	И РазмещениеНоменклатурыПоСкладскимЯчейкам.Помещение = &Помещение";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Помещение", Помещение);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ячейка = ВыборкаДетальныеЗаписи.Ячейка;
	КонецЦикла;
	
	Возврат Ячейка;


КонецФункции // ()






Процедура ДобавитьТаблицуВМенеджерВременныхТаблиц(Знач МенеджерВременныхТаблиц, Знач ИмяТаблицы, Знач ДанныеТаблицы) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ * ПОМЕСТИТЬ %1 ИЗ &ТЗ КАК ТЗ";
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяТаблицы);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТЗ", ДанныеТаблицы);
	Запрос.Выполнить();
	
КонецПроцедуры 





