&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаКлиенте
Перем ДатаМесяцДокументаПриОткрытии; //используется для передачи текущей строки в обработчик ожидания

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСеанса.ВременныйАдресПочты = "";   ////// 77w qaws
	ЗаказТребуетВниманияМенеджераСтатус = Объект.ЗаказТребуетВниманияМенеджера;
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
	
	ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
	ИспользоватьРучныеСкидкиВПродажах         = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВПродажах");
	ИспользоватьАвтоматическиеСкидкиВПродажах = ПолучитьФункциональнуюОпцию("ИспользоватьАвтоматическиеСкидкиВПродажах");
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	ИспользоватьОграниченияРучныхСкидок = ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоПользователям")
	                                      Или ПолучитьФункциональнуюОпцию("ИспользоватьОграниченияРучныхСкидокВПродажахПоСоглашениям");
	ИспользоватьПричиныОтменыЗаказовКлиентов = ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовКлиентов");
	
	ПараметрыВыбораРеквизитов = ЭтапыОплатыСервер.ПараметрыВыбораРеквизитовОплаты(Метаданные.Документы.ЗаказКлиента);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
		Если ЗначениеЗаполнено(Объект.Партнер) Тогда
			ЗаполнитьУстановитьРеквизитыДоставкиСервер("Партнер");
		КонецЕсли;
		
		Объект.Готовность = Ложь;
		Объект.ЕстьЗаданиеНаПеревозку = Ложь;
		Объект.ВыписанаНакладная = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		
		Если Объект.ТоварыДоКорректировкиОрдером.Количество() > 0 Тогда
			Объект.ТоварыДоКорректировкиОрдером.Очистить();
		КонецЕсли; 
		
		
		Если Объект.ОтсутствующиеПозицииНоменклатуры.Количество() > 0 Тогда
			Объект.ОтсутствующиеПозицииНоменклатуры.Очистить();
		КонецЕсли; 
		
		Объект.ИнтернетЗаказ = Ложь;
		Объект.СформированТСД = Ложь;
		Объект.ВзятВРаботу = Ложь;
        Объект.ПунктРазгрузкиПогрузкиКлиента = "";
		Объект.АдресДоставки = "";  
		Объект.КоличествоДоверенностей = 0;
		//ТекстСуммаПросроченоНажатиеНаСервере();
		
		Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета","BY98PJCB30120551901000000933");  //ПриорБанк
		
		//////77w qaws
		
		Если Параметры.ЗначениеКопирования <> Документы.ЗаказКлиента.ПустаяСсылка() Тогда
			Объект.СпособДоставки = Параметры.ЗначениеКопирования.СпособДоставки;
			
			ЗаполнитьУстановитьРеквизитыДоставкиСервер("СпособДоставки");
			
			Объект.АдресДоставки  = Параметры.ЗначениеКопирования.АдресДоставки;
			Объект.ЗонаДоставки   = Параметры.ЗначениеКопирования.ЗонаДоставки;
			
			Объект.ОтгрузкаТолькоПоПредоплате = Ложь;
			Объект.ОтгрузкаНеОсуществляется = Ложь;
			
			//ТекстСуммаПросроченоНажатиеНаСервере();
		КонецЕсли; 
		
		Объект.СерииДоступныДляРедактирования = ЛОЖЬ;    
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
			Если Объект.Партнер.ВидПартнераКонтрагента.Ссылка.Код = "000000007" Тогда
				Объект.СерииДоступныДляРедактирования = ИСТИНА;    
			КонецЕсли;
		
		КонецЕсли;
		
		//ОснСклад = Справочники.Склады.НайтиПоНаименованию("склад N 3 Готовой продукции");     ///////77w qaws
		//Если ОснСклад <> Справочники.Склады.ПустаяСсылка() Тогда
		//	 Объект.Склад = ОснСклад;
		//КонецЕсли; 
	КонецЕсли;
	
	
    
	//jadmin заменяем счет на приорбанк принудительно по условию
	Если НачалоДня(Объект.Дата) >= Дата("20221201000000") Тогда
		Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета","BY98PJCB30120551901000000933");
	КонецЕсли;

	Если Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке 
		И Объект.Проведен = ИСТИНА Тогда
		Объект.ДатаОтгрузкиПриВходе = Объект.ДатаОтгрузки;	
	Иначе
		Объект.ДатаОтгрузкиПриВходе = Дата(1,1,1);
	КонецЕсли;

    
    ///77w 
	КолВоДнейОтрочки = 0;
	СкидкаИндивидуальнаяРазмер = 0;
	ПолучитьКоличествоДнейОтсрочкиПоДоговору(КолВоДнейОтрочки,СкидкаИндивидуальнаяРазмер);
   //Объект.КоличествоДнейОтсрочкиПоДоговору = ПолучитьКоличествоДнейОтсрочкиПоДоговору();
   Объект.КоличествоДнейОтсрочкиПоДоговору = КолВоДнейОтрочки;
   Объект.СкидкаИндивидуальнаяПроцент = СкидкаИндивидуальнаяРазмер;
   

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходныйОрдерНаТоварыОснования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
		|ГДЕ
		|	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ
		|	И РасходныйОрдерНаТоварыОснования.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("ВыбЗаказ", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НашлиОрдер = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;	 
		
		
//jadmin Установка запрета редактирования табличной части если найден ордер
Если НашлиОрдер <> Неопределено 
	ИЛИ Объект.ВзятВРаботу = ИСТИНА Тогда
	//Сообщить("Установлен запрет на редактирование заявки, т.к выписан расходный ордер:"+Символы.ПС+НашлиОрдер);
	//ЭтаФорма.ТолькоПросмотр = Истина;
	//Элементы.Товары.Доступность = Ложь;
	Элементы.ТоварыЗаполнитьСерииПо_FIFO_МССО.Доступность = Ложь;
	Элементы.ТоварыОткрытьПодбор.Доступность = Ложь;
	Элементы.ТоварыГруппаЗаполнить.Доступность = Ложь;
	Элементы.Товары.ТОлькоПросмотр = ИСТИНА;            //jadmin
	Элементы.Статус.ТолькоПросмотр = ИСТИНА;
	
	Элементы.АдресДоставкиПеревозчика.ТолькоПросмотр = ИСТИНА;
	Элементы.АдресДоставкиПолучателя.ТолькоПросмотр = ИСТИНА;
	Элементы.АдресДоставкиПолучателя1.ТолькоПросмотр = ИСТИНА;
	Элементы.АдресДоставкиПолучателя2.ТолькоПросмотр = ИСТИНА;
	Элементы.АдресДоставкиСамовывоз.ТолькоПросмотр = ИСТИНА;
	//Элементы.ресДоставки.ТолькоПросмотр = ИСТИНА;
	
	
	
	Элементы.Партнер.ТолькоПросмотр = ИСТИНА;
	Элементы.Контрагент.ТолькоПросмотр = ИСТИНА;
	
	
	Если РольДоступна("АдминистраторСистемы") Тогда
		Элементы.Товары.ТОлькоПросмотр = Ложь; 
		Элементы.Статус.ТолькоПросмотр = ЛОЖЬ;
		
		Элементы.Партнер.ТолькоПросмотр = ЛОЖЬ;
		Элементы.Контрагент.ТолькоПросмотр = ЛОЖЬ;
		
		Элементы.АдресДоставкиПеревозчика.ТолькоПросмотр = ЛОЖЬ;
		Элементы.АдресДоставкиПолучателя.ТолькоПросмотр = ЛОЖЬ;
		Элементы.АдресДоставкиПолучателя1.ТолькоПросмотр = ЛОЖЬ;
		Элементы.АдресДоставкиПолучателя2.ТолькоПросмотр = ЛОЖЬ;
		Элементы.АдресДоставкиСамовывоз.ТолькоПросмотр = ЛОЖЬ;
		//Элементы.АдресДоставки.ТолькоПросмотр = ЛОЖЬ;
		Элементы.ОтсутвующиеПозиции.ТолькоПросмотр = ЛОЖЬ;
		
	КонецЕсли;	
	
	Если РольДоступна("MSSO_Директор") Тогда
		Элементы.Товары.ТОлькоПросмотр = Ложь;  
		Элементы.Статус.ТолькоПросмотр = ИСТИНА;
	КонецЕсли;
	
	Если ПроверитьВыписанаНакладная(Объект.Ссылка) = Ложь Тогда
		ЕстьВозможностьИзмененияЗаказаДляОрдера = ВозможностьИзмененияЗаказаДляОрдера();
		
		Если ЕстьВозможностьИзмененияЗаказаДляОрдера = Истина Тогда
			Элементы.Товары.ТОлькоПросмотр = Ложь;  
		КонецЕсли; 
		
	КонецЕсли;
Иначе
	Объект.ВзятВРаботу = ЛОЖЬ;
	
КонецЕсли; 
		
		
		
		
		
		
		
		///Проверка выписана ли накладная
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если ПроверитьВыписанаНакладная(Объект.Ссылка) = ИСТИНА Тогда
				Если РольДоступна("АдминистраторСистемы") Тогда
					
				Иначе					
				    ЭтаФорма.ТолькоПросмотр = ИСТИНА;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
		
		
  
		
		
		//jadmin Заполнение ЗнП из регистра
	    НомерЗнП = ПолучитьНомерЗнП(Объект.Ссылка);
		Если НомерЗнП <> Объект.ЕстьЗаданиеНаПеревозку Тогда
		    Объект.ЕстьЗаданиеНаПеревозку = НомерЗнП;
		КонецЕсли; 
		///	
		//jadmin Заполнение ЗнП из регистра
	    ВыписанаНакладнаяИзРегистра = ПолучитьНакладнуюИзРегистра(Объект.Ссылка);
		Если ВыписанаНакладнаяИзРегистра <> Объект.ВыписанаНакладная Тогда
		    Объект.ВыписанаНакладная = ВыписанаНакладнаяИзРегистра;
		КонецЕсли; 

		
		
        Если (Объект.КоличествоДнейОтсрочки = 0) И (Объект.КоличествоДнейОтсрочкиПоДоговору > 0) Тогда
        	Объект.КоличествоДнейОтсрочки = Объект.КоличествоДнейОтсрочкиПоДоговору;
        КонецЕсли; 
		
		
		////jadmin скидка для скл1
		//Если Объект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный",ИСТИНА)   Тогда
		//	Объект.СкидкаЗаПредоплату = ИСТИНА; 
		//	Объект.СкидкаЗаПредоплатуПроцент = 0;
		//	Объект.СкидкаОборот = ЛОЖЬ; 
		//	Объект.СкидкаОборотПроцент = 0;
		//	Объект.СкидкаСезонная = ЛОЖЬ; 
		//	Объект.СкидкаСезоннаяПроцент = 0;
		//	
		//	СкидкаСезоннаяРазмер = 0;
		//	СкидкаЗаПредоплатуРазмер = 0;
		//	СкидкаОборотРазмер = 0;
		//КонецЕсли; 

		
    Иначе    
        Объект.КоличествоДнейОтсрочки = Объект.КоличествоДнейОтсрочкиПоДоговору;
        
	КонецЕсли;
	
	
	Если ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
		Элементы.ГруппаИтого.ЦветФона = Новый Цвет();
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДокументОснование", "Видимость", ЗначениеЗаполнено(Объект.ДокументОснование));
	ПродажиСервер.УстановитьОтметкуНезаполненногоДоговора(Элементы, "Договор");
	ПродажиСервер.УстановитьРежимВыбораГруппЭлементовСклада(Элементы.Склад);
	ПравоНаЧтениеВидаЦены = ПравоДоступа("Просмотр", Метаданные.Документы.ЗаказКлиента.ТабличныеЧасти.Товары.Реквизиты.ВидЦены);
	
	НаправлениеДеятельностиОбязательно = НаправленияДеятельностиСервер.УказаниеНаправленияДеятельностиОбязательно(Объект.ХозяйственнаяОперация);
	
	СкидкиНаценкиСервер.НастроитьКомандуПоказатьСообщения(Объект, Элементы.ПоказатьСообщения);
	
	Элементы.ДекорацияДатаОтгрузки.Видимость = НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента") И Объект.НеОтгружатьЧастями;
	
	Элементы.ТоварыГруппаОтмена.Видимость                        = ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовКлиентов");
	Элементы.ТоварыОтмененоПричиныОтменыНеИспользуются.Видимость = Не ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовКлиентов");
	
	Перечисления.СтатусыЗаказовКлиентов.ЗаполнитьСписокВыбора(Элементы.Статус.СписокВыбора, Объект.Статус);
	
	Элементы.ЗакрытьЗаказ.Доступность = ПравоДоступа("Изменение",Метаданные.Документы.ЗаказКлиента);
	
	
	УстановитьДоступностьКомандБуфераОбмена();
	
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС1);
	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо1);
	            	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать

	ВводНаОсновании.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюСоздатьНаОсновании);
	
	МенюОтчеты.ПриСозданииНаСервере(ЭтаФорма, Элементы.ПодменюОтчеты);
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	// Подсистема "ОбменСКонтрагентами".
	ПараметрыЭДОПриСоздании= ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументССылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(Отказ, СтандартнаяОбработка, ПараметрыЭДОПриСоздании);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски, ПриСозданииНаСервере.
	ПараметрыПроцедуры = Новый Структура("ВариантОтображения", "Однострочный");
	СПАРКРиски.ПриСозданииНаСервере(
		ЭтотОбъект,
		Неопределено,
		Объект.Контрагент,
		ПараметрыПроцедуры);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ПриСозданииНаСервере.
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	// ИнтеграцияСЯндексКассой
	ИнтеграцияСЯндексКассой.ПриСозданииНаСервере(Параметры.Ключ, ЭтотОбъект,
		ЭтаФорма.КоманднаяПанель);
	// Конец ИнтеграцияСЯндексКассой
	
	
	
	
	//Если Параметры.Ключ.Пустая() Тогда    ///////77w qaws
	//	Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
	//	СтатусПриИзмененииСервер();
	//КонецЕсли;
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();  
	
	Если РольДоступна("АдминистраторСистемы")
		ИЛИ СтрНайти(Строка(ТекущийПользователь), "Ковалевская Юлия") = 1 Тогда
		Элементы.ЕстьЗаданиеНаПеревозку.Доступность = Истина;
		Элементы.Товары_v1.Видимость = Истина;
	Иначе
		Элементы.ЕстьЗаданиеНаПеревозку.Доступность = Ложь;
		Элементы.Товары_v1.Видимость = ЛОЖЬ;
	КонецЕсли;
			
	
	
	Если Объект.ТоварыДоКорректировкиОрдером.Количество() = 0 Тогда
		Элементы.СравнитьТЧ.Видимость = Ложь;
	Иначе
		Элементы.СравнитьТЧ.Видимость = Истина;
	КонецЕсли; 
	
	//Островский 02.07.2020
//	ТекстСуммаПросроченоНажатиеНаСервере();
	// SWI jadmin
	Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		//Если Объект.Соглашение.СВ_РасчетныйНДС Тогда
		//	СВ_РасчетныйНДСЗначение = ПолучитьРасчетныйНДС(Объект.Дата);
		//КонецЕсли;
		
		УстановитьВидимостьРасчетныйНДС(Объект.Соглашение.СВ_РасчетныйНДС);
    КонецЕсли;
	
	ЕстьРазрешениеНаУстановкуПризнака = ПроверитьКонтрагентаНаПризнакОтгрузкуРазрешил(Объект.Контрагент);
	Если Объект.Партнер.ВидПартнераКонтрагента.Ссылка.Код = "000000007"  
		ИЛИ ЕстьРазрешениеНаУстановкуПризнака = ИСТИНА Тогда
		Элементы.ОтгрузкуРазрешил.Видимость = Истина;
	Иначе
	    Элементы.ОтгрузкуРазрешил.Видимость = ЛОЖЬ;
	КонецЕсли;
	
    Если РольДоступна("АдминистраторСистемы")   Тогда
		Элементы.ВзятКВыписке.Доступность = Истина;
		Элементы.ОтсутвующиеПозиции.ТолькоПросмотр = ЛОЖЬ;
        Элементы.ОтсутствующиеПозицииНоменклатуры.ТолькоПросмотр = ЛОЖЬ;
	Иначе
   		Элементы.ВзятКВыписке.Доступность = Ложь;
    КонецЕсли;
	
    
	//Если РольДоступна("MSSO_МенеджерыПродаж") 
	//    или РольДоступна("MSSO_ТорговыеПредставители")
	//    	ИЛИ РольДоступна("АдминистраторСистемы") 
	//    Тогда
	//	Элементы.ОтгрузкуРазрешил.Доступность = Истина;
	//Иначе
	//   	Элементы.ОтгрузкуРазрешил.Доступность = Ложь;
	//КонецЕсли;
    
   
    Если Объект.Партнер.ОтгрузкаТолькоПоПредоплате = ИСТИНА Тогда
	
		Объект.СкидкаЗаПредоплату = Истина;
		Элементы.СкидкаЗаПредоплату.ТолькоПросмотр = Истина;
		СкидкаЗаПредоплатуПриИзмененииНаСервере();
	Иначе
		Элементы.СкидкаЗаПредоплату.ТолькоПросмотр = ЛОЖЬ;
	КонецЕсли;
	
	
	//Если ЗначениеЗаполнено(Объект.ЕстьЗаданиеНаПеревозку) = Истина Тогда
	//	Элементы.КоличествоДоверенностей.Доступность = Ложь;
	//Иначе
	//	Элементы.КоличествоДоверенностей.Доступность = Истина;
	//КонецЕсли;
	
	
	НомерЗнП = ПолучитьНомерЗнП(Объект.Ссылка);
	Если НомерЗнП <> "" Тогда    
		Элементы.ДатаОтгрузки.Доступность = ЛОЖЬ;   
	Иначе
		Элементы.ДатаОтгрузки.Доступность = Истина;   
	КонецЕсли; 
	
	
	Если РольДоступна("АдминистраторСистемы")
		ИЛИ РольДоступна("MSSO_МенеджерыПродажРуководитель") 
		ИЛИ РольДоступна("MSSO_Агрономы") 
		ИЛИ РольДоступна("MSSO_ЗавСкладом")  
		ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Ссылка.Код = "000000007"
	Тогда
		Элементы.СерииДоступныДляРедактирования.Видимость = Истина;
	Иначе
		Элементы.СерииДоступныДляРедактирования.Видимость = Ложь;
	КонецЕсли;
	
	Если Объект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад N 3а",ИСТИНА) Тогда
		Если Объект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Благотворительность",ИСТИНА) Тогда
		    Если РольДоступна("MSSO_ЗавСкладом") Тогда
	
		         Элементы.Готовность.Доступность = ИСТИНА;
				 Элементы.Готовность.ТолькоПросмотр = ЛОЖЬ;
	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	
	Если РольДоступна("АдминистраторСистемы") Тогда

	Иначе
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		    Элементы.Контрагент.Доступность = Ложь;  
		    Элементы.Партнер.Доступность = Ложь; 
			Элементы.ГруппаПартнер.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	
	Если Объект.Партнер = Справочники.Партнеры.НайтиПоНаименованию("Магазин N12",ИСТИНА) Тогда
		Если СтрНайти(Строка(ТекущийПользователь), "Поплавская") = 1 
			ИЛИ СтрНайти(Строка(ТекущийПользователь), "Проскурнин") = 1 
			ИЛИ СтрНайти(Строка(ТекущийПользователь), "Афанасьев Алексей") = 1 
			ИЛИ РольДоступна("АдминистраторСистемы") Тогда
		
		Иначе
			ЭтаФорма.ТолькоПросмотр = ИСТИНА;		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если (ТекущийОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин) И (НЕ ЗначениеЗаполнено(ТекущийОбъект.Комментарий)) Тогда
		ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	КонецЕсли;
	
	ПриЧтенииСозданииНаСервере();
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

	
	//jadmin	
	//Если НЕ ЗначениеЗаполнено(Объект.СуммаПросроченногоДолга) Тогда
	//	Элементы.ТекстСуммаПросрочено.Заголовок = "Сумма просрочено: - ";
	//Иначе
		Элементы.ТекстСуммаПросрочено.Заголовок = "Сумма просрочено: " + СокрЛП(Объект.СуммаПросроченногоДолга) + " BYN";
		
		Элементы.ТекстДатаИСуммаДоПросрочки.Заголовок = Объект.ДатаИСуммаБлижПросрочки;
	//КонецЕсли;

	
	
КонецПроцедуры
                          
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Функция ЭтоМагазинИлиСклад()
	Если Объект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		Возврат 1;
	Иначе 
		Возврат 0;
	КонецЕсли; 
КонецФункции

&НаСервере
Процедура ЗаполнитьДругимБанковскимСчетом()
	
	Попытка
		Если объект.Автор.СкладМагазин.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
			Если НачалоДня(Объект.Дата) >= Дата("20221201000000") Тогда
				Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета","BY98PJCB30120551901000000933");
			КонецЕсли;
		КонецЕсли; 
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	 
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЭтоМагазин = ЭтоМагазинИлиСклад();
	Если ЭтоМагазин = 1 Тогда
	    Если ДатаМесяцДокументаПриОткрытии <> Месяц(Объект.Дата) Тогда
			 Сообщить("Нельзя менять месяц в дате заказа");
			 Отказ = Истина;
        КонецЕсли; 
         
		//СоглашениеПриИзменении(""); 
	КонецЕсли; 
	
	ЗаполнитьДругимБанковскимСчетом();
	
	//УстановитьЦеныПоДоставкеНаСервере();
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись  
		//ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		Тогда  	
   	 	ПрименитьСкидку("");	 /////// идет доп. пересчет ТЧ
	КонецЕсли; 
	
	//ПрименитьСкидку("ТоварыОткрытьПодбор");	 /////// идет доп. пересчет ТЧ
    
	//jadmin для корректного резервирования товаров перезаполняю статус товара
	СтатусПриИзмененииСервер();
	
	//Для каждого стр Из Объект.Товары Цикл
	//          
	//	стр.СтатусУказанияСерий = 14;
	//
	//КонецЦикла; 
	
	//SWI jadmin Расчетный НДС	
	ОбработкаВыбораСервер();
	
	//jadmin пересчетТЧ Благотворительность
	Если (СтрНайти(Строка(Объект.Соглашение),"Благотворительность") > 0) Тогда	
		ЗаполнитьПоСебестоимостиНаКлиенте();
	КонецЕсли;

	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		
		УстановитьЦеныПоДоставкеНаСервере();
		ПрименитьСкидку("");
		Возврат;
	КонецЕсли;
	
	// Если документ проводится, проверим рассчитанность скидок и корректность графика оплаты по заказу
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
		
		Отказ = Истина;
		МногооборотнаяТараКлиент.ПредложитьПодобратьМногооборотнуюТару(
			ЭтаФорма,
			"Товары",
			"Номенклатура,Характеристика,Количество,Склад,ДатаОтгрузки",
			Новый ОписаниеОповещения("ПередЗаписьюПредложитьПодобратьМногооборотнуюТаруЗавершение", ЭтотОбъект, ДополнительныеПараметры));
		Возврат;
		
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписьюПредложитьПодобратьМногооборотнуюТаруЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Отказ = Ложь;
	
	Если ИспользоватьАвтоматическиеСкидкиВПродажах И
		Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
		Если Не Объект.СкидкиРассчитаны И СкидкиИзменились() Тогда
			ПрименитьИзмененияСкидокНаценокНаКлиенте(Отказ);
		Иначе
			Объект.СкидкиРассчитаны = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию")
		И Объект.ПорядокРасчетов <> ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным")
		И НЕ (ГрафикИсполненияВДоговоре
		И Объект.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов")) Тогда
		
		СуммаЭтаповОплаты       = Объект.ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
		СуммаЗалогаПоЭтапам     = Объект.ЭтапыГрафикаОплаты.Итог("СуммаЗалогаЗаТару");
		СуммаОтклоненияПоЭтапам = Объект.ЭтапыГрафикаОплаты.Итог("СуммаОтклоненияМерныхТоваров");
		
		СуммаОтклоненияПоОплате = ?(СуммаЭтаповОплаты+СуммаЗалогаПоЭтапам = 0,
		                            0,
		                            Окр(СуммаОтклоненияПоЭтапам * СуммаЭтаповОплаты 
		                                /(СуммаЭтаповОплаты+СуммаЗалогаПоЭтапам),2));
		
		КоличествоЭтапов        = Объект.ЭтапыГрафикаОплаты.Количество();
		
		Если СуммаЗаказано = 0 И СуммаЗалогаЗаТару = 0 И КоличествоЭтапов > 0 Тогда
			Объект.ЭтапыГрафикаОплаты.Очистить();
		ИначеЕсли СуммаЗаказано - СуммаОтклоненияПоОплате <> СуммаЭтаповОплаты
			ИЛИ СуммаЗалогаЗаТару-(СуммаОтклоненияПоЭтапам - СуммаОтклоненияПоОплате) <> СуммаЗалогаПоЭтапам Тогда
			
			ГрафикСоглашенияЗаполнен = ИспользоватьСоглашенияСКлиентами
				И ЗначениеЗаполнено(Объект.Соглашение) И ПродажиВызовСервера.ГрафикСоглашенияЗаполнен(Объект.Соглашение);
			ГрафикЗаполнен = ИспользоватьГрафикиОплаты И ЗначениеЗаполнено(Объект.ГрафикОплаты);
			
			Если КоличествоЭтапов = 0 Тогда
				Если Не (ГрафикЗаполнен Или ГрафикСоглашенияЗаполнен) Тогда
				
					ЭтапыОплатыКлиентСервер.ДобавитьЭтапОплатыПоУмолчанию(
						Объект,
						ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки"),
						Объект.ЖелаемаяДатаОтгрузки,
						СуммаЗаказано,
						СуммаЗалогаЗаТару);
						
				Иначе
					ЗаполнитьЭтапыОплатыСервер(ГрафикСоглашенияЗаполнен, ГрафикЗаполнен);
				КонецЕсли;
			Иначе
				
				ЭтапыОплатыКлиентСервер.РаспределитьСуммуПоЭтапамГрафикаОплаты(
					Объект.ЭтапыГрафикаОплаты,
					СуммаЗаказано,
					СуммаЗалогаЗаТару);
				
			КонецЕсли;
			
			ЭтапыОплатыКлиент.ОповеститьОбОкончанииЗаполненияЭтаповГрафикаОплаты();
			
		КонецЕсли;
		
		НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина);
		
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.ЖелаемаяДатаОтгрузки) Тогда
		
		МаксДатаАванса = ПродажиКлиент.МаксимальнаяДатаАванса(Объект.ЭтапыГрафикаОплаты);
		Если ЗначениеЗаполнено(МаксДатаАванса) И МаксДатаАванса > Объект.ЖелаемаяДатаОтгрузки Тогда
			Объект.ЖелаемаяДатаОтгрузки = МаксДатаАванса;
			ПродажиКлиент.ОповеститьОПерезаполненииЖелаемойДатыОтгрузки();
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтаФорма, ДополнительныеПараметры.ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	//Проверка на ЗапретОтгрузки  
    Если ТекущийОбъект.Партнер.ОтгрузкаНеОсуществляется Тогда
        Если НачалоДня(ТекущийОбъект.Дата)>= НачалоДня(ТекущийОбъект.Партнер.ДатаОтгрузкаНеОсуществляется) Тогда
            Отказ = Истина;
            Сообщить("У контрагента в заказе "+ТекущийОбъект.Контрагент+ " установлен признак ""Отгрузка не осуществляется""!!!");
        КонецЕсли;	
	КонецЕсли; 
	
	
	
	//// Проверка на кратность упаковки
	
	Если Объект.Склад = Справочники.Склады.Склад5 Тогда
		
		ТЧ_Товары0 = ТекущийОбъект.Товары.Выгрузить();
		Для каждого СтрТЧ_0 Из ТЧ_Товары0 Цикл 
			Проверка = 0;
			Если СтрТЧ_0.КратностьУпаковки <> 0 Тогда
				Проверка = СтрТЧ_0.КоличествоУпаковок / СтрТЧ_0.КратностьУпаковки;
			КонецЕсли; 
			
			Если ДробнаяЧасть(Проверка) > 0 Тогда
				Сообщить(" Строка № "+СтрТЧ_0.НомерСтроки+" отгружамое Количество  "+СтрТЧ_0.КоличествоУпаковок+"  не кратно количеству в упаковке  "+СтрТЧ_0.КратностьУпаковки);
				//Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	
////jadmin Проверка на дозаявки
	//Если ТекущийОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
		ТЧ_Товары = ТекущийОбъект.Товары.Выгрузить();

		ЭтоЛук = ПроверитьЗаявкуНаЛук(ТЧ_Товары);

		Если ЭтоЛук = ИСТИНА Тогда	
			Если ТекущийОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
				И ТекущийОбъект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз
				Тогда
				
				Если ТекущийОбъект.Готовность = ЛОЖЬ 
					//И ТекущийОбъект.ВзятВРаботу = ИСТИНА 
					Тогда
					СледРабДень = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),1);
					ЗапретДозаявок = ЛОЖЬ;
					Если ТекущийОбъект.ДатаОтгрузки <= ТекущаяДата() Тогда
						Если Час(ТекущаяДата()) > 13  Тогда 								
							ЗапретДозаявок = ИСТИНА;
							//ИначеЕсли Час(ТекущаяДата()) = 10 И Минута(ТекущаяДата())>30 Тогда
							//	ЗапретДозаявок = ИСТИНА;
						КонецЕсли;
						
						Если ЗапретДозаявок = ИСТИНА Тогда					
							Сообщить("Нельзя делать ""дозаявки"" на лук на сегодня после 14 часов");   
							Если РольДоступна("АдминистраторСистемы") ИЛИ РольДоступна("РазрешитьУстановкуЗаявокВнеГрафика") Тогда
								
							Иначе
								Отказ = ИСТИНА;
							КонецЕсли;   
							
						КонецЕсли;
						
					КонецЕсли;
				КонецЕсли; 
				
				
			Иначе	    
				Если ТекущийОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
					Если ТекущийОбъект.Готовность = ЛОЖЬ 
						//И ТекущийОбъект.ВзятВРаботу = ИСТИНА 
						Тогда
						СледРабДень = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),1);
						ЗапретДозаявок = ЛОЖЬ;
						Если ТекущийОбъект.ДатаОтгрузки <= СледРабДень Тогда
							Если Час(ТекущаяДата()) > 10  Тогда 								
								ЗапретДозаявок = ИСТИНА;
							ИначеЕсли Час(ТекущаяДата()) = 10 И Минута(ТекущаяДата())>30 Тогда
								ЗапретДозаявок = ИСТИНА;
							КонецЕсли;
							
							Если ЗапретДозаявок = ИСТИНА Тогда					
								Сообщить("Нельзя делать ""дозаявки"" на завтра после 10 часов");   
								Если РольДоступна("АдминистраторСистемы") ИЛИ РольДоступна("РазрешитьУстановкуЗаявокВнеГрафика") Тогда
									
								Иначе
									Отказ = ИСТИНА;
								КонецЕсли;   
								
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;				
				КонецЕсли;
			КонецЕсли;
			
	
		Иначе             
			
			Если НЕ Объект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Благотворительность",ИСТИНА) Тогда
				
				Если ТекущийОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
					//И ТекущийОбъект.СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз
					Тогда
					//Если ЗначениеЗаполнено(Объект.ВремяГотовности) Тогда
					//Если НачалоДня(ТекущийОбъект.ВремяГотовности) = НачалоДня(ТекущаяДата()) 
					//	И Час(ТекущийОбъект.ВремяГотовности) > 11 Тогда
					
					Если Объект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
						Если ТекущийОбъект.Готовность = ЛОЖЬ 
							//И ТекущийОбъект.ВзятВРаботу = ИСТИНА 
							Тогда
							СледРабДень = ОбщийМодуль77w.ДобавитьРабочиеДни(ТекущаяДата(),1);
							ЗапретДозаявок = ЛОЖЬ;
							Если ТекущийОбъект.ДатаОтгрузки <= СледРабДень Тогда
								Если Час(ТекущаяДата()) > 10  Тогда 								
									ЗапретДозаявок = ИСТИНА;
								ИначеЕсли Час(ТекущаяДата()) = 10 И Минута(ТекущаяДата())>30 Тогда
									ЗапретДозаявок = ИСТИНА;
								КонецЕсли;
								
								Если ЗапретДозаявок = ИСТИНА Тогда					
									Сообщить("Нельзя делать ""дозаявки"" на завтра после 10 часов");   
									Если РольДоступна("АдминистраторСистемы") ИЛИ РольДоступна("РазрешитьУстановкуЗаявокВнеГрафика") Тогда
										
									Иначе
										Отказ = ИСТИНА;
									КонецЕсли;   
								КонецЕсли;
							КонецЕсли;
						КонецЕсли; 
					КонецЕсли;
					
					
					
					//	КонецЕсли; 
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;

	//КонецЕсли;
////	

		///Проверка выписана ли накладная
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если ПроверитьВыписанаНакладная(Объект.Ссылка) = ИСТИНА Тогда
				Если РольДоступна("АдминистраторСистемы") Тогда
					
				Иначе	
					Сообщить("Изменение заявки запрещено, т.к. уже выписана накладная. Необходимо отменить проведение накладной для внесения корректировок.") ;
				    Отказ = Истина
					
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;



///Проверка КоличестваСтрокВЭквиваленте

 //ТЧ_Товары = ТекущийОбъект.Товары.Выгрузить();

 //   	ЭтоЛук = ПроверитьЗаявкуНаЛук(ТЧ_Товары);


//Если Константы.ОграничениеПоЭквивалентуСтрок.Получить() = ИСТИНА Тогда
	
	//ТЧ_Товары = ТекущийОбъект.Товары.Выгрузить();
	

	СтараяСхема = ЛОЖЬ;
	Если СтараяСхема = Ложь Тогда
		
		Если ТекущийОбъект.Склад = Справочники.Склады.Склад3 
			ИЛИ ТекущийОбъект.Склад = Справочники.Склады.Склад5
			ИЛИ ТекущийОбъект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА)
			И Объект.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Благотворительность") 
			//И ЭтоЛук = ЛОЖЬ 
			И НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			
			
			Если Объект.Готовность = ЛОЖЬ Тогда
				Если Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
					//И Объект.ДатаОтгрузкиПриВходе <> Объект.ДатаОтгрузки 
					КоличествоСтрокВЭквиваленте = 0;
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЛимитыСборкиСкладаСрезПоследних.ГруппаТовара КАК ГруппаТовара
					|ИЗ
					|	РегистрСведений.ЛимитыСборкиСклада.СрезПоследних(&ДатаОтгрузки, ) КАК ЛимитыСборкиСкладаСрезПоследних
					|ГДЕ
					|	ЛимитыСборкиСкладаСрезПоследних.ГруппаТовара <> &ГруппаТовара
					|
					|СГРУППИРОВАТЬ ПО
					|	ЛимитыСборкиСкладаСрезПоследних.ГруппаТовара";
					
					Запрос.УстановитьПараметр("ГруппаТовара", Справочники.Номенклатура.ПустаяСсылка());
					Запрос.УстановитьПараметр("ДатаОтгрузки", ТекущийОбъект.ЖелаемаяДатаОтгрузки);
					
					ТЗГруппыТоваров = Запрос.Выполнить().Выгрузить();
					
					
					
					
					//ТЧ_Товары = ТекущийОбъект.Товары.Выгрузить();	
					
					КоличествоСтрокВЭквиваленте = ОбщийМодуль77w.ПолучитьКолВоСтрокЭквивалент(ТЧ_Товары, ТЗГруппыТоваров,ТекущийОбъект.Склад,ТекущийОбъект.Дата);
					
					Если КоличествоСтрокВЭквиваленте > 0 Тогда
					
						ДоступноСтрок = 0;
						
						ДоступноСтрок = ОбщийМодуль77w.ДоступноСтрокКСборке(ТекущийОбъект.Склад, ТЗГруппыТоваров, ТекущийОбъект.ДатаОтгрузки, ТекущийОбъект.Дата,Перечисления.ПриоритетСборки.Клиенты,ТекущийОбъект.СпособДоставки); 
						
						ДобавитьЗаказ = ИСТИНА;
						//Если ДоступноСтрок - КоличествоСтрокВЭквиваленте < -10 Тогда
						Если ДоступноСтрок < -10 Тогда
							
							ДобавитьЗаказ = ЛОЖЬ;
							
						КонецЕсли;
						
						Если ДобавитьЗаказ = ЛОЖЬ Тогда
							Сообщить("Нельзя добавить заказ на указанную дату доставки. Доступно строк к добавлению: " + (ДоступноСтрок)); 
							
						Иначе                   
							Если ДоступноСтрок <> 0 Тогда
								
								Сообщить("Доступно строк к добавлению: " + (ДоступноСтрок)); 
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;

					//Если ДобавитьЗаказ = ЛОЖЬ Тогда					
					//	Если РольДоступна("MSSO_ЗавСкладом") 
					//		ИЛИ РольДоступна("MSSO_Кладовщики")
					//		ИЛИ РольДоступна("АдминистраторСистемы") Тогда
					//		
					//	Иначе	
					//		Отказ = ИСТИНА;
					//	КонецЕсли;		 
					//КонецЕсли; 
					
					
					//-------------- Группы товара	         
					
					КоличествоСтрокВЭквивалентеГруппы = 0;
					
					
					Для каждого стр Из ТЗГруппыТоваров Цикл
						
						КоличествоСтрокВЭквивалентеГруппа = 0;
						
						ГруппаНоменклатуры = стр.ГруппаТовара;
						
						КоличествоСтрокВЭквивалентеГруппа = ОбщийМодуль77w.ПолучитьКолВоСтрокЭквивалентОтдельныеГруппыТовара(ТЧ_Товары, ГруппаНоменклатуры, ТекущийОбъект.Склад,ТекущийОбъект.Дата);
						
						Если КоличествоСтрокВЭквивалентеГруппа > 0 Тогда
							
							КоличествоСтрокВЭквивалентеГруппы = КоличествоСтрокВЭквивалентеГруппы + КоличествоСтрокВЭквивалентеГруппа;
							
							ДоступноСтрокГруппа = 0;
							ДоступноСтрокГруппа = ОбщийМодуль77w.ДоступноСтрокКСборкеОтдельныеГруппыТовара(ТекущийОбъект.Склад, ГруппаНоменклатуры, ТекущийОбъект.ДатаОтгрузки, ТекущийОбъект.Дата,Перечисления.ПриоритетСборки.Клиенты,ТекущийОбъект.СпособДоставки); 
							
							//ДобавитьЗаказ = ИСТИНА;
							//Если ДоступноСтрокГруппа - КоличествоСтрокВЭквивалентеГруппа < 0 Тогда
							Если ДоступноСтрокГруппа < 0 Тогда	
								ДобавитьЗаказ = ЛОЖЬ;
								
							КонецЕсли;
							Если ДобавитьЗаказ = ЛОЖЬ Тогда
								Сообщить("Нельзя добавить заказ на указанную дату доставки. Доступно строк к добавлению ГРУППЫ("+ГруппаНоменклатуры+"): " + (ДоступноСтрокГруппа)); 
								Прервать;
							Иначе   
								Если ДоступноСтрокГруппа - КоличествоСтрокВЭквивалентеГруппа <> 0 Тогда						
									Сообщить("Доступно строк к добавлению ГРУППА("+ГруппаНоменклатуры+"): " + (ДоступноСтрокГруппа)); 						
								КонецЕсли;
							КонецЕсли;    
							
							
						КонецЕсли;
						
					КонецЦикла;   
					
					Если ДобавитьЗаказ = ЛОЖЬ Тогда					
						Если РольДоступна("MSSO_ЗавСкладом") 
							ИЛИ РольДоступна("MSSO_Кладовщики")
							ИЛИ РольДоступна("АдминистраторСистемы")
							ИЛИ РольДоступна("РазрешитьУстановкуЗаявокВнеГрафика") Тогда
							
						Иначе	
							Отказ = ИСТИНА;
						КонецЕсли;		 
					КонецЕсли; 
					//------------	
					
					
					Если Не Отказ Тогда	
						Если ТекущийОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
							ТекущийОбъект.ДатаОтгрузкиПриВходе = ТекущийОбъект.ДатаОтгрузки;	
						Иначе
							ТекущийОбъект.ДатаОтгрузкиПриВходе = Дата(1,1,1);
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;
				
				//ТекущийОбъект.КоличествоСтрокВЭквиваленте = КоличествоСтрокВЭквиваленте+КоличествоСтрокВЭквивалентеГруппы;
				
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если ТекущийОбъект.Склад = Справочники.Склады.Склад3 
			ИЛИ ТекущийОбъект.Склад = Справочники.Склады.Склад5
			ИЛИ ТекущийОбъект.Склад = Справочники.Склады.НайтиПоНаименованию("Склад N 3 опт",ИСТИНА)
			И Объект.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Благотворительность") 
			И ЭтоЛук = ЛОЖЬ 
			И НЕ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			
			
			
			
			Если Объект.Готовность = ЛОЖЬ Тогда
				Если Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
					//И Объект.ДатаОтгрузкиПриВходе <> Объект.ДатаОтгрузки 
										
					//ТЧ_Товары = ТекущийОбъект.Товары.Выгрузить();	
					
					КоличествоСтрокВЭквиваленте = ОбщийМодуль77w.ПолучитьКолВоСтрокЭквивалентОбщий(ТЧ_Товары,ТекущийОбъект.Склад,ТекущийОбъект.Дата);
					
					ТекущийОбъект.КоличествоСтрокВЭквиваленте = КоличествоСтрокВЭквиваленте;
					
					ДоступноСтрок = 0;
					
					ДоступноСтрок = ОбщийМодуль77w.ДоступноСтрокКСборке(ТекущийОбъект.Склад, ТекущийОбъект.ДатаОтгрузки, ТекущийОбъект.Дата,Перечисления.ПриоритетСборки.Клиенты,ТекущийОбъект.СпособДоставки); 
					
					ДобавитьЗаказ = ИСТИНА;
					Если ДоступноСтрок - КоличествоСтрокВЭквиваленте < -10 Тогда
						
						ДобавитьЗаказ = ЛОЖЬ;
						
					КонецЕсли;
					Если ДобавитьЗаказ = ЛОЖЬ Тогда
						Сообщить("Нельзя добавить заказ на указанную дату доставки. Доступно строк к добавлению: " + (ДоступноСтрок - КоличествоСтрокВЭквиваленте)); 
					Иначе
						Сообщить("Доступно строк к добавлению: " + (ДоступноСтрок - КоличествоСтрокВЭквиваленте)); 
					КонецЕсли;
					
					
					Если ДобавитьЗаказ = ЛОЖЬ Тогда					
						Если РольДоступна("MSSO_ЗавСкладом") 
							ИЛИ РольДоступна("MSSO_Кладовщики")
							ИЛИ РольДоступна("MSSO_Магазины")   /////////////// чтобы безнал по магазинам не проверял ////77w
                            ИЛИ РольДоступна("АдминистраторСистемы")
							ИЛИ РольДоступна("РазрешитьУстановкуЗаявокВнеГрафика") Тогда
							
						Иначе	
							Отказ = ИСТИНА;
						КонецЕсли;		 
					КонецЕсли; 
					
					Если Не Отказ Тогда	
						Если ТекущийОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
							ТекущийОбъект.ДатаОтгрузкиПриВходе = ТекущийОбъект.ДатаОтгрузки;	
						Иначе
							ТекущийОбъект.ДатаОтгрузкиПриВходе = Дата(1,1,1);
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;				
			КонецЕсли;
		КонецЕсли;				
	КонецЕсли;
//КонецЕсли;
/////

    Если НЕ Отказ Тогда	
		Если ТекущийОбъект.ИгнорироватьЗапретДоставки = ЛОЖЬ 
			И ТекущийОбъект.СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз Тогда
			
			ЗапретДоставкиТоваров = ПолучитьТоварыСЗапретомОтгрузки(ТЧ_Товары);
			Отказ = ЗапретДоставкиТоваров;
			
			
		КонецЕсли;
	КонецЕсли;
			


//////
	
	КонтрольЗаполненияКоординатАдресаДоставки = Константы.КонтрольЗаполненияКоординатАдресаДоставки.Получить();
	
	//jadmin Проверка координат Адреса доставки
	Если ТекущийОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
		Если ТекущийОбъект.СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз Тогда
			Если ЗначениеЗаполнено(ТекущийОбъект.АдресДоставки) Тогда
				ЕстьКоординаты = ПроверитьКоординатыАдресаДоставки(ТекущийОбъект.АдресДоставки);
				Если ЕстьКоординаты = ЛОЖЬ Тогда	
					Сообщить("Необходимо добавить адрес доставки " + ТекущийОбъект.АдресДоставки + " в справочник пункты погрузки/разгрузки и указать его координаты");
					Если КонтрольЗаполненияКоординатАдресаДоставки = ИСТИНА Тогда
						Отказ = Истина;	
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 

	
		
	Если ТекущийОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
		 ТекущийОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным;
	КонецЕсли;

	
	////77w qaws
	РассчитанныйВес = 0; СуммаПредоплаты = 0; СуммаДокумента = 0; НашлиОрдерКОтгрузке = ЛОЖЬ;
	Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) Тогда
		НашлиОрдерКОтгрузке = НайтиОрдерКОтгрузке(ТекущийОбъект.Ссылка);
	КонецЕсли; 
	
	Если ТекущийОбъект.Товары.Количество()>0 Тогда
		 Для каждого СтрокаТовара Из ТекущийОбъект.Товары Цикл
		   //РассчитанныйВес = РассчитанныйВес+(СтрокаТовара.Упаковка.Вес*СтрокаТовара.Количество);
		   //РассчитанныйВес = РассчитанныйВес+(СтрокаТовара.Номенклатура.ЕдиницаИзмерения.Вес*СтрокаТовара.Количество); //090321
   		 	РассчитанныйВес = РассчитанныйВес+(СтрокаТовара.Номенклатура.ВесЧислитель*СтрокаТовара.Количество);   //jadmin
			СуммаДокумента = СуммаДокумента + СтрокаТовара.СуммаСНДС;
			
			//проверка весового товара			
			НетДоступныхШТ = ЛОЖЬ;
			Если ТекущийОбъект.Склад.ТипСклада <> Перечисления.ТипыСкладов.РозничныйМагазин Тогда
				
					
				Если СтрокаТовара.Номенклатура.ВесКонтроль = ИСТИНА Тогда
				
					ДоступноШТ = ПроверитьДоступностьВШт(СтрокаТовара.Номенклатура,СтрокаТовара.Серия,ТекущийОбъект.Склад);
					Если ДоступноШТ < 0 Тогда
					    ДоступноШТ = 0;
					КонецЕсли; 
					
					Если ЗначениеЗаполнено(ТекущийОбъект.Ссылка) 
						И ТекущийОбъект.Проведен = ИСТИНА 
						И Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
						Если НашлиОрдерКОтгрузке = ЛОЖЬ Тогда
							Если ДоступноШТ+СтрокаТовара.КолВоГрузовыхМест < СтрокаТовара.КолВоГрузовыхМест Тогда
								НетДоступныхШТ = ИСТИНА;
							КонецЕсли;				
						КонецЕсли;
					Иначе	
					    Если ДоступноШТ < СтрокаТовара.КолВоГрузовыхМест Тогда
							НетДоступныхШТ = ИСТИНА;
						КонецЕсли;
					КонецЕсли;
					Если НетДоступныхШТ = ИСТИНА Тогда
					     Сообщить("Строка " + СтрокаТовара.НомерСтроки +" " +СтрокаТовара.Номенклатура + " - заказано больше грузовых мест, чем имеется в наличии");
						 Если РольДоступна("АдминистраторСистемы") Тогда
						 
						 Иначе	
							 Отказ = ИСТИНА;
						 КонецЕсли; 
					КонецЕсли;				
				КонецЕсли;	
			КонецЕсли; 
			///
	
			///

			
			
			//Если СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//	ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//	ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//	
			//	ИЛИ СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
			//	ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
			//	ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
			//	//
			//	//ИЛИ ((СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")    //ЛукСевок
			//	//		ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")    //ЛукСевок
			//	//		ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016"))    //ЛукСевок
			//	//			И НЕ СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000019")) //Чеснок
			//	////Отключил по требованию руководства с 09.08.22
			//	
			//	Тогда
			//	//ЕстьЛук = Истина;
			//	
			//	//Определяем сумму предоплаты
			//	СуммаПредоплаты = СуммаПредоплаты + СтрокаТовара.СуммаСНДС;
			//	
			//	ТоварыСПредоплатой = Истина;
			//КонецЕсли;
	 
		 КонецЦикла; 
	КонецЕсли; 
	
    РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);	
	
	
	
	
	
    
	//Если Объект.Дата >= Дата("20220314") Тогда 	
	//    
	//    
	//    Если Объект.КоличествоДнейОтсрочки = 0
	//        И Объект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые")
	//        И Объект.Партнер.ВидПартнераКонтрагента <> Справочники.ВидПартнераКонтрагента.НайтиПоКоду("000000007") Тогда
	//        
	//        Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	//        
	//        Объект.ЭтапыГрафикаОплаты.Очистить();
	//        стрЭтапПредоплата = Объект.ЭтапыГрафикаОплаты.Добавить();
	//        стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
	//        стрЭтапПредоплата.ДатаПлатежа = Объект.Дата + 86400*5;
	//        //стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
	//        стрЭтапПредоплата.ПроцентПлатежа = 100;
	//        стрЭтапПредоплата.СуммаПлатежа = СуммаДокумента;
	//        
	//        НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина);
	//        
	//    Иначе
	//        
	//        //Заполняем Этапы оплат по графику Суммы
	//        
	//        Если ТоварыСПредоплатой = ИСТИНА 
	//            И Объект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые")
	//            И Объект.Партнер.ВидПартнераКонтрагента <> Справочники.ВидПартнераКонтрагента.НайтиПоКоду("000000007") Тогда
	//            Объект.ЭтапыГрафикаОплаты.Очистить();
	//            стрЭтапПредоплата = Объект.ЭтапыГрафикаОплаты.Добавить();
	//            стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
	//            стрЭтапПредоплата.ДатаПлатежа = Объект.Дата + 86400*5;
	//            стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
	//            стрЭтапПредоплата.ПроцентПлатежа = Окр(СуммаПредоплаты/СуммаДокумента * 100,0);
	//            
	//            Если стрЭтапПредоплата.ПроцентПлатежа < 100 Тогда
	//                
	//                стрЭтапКредит = Объект.ЭтапыГрафикаОплаты.Добавить();
	//                стрЭтапКредит.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки;
	//                стрЭтапКредит.ДатаПлатежа = Объект.Дата + 86400 * Объект.Договор.ОтсрочкаОплатыПоДоговору;
	//                стрЭтапКредит.СуммаПлатежа = СуммаДокумента - СуммаПредоплаты;
	//                стрЭтапКредит.ПроцентПлатежа = 100 - стрЭтапПредоплата.ПроцентПлатежа; 
	//                
	//            КонецЕсли;
	//            
	//            Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	//            
	//            НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина);
	//        КонецЕсли;
	//    КонецЕсли; 
	//КонецЕсли;	

	

	//jadmin Предоплата откл 220322
	//ИтогСуммаСНДС = ТекущийОбъект.Товары.Итог("СуммаСНДС");
	//Если ТекущийОбъект.ЭтапыГрафикаОплаты.Количество() > 0  Тогда
	//	 ТекущийОбъект.ЭтапыГрафикаОплаты[0].СуммаПлатежа = ИтогСуммаСНДС;
	//КонецЕсли; 	
	//
	
	
	
	Если ТекущийОбъект.СкидкаЗаПредоплату = Истина Тогда
		ДокументПродажи = РеквизитФормыВЗначение("Объект");
		
	    ТекущийОбъект.ЭтапыГрафикаОплаты.Очистить();
		стрЭтапПредоплата = ТекущийОбъект.ЭтапыГрафикаОплаты.Добавить();
		стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
		стрЭтапПредоплата.ДатаПлатежа = ТекущийОбъект.Дата + 86400*3;
		//стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
		стрЭтапПредоплата.ПроцентПлатежа = 100;
		стрЭтапПредоплата.СуммаПлатежа = ДокументПродажи.ПолучитьСуммуЗаказанныхСтрок();
		
		ТекущийОбъект.СуммаПредоплатыДоОтгрузки = ДокументПродажи.ПолучитьСуммуЗаказанныхСтрок();
	КонецЕсли; 

	
	/////Проверка Предоплата       
	Если ТекущийОбъект.СкидкаЗаПредоплату = ИСТИНА  Тогда  
		
		ТЗОплаты = ТекущийОбъект.ЭтапыГрафикаОплаты.Выгрузить();
		
		Если ТекущийОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
			Если ОбщийМодуль77w.ПроверитьПредоплатуМССО(ТекущийОбъект.Ссылка,ТЗОплаты) = Ложь Тогда   				
				ЕстьОбещанныйПлатеж = ОбщийМодуль77w.ПроверкаОбещанногоПлатежа(ТекущийОбъект.Ссылка);
				Если ЕстьОбещанныйПлатеж = ЛОЖЬ Тогда
					Сообщить("По заказу "+ТекущийОбъект.Ссылка+" нет предоплаты. Отгрузка невозможна."); 
					Если РольДоступна("АдминистраторСистемы") Тогда
					
					Иначе	
						Отказ = ИСТИНА; 
					КонецЕсли;
				КонецЕсли;   				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	
	
	
	ТекущийОбъект.ОриентировочныйВес = РассчитанныйВес;
	
	
	СекундДоСрока = Константы.СрокКонтроляДействияАнализа.Получить() *60 * 60 * 24;
	ПодошелСрокДатыАнализа = Дата(1, 1, 1);
	СрокДействияАнализа = Дата(1, 1, 1);	
	
	
	
	///////////77w qaws
	Отказов = 0;
	Если Объект.Товары.Количество() > 0 Тогда
		
		Для каждого ВыборкаПоТовару Из Объект.Товары Цикл
			
			СрокДействияАнализа = "";
			Партия_МССО_Ссылка = ВыборкаПоТовару.Серия.Партия_МССО;
			
			Если Партия_МССО_Ссылка.Анализы.Количество() > 0 Тогда
				
				Для Каждого СтрокаАнализы Из Партия_МССО_Ссылка.Анализы Цикл
					
					СрокДействияАнализаЕсть = СтрокаАнализы.СрокДействияАнализа;
					
					Если НЕ ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
						Продолжить;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
						СрокДействияАнализа = СрокДействияАнализаЕсть;
					Иначе
						СрокДействияАнализа = Дата(1, 1, 1);
					КонецЕсли;
					
				КонецЦикла;
			Иначе
				СрокДействияАнализаЕсть = Партия_МССО_Ссылка.СрокДействияАнализа;
				
					Если НЕ ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
						Продолжить;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
						СрокДействияАнализа = СрокДействияАнализаЕсть;
					Иначе
						СрокДействияАнализа = Дата(1, 1, 1);
					КонецЕсли;
				
			КонецЕсли;
			
			
			
			Попытка
				ПодошелСрокДатыАнализа = НачалоДня(СрокДействияАнализа - СекундДоСрока);
				
				Если (СрокДействияАнализа - Объект.Дата)<=(СрокДействияАнализа - ПодошелСрокДатыАнализа) Тогда
					Сообщить("Строка № "+ВыборкаПоТовару.НомерСтроки+"  СРОК АНАЛИЗА ИСТЕКАЕТ: "+ВыборкаПоТовару.Номенклатура+"  ПАРТИЯ  "+ВыборкаПоТовару.Серия);
					//Если ВыборкаПоТовару.Номенклатура.ВесКонтроль = ИСТИНА Тогда  //////лук
					//	Отказов = Отказов +1;
					//КонецЕсли; 
				КонецЕсли; 
			Исключение
				
			КонецПопытки; 
		КонецЦикла; 
		
		
	КонецЕсли; 
	
	
	Если Отказов>0 Тогда
		Отказ = Истина;
	КонецЕсли; 
	
		//jadmin Проверка на изменения при созданном ордере	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РасходныйОрдерНаТоварыОснования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
		|ГДЕ
		|	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ
		|	И РасходныйОрдерНаТоварыОснования.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("ВыбЗаказ", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НашлиОрдер = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;	 
		
		Если НашлиОрдер <> Неопределено 
			ИЛИ Объект.ВзятВРаботу = ИСТИНА Тогда
			
			//ТЗприВходе = Новый ТаблицаЗначений;	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказКлиента.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаказКлиента КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Док =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				ТЗприВходе = Док.Товары.Выгрузить();
			КонецЦикла;
			ТЗприВыходе = Объект.Товары.Выгрузить();
			ТЗприВыходе.Свернуть("Номенклатура,Серия","Количество");
			ТЗприВходе.Свернуть("Номенклатура,Серия","Количество");
			
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("ТЗприВходе",ТЗприВходе); 
			Запрос.УстановитьПараметр("ТЗприВыходе",ТЗприВыходе);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТЗприВходе.Номенклатура КАК Номенклатура,
			|	ТЗприВходе.Серия КАК Серия,
			|	ТЗприВходе.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТЗприВходе
			|ИЗ
			|	&ТЗприВходе КАК ТЗприВходе
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЗприВыходе.Номенклатура КАК Номенклатура,
			|	ТЗприВыходе.Серия КАК Серия,
			|	ТЗприВыходе.Количество КАК Количество
			|ПОМЕСТИТЬ ВТ_ТЗприВыходе
			|ИЗ
			|	&ТЗприВыходе КАК ТЗприВыходе
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТЗприВходе.Номенклатура КАК Номенклатура,
			|	ВТ_ТЗприВходе.Серия КАК Серия,
			|	ВТ_ТЗприВходе.Количество КАК Количество
			|ПОМЕСТИТЬ Итог
			|ИЗ
			|	ВТ_ТЗприВходе КАК ВТ_ТЗприВходе
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТ_ТЗприВыходе.Номенклатура,
			|	ВТ_ТЗприВыходе.Серия,
			|	-ВТ_ТЗприВыходе.Количество
			|ИЗ
			|	ВТ_ТЗприВыходе КАК ВТ_ТЗприВыходе
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Итог.Номенклатура КАК Номенклатура,
			|	Итог.Серия КАК Серия,
			|	СУММА(Итог.Количество) КАК Количество
			|ПОМЕСТИТЬ Рез
			|ИЗ
			|	Итог КАК Итог
			|
			|СГРУППИРОВАТЬ ПО
			|	Итог.Номенклатура,
			|	Итог.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Рез.Номенклатура КАК Номенклатура,
			|	Рез.Серия КАК Серия,
			|	Рез.Количество КАК Количество
			|ИЗ
			|	Рез КАК Рез
			|ГДЕ
			|	Рез.Количество <> 0";
			
			
			РезЗпр = Запрос.Выполнить().Выгрузить();
			
			Если РезЗпр.Количество() <> 0 Тогда				
				Сообщить("Изменение табличной части с Товарами запрещено, т.к. уже создан расходных ордер");
				
					ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
					Если РольДоступна("АдминистраторСистемы") Тогда

					Иначе
						Отказ = ИСТИНА;	
					КонецЕсли;	
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	/// конец Проверка на изменения при созданном ордере

	
    

    Если Объект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин И Объект.ИнтернетЗаказ = Ложь Тогда 
        
        Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
        Объект.СрокДействияЗаказа =  Объект.Дата + 86400*5;
        Объект.ЭтапыГрафикаОплаты.Очистить();
        
        стрЭтапПредоплата = Объект.ЭтапыГрафикаОплаты.Добавить();
		стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
		стрЭтапПредоплата.ДатаПлатежа = Объект.Дата + 86400*5;
		//стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
		стрЭтапПредоплата.ПроцентПлатежа = 100;
		стрЭтапПредоплата.СуммаПлатежа = Объект.Товары.Итог("СуммаСНДС");
		
		НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина);

    КонецЕсли;
    
    
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДоступностьЭлементовПоСтатусуСервер();
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	ОбновитьДубликатыЗависимыхРеквизитов();
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;

	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРиски.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	
	ОбновитьСостояниеСервер();
	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
	ОбновитьОграничениеЗадолженности();

	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);  
  
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("Сделка", Объект.Сделка);
	Оповестить("Запись_ЗаказКлиента", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияКлиентПереопределяемый.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование

	// Неизвестные штрихкоды
	Если Источник = "ПодключаемоеОборудование"
		И ИмяСобытия = "НеизвестныеШтрихкоды"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		
		КэшированныеЗначения.Штрихкоды.Очистить();
		ДанныеШтрихкодов = Новый Массив;
		Для Каждого ПолученныйШтрихкод Из Параметр.ПолученыНовыеШтрихкоды Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		Для Каждого ПолученныйШтрихкод Из Параметр.ЗарегистрированныеШтрихкоды Цикл
			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
		КонецЦикла;
		
		ОбработатьШтрихкоды(ДанныеШтрихкодов);
		
	КонецЕсли;
	
	Если (ИмяСобытия = "ЗачтенаОплата" И Параметр = Объект.Ссылка) 
		Или ПродажиКлиент.ИзменилисьДокументыОплатыКлиентам(ИмяСобытия) Тогда
		ИзмененаОплатаСервер();
	КонецЕсли;
	
	Если ИмяСобытия = "ОбновитьДокументИБПослеЗаполнения"  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		ЭтаФорма.Прочитать();
	ИначеЕсли ИмяСобытия = "ОбновитьДокументИБПослеЗаполненияИзФайла"  И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	Если ИмяСобытия = "СчитанаКартаЛояльности"
		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
		СчитанаКартаЛояльности(Новый ОписаниеОповещения("ОбработкаОповещенияЗавершение", ЭтотОбъект, Новый Структура("ИмяСобытия, Параметр", ИмяСобытия, Параметр)), Параметр.КартаЛояльности);
        Возврат;
	КонецЕсли;
	
	// Подсистема "ОбменСКонтрагентами".
	ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
	ПараметрыОповещения.Форма = ЭтотОбъект;
	ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
	ПараметрыОповещения.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски
	СПАРКРискиКлиент.ОбработкаОповещения(ЭтотОбъект, Неопределено, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски
	
	ОбработкаОповещенияФрагмент(ИмяСобытия, Параметр);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ИмяСобытия = ДополнительныеПараметры.ИмяСобытия;
    Параметр = ДополнительныеПараметры.Параметр;
    
    
    ОбработкаОповещенияФрагмент(ИмяСобытия, Параметр);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещенияФрагмент(Знач ИмяСобытия, Знач Параметр)
    
    Перем АдресНабораВоВременномХранилище, ПараметрыНабора, ПараметрыОткрытия;
    
    Если ИмяСобытия = "ПолученыСообщения"
        И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
        ПолученыСообщения(Параметр.Сообщения);
    КонецЕсли;
    
    Если ИмяСобытия = "ИзмененРеквизитЗависящийОтСтатуса"
        И Параметр.УникальныйИдентификатор = УникальныйИдентификатор Тогда
        Если Объект.Согласован Тогда
            Объект.Согласован = Ложь;
        КонецЕсли;
        ПодключитьОбработчикОжидания("Подключаемый_ПриИзмененииРеквизитаЗависящегоОтСтатуса", 0.1, Истина);
    КонецЕсли;
    
    Если ИмяСобытия = "КопированиеСтрокВБуферОбмена" Тогда
        
        УстановитьДоступностьКомандБуфераОбменаНаКлиенте();
        
    КонецЕсли;
    
    Если ИмяСобытия = "ДобавлениеПартнераВСегмент"
        ИЛИ ИмяСобытия = "УдалениеПартнераИзСегмента" Тогда
        
        УстановитьВидимостьЗапретаОтгрузкиПартнеру();
    КонецЕсли;
    
    Если ИмяСобытия = "Закрытие_РедактированиеКомплекта"
        И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
        ПриОкончанииРедактированияНабора(Параметр.АдресВоВременномХранилище);
		ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
   КонецЕсли;
    
    Если ИмяСобытия = "РедактироватьНабор" 
        И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
        
        ПараметрыНабора = Новый Структура;
        ПараметрыНабора.Вставить("НоменклатураНабора", Параметр.НоменклатураНабора);
        ПараметрыНабора.Вставить("ХарактеристикаНабора", Параметр.ХарактеристикаНабора);
        ПараметрыНабора.Вставить("КолонкиНабора", КолонкиНабора(ЭтаФорма));
        
        АдресНабораВоВременномХранилище = АдресНабораВоВременномХранилище(ПараметрыНабора);
        
        ПараметрыОткрытия = Новый Структура;
        ПараметрыОткрытия.Вставить("АдресВоВременномХранилище", АдресНабораВоВременномХранилище);
        ПараметрыОткрытия.Вставить("НоменклатураНабора",   Параметр.НоменклатураНабора);
        ПараметрыОткрытия.Вставить("ХарактеристикаНабора", Параметр.ХарактеристикаНабора);
        ПараметрыОткрытия.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
        ПараметрыОткрытия.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
        ПараметрыОткрытия.Вставить("Валюта", Объект.Валюта);
        ПараметрыОткрытия.Вставить("Соглашение", Объект.Соглашение);
        ПараметрыОткрытия.Вставить("Дата", Объект.Дата);
        ПараметрыОткрытия.Вставить("Ссылка", Объект.Ссылка);
        ПараметрыОткрытия.Вставить("Склад", Объект.Склад);
        ПараметрыОткрытия.Вставить("СкрыватьКомандуОстаткиНаСкладах", Ложь);
        
        ОткрытьФорму("Обработка.РедактированиеНабора.Форма.Форма", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор);
        
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЭтоАдминистратор(ТекущийПользователь);
	  КтоИмя = Справочники.Пользователи.НайтиПоНаименованию(ТекущийПользователь,Истина);
	  Если КтоИмя <> Справочники.Пользователи.ПустаяСсылка() Тогда
	  	   Если СокрЛП(КтоИмя.Наименование) = "Администратор" Тогда
		   	    Возврат("Администратор"); 
		   КонецЕсли;  
	  КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаМесяцДокументаПриОткрытии = Месяц(Объект.Дата);
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
	//Если Объект.Ссылка <> Неопределено Тогда
	
	ЭтаФорма.Элементы.ЗаказТребуетВниманияМенеджера.Доступность  = Объект.ЗаказТребуетВниманияМенеджера;      /////77w  qaws

	КтоЭто = ЭтоАдминистратор(ТекущийПользователь);
	
	
	
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
	
	//
	//Если Найти(Строка(ТекущийПользователь), "Бычков Леонид") = 1 Тогда
	//	
	//	ЭтаФорма.Элементы.ОтправитьНаПодтверждение.Видимость = Истина;
	//	
	//	Если СтрНайти(Строка(Объект.Менеджер), "Бычков Леонид") <> 1 Тогда
	//		
	//		Сообщить("У Вас нет прав редактирование не своей заявки!");
	//		
	//		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Объект.Ссылка);
	//		ПоказатьОповещениеПользователя("Только просмотр не своей заявки!", 
	//		НавигационнаяСсылка, 
	//		"...");
	//
	//		ПоказатьПредупреждение(,
	//		"Только просмотр не своей заявки!!",0, "Предупреждение" );
	//		
	//		ТолькоПросмотр = Истина;
	//	Иначе
	//		ТолькоПросмотр = Ложь;
	//		
	//	КонецЕсли; 
	//Иначе 
	//	ЭтаФорма.Элементы.ОтправитьНаПодтверждение.Видимость = Ложь;
	//КонецЕсли; 
	
    
    
        
	Если ОбщийМодуль77w.РольДоступнаНаКлиенте("АдминистраторСистемы") Тогда
	    ЭтаФорма.Элементы.Менеджер.Доступность = Истина;
	Иначе
	    ЭтаФорма.Элементы.Менеджер.Доступность = Ложь;
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Объект.Ссылка) тогда
	//	
	//	Если Объект.ЗаменятьНаАналогПриОтсуствии = Ложь Тогда
	//		
	//		Если КтоЭто <> "Администратор"  Тогда
	//			                             
	//			Если Объект.Автор <> ТекущийПользователь Тогда
	//				//Сообщить("У Вас нет прав на промотр и редактирование не своей заявки");
	//				
	//				//Отказ = Истина;
	//				ЭтаФорма.ТолькоПросмотр = Истина;
	//				НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Объект.Ссылка);
	//				
	//				//ПоказатьОповещениеПользователя("У Вас нет прав на промотр и редактирование не своей заявки!", 
	//				//НавигационнаяСсылка, 
	//				//"...");
	//				ПоказатьОповещениеПользователя("Только просмотр не своей заявки!", 
	//				НавигационнаяСсылка, 
	//				"...");
	//				
	//				//НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Объект.Ссылка);
	//				//ПоказатьОповещениеПользователя("Только просмотр!", 
	//				//НавигационнаяСсылка, 
	//				//"Разрешен только просмотр документа!");
	//				

	//				//Оповещение = "У Вас нет прав на промотр и редактирование не своей заявки!";
	//				//ПоказатьПредупреждение(,
	//				//"У Вас нет прав на промотр и редактирование не своей заявки!",0, "Предупреждение" );
	//				
	//				//Оповещение = "Только просмотр не своей заявки!!";
	//				//ПоказатьПредупреждение(,
	//				//"Только просмотр не своей заявки!!",0, "Предупреждение" );
	//				
	//			КонецЕсли; 
	//		КонецЕсли; 

	//	КонецЕсли; 
	//
	//КонецЕсли; 
	
		
		// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
	
	// Подсистема "ОбменСКонтрагентами".
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец подсистема "ОбменСКонтрагентами".
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски, ПриОткрытии.
	СПАРКРискиКлиент.ПриОткрытии(ЭтотОбъект, Неопределено);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ПриОткрытии.
	
	
	Если Объект.СформированТСД = Истина Тогда
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда
			ПрименитьСкидку("Статус");       ////////77w qaws
		КонецЕсли; 
	КонецЕсли; 
	
	
	
//jadmin	ТекстСуммаПросроченоНажатие("");	
		
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	СкрыватьОтмененныеСтроки =  Настройки.Получить("СкрыватьОтмененныеСтроки");
	
	Если СкрыватьОтмененныеСтроки Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Отменено", Ложь);
	Иначе
		Элементы.Товары.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	Элементы.ТоварыСкрыватьОтмененныеСтроки.Пометка = СкрыватьОтмененныеСтроки;
	ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	Если НЕ Объект.Ссылка.Пустая() ИЛИ НЕ ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента Тогда
		Настройки.Удалить("Объект.НеОтгружатьЧастями");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьВидимостьЭлементовФормыДатОтгрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
		Истина, "Документ.ЗаказКлиента.Форма.ФормаДокумента.Событие.ОбработкаВыбора");

	Если ИсточникВыбора.ИмяФормы = "Перечисление.ВариантыОбеспечения.Форма.ИсполнениеЗаказа" Тогда

		Детали = ЗаполнитьОбеспечениеВУстановленномПорядке(ВыбранноеЗначение);
		Если Детали.Ошибки <> Неопределено Тогда
			ОчиститьСообщения();
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Детали.Ошибки);
		Иначе
			ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Детали.Оповещение);
			СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		КонецЕсли;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Перечисление.ВариантыОбеспечения.Форма.ВыборВариантаОбеспечения" Тогда

		Оповещение = ЗаполнитьВариантОбеспечения(ВыбранноеЗначение);
		ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Оповещение);

		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.СостояниеОбеспечения.Форма.Форма" Тогда

		Оповещение = ЗаполнитьОбеспечениеЗаказа(ВыбранноеЗначение);
		ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Оповещение);

		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Документ.ЗаказКлиента.Форма.РеквизитыПечати" Тогда
		
		Если ВыбранноеЗначение <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		КонецЕсли;
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
		
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
		
		
		ПрименитьСкидку("ТоварыОткрытьПодбор");       ////////77w qaws
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборМногооборотнойТары.Форма.Форма" Тогда
				
			ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(ВыбранноеЗначение.АдресМногооборотнойТарыВХранилище);
			МногооборотнаяТараКлиент.ОповеститьПользователяОЗаполненииМногооборотнойТарой();
			СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		
	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда
		
		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда
		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия" Тогда
		
		СкорректироватьСтрокиЗаказа(ВыбранноеЗначение);
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.ПунктыРазгрузкиПогрузкиКлиентов.Форма.ФормаВыбора" Тогда 
		
		Объект.АдресДоставки = ВыбранноеЗначение;
		ЗаполнитьЗонуДоставкиНаСервере();
		
	КонецЕсли;
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);

	// SWI jadmin
	ОбработкаВыбораСервер();
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораСервер()
	// SWI jadmin
	Если СВ_РасчетныйНДС Тогда
		Для каждого СтрокаТовара Из Объект.Товары Цикл
			//СтрокаТовара.СтавкаНДС = ПолучитьТипНДС();
			НДС = 0;
			ЦенаСоСкидкойСНДС = 0;
			НДССоСкидкой = 0;
			Цена = ОбщийМодуль77w.ПолучитьЦенуНаСервере_Розница(СтрокаТовара.Номенклатура,СтрокаТовара.Серия,Объект.Дата);
			Попытка
				
				ЦенаСоСкидкойСНДС =  Окр(Цена * (1-СтрокаТовара.ПроцентАвтоматическойСкидки/100) * (1-СтрокаТовара.ПроцентРучнойСкидки/100),2);
				
				Если СтрокаТовара.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					НДС = Окр(Цена /6 , 2, РежимОкругления.Окр15как20);
				ИначеЕсли СтрокаТовара.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					НДС = Окр(Цена /11 , 2, РежимОкругления.Окр15как20);	
				Иначе
					НДС = 0;
				КонецЕсли;

				
				Если СтрокаТовара.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
					НДССоСкидкой = Окр(ЦенаСоСкидкойСНДС /6 , 2, РежимОкругления.Окр15как20);
				ИначеЕсли СтрокаТовара.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					НДССоСкидкой = Окр(ЦенаСоСкидкойСНДС /11 , 2, РежимОкругления.Окр15как20);	
				Иначе
					НДССоСкидкой = 0;
				КонецЕсли;
				
					СтрокаТовара.Цена = Окр((Цена - НДС),2);
					////СтрокаТовара.ЦенаСоСкидкой = СтрокаТовара.Цена;
					//СтрокаТовара.ЦенаСоСкидкой = Окр(СтрокаТовара.Цена * (1-СтрокаТовара.ПроцентАвтоматическойСкидки/100) * (1-СтрокаТовара.ПроцентРучнойСкидки/100),2);
					СтрокаТовара.ЦенаСоСкидкой = Окр((ЦенаСоСкидкойСНДС - НДССоСкидкой),2);
					СтрокаТовара.СуммаНДС = Окр(НДССоСкидкой * СтрокаТовара.КоличествоУпаковок,2);
					
					СтрокаТовара.Сумма = СтрокаТовара.ЦенаСоСкидкой * СтрокаТовара.КоличествоУпаковок;	

					СтрокаТовара.СуммаСНДС = СтрокаТовара.Сумма + СтрокаТовара.СуммаНДС;
					
					
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ПринудительноЗакрытьФорму = Истина; 
	
КонецПроцедуры


&НаСервере
Функция ПроверитьНаличиеПрисоединенныхФайлов()
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ЗаказКлиентаПрисоединенныеФайлы.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.ЗаказКлиентаПрисоединенныеФайлы КАК ЗаказКлиентаПрисоединенныеФайлы
    |ГДЕ
    |   ЗаказКлиентаПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
    
    Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат Ложь;
    Иначе
        Возврат Истина;
    КонецЕсли; 
КонецФункции
 
&НаКлиенте
Процедура ПриЗакрытии()
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
    
    Если Объект.КоличествоДнейОтсрочки <> Объект.КоличествоДнейОтсрочкиПоДоговору Тогда
    
        ЕстьПрисоедФайлы = ПроверитьНаличиеПрисоединенныхФайлов();
        
        Если ЕстьПрисоедФайлы = Ложь Тогда
        	Предупреждение("Текущие условия оплаты по заказу отличаются от базовых"+Символы.ПС +"Необходимо прикрепить подписанную счет-фактуру");
        КонецЕсли; 
        

    КонецЕсли; 

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	// СтандартныеПодсистемы.Свойства
	Если ТекущаяСтраница.Имя = "ГруппаДополнительно"
		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		
		СвойстваВыполнитьОтложеннуюИнициализацию();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
	ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
	ПараметрыВыбораСоглашения.ДатаДокумента               = Объект.Дата;
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииСервер();
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииСервер()
	
	ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Объект.Договор, Объект.БанковскийСчет, Объект.БанковскийСчетКонтрагента);
	
	ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь);	
	
	ЗаполнитьГруппуФинУчета();
	
	ОбновитьОграничениеЗадолженности();
	
	Если ИспользоватьНаправленияДеятельности Тогда
		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
	КонецЕсли;
	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Договор");
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.ПорядокОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ПорядокОплаты");
	КонецЕсли;
    
    
	//Объект.КоличествоДнейОтсрочкиПоДоговору = ПолучитьКоличествоДнейОтсрочкиПоДоговору(); 
	
	КолВоДнейОтсрочки = 0;
	СкидкаИндивидуальнаяРазмер = 0;
	ПолучитьКоличествоДнейОтсрочкиПоДоговору(КолВоДнейОтсрочки,СкидкаИндивидуальнаяРазмер);
	
	//Объект.КоличествоДнейОтсрочкиПоДоговору = ПолучитьКоличествоДнейОтсрочкиПоДоговору();
	
	Объект.КоличествоДнейОтсрочкиПоДоговору = КолВоДнейОтсрочки;
	
    Объект.КоличествоДнейОтсрочки  = Объект.КоличествоДнейОтсрочкиПоДоговору;

	Если СкидкаИндивидуальнаяРазмер > 0
		ИЛИ Объект.Договор.СкидкаИндивидуальная = ИСТИНА Тогда
		
		Объект.СкидкаИндивидуальная = Истина;
		Элементы.ГруппаИндивидуальная.ТолькоПросмотр = ЛОЖЬ;
		Элементы.СкидкаИндивидуальная.ТолькоПросмотр = ИСТИНА;
		
		Объект.СкидкаИндивидуальнаяПроцент = СкидкаИндивидуальнаяРазмер;

		Объект.СкидкаСезонная = ЛОЖЬ; 
		Объект.СкидкаСезоннаяПроцент = 0;

		Объект.СкидкаОборот = ЛОЖЬ;
	Иначе
		Объект.СкидкаИндивидуальная = ЛОЖЬ;
		Объект.СкидкаИндивидуальнаяПроцент = 0;
	КонецЕсли;

	
    
КонецПроцедуры




&НаСервере
Процедура ПолучитьКоличествоДнейОтсрочкиПоДоговору(КолДнейОтсрочкиПоДоговору,СкидкаИндивидуальнаяРазмер)
    
    
    КолДнейОтсрочкиПоДоговору = 0;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ОтсрочкаОплатыПоДоговорамСрезПоследних.Контрагент КАК Контрагент,
    |	ОтсрочкаОплатыПоДоговорамСрезПоследних.Договор КАК Договор,
    |	ОтсрочкаОплатыПоДоговорамСрезПоследних.ОтсрочкаОплатыПоДоговору КАК ОтсрочкаОплатыПоДоговору,
    |	ОтсрочкаОплатыПоДоговорамСрезПоследних.СкидкаИндивидуальнаяПроцент КАК СкидкаИндивидуальнаяПроцент
    |ИЗ
    |	РегистрСведений.ОтсрочкаОплатыПоДоговорам.СрезПоследних(&Период, ) КАК ОтсрочкаОплатыПоДоговорамСрезПоследних
    |ГДЕ
    |	ОтсрочкаОплатыПоДоговорамСрезПоследних.Контрагент = &Контрагент
    |	И ОтсрочкаОплатыПоДоговорамСрезПоследних.Договор = &Договор";
    
    Запрос.УстановитьПараметр("Период", Объект.Дата);
    Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
    Запрос.УстановитьПараметр("Договор", Объект.Договор);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если НЕ РезультатЗапроса.Пустой() Тогда
        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
        
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            КолДнейОтсрочкиПоДоговору = ВыборкаДетальныеЗаписи.ОтсрочкаОплатыПоДоговору;
			СкидкаИндивидуальнаяРазмер = ВыборкаДетальныеЗаписи.СкидкаИндивидуальнаяПроцент;
        КонецЦикла;
    Иначе
       КолДнейОтсрочкиПоДоговору = Объект.Договор.ОтсрочкаОплатыПоДоговору;
	   СкидкаИндивидуальнаяРазмер = Объект.Договор.СкидкаИндивидуальнаяПроцент;
    КонецЕсли; 
	
		
	//Возврат КолДнейОтсрочкиПоДоговору;
    
КонецПроцедуры 


&НаСервере
Процедура НайтиОсновнойДоговор()  //////77w qaws
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка,
		|	ДоговорыКонтрагентов.Контрагент,
		|	ДоговорыКонтрагентов.Партнер,
		|	ДоговорыКонтрагентов.ОсновнойДоговор
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Партнер = &Партнер
		|	И ДоговорыКонтрагентов.ОсновнойДоговор = ИСТИНА";
	
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Договор = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	ДоговорПриИзмененииСервер();   //////77w qaws      для подстановки условий оплаты и расчетов по соглашению.
		
КонецПроцедуры
 

&НаСервере
Функция ПолучитьВидПартнераНаСервере(Контра)
	 Возврат(Контра.ВидПартнераКонтрагента.Наименование);
КонецФункции


&НаСервере
Функция ОтгрузкаНеОсуществляетсяНаСервере(Контра)
	 Возврат(Контра.ОтгрузкаНеОсуществляется);
КонецФункции

&НаСервере
Процедура ОтгрузкаНеОсуществляетсяВыделитьЦветом()
	
	ОтгрузкаНеОсуществляется = Объект.Партнер.ОтгрузкаНеОсуществляется;
	Элемент = УсловноеОформление.Элементы.Добавить();

    ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаФормыКолонка2.Имя);
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгрузкаНеОсуществляется.Имя);

    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	//ОтгрузкаНеОсуществляется = Ложь;
	//ОтгрузкаНеОсуществляется = Партнер.ОтгрузкаНеОсуществляется;
	
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоменятьЦветКолонки2");
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтгрузкаНеОсуществляется");
	
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЭлемента.ПравоеЗначение = Истина;

    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 0, 255));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Белый);
	
	
КонецПроцедуры
 

&НаСервере
Функция ОтгрузкаТолькоПоПредоплатеНаСервере(Контра)
	 Возврат(Контра.ОтгрузкаТолькоПоПредоплате);
КонецФункции


&НаСервере
Процедура ОтгрузкаТолькоПоПредоплатеВыделитьЦветом()
	
	ОтгрузкаТолькоПоПредоплате = Объект.Партнер.ОтгрузкаТолькоПоПредоплате;
	Элемент = УсловноеОформление.Элементы.Добавить();

    ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаФормыКолонка2.Имя);
    ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ОтгрузкаТолькоПоПредоплате.Имя);

    ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	//ОтгрузкаНеОсуществляется = Ложь;
	//ОтгрузкаНеОсуществляется = Партнер.ОтгрузкаНеОсуществляется;
	
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПоменятьЦветКолонки2");
    ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОтгрузкаТолькоПоПредоплате");
	
    ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ОтборЭлемента.ПравоеЗначение = Истина;

    Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255,153, 0));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Синий);
	
	
КонецПроцедуры
 


&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено (Объект.Партнер) Тогда
		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы,Объект);
		УстановитьВидимостьЗапретаОтгрузкиПартнеру();
		Возврат;
	КонецЕсли;
	ПриИзмененииПартнераСервер();
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
	// Отображать не по ссылке, а по ИНН, НЕ сохраняя в кэше.
	ЭтотОбъект.ИндексыСПАРКРиски = Неопределено; // Сбросить полученные значения.
	ОбновитьОтображениеИндексыСПАРК();
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродажПоУмолчанию();
	КонецЕсли;
	
	НайтиОсновнойДоговор();
	
	ВидПартнера = ПолучитьВидПартнераНаСервере(Объект.Партнер);
	
	Если Найти(ВидПартнера,"Торговые сети") = 0 Тогда
		ПолучитьРазмерСкидки("Контрагент");        ///////77w qaws
	КонецЕсли; 
	

	УстановитьУсловноеОформление();	
	
	Объект.ОтгрузкаНеОсуществляется = ОтгрузкаНеОсуществляетсяНаСервере(Объект.Партнер);	
	Если Объект.ОтгрузкаНеОсуществляется Тогда
		ОтгрузкаНеОсуществляетсяВыделитьЦветом();
		Сообщить("КЛИЕНТУ ЗАПРЕЩЕНА ОТГРУЗКА");	
	КонецЕсли; 
	
	
	Объект.ОтгрузкаТолькоПоПредоплате = ОтгрузкаТолькоПоПредоплатеНаСервере(Объект.Партнер);	
	Если Объект.ОтгрузкаТолькоПоПредоплате Тогда
		ОтгрузкаТолькоПоПредоплатеВыделитьЦветом();
		Сообщить("ОТГРУЗКА КЛИЕНТУ ТОЛЬКО ПО ПРЕДОПЛАТЕ");	
	КонецЕсли; 
	
	КолВоДнейОтсрочки = 0;
	СкидкаИндивидуальнаяРазмер = 0;
	ПолучитьКоличествоДнейОтсрочкиПоДоговору(КолВоДнейОтсрочки,СкидкаИндивидуальнаяРазмер);
	
	//Объект.КоличествоДнейОтсрочкиПоДоговору = ПолучитьКоличествоДнейОтсрочкиПоДоговору();
	
	Объект.КоличествоДнейОтсрочкиПоДоговору = КолВоДнейОтсрочки;
	
	Объект.СкидкаИндивидуальнаяПроцент = СкидкаИндивидуальнаяРазмер;
	
	Если СкидкаИндивидуальнаяРазмер > 0  Тогда
		
		Объект.СкидкаИндивидуальная = Истина;
		Элементы.ГруппаИндивидуальная.ТолькоПросмотр = ЛОЖЬ;
		Элементы.СкидкаИндивидуальная.ТолькоПросмотр = ИСТИНА;
		
		Объект.СкидкаСезонная = ЛОЖЬ;
		Объект.СкидкаОборот = ЛОЖЬ;
	Иначе
		Объект.СкидкаИндивидуальная = ЛОЖЬ;
	КонецЕсли;
	
	
    Объект.КоличествоДнейОтсрочки  = Объект.КоличествоДнейОтсрочкиПоДоговору;
	ТекстСуммаПросроченоНажатиеНаСервере();         //jadmin  пересчет просрочки при изменении или выборе клиента
	
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактноеЛицоПриИзменении(Элемент)
	
	Если Объект.КонтактноеЛицо.Пустая() Тогда
		Возврат;
	ИначеЕсли Не Объект.Партнер.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПартнерИзменился = Ложь;
	КонтактноеЛицоПриИзмененииСервер(ПартнерИзменился);
	
	Если Не ПартнерИзменился Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено (Объект.Партнер) Тогда
		
		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы,Объект);
		
	Иначе
		
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		
		Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
			ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродажПоУмолчанию();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииСервер();
	
	// ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
	// Отображать не по ссылке, а по ИНН, НЕ сохраняя в кэше.
	ЭтотОбъект.ИндексыСПАРКРиски = Неопределено; // Сбросить полученные значения.
	ОбновитьОтображениеИндексыСПАРК();
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
	

КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииСервер()
	
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		//Объект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",Истина);
		
		ПриИзмененииСоглашенияСервер();
		//ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродаж();
		
		ЗаполнитьДоговорПоУмолчанию();
		ПродажиСервер.ПартнерПриИзменении(Объект);
		
		Если Не ЗначениеЗаполнено(Объект.БанковскийСчетКонтрагента) Тогда
			Объект.БанковскийСчетКонтрагента = ПолучитьБанковскийСчетКонтрагентаПоУмолчаниюСервер(Объект.Контрагент);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИспользоватьНаправленияДеятельности Тогда
		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
	КонецЕсли;
	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Контрагент");
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено (Объект.Соглашение) Тогда
		НалогообложениеИзСоглашения = Ложь;
		Возврат;
	КонецЕсли;
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
	ПриИзмененииСоглашенияСервер();
	
	
	ПродажиКлиент.ОповеститьОбОкончанииЗаполненияУсловийПродаж();
	
	// SWI jadmin
	СоглашениеВыборСервер(Объект.Соглашение);
	
	
	
	ЭтоРозница = ПроверитьЭтоРозничныйЗаказ();
	Объект.СкидкаОбщая = 0;
	//Если (СтрНайти(Строка(Объект.Соглашение),"Розница") > 0)
	Если (ЭтоРозница = Истина)
		или (СтрНайти(Строка(Объект.Соглашение),"Благотворительность") > 0) Тогда
		Возврат;	
	КонецЕсли;	
	
	
	
	ПолучитьРазмерСкидкиНаСервере(Объект.Контрагент);

    УстановитьЦеныПоДоставкеНаСервере();
	
    ПрименитьСкидку("ТоварыОткрытьПодбор");	 /////// идет доп. пересчет ТЧ
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)  Экспорт

	Если Объект.Согласован
		И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.НеСогласован") Тогда
		
		Объект.Согласован = Ложь;
		
	КонецЕсли;

	Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Отменен") Тогда
		СтатусПриИзмененииСервер();
		ПрименитьСкидку("Статус");       ////////77w qaws
	КонецЕсли;
	
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
		 Объект.ВремяГотовности = ТекущаяДата();
 	КонецЕсли;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.Отменен") Тогда
		 Объект.ДатаОтменыЗаказа = ТекущаяДата();
	КонецЕсли;
 
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
	
	//Если Найти(Строка(ТекущийПользователь), "Бычков Леонид") = 1 Тогда
	//	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
	//		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению");
	//		Объект.ОтправитьНаПодтверждение = Истина;
	//	КонецЕсли;	
	//КонецЕсли;
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
		Объект.ОтправитьНаПодтверждение = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НалогообложениеНДСПриИзменении(Элемент)
	
	НалогообложениеНДСПриИзмененииСервер(КэшированныеЗначения);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	
	ЦенаВключаетНДСПриИзмененииСервер(КэшированныеЗначения);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Валюта) Тогда
		
		ПриИзмененииВалютыСервер(
			Объект.Валюта,
			ЦенообразованиеКлиент.НеобходимПересчетВВалюту(Объект,ВалютаДокумента));
		ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ВалютаДокумента, Объект.Валюта);
		
	КонецЕсли;
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
	ВалютаДокумента = Объект.Валюта;
	
	ЗаполнитьПорядокОплатыПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
	Оповещение = Новый ОписаниеОповещения("ДатаПриИзмененииЗавершение", ЭтотОбъект);
	ЦенообразованиеКлиент.ЗадатьВопросПересчетаЦеныПриИзмененииДаты(Объект, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса Тогда
	
		ПересчитыватьЦены = Истина;
		ЦеныРассчитаны = ДатаПриИзмененииСервер(ПересчитыватьЦены);
	
		Если ПересчитыватьЦены Тогда
			ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоСоглашению(ЦеныРассчитаны);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизацииСервер();
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Если СокрЛП(Элемент.ВыделенныйТекст) = "склад N 1ф" Тогда
		 Сообщить("Отгрузка с склад склад N 1ф запрещена");
		 Объект.Склад = ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка");
		 Возврат;
	КонецЕсли; 
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	ПриИзмененииСкладаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	
	ПриИзмененииХозяйственнойОперацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Менеджер");
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КартаЛояльностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	КартыЛояльностиКлиент.НачалоВыбораКартыЛояльности(Элемент, СтандартнаяОбработка, Объект.Партнер, Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура КартаЛояльностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СчитанаКартаЛояльности(Неопределено, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	
	ЗаполнитьДатуОтгрузкиСервер(Объект.ДатаОтгрузки, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НеОтгружатьЧастямиПриИзменении(Элемент)
	
	НеОтгружатьЧастямиПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОстатокДопустимогоКредитаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеПоСуммеПродажи = Новый Структура("СуммаВзаиморасчетов", ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Объект.Товары, Объект.ЦенаВключаетНДС));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", Объект.Ссылка);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",     Истина);
	ПараметрыФормы.Вставить("Отбор",                       Новый Структура("Договор", Объект.Договор));
	ПараметрыФормы.Вставить("Договор",                     Объект.Договор);
	ПараметрыФормы.Вставить("ДанныеПоСуммеПродажи",        ДанныеПоСуммеПродажи);
	
	ОткрытьФорму("Отчет.ПричиныЗапретаОтгрузки.Форма",
		ПараметрыФормы,
		,
		"Договор=" + Объект.Договор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИндексыСПАРКРискиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СПАРКРискиКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);

КонецПроцедуры

// ИнтернетПоддержкаПользователей.СПАРКРиски
&НаКлиенте
Процедура ДекорацияСПАРКПодробноНажатие(Элемент)
	
	СПАРКРискиКлиент.ПоказатьЗначенияИндексовКонтрагента(ИндексыСПАРКРиски, ЭтотОбъект);
	
КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.СПАРКРиски

&НаКлиенте
Процедура ВернутьМногооборотнуюТаруПриИзменении(Элемент)
	
	ВернутьМногооборотнуюТаруПриИзмененииСервер();
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстОтгрузкаПартнеруЗапрещенаНажатие(Элемент)
	ОткрытьФорму("Справочник.Партнеры.Форма.ФормаСегментовЗапретаОтгрузки", Новый Структура("Партнер", Объект.Партнер));
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяЗалогЗаТаруПриИзменении(Элемент)
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеНажатие(Элемент, СтандартнаяОбработка)
	
	ПродажиКлиент.СостояниеВФормеДокументаНажатие(СтандартнаяОбработка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияЭДОНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСКонтрагентамиКлиент.ОткрытьДеревоЭД(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура СпособМестоДоставкиПеревозчикПриИзменении(Элемент)
	
	ЗаполнитьУстановитьРеквизитыДоставкиСервер(Элемент.Имя);
	УстановитьЦеныПоДоставке("");
КонецПроцедуры

&НаСервере
Процедура Перечитать()
	ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы,Объект);
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
КонецПроцедуры
 
&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
	
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	    Элемент,
		Объект[ИмяРеквизитаАдресаДоставки],
		Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"]);
		
	ЗаполнитьЗонуДоставкиНаСервере();    ///////77w

КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	АдресДоставкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	//ПараметрыФормы.Вставить("Владелец",Объект.Партнер);

    ЗначениеОтбора = Новый Структура("Владелец", Объект.Партнер);
    ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);	
	ОткрытьФорму("Справочник.ПунктыРазгрузкиПогрузкиКлиентов.ФормаВыбора",ПараметрыФормы,ЭтаФорма);

	
	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
	
	//ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	//    Элемент,
	//	Объект,
	//	ИмяРеквизитаАдресаДоставки,
	//	СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ЗаполнитьЗонуДоставкиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПунктыРазгрузкиПогрузкиКлиентов.Наименование КАК Наименование,
		|	ПунктыРазгрузкиПогрузкиКлиентов.ЗонаДоставки КАК ЗонаДоставки,
		|	ПунктыРазгрузкиПогрузкиКлиентов.Владелец КАК Владелец,
		|	ПунктыРазгрузкиПогрузкиКлиентов.Ссылка КАК Ссылка,
		|	ПунктыРазгрузкиПогрузкиКлиентов.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицо
		|ИЗ
		|	Справочник.ПунктыРазгрузкиПогрузкиКлиентов КАК ПунктыРазгрузкиПогрузкиКлиентов
		|ГДЕ
		|	ПунктыРазгрузкиПогрузкиКлиентов.Ссылка = &Ссылка
		|	И ПунктыРазгрузкиПогрузкиКлиентов.Владелец = &Владелец
		|	И ПунктыРазгрузкиПогрузкиКлиентов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Партнер);
	Запрос.УстановитьПараметр("Ссылка", Объект.АдресДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.ЗонаДоставки = Справочники.ЗоныДоставки.ПустаяСсылка();
	Объект.ОсновноеКонтактноеЛицо = Справочники.КонтактныеЛица.ПустаяСсылка();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 Объект.ЗонаДоставки = ВыборкаДетальныеЗаписи.ЗонаДоставки;
		 Объект.ОсновноеКонтактноеЛицо = ВыборкаДетальныеЗаписи.ОсновноеКонтактноеЛицо;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;        ////////77w для выбора составного типа
	
	
	
	АдресДоставкиПриИзменении(Элемент);
	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяРеквизитаАдресаДоставки(Элемент)
	
	Если СтрНайти(Элемент.Имя, "АдресДоставкиПеревозчика") > 0 Тогда
		ИмяРеквизитаАдреса = "АдресДоставкиПеревозчика";
	Иначе
		ИмяРеквизитаАдреса = "АдресДоставки";
	КонецЕсли;
	
	Возврат ИмяРеквизитаАдреса;
	
КонецФункции

&НаКлиенте
Процедура НаправлениеДеятельностиПриИзменении(Элемент)
	
	НаправлениеДеятельностиПриИзмененииСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
		Истина, "Документ.ЗаказКлиента.Форма.ФормаДокумента.Элементы.Товары.Выбор");
	
	Если Элемент.ТекущийЭлемент = Элементы.ТоварыВариантОбеспечения И Не ТолькоПросмотр Тогда

		СтандартнаяОбработка = Ложь;
		
		Если ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения Тогда
			
			ПараметрыФормы = ПараметрыФормыЗапросаКоличестваИСерий();
			
			Если ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
				ОткрытьФорму(
				"Обработка.ПодборТоваровВДокументПродажи.Форма.ЗапросКоличестваИСерий",
				ПараметрыФормы,
				ЭтаФорма,
				,
				,
				,
				Новый ОписаниеОповещения("ОбработатьВыборВариантаОбеспечения", ЭтотОбъект),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
			
		Иначе
			
			ПараметрыПроверки = ОбеспечениеКлиентСервер.ИнициализироватьПараметрыПроверкиЗаполнения();
			ПараметрыПроверки.Поля.Удалить("Подразделение");
			
			Если ОбеспечениеКлиентСервер.ПроверитьЗаполнение(
				Объект, Объект.Товары, Элементы.Товары.ТекущаяСтрока, ПараметрыПроверки, Неопределено, Объект.Склад) Тогда
				
				ПараметрыФормы = ПараметрыВыбораОбеспечения();
				Если ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
					ОткрытьФорму("Перечисление.ВариантыОбеспечения.Форма.ВыборВариантаОбеспечения", ПараметрыФормы,
					ЭтаФорма, УникальныйИдентификатор);
					
				Иначе
					Ошибки = ОбеспечениеКлиентСервер.ОшибкиКонтроляОтгрузкиИОбеспечения(ПараметрыФормы, "Товары", НСтр("ru = 'Товары'"));
					ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Элемент.ТекущийЭлемент = Элементы.ТоварыПроцентАвтоматическойСкидки
		Или Элемент.ТекущийЭлемент = Элементы.ТоварыСуммаАвтоматическойСкидки Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если НЕ Объект.СкидкиРассчитаны Тогда
			СтруктураПараметры = Новый Структура;
			СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
			СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
			СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
			СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
			
			СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
			Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
				ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(АдресПримененныхСкидокВоВременномХранилище) Тогда
			РассчитатьСкидкиБезПримененияКОбъекту();
		КонецЕсли;
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		СкидкиНаценкиКлиент.ОткрытьФормуПримененныеСкидки(ТекущиеДанные, Объект, ЭтаФорма);
	
	ИначеЕсли Поле = Элементы.ТоварыЦена Тогда
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		Если ПравоНаЧтениеВидаЦены Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.ВидЦены) И НЕ Объект.Согласован Тогда
				ОчиститьСообщения();
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru='Для редактирования цены выберите вид цены ""<произвольная>""'"),
					Объект.Ссылка,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", ТекущиеДанные.НомерСтроки, "ВидЦены"),);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли НаборыКлиент.БлокируемыйЭлемент(Поле) Тогда
		
		ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураНабора) Тогда
			
			ПараметрОповещения = Новый Структура;
			ПараметрОповещения.Вставить("НоменклатураНабора",   ТекущаяСтрока.НоменклатураНабора);
			ПараметрОповещения.Вставить("ХарактеристикаНабора", ТекущаяСтрока.ХарактеристикаНабора);
			ПараметрОповещения.Вставить("ФормаВладелец",        УникальныйИдентификатор);
			
			Оповестить("РедактироватьНабор", ПараметрОповещения, ЭтаФорма);
			
		КонецЕсли;
		
	ИначеЕсли Поле = Элементы.ТоварыНоменклатураНабора Тогда
		
		ПоказатьЗначение(Неопределено, Элементы.Товары.ТекущиеДанные.НоменклатураНабора);
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ВозможностьИзмененияЗаказаДляОрдера()
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    | НеВыравниватьОрдераЗаказыПоКлиентам.Контрагент КАК Контрагент
    |ИЗ
    | РегистрСведений.НеВыравниватьОрдераЗаказыПоКлиентам КАК НеВыравниватьОрдераЗаказыПоКлиентам
    |ГДЕ
    | НеВыравниватьОрдераЗаказыПоКлиентам.Контрагент = &Контрагент";
    
    Запрос.УстановитьПараметр("Контрагент", Объект.Партнер);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    ЕстьВозможностьИзмененияЗаказаДляОрдера = Ложь;
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
      ЕстьВозможностьИзмененияЗаказаДляОрдера = Истина;
    КонецЦикла; 
    
    Возврат ЕстьВозможностьИзмененияЗаказаДляОрдера;
    
КонецФункции 

&НаСервере
Функция ПроверитьВозможностьРедактированияНаСервере(Номенклатура) 
  
  ЕстьВозможностьИзмененияЗаказаДляОрдера = ВозможностьИзмененияЗаказаДляОрдера();
	//jadmin Запрет на редактирование серий
	Если 
		//	Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016") 
		//	ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")
		//	ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")
		//ИЛИ 
		ЕстьВозможностьИзмененияЗаказаДляОрдера = Истина   Тогда	
			Возврат Истина;
	КонецЕсли;
	
	
	Если РольДоступна("АдминистраторСистемы")
		ИЛИ РольДоступна("MSSO_МенеджерыПродажРуководитель")
		ИЛИ Объект.СерииДоступныДляРедактирования = Истина  
		Тогда
		 Возврат Истина;    
	Иначе
	     Возврат Ложь;
	КонецЕсли; 
	
	//Если Объект.СерииДоступныДляРедактирования = Истина Тогда
	//	Возврат Истина;    
	//Иначе
	//     Возврат Ложь;
	//КонецЕсли;
	
	
КонецФункции 

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Строка(Объект.Склад) <> "склад N 1 Центральный" Тогда
	    Если Элемент.ТекущийЭлемент.Имя = "ТоварыСерия" Тогда
			СтрокаТабличнойЧасти = Элемент.ТекущиеДанные;
			
			Отказ = ПроверитьВозможностьРедактированияНаСервере(СтрокаТабличнойЧасти.Номенклатура); 

			Если Отказ = Ложь Тогда 
				Сообщить("Редактирование серий запрещено.");
				Предупреждение("Редактирование серий запрещено.");

				//Элемент.ТекущийЭлемент.Доступность = Ложь; 
				Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина; 
				
				Возврат;
			КонецЕсли;   
			
			//Если Объект.СерииДоступныДляРедактирования = Ложь Тогда
			//	Сообщить("Редактирование серий запрещено.");
			//	Предупреждение("Редактирование серий запрещено.");

			//	Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина; 
			//КонецЕсли;
				
	    КонецЕсли;	
	КонецЕсли;
	
	ОбщегоНазначенияУТКлиент.КешироватьТекущуюСтроку(ЭтотОбъект, "Товары");
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ПродажиКлиент.СтрокаНоменклатурыПриНачалеРедактирования(ЭтаФорма, "Товары", ТекущиеДанные, НоваяСтрока, Копирование);
	
	Если НоваяСтрока Тогда
		ТекущиеДанные.КодСтроки = 0;
	КонецЕсли;
	
	Если Копирование Тогда
		СтруктураДействий = Новый Структура;
		ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус",
			Новый Структура("Склад, ПараметрыУказанияСерий", ТекущиеДанные.Склад, ПараметрыУказанияСерий));
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
		ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	Если Не ОтменаРедактирования Тогда
		КешСтроки = ?(НоваяСтрока, Неопределено, ТоварыКешТекущейСтроки);
		Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОтгрузки) И Объект.НеОтгружатьЧастями
			И (КешСтроки = Неопределено Или КешСтроки.ДатаОтгрузки <> ТекущиеДанные.ДатаОтгрузки) Тогда
			ПриИзмененииДатыОтгрузкиВТабЧасти(); // вызов сервера.
		КонецЕсли;
		СкладыКлиент.ОбновитьТаблицуСкладов(ТаблицаСкладов, ТекущиеДанные, КешСтроки, СкладГруппа);
		ВсегоСкладов = ТаблицаСкладов.Количество();
		СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено И Объект.НеОтгружатьЧастями Тогда
		ТекущиеДанные.ДатаОтгрузки = Объект.ДатаОтгрузки;
	КонецЕсли;
	
	МногооборотнаяТараКлиент.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
    
   УстановитьЦеныПоДоставкеНаСервере();

   //ПрименитьСкидку("ТоварыОткрытьПодбор");	 /////// идет доп. пересчет ТЧ

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	ОбщегоНазначенияУТКлиент.КешироватьТекущуюСтроку(ЭтотОбъект, "Товары");
	НаборыКлиент.ПередУдалениемСтрокиТабличнойЧасти(ЭтаФорма, "Товары", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	СкладыКлиент.ОбновитьТаблицуСкладов(ТаблицаСкладов, Неопределено, ТоварыКешТекущейСтроки, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	МногооборотнаяТараКлиент.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСодержаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Элементы.Товары.ТекущиеДанные.Содержание",
		НСтр("ru='Содержание услуги'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	КонецЕсли;
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	КонецЕсли;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	СтруктураДействий.Вставить("ХарактеристикаПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	
	Если ТекущаяСтрока.Количество > 0 Тогда
		СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущаяСтрока.Количество);
	ИначеЕсли ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	КонецЕсли;
	
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);	
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВидЦеныПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	
	ТекущаяСтрока.Цена = ПолучитьРегулировануюЦену(ТекущаяСтрока.Номенклатура,ТекущаяСтрока.Серия,ТекущаяСтрока.ВидЦены, ТекущаяСтрока.Цена);
	
	
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОтмененоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если Не ТекущаяСтрока.Отменено Тогда
		ТекущаяСтрока.ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка");
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПроцентРучнойСкидкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаРучнойСкидкиПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьПроцентРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать, ПересчитыватьСуммуРучнойСкидки", Ложь, Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураПересчетаЦены  = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВПродажахВТЧ(Объект, 
		Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию"));
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВПродажах", СтруктураПересчетаЦены);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкладПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#Область Обеспечение

&НаКлиенте
Процедура ЗаполнитьОбеспечение(Команда)

	ПараметрыПроверки = ОбеспечениеКлиентСервер.ИнициализироватьПараметрыПроверкиЗаполнения();
	ПараметрыПроверки.Поля.Удалить("Подразделение");

	Если ОбеспечениеКлиентСервер.ПроверитьЗаполнение(
		Объект, Объект.Товары, Элементы.Товары.ВыделенныеСтроки, ПараметрыПроверки, Неопределено, Объект.Склад) Тогда

		ПараметрыФормы = ОбеспечениеКлиентСервер.ПараметрыФормыИсполнениеЗаказа(ТипЗнч(Объект.Ссылка));
		ПараметрыФормы.НаправлениеДеятельности = Объект.НаправлениеДеятельности;
		ОткрытьФорму("Перечисление.ВариантыОбеспечения.Форма.ИсполнениеЗаказа", ПараметрыФормы,
			ЭтаФорма, УникальныйИдентификатор);

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СостояниеОбеспечения(Команда)

	Если ОбеспечениеКлиент.ПроверитьВозможностьВыполненияКомандыСостояниеОбеспеченияВДокументе(ЭтаФорма) Тогда
		
		ДанныеДляОбеспечения = ПодготовитьДанныеДляОбеспеченияЗаказа();
		ОткрытьФорму("Обработка.СостояниеОбеспечения.Форма", ДанныеДляОбеспечения, ЭтаФорма, УникальныйИдентификатор);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуОтгрузки(Команда)

	МассивВыделенныхСтрок = Элементы.Товары.ВыделенныеСтроки;
	Если МассивВыделенныхСтрок.Количество() > 0 Тогда
		ДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
		
		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДатуОтгрузкиЗавершение", ЭтотОбъект, Новый Структура("МассивВыделенныхСтрок", МассивВыделенныхСтрок));
		
		ОбщегоНазначенияУТКлиент.ВвестиДатуСКонтролемПустогоЗначения(ДатаОтгрузки, НСтр("ru='Введите дату отгрузки'"), ЧастиДаты.Дата, Оповещение);
		
	Иначе
		ТекстПредупреждения = НСтр("ru='В документе не выбраны строки для заполнения. Дата отгрузки не будет заполнена.'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДатуОтгрузкиЗавершение(ВыбраннаяДата, ДополнительныеПараметры) Экспорт
	
	Если ВыбраннаяДата <> Неопределено И ЗначениеЗаполнено(ВыбраннаяДата) Тогда
		
		ДатаОтгрузки = ВыбраннаяДата;
		МассивВыделенныхСтрок = ДополнительныеПараметры.МассивВыделенныхСтрок;
		
		ЗаполнитьДатуОтгрузкиСервер(ДатаОтгрузки, МассивВыделенныхСтрок);
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияДатОтгрузки(ДатаОтгрузки, Истина);
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировкуНазначенияРезервирование(Команда)
	
	ОбъектыОснований = Новый Массив();
	ОбъектыОснований.Добавить(Объект.Ссылка);
	
	ОписаниеКоманды = Новый Структура();
	ОписаниеКоманды.Вставить("ОбъектыОснований", ОбъектыОснований);
	ОписаниеКоманды.Вставить("Форма", ЭтаФорма);
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.НеСогласован") Тогда
		МинимальныйСтатус = НСтр("ru = 'К выполнению'");
		ОбеспечениеКлиент.СообщитьОНеобходимомМинимальномСтатусеДокумента(Истина, МинимальныйСтатус);
	ИначеЕсли Не Объект.Проведен Или Модифицированность Тогда
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("Резервирование", Истина);
		ДополнительныеПараметры.Вставить("ОписаниеКоманды", ОписаниеКоманды);
		
		ТекстВопроса = НСтр("ru = 'Для резервирования под назначение необходимо предварительно провести документ. Выполнить проведение документа и продолжить?'");
		ПоказатьВопрос(
			Новый ОписаниеОповещения("СоздатьКорректировкуНазначенияЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
				ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		
		Если ЕстьТоварыКОбособленномуОбеспечению() Тогда
			ВводНаОснованииУТКлиент.ОткрытьМастерРезервирования(ОписаниеКоманды);
		Иначе
			ОбеспечениеКлиент.СообщитьОбОтсутствииТовараКОбособленномуОбеспечению();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКорректировкуНазначенияСнятиеРезерва(Команда)
	
	ОбъектыОснований = Новый Массив();
	ОбъектыОснований.Добавить(Объект.Ссылка);
	
	ОписаниеКоманды = Новый Структура();
	ОписаниеКоманды.Вставить("ОбъектыОснований", ОбъектыОснований);
	ОписаниеКоманды.Вставить("Форма", ЭтаФорма);
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.НеСогласован") Тогда
		МинимальныйСтатус = НСтр("ru = 'К выполнению'");
		ОбеспечениеКлиент.СообщитьОНеобходимомМинимальномСтатусеДокумента(Ложь, МинимальныйСтатус);
	ИначеЕсли Не Объект.Проведен Или Модифицированность Тогда
		ДополнительныеПараметры = Новый Структура();
		ДополнительныеПараметры.Вставить("Резервирование", Ложь);
		ДополнительныеПараметры.Вставить("ОписаниеКоманды", ОписаниеКоманды);
		
		ТекстВопроса = НСтр("ru = 'Для снятия резерва под назначение необходимо предварительно провести документ. Выполнить проведение документа и продолжить?'");
		ПоказатьВопрос(
			Новый ОписаниеОповещения("СоздатьКорректировкуНазначенияЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
				ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		
		Если ЕстьТоварыКОбособленномуОбеспечению() Тогда
			ВводНаОснованииУТКлиент.ОткрытьМастерСнятияРезерва(ОписаниеКоманды);
		Иначе
			ОбеспечениеКлиент.СообщитьОбОтсутствииТовараКОбособленномуОбеспечению();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьТоварыКОбособленномуОбеспечению()
	
	НазначениеДокумента = Документы.КорректировкаНазначенияТоваров.ПолучитьНазначениеЗаказа(Объект.Ссылка);
	Возврат Документы.КорректировкаНазначенияТоваров.ЕстьТоварыКОбособленномуОбеспечению(НазначениеДокумента);
	
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура АвтоТест_ЗаполнитьЦеныПоСоглашению(Команда) Экспорт

	Если ПродажиКлиент.НеобходимоЗаполнениеЦенПоСоглашению(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		
		ЦеныРассчитаны = ЗаполнитьЦеныПоСоглашениюСервер();
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоСоглашению(ЦеныРассчитаны);
		
	КонецЕсли;
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВыделенныхСтрокПоВидуЦен(Команда)

	Если ПродажиКлиент.НеобходимоЗаполнениеЦенПоВидуЦен(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ПродажиКлиент.ВыбратьВидЦен(
			Новый ОписаниеОповещения("ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение", ЭтотОбъект, ДополнительныеПараметры),
			Объект.ЦенаВключаетНДС,
			Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенЗавершение(ВидЦен, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВидЦен) Тогда
		
		ЦеныРассчитаны = ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенСервер(ВидЦен);
		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦен);
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделенныеСтроки(Команда)
	
	Если Не ПродажиКлиент.НеобходимоЗаполнениеПричиныОтменыВыделенныхСтрок(Объект.Товары, НСтр("ru='Товары'"), Элементы.Товары.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;

	ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка");
	Если ИспользоватьПричиныОтменыЗаказовКлиентов Тогда
		ОткрытьФорму("Справочник.ПричиныОтменыЗаказовКлиентов.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ОтменитьВыделенныеСтрокиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
        Возврат;
	КонецЕсли;
	
	ОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделенныеСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ПричинаОтмены = Результат;
    Если Не ЗначениеЗаполнено(ПричинаОтмены) Тогда
        Возврат;
    КонецЕсли;
    
    ОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены);

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыделенныеСтрокиФрагмент(Знач ПричинаОтмены)
    
    Перем ВыделенныеСтроки, СтруктураДействий;
    
    СтруктураДействий = Новый Структура();
    СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
    СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
    СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
        Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
    
    ВыделенныеСтроки = ДополнитьДоПолногоНабора();
    
    ПродажиКлиент.ОтменитьВыделенныеСтроки(
    Объект.Товары,
    ВыделенныеСтроки,
    ПричинаОтмены,
    СтруктураДействий);
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
    РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
    
    ПродажиКлиент.ОповеститьОбОтменеВыделенныхСтрок(ПричинаОтмены);
    
    ОтменитьВыделенныеСтрокиНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьНепоставленныеСтроки(Команда)

	Если Не ПродажиКлиент.НеобходимоЗаполнениеПричиныОтменыВыделенныхСтрок(Объект.Товары, НСтр("ru='Товары'"), Элементы.Товары.ВыделенныеСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверятьОстатки = Истина;
	
	Если Не Объект.Проведен Тогда
		ПроверятьОстатки = Ложь;
	ИначеЕсли Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.НеСогласован")
		Или Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда
		
		ПроверятьОстатки = Истина;
	КонецЕсли;
	
	ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка");
	Если ИспользоватьПричиныОтменыЗаказовКлиентов Тогда
		ОткрытьФорму("Справочник.ПричиныОтменыЗаказовКлиентов.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ОтменитьНепоставленныеСтрокиЗавершение", ЭтотОбъект, Новый Структура("ПроверятьОстатки", ПроверятьОстатки)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
        Возврат;
	КонецЕсли;
	
	ОтменитьНепоставленныеСтрокиФрагмент(ПричинаОтмены, ПроверятьОстатки);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьНепоставленныеСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ПроверятьОстатки = ДополнительныеПараметры.ПроверятьОстатки;
    
    
    ПричинаОтмены = Результат;
    Если Не ЗначениеЗаполнено(ПричинаОтмены) Тогда
        Возврат;
    КонецЕсли;
    
    ОтменитьНепоставленныеСтрокиФрагмент(ПричинаОтмены, ПроверятьОстатки);

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьНепоставленныеСтрокиФрагмент(Знач ПричинаОтмены, Знач ПроверятьОстатки)
    
    Перем КоличествоСтрокОтменено;
    
    КоличествоСтрокОтменено = ОтменитьНепоставленныеСтрокиСервер(ПричинаОтмены, ПроверятьОстатки);
    
    Если КоличествоСтрокОтменено = 0 Тогда
        
        ПродажиКлиент.ОповеститьОбОтменеНепоставленныхСтрок(ПричинаОтмены, КоличествоСтрокОтменено, ПроверятьОстатки);
        
    Иначе
        
        РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
        ПродажиКлиент.ОповеститьОбОтменеНепоставленныхСтрок(ПричинаОтмены, КоличествоСтрокОтменено, ПроверятьОстатки);
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкрыватьОтмененныеСтроки(Команда)
	
	СкрыватьОтмененныеСтроки = Не СкрыватьОтмененныеСтроки;
	
	Если СкрыватьОтмененныеСтроки Тогда
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("Отменено", Ложь);
	Иначе
		Элементы.Товары.ОтборСтрок = Неопределено;
	КонецЕсли;
	
	Элементы.ТоварыСкрыватьОтмененныеСтроки.Пометка = СкрыватьОтмененныеСтроки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСкидкиНаценки(Команда)
	
	РассчитатьСкидкиНаценкиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодбор(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.ЗаказКлиента.ФормаДокумента.Команда.ОткрытьПодбор");
	
	Отказ = Ложь;
	Если (ИспользоватьСоглашенияСКлиентами И Не ЗначениеЗаполнено(Объект.Соглашение))
		Или Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОчиститьСообщения();
		СообщитьОбОшибкахОткрытияПодбора(Отказ);
	КонецЕсли;
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
	Иначе
		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru='заказ клиента'"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Соглашение",               Объект.Соглашение);
	ПараметрыФормы.Вставить("Организация",              Объект.Организация);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС",          Объект.ЦенаВключаетНДС);
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
		ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре()));
		ПараметрыФормы.Вставить("СкрыватьРучныеСкидки", Истина);	
	КонецЕсли;
	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки",                      Истина);
	ПараметрыФормы.Вставить("СкрыватьПодакцизныеТовары",               Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД"));
	ПараметрыФормы.Вставить("ОтображатьФлагСкрыватьПодакцизныеТовары", Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД"));
	ПараметрыФормы.Вставить("Склад",                                   Объект.Склад);
	ПараметрыФормы.Вставить("Валюта",                                  Объект.Валюта);
	ПараметрыФормы.Вставить("Заголовок",                               ПараметрЗаголовок);
	ПараметрыФормы.Вставить("Дата",                                    Объект.Дата);
	ПараметрыФормы.Вставить("Документ",                                Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий",                  ПараметрыУказанияСерий);
	ПараметрыФормы.Вставить("Назначение",                              Объект.Назначение);
	ПараметрыФормы.Вставить("Подразделение",                           Объект.Подразделение);
	ПараметрыФормы.Вставить("ПодборВариантовОбеспечения",              Истина);
	
	ПараметрыФормы.Вставить("ВариантыОбеспечения",    ВариантыОбеспечения);
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнформациюОСкидках(Команда)
	
	Если НЕ Объект.СкидкиРассчитаны Тогда
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
		СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
		СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
		СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
		
		СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
		Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
			ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АдресПримененныхСкидокВоВременномХранилище) Тогда
		РассчитатьСкидкиБезПримененияКОбъекту();
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	СкидкиНаценкиКлиент.ОткрытьФормуПримененныеСкидки(ТекущиеДанные, Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьАвтоматическиеСкидки(Команда)
	
	АдресВХранилище = ВыполнитьПредварительныйРасчетСкидокНаСервере();
	Оповещение = Новый ОписаниеОповещения("НазначитьАвтоматическиеСкидкиЗавершение", ЭтотОбъект);
	СкидкиНаценкиКлиент.ОткрытьФормуНазначенияУправляемыхСкидокНаценок(АдресВХранилище, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьАвтоматическиеСкидкиЗавершение(ВозвращенноеЗначение, ДополнительныеПараметры) Экспорт 
	
	Если ВозвращенноеЗначение <> Неопределено Тогда
		УправляемыеСкидки = ВозвращенноеЗначение;
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
		СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
		СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
		СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
		
		СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
		Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
			ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Скидки (наценки)'"),
			,
			НСтр("ru = 'Скидки (наценки) рассчитаны'"),
			БиблиотекаКартинок.Информация32);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидку(Команда)
	
	Если Не СкидкиНаценкиКлиент.ВозможноНазначениеРучнойСкидкиНаценки(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	АдресВоВременномХранилище = АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(Ложь);
	
	Оповещение = Новый ОписаниеОповещения(
		"НазначитьРучнуюСкидкуЗавершение", 
		ЭтотОбъект, 
		Новый Структура("АдресВоВременномХранилище", АдресВоВременномХранилище));
	
	СкидкиНаценкиКлиент.ОткрытьФормуНазначенияРучныхСкидок(
		АдресВоВременномХранилище,
		Объект.Валюта,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидкуЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры) Экспорт 
	
	АдресВоВременномХранилище = ДополнительныеПараметры.АдресВоВременномХранилище;
	
	Если СуммаРучнойСкидкиНаценки <> Неопределено Тогда
		
		НазначитьРучнуюСкидкуНаСервере(СуммаРучнойСкидкиНаценки, Неопределено, АдресВоВременномХранилище);
		СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок(СуммаРучнойСкидкиНаценки, Объект.Валюта);
		
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидкуДляВыделенныхСтрок(Команда)
	
	Если Не СкидкиНаценкиКлиент.ВозможноНазначениеРучнойСкидкиНаценки(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	АдресВоВременномХранилище = АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(Истина);
	
	Оповещение = Новый ОписаниеОповещения(
		"НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершение", 
		ЭтотОбъект, 
		Новый Структура("АдресВоВременномХранилище", АдресВоВременномХранилище));
	
	СкидкиНаценкиКлиент.ОткрытьФормуНазначенияРучныхСкидок(
		АдресВоВременномХранилище,
		Объект.Валюта,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьРучнуюСкидкуДляВыделенныхСтрокЗавершение(СуммаРучнойСкидкиНаценки, ДополнительныеПараметры) Экспорт 
	
	АдресВоВременномХранилище = ДополнительныеПараметры.АдресВоВременномХранилище;
	
	Если СуммаРучнойСкидкиНаценки <> Неопределено Тогда
		
		НазначитьРучнуюСкидкуНаСервере(СуммаРучнойСкидкиНаценки, Элементы.Товары.ВыделенныеСтроки, АдресВоВременномХранилище);
		СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок(СуммаРучнойСкидкиНаценки, Объект.Валюта);
		
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРучныеСкидки(Команда)
	
	Если Не СкидкиНаценкиКлиент.ВозможнаОтменаРучныхСкидокНаценок(Объект, "Товары", НСтр("ru='Товары'")) Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьРучныеСкидкиНаСервере();
	СкидкиНаценкиКлиент.ОповеститьОбОкончанииНазначенияРучныхСкидокНаценок();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств(Команда)
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСкладВВыделенныхСтроках(Команда)
	
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	Если СкладыКлиент.ПроверитьВозможностьЗаполненияСкладовВТабличнойЧасти(Объект, Объект.Товары, НСтр("ru='Товары'"), ВыделенныеСтроки) Тогда
		МассивОтбора = Новый Массив();
		МассивОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах"));
		МассивОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных"));
		СтруктураОтбора = Новый Структура("ВыборГруппы, ЭтоГруппа", МассивОтбора, Ложь);
		СтруктураПараметров = Новый Структура("Отбор,ГруппаСкладов", СтруктураОтбора, Объект.Склад);
		ВыбранныйСклад = Неопределено;

		ОткрытьФорму("Справочник.Склады.ФормаВыбора", СтруктураПараметров, ЭтаФорма,,,, Новый ОписаниеОповещения("ЗаполнитьСкладВВыделенныхСтрокахЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСкладВВыделенныхСтрокахЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
    
    
    ВыбранныйСклад = Результат;
    Если ЗначениеЗаполнено(ВыбранныйСклад) Тогда
        ЗаполненоСтрок = ЗаполнитьСкладВВыделенныхСтрокахНаСервере(ВыделенныеСтроки, ВыбранныйСклад);
        СкладыКлиент.ПоказатьОповещениеОЗаполненииСкладаВТабличнойЧасти(ВыбранныйСклад, ЗаполненоСтрок, ВыделенныеСтроки.Количество());
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	ТаблицаФормы  = Элементы.Товары;
	ДанныеТаблицы = Объект.Товары;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.СтруктураПересчетаСуммы(
		"Количество, Сумма, СуммаНДС, СуммаСНДС, СуммаРучнойСкидки, СуммаАвтоматическойСкидки",
		ЗависимыеРеквизиты(), "КоличествоУпаковок");
		
	Если ТаблицаФормы.ТекущиеДанные <> Неопределено Тогда
		ОбработкаТабличнойЧастиКлиентСервер.ЗаполнитьСтруктуруПересчетаСуммы(СтруктураПересчетаСуммы, ТаблицаФормы.ТекущиеДанные);
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтруктураПересчетаСуммы", СтруктураПересчетаСуммы);
	
	ОбщегоНазначенияУТКлиент.РазбитьСтрокуТЧ(
		ДанныеТаблицы,
		ТаблицаФормы,
		Новый ОписаниеОповещения("РазбитьСтрокуЗавершение", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если НоваяСтрока <> Неопределено Тогда
		
		НоваяСтрока.КодСтроки = 0;
		
		ОбработкаТабличнойЧастиКлиентСервер.ДобавитьСтрокуДляПересчетаСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы, ТекущаяСтрока);
		ОбработкаТабличнойЧастиКлиентСервер.ДобавитьСтрокуДляПересчетаСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы, НоваяСтрока);
		ОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСуммы(ДополнительныеПараметры.СтруктураПересчетаСуммы);
		
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		
		// HS нужно пересчитать строки как при изменении количества вручную
		ТоварыКоличествоУпаковокПриИзменении(Неопределено);
		Элементы.Товары.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		ТоварыКоличествоУпаковокПриИзменении(Неопределено);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	ОчиститьСообщения();
	
	МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
		Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение", ЭтотОбъект),
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСДЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Результат Тогда
		ОбработатьШтрихкоды(Результат.ТаблицаТоваров);
	Иначе
		МенеджерОборудованияКлиентПереопределяемый.СообщитьОбОшибке(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруСообщений()
	
	Возврат СкидкиНаценкиСервер.ПолучитьСтруктуруСообщений(Объект);
	
КонецФункции

&НаКлиенте
Процедура ПоказатьСообщения(Команда)
	
	СкидкиНаценкиКлиент.ОткрытьФормуСообщений(ПолучитьСтруктуруСообщений(), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчитатьКартуЛояльности(Команда)
	
	Если Объект.Согласован Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму(
		"Справочник.КартыЛояльности.Форма.СчитываниеКартыЛояльности",
		Новый Структура("Партнер", Объект.Партнер),
		ЭтаФорма,
		ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПечати(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("АдресДоставки",                  Объект.АдресДоставки);
	СтруктураПараметров.Вставить("БанковскийСчетГрузоотправителя", Объект.БанковскийСчетГрузоотправителя);
	СтруктураПараметров.Вставить("БанковскийСчетГрузополучателя",  Объект.БанковскийСчетГрузополучателя);
	СтруктураПараметров.Вставить("БанковскийСчетКонтрагента",      Объект.БанковскийСчетКонтрагента);
	СтруктураПараметров.Вставить("Грузоотправитель",               Объект.Грузоотправитель);
	СтруктураПараметров.Вставить("Грузополучатель",                Объект.Грузополучатель);
	СтруктураПараметров.Вставить("Партнер",                        Объект.Партнер);
	СтруктураПараметров.Вставить("ХозяйственнаяОперация",          Объект.ХозяйственнаяОперация);
	СтруктураПараметров.Вставить("Контрагент",                     Объект.Контрагент);
	СтруктураПараметров.Вставить("БанковскийСчет",                 Объект.БанковскийСчет);
	СтруктураПараметров.Вставить("Организация",                    Объект.Организация);
	СтруктураПараметров.Вставить("Дата",                           Объект.Дата);
	СтруктураПараметров.Вставить("Руководитель",                   Объект.Руководитель);
	СтруктураПараметров.Вставить("ГлавныйБухгалтер",               Объект.ГлавныйБухгалтер);
	СтруктураПараметров.Вставить("НазначениеПлатежа",              Объект.НазначениеПлатежа);
	СтруктураПараметров.Вставить("НомерЗаказа", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер));
	СтруктураПараметров.Вставить("ДатаЗаказа",                     Формат(Объект.Дата, "ДЛФ = D"));
	СтруктураПараметров.Вставить("ПараметрыВыбораРеквизитов",      ПараметрыВыбораРеквизитов);
	
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.РеквизитыПечати", СтруктураПараметров, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВставитьСтроки(Команда)
	
	КоличествоТоваровДоВставки = Объект.Товары.Количество();
	
	ПолучитьСтрокиИзБуфераОбмена();
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	КоличествоВставленных = Объект.Товары.Количество()-КоличествоТоваровДоВставки;
	КопированиеСтрокКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьСтроки(Команда)
	
	Если КопированиеСтрокКлиент.ВозможноКопированиеСтрок(Элементы.Товары.ТекущаяСтрока) Тогда
		СкопироватьСтрокиНаСервере();
		КопированиеСтрокКлиент.ОповеститьПользователяОКопированииСтрок(Элементы.Товары.ВыделенныеСтроки.Количество());
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДополнитьМногооборотнойТарой(Команда)

	МногооборотнаяТараКлиент.ПодобратьМногооборотнуюТару(
		ЭтаФорма,
		"Товары",
		"Номенклатура,Характеристика,Количество,Склад,ДатаОтгрузки");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзВнешнегоФайла(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗагружатьЦены", Истина);
	ПараметрыФормы.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	ПараметрыФормы.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ПараметрыФормы.Вставить("ВернутьМногооборотнуюТару", Объект.ВернутьМногооборотнуюТару);
	ПараметрыФормы.Вставить("Соглашение", Объект.Соглашение);
	ПараметрыФормы.Вставить("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Валюта", Объект.Валюта);
	
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
		ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре()));
	КонецЕсли;
	
	ОткрытьФорму(
		"Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);
	
КонецПроцедуры


&НаСервере
Процедура ПроверитьСостояниеОрдера_И_ПеренестиВЗаказ(Заказ)
	
	//////77w qaws
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |	РасходныйОрдерНаТоварыОснования.Ссылка
        |ИЗ
        |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
        |ГДЕ
        |	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ";
 
    Запрос.УстановитьПараметр("ВыбЗаказ", Заказ);
 
    РезультатЗапроса = Запрос.Выполнить();
 
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        НашлиОрдер = ВыборкаДетальныеЗаписи.Ссылка;
		
		Если НашлиОрдер.ТоварыПоРаспоряжениям.Количество() > 0 Тогда
			
			Если НашлиОрдер.ТоварыПоРаспоряжениям[0].Распоряжение.Ссылка = Заказ Тогда
				
				Если НашлиОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Тогда
					НовыйНаборЗаписей = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
					НовыйНаборЗаписей.Отбор.Заказ.Установить(Заказ);
					
					НовыйНаборЗаписей.Прочитать();
					Для каждого СтрТЗ Из НовыйНаборЗаписей Цикл
						//Сообщить(" "+  СтрТЗ.Состояние); //было
						СтрТЗ.Состояние = Перечисления.СостоянияЗаказовКлиентов.ГотовКОтгрузке;
						СтрТЗ.ЕстьРасхожденияОрдерНакладная = Ложь;
					КонецЦикла;
					
					НовыйНаборЗаписей.Записать();
				КонецЕсли; 
			КонецЕсли; 
		
		КонецЕсли; 
		
	КонецЦикла;
	
	
КонецПроцедуры
 

&НаСервере
Функция ОстатокДопустимогоКредита()
	
УстановитьПривилегированныйРежим(Истина);

Договор = Объект.Договор;
ДопустимыйКредит = Объект.Договор.ДопустимаяСуммаЗадолженности;


Запрос = Новый Запрос("
	|ВЫБРАТЬ
	//jadmin
	|	РасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток,
	
	|	РасчетыСКлиентамиОстатки.СуммаОстаток + РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток КАК ОстатокДолга
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|		,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ГДЕ
	|				АналитикаПоПартнерам.Договор = &Договор
	|			)
	|	) КАК РасчетыСКлиентамиОстатки
	|");
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//ОстатокДопустимогоКредита = ДопустимыйКредит - Выборка.ОстатокДолга;
		ОстатокДопустимогоКредита = ДопустимыйКредит - Выборка.СуммаОстаток; //jadmin Допустимый кредит 
	Иначе
		ОстатокДопустимогоКредита = ДопустимыйКредит;
	КонецЕсли;
	
	Возврат ОстатокДопустимогоКредита;
	
КонецФункции

&НаКлиенте

Процедура ПослеЗакрытияВопроса(Результат,Параметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да  Тогда
		Возврат;
	Иначе
		ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
		ПроверитьСостояниеОрдера_И_ПеренестиВЗаказ(Объект.Ссылка);
	КонецЕсли; 
	
КонецПроцедуры
 


&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	
	ОстатокДопустимогоКредита = ОстатокДопустимогоКредита();
	
	Если ОстатокДопустимогоКредита <> 0 Тогда
		//Если Объект.СуммаДокумента > ОстатокДопустимогоКредита Тогда
		Если Объект.Товары.Итог("СуммаСНДС") > ОстатокДопустимогоКредита Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма,Параметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Сумма заказа превышает остаток допустимого кредита.  Продолжать проведение?'"), Режим, 0);			
		Иначе
			ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
			ПроверитьСостояниеОрдера_И_ПеренестиВЗаказ(Объект.Ссылка);
		КонецЕсли;
	Иначе
			ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
			ПроверитьСостояниеОрдера_И_ПеренестиВЗаказ(Объект.Ссылка);
	КонецЕсли; 	
	
КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
//Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеСлужебныйКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗаказ(Команда)
	
	Если Модифицированность Или Не Объект.Проведен Тогда
		Ответ = Неопределено;
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗакрытьЗаказЗавершение", ЭтотОбъект),
			НСтр("ru = 'Необходимо провести документ для выполнения операции. Провести документ?'"), РежимДиалогаВопрос.ДаНет);
		Возврат;
	КонецЕсли;
	
	ЗакрытьЗаказФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗаказФрагмент()
	
	СписокЗаказовКЗакрытию = Новый СписокЗначений;
	СписокЗаказовКЗакрытию.Добавить(Объект.Ссылка);
	
	СтруктураЗакрытия = Новый Структура;
	СтруктураЗакрытия.Вставить("Заказы",                       СписокЗаказовКЗакрытию);
	СтруктураЗакрытия.Вставить("ДокументИнициатор",            Объект.Ссылка);
	СтруктураЗакрытия.Вставить("ОтменитьНеотработанныеСтроки", Истина);
	СтруктураЗакрытия.Вставить("ЗакрыватьЗаказы",              Истина);
	
	СтруктураЗакрытия.Вставить("ТаблицаТоваровРасход",         ПоместитьВоВременноеХранилищеНаСервере("Товары", Новый УникальныйИдентификатор));
	
	ОткрытьФорму("Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия",
	             СтруктураЗакрытия, ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗаказЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	ИначеЕсли Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение)) Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрытьЗаказФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса1(Результат,Параметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да  Тогда
		Возврат;
	Иначе
	    ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОстатокДопустимогоКредита = ОстатокДопустимогоКредита();
	
	Если ОстатокДопустимогоКредита <> 0 Тогда
		Если Объект.Товары.Итог("СуммаСНДС") > ОстатокДопустимогоКредита Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса1", ЭтаФорма,Параметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Сумма заказа превышает остаток допустимого кредита.  Продолжать проведение?'"), Режим, 0);
		Иначе
			ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
		КонецЕсли; 
	Иначе
			ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	КонецЕсли; 
	//ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства

&НаСервере
Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ЗаполнитьПодчиненныеСвойстваПоСтатистике(ИмяРеквизитаРодителя)
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьПодчиненныеСвойства(Объект, ИмяРеквизитаРодителя);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
    
   
	Объект.ОтгрузкаНеОсуществляется = ОтгрузкаНеОсуществляетсяНаСервере(Объект.Партнер);	
       
	Если Объект.ОтгрузкаНеОсуществляется Тогда
		Элементы.ОтгрузкаНеОсуществляется.Видимость = Истина;
		//Элементы.ГруппаПартнер.ЦветФона = WebЦвета.Красный;
		Элементы.ГруппаШапка.ЦветФона = WebЦвета.Красный;
		Элементы.Партнер.Шрифт = ШрифтыСтиля.ШрифтОтмененнойСтрокиДокумента;
	Иначе
		Элементы.ОтгрузкаНеОсуществляется.Видимость = Ложь;
		//Элементы.ГруппаПартнер.ЦветФона = WebЦвета.Белый;
		Элементы.ГруппаШапка.ЦветФона = WebЦвета.Белый;
	КонецЕсли; 

	
	Объект.ОтгрузкаТолькоПоПредоплате = ОтгрузкаТолькоПоПредоплатеНаСервере(Объект.Партнер);	
	Если Объект.ОтгрузкаТолькоПоПредоплате Тогда
		Элементы.ОтгрузкаНеОсуществляется.Видимость = Ложь;
		Элементы.ОтгрузкаТолькоПоПредоплате.ЦветТекста = WebЦвета.Синий;
		Элементы.ОтгрузкаТолькоПоПредоплате.Доступность = Ложь;
		//Элементы.ГруппаПартнер.ЦветФона = WebЦвета.Красный;
		Элементы.ГруппаШапка.ЦветФона = WebЦвета.Оранжевый;
		Элементы.Партнер.Шрифт = ШрифтыСтиля.ШрифтВажнойНадписи;
	Иначе
		Элементы.ОтгрузкаТолькоПоПредоплате.Видимость = Ложь;
		//Элементы.ГруппаПартнер.ЦветФона = WebЦвета.Белый;
		Элементы.ГруппаШапка.ЦветФона = WebЦвета.Белый;
	КонецЕсли; 
	
	
	
	УсловноеОформление.Элементы.Очистить();

	// Условное оформление обеспечения.
	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(
		УсловноеОформление,"ДатаОтгрузки", "ДатаОтгрузки", "", "ДатаОтгрузкиОбязательна");
	
	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(
		УсловноеОформление, "ТоварыДатаОтгрузки", "ДатаОтгрузки", "Товары", "ДатаОтгрузкиОбязательна");

	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(
		УсловноеОформление, "ТоварыСклад", "Склад", "Товары", "СкладОбязателен");
	
	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(
		УсловноеОформление, "Склад", "Склад", "", "СкладОбязателен");
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Состояние.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеПросрочено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Состояние.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовКлиентов.Закрыт;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);
	
	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПроцентАвтоматическойСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСуммаАвтоматическойСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыПроцентРучнойСкидки.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСуммаРучнойСкидки.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Отменено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("ВыделятьОтрицательные", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыЦена.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВидЦены");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСумма.Имя);

	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ГруппаОтбора2 = ГруппаОтбора1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ВидЦены");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;

	ГруппаОтбора3 = ГруппаОтбора2.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора3.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента = ГруппаОтбора3.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьРучныеСкидкиВПродажах");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	ОтборЭлемента = ГруппаОтбора3.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ХозяйственнаяОперация");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	Ценообразование.УстановитьУсловноеОформлениеСуммНДС(ЭтаФорма);
	
	//

	Ценообразование.УстановитьУсловноеОформлениеСтавкиНДС(ЭтаФорма);

	//

	Ценообразование.УстановитьУсловноеОформлениеЦенаВключаетНДС(ЭтаФорма);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);

	//

	ОбщегоНазначенияУТ.УстановитьУсловноеОформлениеПриоритета(ЭтаФорма);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма);

	//

	СкладыСервер.УстановитьУсловноеОформлениеСкладаВТЧ(ЭтаФорма);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыЗаполнитьСкладВВыделенныхСтроках.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СкладГруппа");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;

	Элемент.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);

	//

	Ценообразование.УстановитьУсловноеОформлениеВидовЦен(ЭтаФорма);

	//
	
	НоменклатураСервер.УстановитьУсловноеОформлениеСодержания(ЭтаФорма);

	//
	
	ПараметрыУстановки = МногооборотнаяТараСервер.ПараметрыУстановкиУсловногоОформленияДляСтрокСМногооборотнойТарой();
	
	ПараметрыУстановки.Форма                 = ЭтаФорма;
	ПараметрыУстановки.ЭтоПоступление        = Истина;
	
	МногооборотнаяТараСервер.УстановитьУсловноеОформлениеДляСтрокСМногооборотнойТарой(ПараметрыУстановки);

	//

	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСклад.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.ТипНоменклатуры");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	СписокЗначений.Добавить(Перечисления.ТипыНоменклатуры.МногооборотнаяТара);
	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Склад");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НезаполненноеПолеТаблицы);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<для товаров>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");

	//

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Приоритеты.Ссылка КАК Приоритет,
	|	Приоритеты.Цвет   КАК Цвет
	|ИЗ
	|	Справочник.Приоритеты КАК Приоритеты");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Элемент = УсловноеОформление.Элементы.Добавить();

			ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Приоритет.Имя);

			ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Приоритет");
			ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Выборка.Приоритет;

			Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Выборка.Цвет.Получить());
			
		КонецЦикла;
		
	КонецЕсли;

	//

	НаборыСервер.УстановитьУсловноеОформление(ЭтаФорма, "Товары");
	
	//
	ЗаказыСервер.УстановитьОформлениеОтмененнойСтроки(УсловноеОформление,
		Элементы.Товары,
		Элементы.ТоварыОтменено.Имя,
		Элементы.ТоварыПричинаОтмены.Имя,
		Элементы.ТоварыЦена.Имя,
		Элементы.ТоварыСумма.Имя);
		
	НаправленияДеятельностиСервер.УстановитьУсловноеОформлениеНаправленияДеятельности(ЭтаФорма);
	
	
	
	Элемент = УсловноеОформление.Элементы.Добавить();

	
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Партнер.Имя);
	
	//ОтгрузкаНеОсуществляется = Ложь;
	//ОтгрузкаНеОсуществляется = Объект.Контрагент.Партнер.ОтгрузкаНеОсуществляется;
	
	Объект.ОтгрузкаНеОсуществляется = Объект.Партнер.ОтгрузкаНеОсуществляется;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтгрузкаНеОсуществляется");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;    //////77w qaws
	
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.ЖелтоЗеленый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 0, 255));
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Белый);
	
	
	//jadmin
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Ном");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;    //////77w qaws
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 232, 179));
	Элемент.Использование = Истина;
   	
    	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Ном");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;    //////77w qaws
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(225, 255, 225));
	Элемент.Использование = Истина;
	
		Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Ном");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 3;    //////77w qaws
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(192, 192, 192));
	Элемент.Использование = Истина;
	
	
		Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Ном");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 4;    //////77w qaws
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250, 250, 210));
	Элемент.Использование = Истина;

	
	Элемент = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Товары.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Ном");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ОтборЭлемента.ПравоеЗначение = 5;    //////77w qaws
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(255, 255, 220));
	Элемент.Использование = Истина;

КонецПроцедуры

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#Область Обеспечение

&НаСервере
Функция ПараметрыВыбораОбеспечения()

	ПутиКДанным = Новый Соответствие();
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки");

	ПараметрыЗаполнения = Новый Структура("СтатусКВыполнению, ГруппаСкладов, МенеджерРегистра",
		Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован, Объект.Склад, РегистрыНакопления.ЗаказыКлиентов);

	Результат = ОбеспечениеСервер.ПараметрыВыбораОбеспечения(
		Элементы.Товары.ТекущаяСтрока,
		Объект,
		Объект.Товары,
		ПутиКДанным,
		ПараметрыЗаполнения);

	ОбеспечениеСервер.ДобавитьСвойствоАдресТаблицыПодобраноРанее(Результат, УникальныйИдентификатор);
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция ПараметрыФормыЗапросаКоличестваИСерий()
	
	ПараметрыПроверки = ОбеспечениеКлиентСервер.ИнициализироватьПараметрыПроверкиЗаполнения();
	ПараметрыПроверки.Поля.Удалить("Подразделение");
		
	Если Не ОбеспечениеКлиентСервер.ПроверитьЗаполнение(
			Объект, Объект.Товары, Элементы.Товары.ТекущаяСтрока, ПараметрыПроверки, Неопределено, Объект.Склад) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыВыбораОбеспечения(); // получен, в том числе, параметр "АдресТаблицыПодобраноРанее".
	
	Если Не ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
		Ошибки = ОбеспечениеКлиентСервер.ОшибкиКонтроляОтгрузкиИОбеспечения(ПараметрыФормы, "Товары", НСтр("ru = 'Товары'"));
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ПодборТоваров", Ложь);
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыФормы.Вставить("Дата",                              Объект.Дата);
	ПараметрыФормы.Вставить("Склад",                             Объект.Склад);
	ПараметрыФормы.Вставить("ИспользоватьСкладыВТабличнойЧасти", Истина);
	ПараметрыФормы.Вставить("Упаковка",                          ТекущаяСтрока.Упаковка);
	ПараметрыФормы.Вставить("Серия",                             ТекущаяСтрока.Серия);

	ПараметрыФормы.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
	ПараметрыФормы.Вставить("Регистратор", Объект.Ссылка);
	
	// Остальные параметры получены при вызове ПараметрыВыбораОбеспечения()
	ПараметрыФормы.Вставить("Назначение",                        ПараметрыФормы.Отбор.Назначение);
	ПараметрыФормы.Вставить("Подразделение",                     ПараметрыФормы.Отбор.Подразделение);
	
	ПараметрыФормы.Вставить("Номенклатура",                      ПараметрыФормы.Отбор.Номенклатура);
	ПараметрыФормы.Вставить("Характеристика",                    ПараметрыФормы.Отбор.Характеристика);
	
	ПараметрыФормы.Вставить("ТипНоменклатуры",                   ПараметрыФормы.Отбор.ТипНоменклатуры);
	
	ПараметрыФормы.Вставить("СкладВТЧ",                          ПараметрыФормы.Отбор.Склад);
	ПараметрыФормы.Вставить("ВариантОбеспечения",                ПараметрыФормы.ТекущийВариант.ВариантОбеспечения);
	ПараметрыФормы.Вставить("Количество",                        ПараметрыФормы.ТекущийВариант.Количество);
	
	Возврат ПараметрыФормы
	
КонецФункции

&НаСервере
Функция ПодготовитьДанныеДляОбеспеченияЗаказа()

	РеквизитыЗаказа = Новый Структура("ЖелаемаяДатаОтгрузки, Ссылка, НеОтгружатьЧастями, Статус, Дата, Партнер, Менеджер");
	ЗаполнитьЗначенияСвойств(РеквизитыЗаказа, Объект);

	//Описание особенностей формы - дату отгрузки работ необходимо брать из поля "Дата отгрузки".
	ПутиКДанным = Новый Соответствие();
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки");

	ТаблицаТовары = ОбеспечениеСервер.СтрокиВТаблицу(Объект.Товары, Объект, ПутиКДанным);
	АдресТаблицыТовары = ПоместитьВоВременноеХранилище(ТаблицаТовары);

	ПараметрыЗаполнения = Новый Структура("СтатусКВыполнению, ИмяМенеджераРегистра",
		Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован, "ЗаказыКлиентов");

	ПараметрыФормы = ОбеспечениеКлиентСервер.ПараметрыФормыСостояниеОбеспеченияЗаказов();
	ПараметрыФормы.ВызовИзФормыЗаказа          = Истина;
	ПараметрыФормы.РеквизитыЗаказа             = РеквизитыЗаказа;
	ПараметрыФормы.АдресТаблицыТовары          = АдресТаблицыТовары;
	ПараметрыФормы.ПараметрыВыполненияДействий = ПараметрыЗаполнения;

	Возврат ПараметрыФормы;

КонецФункции

&НаКлиенте
Процедура ОбработатьВыборВариантаОбеспечения(СтруктураПодобранныеТовары, ДополнительныеПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(СтруктураПодобранныеТовары) Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбеспечениеКлиентСервер.ЗначенияРеквизитовДокументаДляВопросаОбОтгрузкеОднойДатой();
	ЗначенияРеквизитов.ДатаОтгрузки         = Объект.ДатаОтгрузки;
	ЗначенияРеквизитов.ЖелаемаяДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
	ЗначенияРеквизитов.НеОтгружатьЧастями   = Объект.НеОтгружатьЧастями;
	
	ОбеспечениеКлиент.ПоказатьВопросОбОтгрузкеОднойДатой(
		ЭтаФорма,
		ЗначенияРеквизитов,
		СтруктураПодобранныеТовары,
		"ЗаполнитьВариантОбеспеченияПослеВопроса",
		Объект.Товары.Количество() > 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВариантОбеспеченияПослеВопроса(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.НеОтгружатьЧастями = Ложь;
		УстановитьВидимостьЭлементовФормыДатОтгрузки();
	КонецЕсли;
	
	Оповещение = ЗаполнитьВариантОбеспечения(ДополнительныеПараметры.ПодобранныеТовары);
	ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Оповещение);
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьВариантОбеспечения(ВыбранноеЗначение)

	Для Каждого Элемент Из ВыбранноеЗначение Цикл
		Элемент.Вставить("Идентификатор", Элементы.Товары.ТекущаяСтрока);
	КонецЦикла;
	ТекстОповещения = Документы.ЗаказКлиента.ЗаполнитьВариантОбеспечения(
		Объект, ЭтаФорма, "СтрокаТовары", ВыбранноеЗначение, ПараметрыУказанияСерий, ЗависимыеРеквизиты());

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	Возврат ТекстОповещения;

КонецФункции

&НаСервере
Функция ЗаполнитьОбеспечениеВУстановленномПорядке(ВыбранноеЗначение)
	
	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
	ПутиКДанным = Новый Соответствие; //Описание особенностей формы
	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки"); // дату отгрузки работ необходимо брать из поля "Дата отгрузки".
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("СтатусКВыполнению", Объект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	ПараметрыДокумента.Вставить("ГруппаСкладов", Объект.Склад);
	ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыКлиентов);
	ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
	
	Таблица = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспечения(
		Элементы.Товары.ВыделенныеСтроки,
		Объект,
		Объект.Товары,
		ПараметрыЗаполнения,
		ПараметрыДокумента);
	

	Если ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") Тогда
		Возврат Новый Структура(
			"Ошибки",
			ОбеспечениеКлиентСервер.ОшибкиКонтроляОтгрузкиИОбеспечения(
				Таблица, "Товары", НСтр("ru = 'Товары'")));
	КонецЕсли;
	
	//Перенос результатов в документ.
	ТекстОповещения = Документы.ЗаказКлиента.ЗаполнитьВариантОбеспечения(
		Объект, ЭтаФорма, "СтрокиТовары", Таблица, ПараметрыУказанияСерий, ЗависимыеРеквизиты());
	
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	Возврат Новый Структура("Ошибки, Оповещение", Неопределено, ТекстОповещения);
	
КонецФункции

&НаСервере
Функция ЗаполнитьОбеспечениеЗаказа(ВыбранноеЗначение)

	Если ВыбранноеЗначение.ОтгружатьЧастями Тогда
		Объект.НеОтгружатьЧастями = Ложь;
		УстановитьВидимостьЭлементовФормыДатОтгрузки();
	КонецЕсли;

	ТаблицаОбеспечения = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	ТекстОповещения    = Документы.ЗаказКлиента.ЗаполнитьВариантОбеспечения(
		Объект, ЭтаФорма, "Заказ", ТаблицаОбеспечения, ПараметрыУказанияСерий, ЗависимыеРеквизиты());

	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	Возврат ТекстОповещения;

КонецФункции

&НаКлиенте
Процедура СоздатьКорректировкуНазначенияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	КонецЕсли;
	
	ЕстьТоварыКОбособленномуОбеспечению = ЕстьТоварыКОбособленномуОбеспечению();
	
	Если ЕстьТоварыКОбособленномуОбеспечению И Объект.Проведен И Не Модифицированность Тогда
		
		// Если документ записан впервые, в ОбъектыОснований находится пустая ссылка, нужно актуализировать
		ОбъектыОснований = Новый Массив();
		ОбъектыОснований.Добавить(Объект.Ссылка);
		
		ДополнительныеПараметры.ОписаниеКоманды.Вставить("ОбъектыОснований", ОбъектыОснований);
		
		Если ДополнительныеПараметры.Резервирование Тогда
			ВводНаОснованииУТКлиент.ОткрытьМастерРезервирования(ДополнительныеПараметры.ОписаниеКоманды);
		Иначе
			ВводНаОснованииУТКлиент.ОткрытьМастерСнятияРезерва(ДополнительныеПараметры.ОписаниеКоманды);
		КонецЕсли;
		
	ИначеЕсли Не ЕстьТоварыКОбособленномуОбеспечению И Объект.Проведен Тогда
		ОбеспечениеКлиент.СообщитьОбОтсутствииТовараКОбособленномуОбеспечению();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДатыОтгрузки

&НаСервере
Процедура УстановитьВидимостьЭлементовФормыДатОтгрузки()

	//Элементы.ТоварыДатаОтгрузки.Видимость = Не Объект.НеОтгружатьЧастями;
	//Элементы.ДатаОтгрузки.Видимость = Объект.НеОтгружатьЧастями;
	//Элементы.ЗаполнитьДатуОтгрузки.Видимость = Не Объект.НеОтгружатьЧастями;
	
	Элементы.ДатаОтгрузки.Видимость = Истина;   //////77w  qaws
	Элементы.ТоварыДатаОтгрузки.Видимость =  Истина;   //////77w  qaws
	Элементы.ЗаполнитьДатуОтгрузки.Видимость = Истина;
	Элементы.ДекорацияДатаОтгрузки.Видимость = Истина;

	Если Объект.ТоварыДоКорректировкиОрдером.Количество()>0 Тогда      ///////77w  qaws
		Элементы.ТоварыДоКорректировкиОрдером.Видимость = Истина;
	Иначе
		Элементы.ТоварыДоКорректировкиОрдером.Видимость = Ложь;
	КонецЕсли; 
	
	Если Объект.ОтсутствующиеПозицииНоменклатуры.Количество() > 0 Тогда      ///////77w  qaws
		Элементы.ОтсутствующиеПозицииНоменклатуры.Видимость = Истина;
	Иначе
		Элементы.ОтсутствующиеПозицииНоменклатуры.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДатуОтгрузкиСервер(ДатаОтгрузки, МассивВыделенныхСтрок)

	ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(Объект.Товары, "ДатаОтгрузки", ДатаОтгрузки, МассивВыделенныхСтрок);

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДатыОтгрузкиВТабЧасти()
	
	Если Объект.НеОтгружатьЧастями Тогда
		МаксимальнаяДата = ОбеспечениеСервер.МаксимальноеЗначениеВКоллекции(Объект.Товары, "ДатаОтгрузки", '00010101');
		Объект.ДатаОтгрузки = ?(ЗначениеЗаполнено(МаксимальнаяДата), МаксимальнаяДата, Объект.ДатаОтгрузки);
		ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(Объект.Товары, "ДатаОтгрузки", Объект.ДатаОтгрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НеОтгружатьЧастямиПриИзмененииСервер()

	Если Объект.НеОтгружатьЧастями Тогда
		Объект.ДатаОтгрузки = ОбеспечениеСервер.МаксимальноеЗначениеВКоллекции(Объект.Товары, "ДатаОтгрузки", '00010101');
		ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(Объект.Товары, "ДатаОтгрузки", Объект.ДатаОтгрузки);
	КонецЕсли;

	УстановитьВидимостьЭлементовФормыДатОтгрузки();

КонецПроцедуры

#КонецОбласти

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура ПриИзмененииПартнераСервер()
	
	Если ИспользоватьСоглашенияСКлиентами Тогда
		ЗаполнитьУсловияПродаж();
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	
	ПриИзмененииСкладаСервер();
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	ОбновитьДубликатыЗависимыхРеквизитов();
	Объект.БанковскийСчетКонтрагента = ПолучитьБанковскийСчетКонтрагентаПоУмолчаниюСервер(Объект.Контрагент);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	
	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);
	
	ЗаполнитьУстановитьРеквизитыДоставкиСервер("Партнер");
	
	ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь);
	
	ОбновитьОграничениеЗадолженности();
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Контрагент");
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
	УстановитьВидимостьЗапретаОтгрузкиПартнеру();
	ПродажиСервер.ПартнерПриИзменении(Объект);
	
	РассылкиИОповещенияКлиентам.УстановитьВидимостьПодпискиНаОповещенияВОбъекте(
		Элементы.ГруппаПодпискаНаОповещения,
		Объект.Партнер,
		ПредопределенноеЗначение("Перечисление.ТипыСобытийОповещений.ИзменениеСостоянияЗаказа"));
		
	Если ИспользоватьНаправленияДеятельности Тогда
		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
	КонецЕсли;
	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
	
	//jadmin
	Если Объект.Партнер.ОтгрузкаТолькоПоПредоплате = ИСТИНА Тогда
		Объект.СкидкаЗаПредоплату = Истина;
		Элементы.СкидкаЗаПредоплату.ТолькоПросмотр = ИСТИНА;
		СкидкаЗаПредоплатуПриИзмененииНаСервере();
	Иначе
		Элементы.СкидкаЗаПредоплату.ТолькоПросмотр = ЛОЖЬ;
	КонецЕсли;
	
	////jadmin 
	Если Объект.Контрагент.СостояниеНалогоплательщика <> Перечисления.СостоянияНалогоплательщиков.Действующий Тогда
	
		Сообщить("Внимание! Контрагент "+ Объект.Контрагент + " находится в состоянии:" + Объект.Контрагент.СостояниеНалогоплательщика );
	
	КонецЕсли;

	ЕстьРазрешениеНаУстановкуПризнака = ПроверитьКонтрагентаНаПризнакОтгрузкуРазрешил(Объект.Контрагент);
	Если Объект.Партнер.ВидПартнераКонтрагента.Ссылка.Код = "000000007"  
		ИЛИ ЕстьРазрешениеНаУстановкуПризнака = ИСТИНА Тогда
		Элементы.ОтгрузкуРазрешил.Видимость = Истина;
	Иначе
	    Элементы.ОтгрузкуРазрешил.Видимость = ЛОЖЬ;
	КонецЕсли;

	
	
	Если Объект.Контрагент.Партнер.ОсновнойМенеджер <> Объект.Менеджер Тогда
		 Сообщить("Автор заказа не соответствует основному менеджеру клиента");
	КонецЕсли; 
	
	Если Объект.Партнер.ВидПартнераКонтрагента.Ссылка.Код = "000000007" Тогда   /////// для сетей возможность менять серии
		Объект.СерииДоступныДляРедактирования = Истина; 
	Иначе
		Объект.СерииДоступныДляРедактирования = Ложь;
		Элементы.СерииДоступныДляРедактирования.Видимость = Ложь;

	КонецЕсли; 
		
КонецПроцедуры

&НаСервере
Процедура КонтактноеЛицоПриИзмененииСервер(ПартнерИзменился)
	
	ВладелецКонтактногоЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КонтактноеЛицо, "Владелец");
	Если ВладелецКонтактногоЛица <> Объект.Партнер Тогда
		Объект.Партнер = ВладелецКонтактногоЛица;
		ПриИзмененииПартнераСервер();
		ПартнерИзменился = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСоглашенияСервер()
	
	ГрафикОплаты = Объект.ГрафикОплаты;

	ДокументПродажи = РеквизитФормыВЗначение("Объект");
	ДокументПродажи.ЗаполнитьУсловияПродажПоСоглашению();
	ЗначениеВРеквизитФормы(ДокументПродажи, "Объект");
	
	ВалютаДокумента = Объект.Валюта;
	НалогообложениеИзСоглашения = ПродажиСервер.НалогообложениеОпределяетсяИзСоглашения(Объект.Соглашение);
	
	ПриИзмененииХозяйственнойОперацииСервер(Ложь);
	ПриИзмененииСкладаСервер();
	
	НекорректнаяДатаОплаты = Объект.ЭтапыГрафикаОплаты.Количество() = 0 ИЛИ Объект.ЭтапыГрафикаОплаты.Получить(0).ДатаПлатежа < Объект.Дата;
	
	ЗаполнитьЭтапыОплатыСервер(
		ИспользоватьСоглашенияСКлиентами И ПродажиВызовСервера.ГрафикСоглашенияЗаполнен(Объект.Соглашение),
		ИспользоватьГрафикиОплаты И ЗначениеЗаполнено(Объект.ГрафикОплаты) И (ГрафикОплаты <> Объект.ГрафикОплаты ИЛИ НекорректнаяДатаОплаты));
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	ОбновитьДубликатыЗависимыхРеквизитов();
	Объект.БанковскийСчетКонтрагента = ПолучитьБанковскийСчетКонтрагентаПоУмолчаниюСервер(Объект.Контрагент);
	ДенежныеСредстваСервер.ПроверитьЗаполнитьБанковскийСчетОрганизацииПоВладельцу(Объект.Организация, Объект.БанковскийСчет, , Объект.НаправлениеДеятельности);
	ДенежныеСредстваСервер.ПроверитьЗаполнитьКассуОрганизацииПоВладельцу(Объект.Организация, Объект.Касса, Объект.ФормаОплаты, Объект.НаправлениеДеятельности);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	УстановитьВидимостьОпераций();
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	ЗаполнитьГруппуФинУчета();
	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);
	
	ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь);
	ОбновитьОграничениеЗадолженности();
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Договор");
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
	ВариантыОбеспечения = ПродажиСервер.ВариантыОбеспеченияПоУмолчанию(Объект.Соглашение, Объект.Статус);
	
	Если ИспользоватьНаправленияДеятельности Тогда
		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
	КонецЕсли;
	
	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВалютыСервер(НоваяВалюта, ПересчитатьСуммы = Истина)
	
	ЗаполнитьДоговорПоУмолчанию();
	
	Если ПересчитатьСуммы Тогда
		СтараяВалюта                = ВалютаДокумента;
		ДатаДокумента               = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата());
		СтруктураКурсовСтаройВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтараяВалюта, ДатаДокумента);
		СтруктураКурсовНовойВалюты  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НоваяВалюта,  ДатаДокумента);
		
		Ценообразование.ПересчитатьСуммыТабличнойЧастиВВалюту(
			Объект.Товары,
			Объект.ЦенаВключаетНДС,
			СтараяВалюта,
			НоваяВалюта,
			СтруктураКурсовСтаройВалюты,
			СтруктураКурсовНовойВалюты,
			Истина,
			Истина);
		
		ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
		
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		
		Ценообразование.РаспределитьСуммуПоЭтапамОплаты(Объект, СуммаЗаказано, СуммаЗалогаЗаТару);
	КонецЕсли;
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Валюта");
	
	ЗаполнитьПорядокОплатыПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура НалогообложениеНДСПриИзмененииСервер(КэшированныеЗначения = Неопределено)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, КэшированныеЗначения);
	ОбновитьДубликатыЗависимыхРеквизитов();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЦенаВключаетНДСПриИзмененииСервер(КэшированныеЗначения)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, КэшированныеЗначения);
	ОбновитьДубликатыЗависимыхРеквизитов();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	Если НЕ ИспользоватьСоглашенияСКлиентами Тогда
		ПараметрыВыбораВидаЦены = ЗначениеНастроекПовтИсп.ПараметрыВыбораВидаЦеныПоУмолчанию();
	
		ПараметрыВыбораВидаЦены.ЦенаВключаетНДС        = Объект.ЦенаВключаетНДС;
		ПараметрыВыбораВидаЦены.ИспользоватьПриПродаже = Истина;
		ПараметрыВыбораВидаЦены.Статус                 = Перечисления.СтатусыДействияВидовЦен.Действует;
		
		ВидЦеныПоУмолчанию = ЗначениеНастроекПовтИсп.ВидЦеныПоУмолчанию(ПараметрыВыбораВидаЦены);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизацииСервер()
	
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ЗаполнитьДоговорПоУмолчанию();
		
		Если ИспользоватьНаправленияДеятельности Тогда
			НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, Объект.Соглашение, Объект.Договор);
		КонецЕсли;
		
		Если Не (ИспользоватьСоглашенияСКлиентами И НалогообложениеИзСоглашения) Тогда
			Объект.НалогообложениеНДС = ЗначениеНастроекПовтИсп.ПолучитьНалогообложениеНДС(Объект.Организация, Объект.Склад, Объект.Дата);
			НалогообложениеНДСПриИзмененииСервер();
		КонецЕсли;
		
	КонецЕсли;
	
	ДенежныеСредстваСервер.ПроверитьЗаполнитьБанковскийСчетОрганизацииПоВладельцу(Объект.Организация, Объект.БанковскийСчет, , Объект.НаправлениеДеятельности);
	ДенежныеСредстваСервер.ПроверитьЗаполнитьКассуОрганизацииПоВладельцу(Объект.Организация, Объект.Касса, Объект.ФормаОплаты, Объект.НаправлениеДеятельности);
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Организация");
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСкладаСервер()
	
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Объект.Склад);
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Объект.Склад, СкладГруппа, Объект.Товары, Ложь);
	
	УстановитьПараметрыВыбораТоварыСклад();
	
	Элементы.ТоварыЗаполнитьСкладВВыделенныхСтроках.Доступность = СкладГруппа;
	
	ПодготовитьЗаполнитьУстановитьВидимостьСерий();
	
	Если Не (ИспользоватьСоглашенияСКлиентами И НалогообложениеИзСоглашения) Тогда
		Объект.НалогообложениеНДС = ЗначениеНастроекПовтИсп.ПолучитьНалогообложениеНДС(Объект.Организация, Объект.Склад, Объект.Дата);
		НалогообложениеНДСПриИзмененииСервер();
	КонецЕсли;
	
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
		////jadmin скидка для скл1 Картофель
		//Если Объект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный",ИСТИНА)   Тогда
		//	Объект.СкидкаЗаПредоплату = ИСТИНА; 
		//	Объект.СкидкаЗаПредоплатуПроцент = 5;
		//	Объект.СкидкаОборот = ЛОЖЬ; 
		//	Объект.СкидкаОборотПроцент = 0;
		//	Объект.СкидкаСезонная = ЛОЖЬ; 
		//	Объект.СкидкаСезоннаяПроцент = 0;
		//	
		//	СкидкаСезоннаяРазмер = 0;
		//	СкидкаЗаПредоплатуРазмер = 0;
		//	СкидкаОборотРазмер = 0;
		//КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Процедура СтатусПриИзмененииСервер()  
	
	ВариантыОбеспечения = ПродажиСервер.ВариантыОбеспеченияПоУмолчанию(Объект.Соглашение, Объект.Статус);
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента") Тогда
		
		Если ОбеспечениеСервер.ЗаполнитьВариантОбеспеченияПоУмолчанию(Объект.Товары, Ложь, Объект.Статус) Тогда
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовПоСтатусуСервер();
	
КонецПроцедуры



&НаСервере
Процедура СтатусПриИзмененииСервер_77w() Экспорт        /////////77w qaws
	
	ВариантыОбеспечения = ПродажиСервер.ВариантыОбеспеченияПоУмолчанию(Объект.Соглашение, Объект.Статус);
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента") Тогда
		
		Если ОбеспечениеСервер.ЗаполнитьВариантОбеспеченияПоУмолчанию(Объект.Товары, Ложь, Объект.Статус) Тогда
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементовПоСтатусуСервер();
	
КонецПроцедуры


&НаСервере
Процедура ПриИзмененииХозяйственнойОперацииСервер(ВызовПоКоманде=Истина)
	
	Если ВызовПоКоманде Тогда
		ЗаполнитьДоговорПоУмолчанию();
	КонецЕсли;
	
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
		
		Если (ИспользоватьРучныеСкидкиВПродажах Или ИспользоватьАвтоматическиеСкидкиВПродажах)Тогда
			СкидкиНаценкиСервер.ОтменитьСкидки(Объект, "Товары", Истина);
			СкидкиНаценкиСервер.НастроитьКомандуПоказатьСообщения(Объект, Элементы.ПоказатьСообщения, Ложь);
		КонецЕсли;
		
		Если Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
			Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПустаяСсылка();
		КонецЕсли; 
		
		Если Объект.ТребуетсяЗалогЗаТару Тогда
			Объект.ТребуетсяЗалогЗаТару = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	ОбновитьДубликатыЗависимыхРеквизитов();
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	УстановитьВидимостьЭлементовПоОперацииСервер();
	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
	
КонецПроцедуры

&НаСервере
Функция ДатаПриИзмененииСервер(ПересчитыватьЦены)
	
	Если ПересчитыватьЦены Тогда
		ЦеныРассчитаны = ЗаполнитьЦеныПоСоглашениюСервер(Истина);
	Иначе
		ЦеныРассчитаны = Ложь;
	КонецЕсли;

	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаСервере
Процедура НаправлениеДеятельностиПриИзмененииСервер()
	
	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
		
		ЗаполнитьДоговорПоУмолчанию();
		
	КонецЕсли;
	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ЦенообразованиеИСкидки

&НаСервере
Функция ЗаполнитьЦеныПоСоглашениюСервер(ПоВсемСтрокам = Ложь)
	
	Если ПоВсемСтрокам Тогда
		МассивСтрок = Неопределено;
	Иначе
		МассивСтрок = Новый Массив;
		Для Каждого Строка Из Элементы.Товары.ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(Строка));
		КонецЦикла;
	КонецЕсли;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(Объект.Товары, МассивСтрок);
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку");
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗаполнения.Вставить("Соглашение", Объект.Соглашение);
	ПараметрыЗаполнения.Вставить("Организация", Объект.Организация);
	ПараметрыЗаполнения.Вставить("РасчитыватьНаборы", Истина);
	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, СтавкаНДС, ВидЦены, СрокПоставки");
	
	ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
		Объект.Товары,
		МассивСтрок, // Массив строк или структура отбора
		ПараметрыЗаполнения,
		СтруктураДействий);
		
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаСервере
Функция ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенСервер(ВидЦен)
	
	МассивСтрок = Новый Массив;
	Для Каждого Строка Из Элементы.Товары.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(Объект.Товары.НайтиПоИдентификатору(Строка));
	КонецЦикла;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(Объект.Товары, МассивСтрок);
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку");
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
	ПараметрыЗаполнения.Вставить("Валюта", Объект.Валюта);
	ПараметрыЗаполнения.Вставить("ВидЦены", ВидЦен);
	ПараметрыЗаполнения.Вставить("РасчитыватьНаборы", Истина);
	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
	
	ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
		Объект.Товары,
		МассивСтрок, // Массив строк или структура отбора
		ПараметрыЗаполнения,
		СтруктураДействий);
	
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	Возврат ЦеныРассчитаны;
	
КонецФункции

&НаСервере
Процедура РассчитатьСкидкиБезПримененияКОбъекту()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	ПримененныеСкидки = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Функция РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры, ВзятьИзВременногоХранилища = Ложь)
	
	Если ВзятьИзВременногоХранилища Тогда
		ПримененныеСкидки = ПолучитьИзВременногоХранилища(АдресПримененныхСкидокВоВременномХранилище);
		СкидкиНаценкиСервер.ПрименитьРезультатРасчета(Объект, ПримененныеСкидки);
	Иначе
		ПримененныеСкидки = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
		АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	КонецЕсли;

	Объект.СкидкиРассчитаны = Истина;
	ОбновитьДубликатыЗависимыхРеквизитов();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
	СтруктураСообщений = СкидкиНаценкиСервер.ПолучитьСтруктуруСообщений(Объект);
	СкидкиНаценкиСервер.НастроитьКомандуПоказатьСообщения(Объект, Элементы.ПоказатьСообщения);
	
	Возврат СтруктураСообщений;
	
КонецФункции

&НаСервере
Процедура НазначитьРучнуюСкидкуНаСервере(СуммаСкидкиНаценки, Знач ВыделенныеСтроки, АдресВоВременномХранилище)
	
	ПараметрыСкидки = Новый Структура();
	ПараметрыСкидки.Вставить("ИспользуютсяАвтоматическиеСкидки", Истина);
	ПараметрыСкидки.Вставить("ТолькоДляАктивныхСтрок", Ложь);
	ПараметрыСкидки.Вставить("РассчитыватьСуммуСНДС", Истина);
	ПараметрыСкидки.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ПараметрыСкидки.Вставить("АдресВоВременномХранилище", АдресВоВременномХранилище);
	
	СкидкиНаценкиСервер.НазначитьРучнуюСкидку(Объект, "Товары", СуммаСкидкиНаценки, ПараметрыСкидки);
	ОбновитьДубликатыЗависимыхРеквизитов();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПредварительныйРасчетСкидокНаСервере()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Истина);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	Возврат ПоместитьВоВременноеХранилище(СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ОтменитьРучныеСкидкиНаСервере()
	
	СкидкиНаценкиСервер.ОтменитьРучныеСкидки(Объект, "Товары", Истина, Истина);
	ОбновитьДубликатыЗависимыхРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСкидкиНаценкиКлиент()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(СтруктураПараметры);
	Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
		ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Скидки (наценки)'"),
		,
		НСтр("ru = 'Скидки (наценки) рассчитаны'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьИзмененияСкидокНаценокНаКлиенте(Отказ)
	
	СтруктураСообщений = РассчитатьСкидкиНаценкиНаСервере(Неопределено, Истина);
	Если СтруктураСообщений.Сообщения.Количество() > 0 И СтруктураСообщений.АвтоматическиОткрывать Тогда
		ОткрытьФорму("ОбщаяФорма.СообщенияСкидокНаценок", СтруктураСообщений, ЭтаФорма, УникальныйИдентификатор);
		Отказ = Истина;
	КонецЕсли;
	
	ПоказатьОповещениеПользователя(
		НСтр("ru = 'Скидки (наценки)'"),
		,
		НСтр("ru = 'Скидки (наценки) рассчитаны'"),
		БиблиотекаКартинок.Информация32);
	
КонецПроцедуры

&НаСервере
Процедура ПолученыСообщения(Сообщения)
	
	СкидкиНаценкиСервер.СохранитьОтработанныеСообщения(Объект, Сообщения);
	СкидкиНаценкиСервер.НастроитьКомандуПоказатьСообщения(Объект, Элементы.ПоказатьСообщения);
	
КонецПроцедуры

&НаСервере
Функция СкидкиИзменились()
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Ложь);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", УправляемыеСкидки);
	
	ПримененныеСкидки = СкидкиНаценкиСервер.Рассчитать(Объект, СтруктураПараметры);
	
	СкидкиИзменились = Ложь;
	
	КоличествоСтрок = ПримененныеСкидки.ТаблицаСкидкиНаценки.Количество();
	Если КоличествоСтрок <> Объект.СкидкиНаценки.Количество() Тогда
		СкидкиИзменились = Истина;
	Иначе
		
		Если Объект.Товары.Итог("СуммаАвтоматическойСкидкиБезВозвратнойТары") <> Объект.СкидкиНаценки.Итог("Сумма") Тогда
			СкидкиИзменились = Истина;
		КонецЕсли;
		
		Для НомерСтроки = 1 По КоличествоСтрок Цикл
			Если    Объект.СкидкиНаценки[НомерСтроки-1].Сумма <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].Сумма
				ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].КлючСвязи <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].КлючСвязи
				ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].СкидкаНаценка <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].СкидкаНаценка
				ИЛИ Объект.СкидкиНаценки[НомерСтроки-1].НапомнитьПозже <> ПримененныеСкидки.ТаблицаСкидкиНаценки[НомерСтроки-1].НапомнитьПозже Тогда
				СкидкиИзменились = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если СкидкиИзменились Тогда
		АдресПримененныхСкидокВоВременномХранилище = ПоместитьВоВременноеХранилище(ПримененныеСкидки, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат СкидкиИзменились;
	
КонецФункции

#КонецОбласти

#Область ПодборыИОбработкаПроверкиКоличества

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента = ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "НоменклатураНабора, ХарактеристикаНабора, Номенклатура, Характеристика, Упаковка, Склад, ДатаОтгрузки, ВидЦены, Цена, КоличествоУпаковок, СрокПоставки, ПроцентРучнойСкидки, ВариантОбеспечения, Серия, СтатусУказанияСерий");
		
		
		Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(СтрокаТовара.Номенклатура,Объект.Дата) Тогда			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор КАК Регистратор,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
			|ГДЕ
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
			|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия
			|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена <> 0
			|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены";
			
			Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
			Запрос.УстановитьПараметр("Серия", ТекущаяСтрока.Серия);
			Запрос.УстановитьПараметр("ВидЦены", ТекущаяСтрока.ВидЦены);
			Запрос.УстановитьПараметр("Период", Объект.Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				ТекущаяСтрока.Цена = 0;
			КонецЕсли; 
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ТекущаяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;
			КонецЦикла;
		КонецЕсли; 
		
		
		
		HS_ОбщегоНазначения.ЗаполнитьЗначенияСвойствБезопасно(ТекущаяСтрока, СтрокаТовара, "ЦенаСоСкидкой,Серия,ВариантОбеспечения,Отменено,ПричинаОтмены,КодСтроки,КлючСвязи,Содержание");
		
		ТекущаяСтрока.ИндексНабора = ?(ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураНабора), 1, 0);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
		СтруктураДействий.Вставить("ПоместитьОбработанныеСтрокиВКэшированныеЗначения");
		
		Если Не ЗначениеЗаполнено(СтрокаТовара.ВариантОбеспечения) Тогда
		
			ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения);
			СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
			
			Если ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента Тогда
				
				СтруктураДействий.Вставить("ЗаполнитьВариантОбеспеченияПоДатеОтгрузки",
					ОбеспечениеКлиентСервер.СтруктураЗаполненияВариантаОбеспечения(Объект, СтрокаТовара.ДатаОтгрузки));
				
			КонецЕсли;
			
			СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
				Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
				
		КонецЕсли;
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
		
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		// HS
		Если ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
			// видимо пользователь хочет зарезервировать серию, раз ее заполнил
			Если HS_ОбщегоНазначения.ЕстьРеквизитОбъекта(СтрокаТовара, "ВариантОбеспечения") Тогда
				ТекущаяСтрока.ВариантОбеспечения = СтрокаТовара.ВариантОбеспечения;
			Иначе	
				ТекущаяСтрока.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
			КонецЕсли;	
			
			ТекущаяСтрока.СтатусУказанияСерий = 14;  //////// 77w qaws

		КонецЕсли;	
			
	КонецЦикла;
	ОбеспечениеСервер.РассчитатьДатуОтгрузкиВСтрокахТабличнойЧасти(КэшированныеЗначения.ОбработанныеСтроки, Объект, Объект.Товары);
	
	Если Объект.НеОтгружатьЧастями И ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения Тогда
		Объект.ДатаОтгрузки = Макс(ВыбранноеЗначение.МаксимальнаяДатаОтгрузки, Объект.ДатаОтгрузки, НачалоДня(ТекущаяДатаСеанса()));
		ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(Объект.Товары, "ДатаОтгрузки", Объект.ДатаОтгрузки);
	КонецЕсли;
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	
	
	//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);   //////// 77w qaws  убрал статус не заполнялся
	
	
	
	ПриИзмененииДатыОтгрузкиВТабЧасти();
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);

КонецПроцедуры

&НаКлиенте
Процедура СообщитьОбОшибкахОткрытияПодбора(Отказ)
	
	Если ИспользоватьСоглашенияСКлиентами И Не ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Соглашение"" не заполнено'"), Объект.Ссылка, "Объект.Соглашение",,Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Валюта"" не заполнено'"), Объект.Ссылка, "Объект.Валюта",,Отказ);
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Склад"" не заполнено'"), Объект.Ссылка, "Объект.Склад",,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	ИзменятьКоличество = Истина;
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	КонецЕсли;
	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПоместитьОбработанныеСтрокиВКэшированныеЗначения");
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействийСДобавленнымиСтроками,Объект);
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействийСИзмененнымиСтроками,Объект);
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();

	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	СтруктураДействий.ПараметрыУказанияСерий                 = ПараметрыУказанияСерий;
	СтруктураДействий.ИзменятьКоличество                     = ИзменятьКоличество;
	СтруктураДействий.РассчитыватьНаборы                     = Истина;
	
	ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
	
	Если ШтрихкодированиеНоменклатурыКлиент.НужноОткрытьФормуУказанияСерийПослеОбработкиШтрихкодов(СтруктураДействий) Тогда
		
		ТекущиеДанныеИдентификатор = СтруктураДействий.МассивСтрокССериями[0];
		
		ПодключитьОбработчикОжидания("ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры",0.1,Истина);
			
	КонецЕсли;

	Если ИзменятьКоличество Тогда
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	КонецЕсли;
		
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		Элементы.Товары.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураПараметровДействия,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,СтруктураПараметровДействия,КэшированныеЗначения);
	ОбеспечениеСервер.РассчитатьДатуОтгрузкиВСтрокахТабличнойЧасти(КэшированныеЗначения.ОбработанныеСтроки, Объект, Объект.Товары);
	КэшированныеЗначения.ОбработанныеСтроки.Очистить();
	
	ПриИзмененииДатыОтгрузкиВТабЧасти();
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
КонецПроцедуры

#КонецОбласти

#Область Серии

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерий()
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры()

	Если ТекущиеДанныеИдентификатор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
	ОткрытьПодборСерий(,ТекущиеДанные);

КонецПроцедуры

#КонецОбласти

#Область РаботаСБуферомОбмена

&НаСервере
Процедура СкопироватьСтрокиНаСервере()
	
	КопированиеСтрокСервер.ПоместитьВыделенныеСтрокиВБуферОбмена(Элементы.Товары.ВыделенныеСтроки, Объект.Товары);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтрокиИзБуфераОбмена()
	
	Если Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("ОтборПоТипуНоменклатуры",НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре());
		ТаблицаТоваров = КопированиеСтрокСервер.ПолучитьСтрокиИзБуфераОбмена(ПараметрыОтбора);
	Иначе
		ТаблицаТоваров = КопированиеСтрокСервер.ПолучитьСтрокиИзБуфераОбмена();
	КонецЕсли;
	
	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара);
		ТекущаяСтрока.ИндексНабора = ?(ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураНабора), 1, 0);
		Если НЕ ИспользоватьРучныеСкидкиВПродажах Тогда
			ТекущаяСтрока.ПроцентРучнойСкидки = 0;
			ТекущаяСтрока.СуммаРучнойСкидки = 0;
		КонецЕсли;
		
		Если Объект.НеОтгружатьЧастями Тогда
			ТекущаяСтрока.ДатаОтгрузки = Объект.ДатаОтгрузки;
		КонецЕсли;
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
		ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
		СтруктураДействий.Вставить("ПоместитьОбработанныеСтрокиВКэшированныеЗначения");
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
		
		КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
	КонецЦикла;
	ОбеспечениеСервер.РассчитатьДатуОтгрузкиВСтрокахТабличнойЧасти(КэшированныеЗначения.ОбработанныеСтроки, Объект, Объект.Товары);
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	ПриИзмененииДатыОтгрузкиВТабЧасти();
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьКомандБуфераОбмена()
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ТоварыВставитьСтроки");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ПустойБуферОбмена = ОбщегоНазначения.ПустойБуферОбмена("Строки");
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность", НЕ ПустойБуферОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандБуфераОбменаНаКлиенте()
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ТоварыВставитьСтроки");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюВставитьСтроки");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Доступность", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Доставка

&НаСервере
Процедура ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы);
	
	ДоставкаТоваров.ЗаполнитьРеквизитыДоставки(Элементы, ИмяЭлементаФормы, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область КонтрольНесогласованныхИзменений

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПриИзменении(Элемент)
	Если Элемент.Имя = "Дата" Тогда
		ДатаПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "Партнер" Тогда
		ПартнерПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "Соглашение" Тогда
		СоглашениеПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "Валюта" Тогда
		ВалютаПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ЦенаВключаетНДС" Тогда
		ЦенаВключаетНДСПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "НалогообложениеНДС" Тогда
		НалогообложениеНДСПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "Организация" Тогда
		ОрганизацияПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "Контрагент" Тогда
		КонтрагентПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "Договор" Тогда
		ДоговорПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "Склад" Тогда
		СкладПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "НеОтгружатьЧастями" Тогда
		НеОтгружатьЧастямиПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ДатаОтгрузки" Тогда
		ДатаОтгрузкиПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ХозяйственнаяОперация" Тогда
		ХозяйственнаяОперацияПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ВернутьМногооборотнуюТару" Тогда
		ВернутьМногооборотнуюТаруПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТребуетсяЗалогЗаТару" Тогда
		ТребуетсяЗалогЗаТаруПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыНоменклатура" Тогда
		ТоварыНоменклатураПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыХарактеристика" Тогда
		ТоварыХарактеристикаПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыКоличествоУпаковок" Тогда
		ТоварыКоличествоУпаковокПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыУпаковка" Тогда
		ТоварыУпаковкаПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыВидЦены" Тогда
		ТоварыВидЦеныПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыЦена" Тогда
		ТоварыЦенаПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыСтавкаНДС" Тогда
		ТоварыСтавкаНДСПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыПроцентРучнойСкидки" Тогда
		ТоварыПроцентРучнойСкидкиПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыСуммаРучнойСкидки" Тогда
		ТоварыСуммаРучнойСкидкиПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыСумма" Тогда
		ТоварыСуммаПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыСерия" Тогда
		ТоварыСерияПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыСклад" Тогда
		ТоварыСкладПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыОтмененоПричиныОтменыНеИспользуются" Тогда
		ТоварыОтмененоПриИзменении(Элемент);
	ИначеЕсли Элемент.Имя = "ТоварыОтменено" Тогда
		ТоварыОтмененоПриИзменении(Элемент);
	Иначе
		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеКоманды(Команда)
	Если Команда.Имя = "ОткрытьПодбор" Тогда
		ОткрытьПодбор(Команда);
	ИначеЕсли Команда.Имя = "ДополнитьМногооборотнойТарой" Тогда
		ДополнитьМногооборотнойТарой(Команда);
	ИначеЕсли Команда.Имя = "ПоискПоШтрихкоду" Тогда
		ПоискПоШтрихкодуВыполнить(Команда);
	ИначеЕсли Команда.Имя = "ЗагрузитьДанныеИзТСД" Тогда
		ЗагрузитьДанныеИзТСД(Команда);
	ИначеЕсли Команда.Имя = "ЗаполнитьСкладВВыделенныхСтроках" Тогда
		ЗаполнитьСкладВВыделенныхСтроках(Команда);
	ИначеЕсли Команда.Имя = "ЗагрузитьИзВнешнегоФайла" Тогда
		ЗагрузитьИзВнешнегоФайла(Команда);
	ИначеЕсли Команда.Имя = "ЗаполнитьЦеныПоСоглашению" Тогда
		АвтоТест_ЗаполнитьЦеныПоСоглашению(Команда);
	ИначеЕсли Команда.Имя = "ЗаполнитьЦеныВыделенныхСтрокПоВидуЦен" Тогда
		ЗаполнитьЦеныВыделенныхСтрокПоВидуЦен(Команда);
	ИначеЕсли Команда.Имя = "СчитатьКартуЛояльности" Тогда
		СчитатьКартуЛояльности(Команда);
	ИначеЕсли Команда.Имя = "РассчитатьСкидкиНаценки" Тогда
		РассчитатьСкидкиНаценки(Команда);
	ИначеЕсли Команда.Имя = "ОтменитьРучныеСкидки" Тогда
		ОтменитьРучныеСкидки(Команда);
	ИначеЕсли Команда.Имя = "НазначитьРучнуюСкидку" Тогда
		НазначитьРучнуюСкидку(Команда);
	ИначеЕсли Команда.Имя = "НазначитьРучнуюСкидкуВыделенныхСтрок" Тогда
		НазначитьРучнуюСкидкуДляВыделенныхСтрок(Команда);
	ИначеЕсли Команда.Имя = "НазначитьАвтоматическиеСкидки" Тогда
		НазначитьАвтоматическиеСкидки(Команда);
	ИначеЕсли Команда.Имя = "СоставНабора" Тогда
		СоставНабора(Команда);
	Иначе
		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Команда);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеНажатие(Элемент)
	ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломИзменения(Элемент, Отказ)
	ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередУдалением(Элемент, Отказ)
	Если Элемент.Имя = "Товары" Тогда
		ТоварыПередУдалением(Элемент, Отказ);
	Иначе
		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Элемент.Имя = "Товары" Тогда
		ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа);
	Иначе
		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзменении_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент)
	// HS
	Экспорт
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПриИзменении.Свойство(Элемент.Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Нажатие_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.Нажатие.Свойство(Элемент.Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеНажатие(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Команда_УстановитьДоступностьЭлементовПоСтатусуСервер(Команда)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.Команды.Свойство(Команда.Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеКоманды(Команда);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередНачаломИзменения_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередНачаломИзменения.Свойство(Элемент.Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломИзменения(Элемент, Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередУдалением_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Имя = Элемент.Имя;
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередУдалением.Свойство(Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередУдалением(Элемент, Отказ);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПередНачаломДобавления_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Имя = Элемент.Имя;
	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередНачаломДобавления.Свойство(Имя) Тогда
		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииРеквизитаЗависящегоОтСтатуса()
	
	УстановитьДоступностьЭлементовПоСтатусуСервер();
	ОбщегоНазначенияУТКлиент.ПослеИзмененияРеквизитаЗависящегоОтСтатуса(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ВернутьМногооборотнуюТаруПриИзмененииСервер()
	
	Если Не Объект.ВернутьМногооборотнуюТару Тогда
		Объект.ТребуетсяЗалогЗаТару = Ложь;
	КонецЕсли;
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, Неопределено);
	
	ОбновитьДубликатыЗависимыхРеквизитов();
	
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьЗаполнитьУстановитьВидимостьСерий()
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЗаказКлиента));
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	Элементы.ТоварыСерия.Видимость = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьПодборСерий(Элемент.ТекстРедактирования);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияПриИзменении(Элемент)
	
	ВыбранноеЗначение = НоменклатураКлиентСервер.ВыбраннаяСерия();
	
	ВыбранноеЗначение.Значение            		 = Элементы.Товары.ТекущиеДанные.Серия;
	ВыбранноеЗначение.ИдентификаторТекущейСтроки = Элементы.Товары.ТекущиеДанные.ПолучитьИдентификатор();
	
	НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСлужебныеРеквизитыПоНоменклатуре()
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
											Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
											Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
											Новый Структура("Номенклатура", "Артикул"));
											
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакВариантОформленияПродажи",
											Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары,ПараметрыЗаполненияРеквизитов);
	
	НаборыСервер.ЗаполнитьСлужебныеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)
	
	Если ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения Тогда
		ПараметрыФормы = ПараметрыФормыЗапросаКоличестваИСерий();
		Если ПараметрыФормы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ПараметрыФормы.Вставить("ВыборСерии", Истина);
		
		Если ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
			ОткрытьФорму(
				"Обработка.ПодборТоваровВДокументПродажи.Форма.ЗапросКоличестваИСерий",
				ПараметрыФормы,
				ЭтаФорма,
				,
				,
				,
				Новый ОписаниеОповещения("ОбработатьВыборВариантаОбеспечения", ЭтотОбъект),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
			
		Возврат;
	КонецЕсли;
	
	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные)Тогда
		ТекстИсключения = НСтр("ru = 'Ошибка при попытке указать серии - в этом документе для указания серий не нужен серверный вызов.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЖелаемаяДатаОтгрузки()

	МаксДатаАванса = ПродажиСервер.МаксимальнаяДатаАванса(Объект.ЭтапыГрафикаОплаты);
	ЖелаемаяДатаОтгрузкиСписокВыбора = Элементы.ЖелаемаяДатаОтгрузки.СписокВыбора;
	
	Если ЗначениеЗаполнено(МаксДатаАванса) Тогда
		
		ПредставлениеМаксДатаАванса = "%МаксДатаАванса%";
		ПредставлениеМаксДатаАванса = СтрЗаменить(ПредставлениеМаксДатаАванса, "%МаксДатаАванса%", Формат(МаксДатаАванса,"ДЛФ=DD"));
		
		ЖелаемаяДатаОтгрузкиСписокВыбора.Очистить();
		ЖелаемаяДатаОтгрузкиСписокВыбора.Добавить(МаксДатаАванса, ПредставлениеМаксДатаАванса);
		
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента");
	Элементы.Статус.Видимость = ИспользоватьСтатусы;
	Элементы.ЗакрытьЗаказ.Видимость = ИспользоватьСтатусы;
	
	ВалютаДокумента = Объект.Валюта;
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Объект.Склад);
	Элементы.ТоварыЗаполнитьСкладВВыделенныхСтроках.Доступность = СкладГруппа;
	
	ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь , Ложь);
	
	УстановитьПараметрыВыбораТоварыСклад();
	
	ИспользоватьСоглашенияСКлиентами                  = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	ИспользоватьОтгрузкуБезПереходаПраваСобственности = ПолучитьФункциональнуюОпцию("ИспользоватьОтгрузкуБезПереходаПраваСобственности");
	ИспользоватьУпрощеннуюСхемуОплаты                 = ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВПродажах");
	ИспользоватьГрафикиОплаты                         = ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты");
	ИспользоватьНесколькоОрганизаций                  = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций");
	ИспользоватьНаправленияДеятельности               = ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности");
	
	ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения = ПолучитьФункциональнуюОпцию("ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения")
																		И ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	
	Если НЕ ИспользоватьСоглашенияСКлиентами Тогда
		ПараметрыВыбораВидаЦены = ЗначениеНастроекПовтИсп.ПараметрыВыбораВидаЦеныПоУмолчанию();
	
		ПараметрыВыбораВидаЦены.ЦенаВключаетНДС        = Объект.ЦенаВключаетНДС;
		ПараметрыВыбораВидаЦены.ИспользоватьПриПродаже = Истина;
		ПараметрыВыбораВидаЦены.Статус                 = Перечисления.СтатусыДействияВидовЦен.Действует;
		
		ВидЦеныПоУмолчанию = ЗначениеНастроекПовтИсп.ВидЦеныПоУмолчанию(ПараметрыВыбораВидаЦены);
	Иначе
		НалогообложениеИзСоглашения = ПродажиСервер.НалогообложениеОпределяетсяИзСоглашения(Объект.Соглашение);
	КонецЕсли;

	УстановитьВидимостьОпераций();
	УстановитьДоступностьЭлементовПоСтатусуСервер();
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	ОбновитьДубликатыЗависимыхРеквизитов();
	ОбновитьСостояниеСервер();
	
	УстановитьВидимостьЭлементовПоОперацииСервер();
	УстановитьСвойстваЭлементовПоПорядкуРасчетов();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЗаказКлиента));
	Элементы.ТоварыСерия.Видимость = ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры;
	ЗаполнитьСписокВыбораЖелаемаяДатаОтгрузки();
	
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость);
	
	Элементы.Организация.Видимость = ИспользоватьНесколькоОрганизаций;

	УстановитьВидимостьЭлементовФормыДатОтгрузки();
	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);
	
	ДоставкаТоваров.ПриЧтенииСозданииРаспоряженийНаСервере(Элементы, Объект);
	
	УстановитьВидимостьЗапретаОтгрузкиПартнеру();
	УстановитьВидимостьОбеспечения();
	Элементы.ТоварыЗаполнитьОбеспечение.Доступность = Не ТолькоПросмотр;

	РассылкиИОповещенияКлиентам.УстановитьВидимостьПодпискиНаОповещенияВОбъекте(
		Элементы.ГруппаПодпискаНаОповещения,
		Объект.Партнер,
		ПредопределенноеЗначение("Перечисление.ТипыСобытийОповещений.ИзменениеСостоянияЗаказа"));
		
		
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСостояниеЭДО", "Видимость", ИспользоватьСтатусы, Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	ВариантыОбеспечения = ПродажиСервер.ВариантыОбеспеченияПоУмолчанию(Объект.Соглашение, Объект.Статус);
	
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	ОбщегоНазначенияУТ.ИнициализироватьКешТекущейСтроки(ЭтотОбъект, "Товары");
	
	МетаданныеФормы = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка).ОписаниеФормыДокументаДляЗаполненияРеквизитовСвязанныхСНаправлениемДеятельности();
	НаправленияДеятельностиСервер.ПриЧтенииСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказателиЗаказа(Форма)
	
	// Заполнение итогов по таблице "Товары"
	
	КоллекцияТовары = Форма.Объект.Товары;

	Форма.СуммаЗаказаноСЗалоговойТарой = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено"),
		КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));
	Форма.СуммаЗаказано     = КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары");
	Форма.СуммаЗалогаЗаТару = ?(Форма.Объект.ТребуетсяЗалогЗаТару,(КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено"))
			- (КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары")),0);
	Форма.СуммаНДСЗаказано  = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаНДС") - КоллекцияТовары.Итог("СуммаНДСОтменено"),
		КоллекцияТовары.Итог("СуммаНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаНДСОтмененоБезВозвратнойТары"));
	Форма.СуммаАвтоСкидки   = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаАвтоматическойСкидки") - КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиОтменено"),
		КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиОтмененоБезВозвратнойТары"));
	Форма.СуммаРучнойСкидки = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаРучнойСкидки") - КоллекцияТовары.Итог("СуммаРучнойСкидкиОтменено"),
		КоллекцияТовары.Итог("СуммаРучнойСкидкиБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаРучнойСкидкиОтмененоБезВозвратнойТары"));
	Форма.СуммаСкидки       = Форма.СуммаАвтоСкидки + Форма.СуммаРучнойСкидки;
	Форма.СуммаОтменено     = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаСНДСОтменено"),
		КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));
	
	Если КоллекцияТовары.Итог("СуммаСНДСОтменено") = КоллекцияТовары.Итог("СуммаСНДС") Тогда
		Форма.ВсеСтрокиОтменены = Истина;
	Иначе
		Форма.ВсеСтрокиОтменены = Ложь;
	КонецЕсли;
	
	СуммаЗаказано = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("Сумма") - КоллекцияТовары.Итог("СуммаОтменено"),
		КоллекцияТовары.Итог("СуммаБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаОтмененоБезВозвратнойТары"));
	
	Если СуммаЗаказано > 0 
		И (СуммаЗаказано + Форма.СуммаСкидки) <> 0 Тогда
		Форма.ПроцентАвтоСкидки   = Форма.СуммаАвтоСкидки * 100 / (СуммаЗаказано + Форма.СуммаСкидки);
		Форма.ПроцентРучнойСкидки = Форма.СуммаРучнойСкидки * 100 / (СуммаЗаказано + Форма.СуммаСкидки);
		Форма.ПроцентСкидки       = Форма.ПроцентАвтоСкидки + Форма.ПроцентРучнойСкидки;
	ИначеЕсли Форма.СуммаСкидки > 0 Тогда
		Форма.ПроцентАвтоСкидки   = Форма.СуммаАвтоСкидки * 100 / Форма.СуммаСкидки;
		Форма.ПроцентРучнойСкидки = Форма.СуммаРучнойСкидки * 100 / Форма.СуммаСкидки;
		Форма.ПроцентСкидки       = 100;
	Иначе
		Форма.ПроцентАвтоСкидки   = 0;
		Форма.ПроцентРучнойСкидки = 0;
		Форма.ПроцентСкидки       = 0;
	КонецЕсли;
	
	// Заполнение итогов по этапам оплаты
	
	Форма.СуммаАвансаДоОбеспечения = 0;
	Форма.СуммаПредоплатыДоОтгрузки = 0;
	Форма.СуммаКредитаПослеОтгрузки = 0;
	Форма.ПроцентАвансаДоОбеспечения = 0;
	Форма.ПроцентПредоплатыДоОтгрузки = 0;
	Форма.ПроцентКредитаПослеОтгрузки = 0;
	
	СоответствиеВариантовОплаты = Новый Соответствие;
	СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения"),
		Новый Структура("Сумма, Проценты", "СуммаАвансаДоОбеспечения", "ПроцентАвансаДоОбеспечения"));
	СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки"),
		Новый Структура("Сумма, Проценты", "СуммаПредоплатыДоОтгрузки", "ПроцентПредоплатыДоОтгрузки"));
	СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки"),
		Новый Структура("Сумма, Проценты", "СуммаКредитаПослеОтгрузки", "ПроцентКредитаПослеОтгрузки"));
	
	Для Каждого ТекСтрока Из Форма.Объект.ЭтапыГрафикаОплаты Цикл
		ИменаЭлементов = СоответствиеВариантовОплаты[ТекСтрока.ВариантОплаты];
		Если ИменаЭлементов <> Неопределено Тогда
			Форма[ИменаЭлементов.Сумма] = Форма[ИменаЭлементов.Сумма] + ТекСтрока.СуммаПлатежа
				+ ?(Форма.Объект.ТребуетсяЗалогЗаТару, ТекСтрока.СуммаЗалогаЗаТару, 0);
		КонецЕсли;
	КонецЦикла;
	
	СуммаВсегоПоЭтапам = Форма.СуммаАвансаДоОбеспечения + Форма.СуммаПредоплатыДоОтгрузки + Форма.СуммаКредитаПослеОтгрузки;
	Если СуммаВсегоПоЭтапам <> 0 Тогда
		Форма.ПроцентАвансаДоОбеспечения  = (Форма.СуммаАвансаДоОбеспечения/СуммаВсегоПоЭтапам)*100;
		Форма.ПроцентПредоплатыДоОтгрузки = (Форма.СуммаПредоплатыДоОтгрузки/СуммаВсегоПоЭтапам)*100;;
		Форма.ПроцентКредитаПослеОтгрузки = (Форма.СуммаКредитаПослеОтгрузки/СуммаВсегоПоЭтапам)*100;
	КонецЕсли;
	
	// Выбор странцицы отображения НДС
	
	Если Форма.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС")
		ИЛИ Форма.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД") Тогда
		
		Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоБезНДС;
		Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаБезНДС;
	Иначе
		
		Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоСНДС;
		Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаСНДС;
	КонецЕсли;
	
	HS_РаботаСДиалогамиКлиентСервер.РассчитатьИтоговыеПоказателиФормы(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗависимыеРеквизиты()
	
	Возврат Новый Структура(
		"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаАвтоматическойСкидки,СуммаРучнойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаАвтоматическойСкидки,СуммаРучнойСкидки",
		"Сумма,СуммаНДС,СуммаСНДС,СуммаАвтоматическойСкидки,СуммаРучнойСкидки");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Объект)
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьВыделенныеСтрокиНаСервере()

	Если ПараметрыУказанияСерий.ИспользоватьСерииНоменклатуры Тогда
		ЗаполнитьСтатусыУказанияСерий();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорПоУмолчанию()
	
	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов 
		И ИспользоватьНаправленияДеятельности	Тогда
	
		Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(Объект, 
															Объект.ХозяйственнаяОперация, 
															Объект.Валюта, 
															Объект.НаправлениеДеятельности);
	Иначе
															
		Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(Объект, 
															Объект.ХозяйственнаяОперация, 
															Объект.Валюта);
	КонецЕсли;													
															
	Если Договор <> Объект.Договор Тогда
		Объект.Договор = Договор;
		ЗаполнитьГруппуФинУчета();
		ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь);
		ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Объект.Договор, Объект.БанковскийСчет, Объект.БанковскийСчетКонтрагента);
		ЗаполнитьПорядокОплатыПоУмолчанию();
	КонецЕсли;
	
	ОбновитьОграничениеЗадолженности();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовПоСтатусуСервер()
	
	УстановитьПодписку = Ложь;
	
	Если Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован И ИспользоватьСтатусы Тогда
		
		УстановитьПодписку = Ложь;
		
	ИначеЕсли (Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован И Не ИспользоватьСтатусы) 
		ИЛИ Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению
		ИЛИ Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке 
		ИЛИ Объект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		
			УстановитьПодписку = Объект.Согласован;
		
	КонецЕсли;
	
	МассивЭлементов = Новый Массив;
	
	// Элементы управления шапки
	МассивЭлементов.Добавить("Дата");
	МассивЭлементов.Добавить("Партнер");
	МассивЭлементов.Добавить("Соглашение");
	МассивЭлементов.Добавить("Валюта");
	МассивЭлементов.Добавить("ЦенаВключаетНДС");
	МассивЭлементов.Добавить("НалогообложениеНДС");
	МассивЭлементов.Добавить("Организация");
	МассивЭлементов.Добавить("Контрагент");
	МассивЭлементов.Добавить("Договор");
	МассивЭлементов.Добавить("Склад");
	МассивЭлементов.Добавить("ЖелаемаяДатаОтгрузки");
	МассивЭлементов.Добавить("НеОтгружатьЧастями");
	МассивЭлементов.Добавить("ДатаОтгрузки");
	МассивЭлементов.Добавить("ДатаСогласования");
	МассивЭлементов.Добавить("ХозяйственнаяОперация");
	МассивЭлементов.Добавить("КартаЛояльности");
	МассивЭлементов.Добавить("ВернутьМногооборотнуюТару");
	МассивЭлементов.Добавить("СрокВозвратаМногооборотнойТары");
	МассивЭлементов.Добавить("ТребуетсяЗалогЗаТару");
	
	// Элементы управления, связанные с таблицей Товары
	МассивЭлементов.Добавить("ТоварыНоменклатура");
	МассивЭлементов.Добавить("ТоварыХарактеристика");
	МассивЭлементов.Добавить("ТоварыКоличествоУпаковок");
	МассивЭлементов.Добавить("ТоварыУпаковка");
	МассивЭлементов.Добавить("ТоварыВидЦены");
	МассивЭлементов.Добавить("ТоварыЦена");
	МассивЭлементов.Добавить("ТоварыСтавкаНДС");
	МассивЭлементов.Добавить("ТоварыПроцентРучнойСкидки");
	МассивЭлементов.Добавить("ТоварыСуммаРучнойСкидки");
	МассивЭлементов.Добавить("ТоварыСумма");
	МассивЭлементов.Добавить("ТоварыСодержание");
	
	// Элементы управления шапки
	МассивЭлементов.Добавить("Товары;ПередНачаломДобавления,ПередУдалением;ТоварыДатаОтгрузки");
	
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюДобавить");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюСкопировать");
	МассивЭлементов.Добавить("ТоварыКонтекстноеМенюУдалить");
	
	МассивЭлементов.Добавить("ТоварыДобавить");
	МассивЭлементов.Добавить("ТоварыИзменить");
	МассивЭлементов.Добавить("ТоварыСкопировать");
	МассивЭлементов.Добавить("ТоварыУдалить");
	
	МассивЭлементов.Добавить("ТоварыОткрытьПодбор");
	МассивЭлементов.Добавить("ТоварыДополнитьМногооборотнойТарой");
	МассивЭлементов.Добавить("ТоварыПоискПоШтрихкоду");
	МассивЭлементов.Добавить("ТоварыЗагрузитьДанныеИзТСД");
	МассивЭлементов.Добавить("ТоварыЗаполнитьСкладВВыделенныхСтроках");
	МассивЭлементов.Добавить("ТоварыЗагрузитьИзВнешнегоФайла");
	МассивЭлементов.Добавить("ТоварыСоставНабора");
	
	МассивЭлементов.Добавить("ТоварыЗаполнитьЦеныПоСоглашению");
	МассивЭлементов.Добавить("ТоварыЗаполнитьЦеныВыделенныхСтрокПоВидуЦен");
	
	МассивЭлементов.Добавить("СчитатьКартуЛояльности");
	МассивЭлементов.Добавить("СчитатьКартуЛояльностиКлиент");
	МассивЭлементов.Добавить("КартаЛояльности");
	МассивЭлементов.Добавить("ТоварыРассчитатьСкидкиНаценки");
	МассивЭлементов.Добавить("ТоварыОтменитьРучныеСкидки");
	МассивЭлементов.Добавить("ТоварыНазначитьРучнуюСкидку");
	МассивЭлементов.Добавить("ТоварыНазначитьРучнуюСкидкуВыделенныхСтрок");
	МассивЭлементов.Добавить("ТоварыНазначитьАвтоматическиеСкидки");
	
	ОбщегоНазначенияУТ.УстановитьПодпискуНаСобытияИзмененияЭлементовФормы(ЭтаФорма, МассивЭлементов, УстановитьПодписку);
	

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовПоОперацииСервер()
	
	Перем МассивВсехРеквизитов;
	Перем МассивРеквизитовОперации;
	
	Документы.ЗаказКлиента.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		Объект.ХозяйственнаяОперация, 
		МассивВсехРеквизитов, 
		МассивРеквизитовОперации);
	
	ДенежныеСредстваСервер.УстановитьВидимостьЭлементовПоМассиву(
		Элементы,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	
	ЭтоПередачаНаКомиссию = (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	
	МассивЭлементов = Новый Массив();
	
	МассивЭлементов.Добавить("НадписьЭтапыОплаты");
	МассивЭлементов.Добавить("ТоварыРассчитатьСкидкиНаценки");
	МассивЭлементов.Добавить("ТоварыОтменитьРучныеСкидки");
	МассивЭлементов.Добавить("ТоварыНазначитьРучнуюСкидку");
	МассивЭлементов.Добавить("ТоварыНазначитьРучнуюСкидкуВыделенныхСтрок");
	МассивЭлементов.Добавить("ТоварыНазначитьАвтоматическиеСкидки");
	МассивЭлементов.Добавить("ТоварыОткрытьИнформациюОСкидках");
	МассивЭлементов.Добавить("КонтекстноеМенюТоварыОткрытьИнформациюОСкидках");
	МассивЭлементов.Добавить("СчитатьКартуЛояльности");
	МассивЭлементов.Добавить("СчитатьКартуЛояльностиКлиент");
	МассивЭлементов.Добавить("КартаЛояльности");
	МассивЭлементов.Добавить("СуммаСкидки");
	МассивЭлементов.Добавить("ТребуетсяЗалогЗаТару");
	МассивЭлементов.Добавить("ДекорацияОтступТребуетсяЗалогЗаТару");
	МассивЭлементов.Добавить("ДекорацияЗаголовокОплата");
	МассивЭлементов.Добавить("НадписьЭтапыОплаты");
	МассивЭлементов.Добавить("Расчеты");
	МассивЭлементов.Добавить("ЗачетОплатыФорма");

	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, МассивЭлементов, "Видимость", Не ЭтоПередачаНаКомиссию);
	
	Элементы.Расчеты.Видимость = Не ЭтоПередачаНаКомиссию;
	
	НоменклатураСервер.УстановитьПараметрыВыбораНоменклатуры(Объект.ХозяйственнаяОперация, Элементы.ТоварыНоменклатура);
	
	УчетНДСУТ.ЗаполнитьСписокВыбораНалогообложенияПродажи(Элементы.НалогообложениеНДС, Объект.ХозяйственнаяОперация);
	
	УстановитьВидимостьПоляПартнер();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСкладВВыделенныхСтрокахНаСервере(Знач МассивВыделенныхСтрок, Склад)
	
	ЗаполненоСтрок = СкладыСервер.ЗаполнитьСкладыВВыделенныхСтроках(Объект.Товары, МассивВыделенныхСтрок, Склад);
	
	Если ЗаполненоСтрок > 0 Тогда
		
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
		СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
		ВсегоСкладов = ТаблицаСкладов.Количество();
		СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	КонецЕсли;
	
	Возврат ЗаполненоСтрок;
	
КонецФункции

&НаСервере
Функция ОтменитьНепоставленныеСтрокиСервер(ПричинаОтмены, Знач ПроверятьОстатки = Ложь)
	
	СтруктураКорректировки = ЗаказыСервер.ПолучитьСтруктуруКорректировкиСтрокЗаказа();
	СтруктураКорректировки.ДокументОбъект               = Объект;
	СтруктураКорректировки.ПричинаОтмены                = ПричинаОтмены;
	СтруктураКорректировки.ПроверятьОстатки             = ПроверятьОстатки;
	СтруктураКорректировки.ОтменитьНеотработанныеСтроки = Истина;
	
	СтруктураРезультата = ПродажиСервер.СкорректироватьСтрокиЗаказа(СтруктураКорректировки);
	КоличествоОтмененныхСтрок = СтруктураРезультата.КоличествоСтрок;
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна, СкладОбязателен);
	
	ОбновитьДубликатыЗависимыхРеквизитов();
	
	Если КоличествоОтмененныхСтрок > 0 Тогда
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	КонецЕсли;
	
	Возврат КоличествоОтмененныхСтрок;
	
КонецФункции

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеСервер()
	
	Документы.ЗаказКлиента.РассчитатьСостояние(
		Объект.Ссылка,
		Объект.Договор,
		ЭтаФорма);
	
	ОбновитьОграничениеЗадолженности();
	Элементы.Состояние.Гиперссылка = ПравоДоступа("Просмотр", Метаданные.Отчеты.СостояниеВыполненияДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам()
	
	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
		Расчеты = НСтр("ru='Расчеты по договору'");
	Иначе
		Расчеты = НСтр("ru='Оплачено по заказу'") + ": " + Формат(СуммаОплаты, "ЧЦ=15; ЧДЦ=2; ЧН=") + " " + ВалютаДокумента + "  " + ПроцентОплаты + "%";
	КонецЕсли;
	
	Элементы.Расчеты.Видимость = Объект.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию 
		И Объект.ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным
		И ИспользоватьСтатусы;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБанковскийСчетКонтрагентаПоУмолчаниюСервер(Контрагент)
	
	Возврат ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения Тогда
		
		ЗначенияРеквизитов = ОбеспечениеКлиентСервер.ЗначенияРеквизитовДокументаДляВопросаОбОтгрузкеОднойДатой();
		ЗначенияРеквизитов.ДатаОтгрузки         = Объект.ДатаОтгрузки;
		ЗначенияРеквизитов.ЖелаемаяДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
		ЗначенияРеквизитов.НеОтгружатьЧастями   = Объект.НеОтгружатьЧастями;
		
		ОбеспечениеКлиент.ПоказатьВопросОбОтгрузкеОднойДатой(
			ЭтаФорма,
			ЗначенияРеквизитов,
			ВыбранноеЗначение,
			"ОбработкаВыбораПодборНаКлиентеПослеВопроса",
			Объект.Товары.Количество() > 0);
		
	Иначе
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	КонецЕсли;
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиентеПослеВопроса(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.НеОтгружатьЧастями = Ложь;
		УстановитьВидимостьЭлементовФормыДатОтгрузки();
	КонецЕсли;
	
	ОбработкаВыбораПодборНаСервере(ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервере
Процедура СчитанаКартаЛояльностиНаСервере(ДанныеКартыЛояльности)
	
	Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Партнер) И ДанныеКартыЛояльности.Партнер <> Объект.Партнер Тогда
		Объект.Партнер = ДанныеКартыЛояльности.Партнер;
		Объект.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Объект.Соглашение = Справочники.СоглашенияСКлиентами.ПустаяСсылка();
		ПриИзмененииПартнераСервер();
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Соглашение)
		И ДанныеКартыЛояльности.Соглашение <> Объект.Соглашение
		И ДанныеКартыЛояльности.СоглашениеДоступно Тогда
		Объект.Соглашение = ДанныеКартыЛояльности.Соглашение;
		ПриИзмененииСоглашенияСервер();
	КонецЕсли;
	Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Контрагент)
		И ДанныеКартыЛояльности.Контрагент <> Объект.Контрагент
		И ДанныеКартыЛояльности.КонтрагентДоступен Тогда
		Объект.Контрагент = ДанныеКартыЛояльности.Контрагент;
		КонтрагентПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчитанаКартаЛояльности(Знач Оповещение, КартаЛояльности)
	
	ДанныеКартыЛояльности = КартыЛояльностиВызовСервера.ПолучитьДанныеКартыЛояльности(КартаЛояльности);
	Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Ссылка) Тогда
		
		Если Не ДанныеКартыЛояльности.ПартнерДоступен Тогда
			ПоказатьПредупреждение(Новый ОписаниеОповещения("СчитанаКартаЛояльностиЗавершение", ЭтотОбъект, Новый Структура("Оповещение", Оповещение)), НСтр("ru = 'Нет доступа к партнеру-владельцу карты лояльности.'"));
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДанныеКартыЛояльности.Партнер) Тогда // Обезличенная карта
			
			СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
			Модифицированность = Истина;
			Объект.КартаЛояльности   = КартаЛояльности;
			
			ВыполнитьОбработкуОповещения(Оповещение);
			Возврат;
			
		ИначеЕсли Объект.Партнер <> ДанныеКартыЛояльности.Партнер Тогда // Партнер в карте отличается от партнера в документе.
			
			Если ЗначениеЗаполнено(Объект.Партнер) Тогда
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Оповещение", Оповещение);
				ДополнительныеПараметры.Вставить("КартаЛояльности", КартаЛояльности);
				ДополнительныеПараметры.Вставить("ДанныеКартыЛояльности", ДанныеКартыЛояльности);
				ПоказатьВопрос(
					Новый ОписаниеОповещения("СчитанаКартаЛояльностиВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры),
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Карта лояльности принадлежит партнеру ""%1"". Изменить партнера в документе?'"), ДанныеКартыЛояльности.Партнер),
					РежимДиалогаВопрос.ДаНет);
				Возврат;
			КонецЕсли;
			
		Иначе // Партнер в документе равен партнеру в карте.
			
			ВопросОбИзмененииКонтрагента = Ложь;
			Если ЗначениеЗаполнено(ДанныеКартыЛояльности.Контрагент)
				И ЗначениеЗаполнено(Объект.Контрагент) И ДанныеКартыЛояльности.Контрагент <> Объект.Контрагент Тогда
				ВопросОбИзмененииКонтрагента = Истина;
			КонецЕсли;
			
			ВопросОбИзмененииСоглашения = Ложь;
			Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(ДанныеКартыЛояльности.Соглашение)
				И ЗначениеЗаполнено(Объект.Соглашение) И ДанныеКартыЛояльности.Соглашение <> Объект.Соглашение Тогда
				ВопросОбИзмененииСоглашения = Истина;
			КонецЕсли;
			
			Если ВопросОбИзмененииКонтрагента Или ВопросОбИзмененииСоглашения Тогда
				
				Если ВопросОбИзмененииКонтрагента И ВопросОбИзмененииСоглашения Тогда
					ТекстВопроса = НСтр("ru = 'Для карты лояльности заданы контрагент ""%1"" и соглашение ""%2"". Применить карту лояльности и подставить в документ контрагента ""%1"" и соглашение ""%2""?'");
				ИначеЕсли ВопросОбИзмененииКонтрагента Тогда
					ТекстВопроса = НСтр("ru = 'Для карты лояльности задан контрагент ""%1"". Применить карту лояльности и подставить в документ контрагента ""%1""?'");
				ИначеЕсли ВопросОбИзмененииСоглашения Тогда
					ТекстВопроса = НСтр("ru = 'Для карты лояльности задано соглашение ""%2"". Применить карту лояльности и подставить в документ соглашение ""%2""?'");
				КонецЕсли;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Оповещение", Оповещение);
				ДополнительныеПараметры.Вставить("КартаЛояльности", КартаЛояльности);
				ДополнительныеПараметры.Вставить("ДанныеКартыЛояльности", ДанныеКартыЛояльности);
				ПоказатьВопрос(
					Новый ОписаниеОповещения("СчитанаКартаЛояльностиВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры),
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, ДанныеКартыЛояльности.Контрагент, ДанныеКартыЛояльности.Соглашение),
					РежимДиалогаВопрос.ДаНет);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		Модифицированность = Истина;
		Объект.КартаЛояльности   = КартаЛояльности;
		СчитанаКартаЛояльностиНаСервере(ДанныеКартыЛояльности);
		
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура СчитанаКартаЛояльностиВопросЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.Оповещение);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		Модифицированность = Истина;
		Объект.КартаЛояльности   = ДополнительныеПараметры.КартаЛояльности;
		СчитанаКартаЛояльностиНаСервере(ДополнительныеПараметры.ДанныеКартыЛояльности);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СчитанаКартаЛояльностиЗавершение(ДополнительныеПараметры) Экспорт
    
    Оповещение = ДополнительныеПараметры.Оповещение;
    
    
    ВыполнитьОбработкуОповещения(Оповещение);

КонецПроцедуры

&НаСервере
Функция АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(ТолькоВыделенныеСтроки)
	
	Возврат СкидкиНаценкиСервер.АдресДанныхДляРасчетаРучныхСкидокВоВременномХранилище(ЭтаФорма, "Товары", УникальныйИдентификатор, ТолькоВыделенныеСтроки);
	
КонецФункции

&НаКлиенте
Процедура НадписьЭтапыОплатыНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Попытка
		ЗаблокироватьДанныеФормыДляРедактирования();
	Исключение
		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",             ТолькоПросмотр);
	ПараметрыФормы.Вставить("СуммаОплатыПоДокументу",     СуммаЗаказано);
	ПараметрыФормы.Вставить("СуммаЗалогаПоДокументу",     СуммаЗалогаЗаТару);
	ПараметрыФормы.Вставить("СуммаОтклоненияПоДокументу", Объект.ЭтапыГрафикаОплаты.Итог("СуммаОтклоненияМерныхТоваров"));
	ПараметрыФормы.Вставить("СуммаДопустимогоОтклоненияПоДокументу",
		ПолучитьСуммуДопустимогоОтклоненияПредоплатыПоДокументу());
	ПараметрыФормы.Вставить("ТребуетсяЗалогЗаТару",       Объект.ВернутьМногооборотнуюТару И Объект.ТребуетсяЗалогЗаТару);
	ПараметрыФормы.Вставить("ГрафикОплаты",               Объект.ГрафикОплаты);
	Если ПроверитьПравоНаЧтениеСоглашения() Тогда
		ПараметрыФормы.Вставить("Соглашение",             Объект.Соглашение);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ЖелаемаяДатаОтгрузки",       Объект.ЖелаемаяДатаОтгрузки);
	ПараметрыФормы.Вставить("Дата",                       Объект.Дата);
	ПараметрыФормы.Вставить("Валюта",                     Объект.Валюта);
	ПараметрыФормы.Вставить("УчитыватьВариантОплаты",     Истина);
	ПараметрыФормы.Вставить("УникальныйИдентификатор",    УникальныйИдентификатор);
	ПараметрыФормы.Вставить("АдресВоВременномХранилище",  ПоместитьВоВременноеХранилищеНаСервере("ЭтапыГрафикаОплаты"));
	ПараметрыФормы.Вставить("ФормаОплаты",                Объект.ФормаОплаты);
	ПараметрыФормы.Вставить("Касса",                      Объект.Касса);
	ПараметрыФормы.Вставить("БанковскийСчет",             Объект.БанковскийСчет);
	ПараметрыФормы.Вставить("Организация",                Объект.Организация);
	ПараметрыФормы.Вставить("ПараметрыВыбораРеквизитов",  ПараметрыВыбораРеквизитов);
	ПараметрыФормы.Вставить("ИдентификаторПлатежа",       Объект.ИдентификаторПлатежа);
	ПараметрыФормы.Вставить("ПорядокРасчетов",            Объект.ПорядокРасчетов);
	ПараметрыФормы.Вставить("ДоступныеПорядкиРасчетов",   ДоступныеПорядкиРасчетов);
	ПараметрыФормы.Вставить("ЭтоЗаказ",                   Истина);
	ПараметрыФормы.Вставить("Ключ",                       Объект.Ссылка);
	ПараметрыФормы.Вставить("НаправлениеДеятельности",    Объект.НаправлениеДеятельности);
	ПараметрыФормы.Вставить("ГрафикИсполненияВДоговоре",  ГрафикИсполненияВДоговоре);
	ПараметрыФормы.Вставить("ПорядокОплаты",              Объект.ПорядокОплаты);
	ПараметрыФормы.Вставить("ВалютаВзаиморасчетов",       Объект.Валюта);
	ПараметрыФормы.Вставить("РучноеРаспределениеОплат",   Объект.РучноеРаспределениеОплат);
	ПараметрыФормы.Вставить("КоличествоДнейОтсрочкиПоДоговору",     Объект.КоличествоДнейОтсрочкиПоДоговору);
  	ПараметрыФормы.Вставить("КоличествоДнейОтсрочки",     Объект.КоличествоДнейОтсрочки);


	Оповещение = Новый ОписаниеОповещения("НадписьЭтапыОплатыНажатиеЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ЭтапыОплатыКлиентом", 
		ПараметрыФормы, 
		ЭтаФорма,,,, 
		Оповещение, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьЭтапыОплатыНажатиеЗавершение(ПараметрыОплаты, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыОплаты <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		Объект.ЭтапыГрафикаОплаты.Очистить();
		Объект.Согласован           = Ложь;
		Объект.Касса                = ПараметрыОплаты.Касса;
		Объект.БанковскийСчет       = ПараметрыОплаты.БанковскийСчет;
		Объект.ГрафикОплаты         = ПараметрыОплаты.ГрафикОплаты;
		Объект.ЖелаемаяДатаОтгрузки = ПараметрыОплаты.ЖелаемаяДатаОтгрузки;
		Объект.ПорядокОплаты        = ПараметрыОплаты.ПорядокОплаты;
		Объект.РучноеРаспределениеОплат = ПараметрыОплаты.РучноеРаспределениеОплат;  //jadmin
		Объект.КоличествоДнейОтсрочки = ПараметрыОплаты.КоличествоДнейОтсрочки;  //77w
		
		Если Объект.ФормаОплаты <> ПараметрыОплаты.ФормаОплаты Тогда
			Объект.ФормаОплаты = ПараметрыОплаты.ФормаОплаты;
			СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		КонецЕсли;
		
		Если Объект.ПорядокРасчетов <> ПараметрыОплаты.ПорядокРасчетов Тогда
			Объект.ПорядокРасчетов = ПараметрыОплаты.ПорядокРасчетов;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыОплаты.АдресВоВременномХранилище) Тогда
			ЗаполнитьЭтапыОплатыИзВременногоХранилищаСервер(ПараметрыОплаты.АдресВоВременномХранилище);
		КонецЕсли;
		
		УстановитьСвойстваЭлементовПоПорядкуРасчетов();
		
		УстановитьДоступностьЭлементовПоСтатусуСервер();
		
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере(ИмяТЧ,Идентификатор = "")
	
	Возврат ПоместитьВоВременноеХранилище(Объект[ИМЯТЧ].Выгрузить(),Идентификатор);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЭтапыОплатыИзВременногоХранилищаСервер(АдресВоВременномХранилище)
	
	ЭтапыОплаты = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Для Каждого ТекСтрока Из ЭтапыОплаты Цикл
		НоваяСтрока = Объект.ЭтапыГрафикаОплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
	КонецЦикла;
	ЗаполнитьСписокВыбораЖелаемаяДатаОтгрузки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭтапыОплатыСервер(ГрафикСоглашенияЗаполнен, ГрафикЗаполнен)
	
	ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПродажи(
		Объект,
		ГрафикСоглашенияЗаполнен,
		ГрафикЗаполнен,
		СуммаЗаказано,
		СуммаЗалогаЗаТару);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьПравоНаЧтениеСоглашения()
	
	Возврат ПравоДоступа("Просмотр",Метаданные.Документы.ЗаказКлиента.Реквизиты.Соглашение);
	
КонецФункции

&НаСервере
Процедура ОбновитьОграничениеЗадолженности()
	
	ПродажиСервер.ОбновитьОграничениеЗадолженности(
		Объект.Договор,
		Объект.Дата,
		ТекстОстатокДопустимогоКредита,
		Элементы.ТекстОстатокДопустимогоКредита.Видимость,
		Элементы.ТекстОстатокДопустимогоКредита.ЦветТекста,
		Элементы.КартинкаОтгрузкаЗапрещена.Видимость);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловияПродаж()
	ГрафикОплаты = Объект.ГрафикОплаты;
	
	ДокументПродажи = РеквизитФормыВЗначение("Объект");
	ДокументПродажи.ЗаполнитьУсловияПродажПоУмолчанию();
	ЗначениеВРеквизитФормы(ДокументПродажи, "Объект");
	
	НалогообложениеИзСоглашения = ПродажиСервер.НалогообложениеОпределяетсяИзСоглашения(Объект.Соглашение);
	
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		
		ВалютаДокумента = Объект.Валюта;
		ПриИзмененииХозяйственнойОперацииСервер(Ложь);
		
		ЗаполнитьЭтапыОплатыСервер(
			ПродажиВызовСервера.ГрафикСоглашенияЗаполнен(Объект.Соглашение),
			ИспользоватьГрафикиОплаты И ЗначениеЗаполнено(Объект.ГрафикОплаты) И ГрафикОплаты <> Объект.ГрафикОплаты);
		
	КонецЕсли;
	
	УстановитьВидимостьОпераций();
	ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	
	НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваЭлементовПоПорядкуРасчетов() Экспорт
	
	НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина);
	
	ВзаиморасчетыСервер.УстановитьВидимостьГруппыФинансовогоУчета(ЭтаФорма, Истина);
	ВзаиморасчетыСервер.УстановитьВидимостьЗачетаОплаты(ЭтаФорма, Истина);
	
	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДоступностьЭлементовВозвратнойТары(Форма)
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("СрокВозвратаМногооборотнойТары");
	МассивЭлементов.Добавить("ТребуетсяЗалогЗаТару");
	
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
		Форма.Элементы,
		МассивЭлементов,
		"Доступность",
		Форма.Объект.ВернутьМногооборотнуюТару);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(АдресТарыВХранилище)
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	СтруктураДействийИзмененныеСтроки = Новый Структура;
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействийИзмененныеСтроки.Вставить("ПересчитатьКоличествоУпаковок");
	СтруктураДействийИзмененныеСтроки.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийИзмененныеСтроки.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействийИзмененныеСтроки.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
	СтруктураДействийИзмененныеСтроки.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействийИзмененныеСтроки.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействийИзмененныеСтроки.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействийИзмененныеСтроки.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействийИзмененныеСтроки.Вставить("ПересчитатьСумму");
	СтруктураДействийИзмененныеСтроки.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействийИзмененныеСтроки.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействийИзмененныеСтроки.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	СтруктураДействийИзмененныеСтроки.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения);
	СтруктураДействийИзмененныеСтроки.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	СтруктураДействийИзмененныеСтроки.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	СтруктураДействийДобавленныеСтроки =  ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураДействийИзмененныеСтроки);;
	СтруктураДействийДобавленныеСтроки.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействийДобавленныеСтроки.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействийДобавленныеСтроки.Вставить("ПоместитьОбработанныеСтрокиВКэшированныеЗначения");
	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
		СтруктураДействийДобавленныеСтроки.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	Иначе
		СтруктураДействийДобавленныеСтроки.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	КонецЕсли;
	СтруктураДействийДобавленныеСтроки.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействийДобавленныеСтроки.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	МногооборотнаяТараСервер.ЗаполнитьМногооборотнуюТаруИзХранилища(
		Объект,
		АдресТарыВХранилище,
		"Товары",
		"Номенклатура,Характеристика,Склад,ДатаОтгрузки",
		СтруктураДействийИзмененныеСтроки,
		СтруктураДействийДобавленныеСтроки,
		КэшированныеЗначения);
	ОбеспечениеСервер.РассчитатьДатуОтгрузкиВСтрокахТабличнойЧасти(КэшированныеЗначения.ОбработанныеСтроки, Объект, Объект.Товары);
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	
	ПриИзмененииДатыОтгрузкиВТабЧасти();
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбновитьДубликатыЗависимыхРеквизитов()
	
	СтруктураДополнительныхДействий = Новый Структура;
	СтруктураДополнительныхДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	МногооборотнаяТараСервер.ОбновитьПризнакБезВозвратнойТары(Объект.Товары, Объект.ВернутьМногооборотнуюТару, СтруктураДополнительныхДействий);
	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Товары, ЗависимыеРеквизиты());
	
КонецПроцедуры

&НаСервере
Процедура ИзмененаОплатаСервер()
	
	ОбновитьСостояниеСервер();
	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
	ОбновитьОграничениеЗадолженности();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОбеспечения()
	
	Элементы.ТоварыСостояниеОбеспечения.Видимость = ПравоДоступа("Просмотр", Метаданные.Обработки.СостояниеОбеспечения);
	
	Если Не ПравоДоступа("Добавление", Метаданные.Документы.КорректировкаНазначенияТоваров)
		Или Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов") Тогда
		Элементы.ТоварыСоздатьКорректировкуНазначенияСнятиеРезерва.Видимость = Ложь;
		Элементы.ТоварыСоздатьКорректировкуНазначенияРезервирование.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЗапретаОтгрузкиПартнеру()
	
	СегментыСервер.УстановитьВидимостьЗапретаОтгрузкиПартнеру(Объект.Партнер, Элементы);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	СтруктураДействий.Вставить("ПоместитьОбработанныеСтрокиВКэшированныеЗначения");
	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,Объект);
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		СтрокаТЧТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров,,"КодСтроки");
		
		СтрокаТЧТовары.СтавкаНДС = СтрокаТЧТовары.Номенклатура.СтавкаНДС;   //////// 77w qaws   бралась ставка НДС поставщика
		СтрокаТЧТовары.ВидЦены = Объект.Соглашение.ВидЦен;          //jadmin устанавливаем цены из соглашения при импорте из файла
		
		Если Объект.НеОтгружатьЧастями Тогда
			СтрокаТЧТовары.ДатаОтгрузки = Объект.ДатаОтгрузки;
		КонецЕсли;
		
		ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТЧТовары, СтруктураДействий, КэшированныеЗначения);
		
	КонецЦикла;
	
	ОбеспечениеСервер.РассчитатьДатуОтгрузкиВСтрокахТабличнойЧасти(КэшированныеЗначения.ОбработанныеСтроки, Объект, Объект.Товары);
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
	
	ПриИзмененииДатыОтгрузкиВТабЧасти();
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеВыбораСкладов(Склад)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка В ИЕРАРХИИ(&ГруппаСкладов)
	|	И Склады.ЭтоГруппа = ЛОЖЬ
	|	И Склады.ВыборГруппы <> ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.Запретить)");

	Запрос.УстановитьПараметр("ГруппаСкладов", Склад);
	МассивСкладов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат МассивСкладов;

КонецФункции

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование Тогда
		НаборыКлиент.ПередУдалениемСтрокиТабличнойЧасти(ЭтаФорма, "Товары", Отказ, Истина);
	КонецЕсли;
	
	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНабора(Команда)
	
	ВыбраннаяСтрока = Элементы.Товары.ТекущаяСтрока;
	
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НоменклатураНабора) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКомплекта = Новый Структура;
	ПараметрыКомплекта.Вставить("НоменклатураНабора", ТекущаяСтрока.НоменклатураНабора);
	ПараметрыКомплекта.Вставить("ХарактеристикаНабора", ТекущаяСтрока.ХарактеристикаНабора);
	ПараметрыКомплекта.Вставить("КолонкиНабора", КолонкиНабора(ЭтаФорма));
	
	АдресНабораВоВременномХранилище = АдресНабораВоВременномХранилище(ПараметрыКомплекта);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресВоВременномХранилище", АдресНабораВоВременномХранилище);
	ПараметрыОткрытия.Вставить("НоменклатураНабора", ТекущаяСтрока.НоменклатураНабора);
	ПараметрыОткрытия.Вставить("ХарактеристикаНабора", ТекущаяСтрока.ХарактеристикаНабора);
	ПараметрыОткрытия.Вставить("ЦенаВключаетНДС", Объект.ЦенаВключаетНДС);
	ПараметрыОткрытия.Вставить("НалогообложениеНДС", Объект.НалогообложениеНДС);
	ПараметрыОткрытия.Вставить("Валюта", Объект.Валюта);
	ПараметрыОткрытия.Вставить("Соглашение", Объект.Соглашение);
	ПараметрыОткрытия.Вставить("Дата", Объект.Дата);
	ПараметрыОткрытия.Вставить("Ссылка", Объект.Ссылка);
	ПараметрыОткрытия.Вставить("Склад", Объект.Склад);
	ПараметрыОткрытия.Вставить("СкрыватьКомандуОстаткиНаСкладах", Ложь);
	
	ОткрытьФорму("Обработка.РедактированиеНабора.Форма.Форма", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПодпискуНаОповещения(Команда)
	
	РассылкиИОповещенияКлиентамКлиент.НастроитьПодпискуНаОповещенияИзОбъекта(
		Объект.Партнер,
		ПредопределенноеЗначение("Перечисление.ТипыСобытийОповещений.ИзменениеСостоянияЗаказа"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьОпераций()
	
	Если Не ИспользоватьСоглашенияСКлиентами Тогда
		ВозможнаРеализацияБезПереходаПраваСобственности = ИспользоватьОтгрузкуБезПереходаПраваСобственности;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Соглашение) Тогда
		ВозможнаРеализацияБезПереходаПраваСобственности = Ложь;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		ВозможнаРеализацияБезПереходаПраваСобственности = 
			ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Объект.Соглашение, "ВозможнаРеализацияБезПереходаПраваСобственности");
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Если Элементы.Найти("ХозяйственнаяОперация") <> Неопределено  Тогда
	
		Если Не ПолучитьФункциональнуюОпциюФормы("ИспользоватьКомиссиюПриПродажах") Тогда
			
			ЭлементСписка = Элементы.ХозяйственнаяОперация.СписокВыбора.НайтиПоЗначению(Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
			
			Если ЭлементСписка <> Неопределено Тогда
				Элементы.ХозяйственнаяОперация.СписокВыбора.Удалить(ЭлементСписка);
			КонецЕсли;			
			
		КонецЕсли;          
		
		ЭлементСписка = Элементы.ХозяйственнаяОперация.СписокВыбора.НайтиПоЗначению(
			Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);

		Если Не ВозможнаРеализацияБезПереходаПраваСобственности Тогда
			
			Если ЭлементСписка <> Неопределено Тогда
				Элементы.ХозяйственнаяОперация.СписокВыбора.Удалить(ЭлементСписка);
			КонецЕсли;	
								
		Иначе	
			
			Если ЭлементСписка = Неопределено Тогда
				Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(
					Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности);
			КонецЕсли;
			
		КонецЕсли;	
			
		Если Элементы.ХозяйственнаяОперация.СписокВыбора.Количество() = 1 Тогда
			Элементы.ХозяйственнаяОперация.ТолькоПросмотр = Истина;
		Иначе
			Элементы.ХозяйственнаяОперация.ТолькоПросмотр = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораТоварыСклад()
	
	Элементы.ТоварыСклад.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.ТоварыСклад, "Ссылка", ДанныеВыбораСкладов(Объект.Склад));

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГруппуФинУчета()
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Объект.ГруппаФинансовогоУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор, "ГруппаФинансовогоУчета");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПорядокОплатыПоУмолчанию()
	
	ВалютаОплаты = ДенежныеСредстваСервер.ПолучитьВалютуОплаты(Объект.ФормаОплаты, Объект.БанковскийСчет, Объект.Касса);
	
	Объект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.ПолучитьПорядокОплатыПоУмолчанию(ВалютаДокумента,
																									Объект.НалогообложениеНДС,
																									ВалютаОплаты);
	
КонецПроцедуры

&НаСервере
Процедура СкорректироватьСтрокиЗаказа(СтруктураДополнительныхПараметров)
	
	СтруктураКорректировкиСтрокЗаказа = ЗаказыСервер.ПолучитьСтруктуруКорректировкиСтрокЗаказа();
	ЗаполнитьЗначенияСвойств(СтруктураКорректировкиСтрокЗаказа, СтруктураДополнительныхПараметров);
	
	ДокументПродажи = РеквизитФормыВЗначение("Объект");
	
	СтруктураКорректировкиСтрокЗаказа.ДокументОбъект   = ДокументПродажи;
	СтруктураКорректировкиСтрокЗаказа.ПроверятьОстатки = 
		Не (ДокументПродажи.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
	
	СтруктураРезультата = ПродажиСервер.СкорректироватьСтрокиЗаказа(СтруктураКорректировкиСтрокЗаказа);
	
	Если СтруктураРезультата.КоличествоСтрок <> 0 ИЛИ СтруктураРезультата.СуммаКорректировки > 0 Тогда
		
		СуммаЗаказано       = ДокументПродажи.ПолучитьСуммуЗаказанныхСтрок();
		СуммаЗалогаЗаТару   = ДокументПродажи.ПолучитьСуммуЗаказанныхСтрок(Истина);
		СуммаЗаказаноКРаспределению = СуммаЗаказано - СуммаЗалогаЗаТару;
		
		ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПродажи(
			ДокументПродажи,
			Ложь,
			Ложь,
			СуммаЗаказаноКРаспределению,
			СуммаЗалогаЗаТару,,,Истина);
		
		ЭтапыОплатыСервер.РаспределитьСуммуОтклоненияПоЭтапамГрафикаОплаты(
							ДокументПродажи.ЭтапыГрафикаОплаты,
							СтруктураРезультата.СуммаКорректировки);
		
	КонецЕсли;
	
	Если СтруктураДополнительныхПараметров.ЗакрыватьЗаказы Тогда
		ДокументПродажи.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокументПродажи, "Объект");
	
	ЗаполнитьСлужебныеРеквизитыПоНоменклатуре();
	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина);
	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ПараметрыЗаполнения,
													ДатаОтгрузкиОбязательна, СкладОбязателен);
	ОбновитьДубликатыЗависимыхРеквизитов();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область Наборы

&НаСервере
Функция ДополнитьДоПолногоНабора()
	
	ТабличнаяЧасть = Объект.Товары;
	ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	
	МассивСтрок = Новый Массив;
	Для Каждого ТекСтрока Из ВыделенныеСтроки Цикл
		СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ТекСтрока);
		МассивСтрок.Добавить(СтрокаТаблицы);
	КонецЦикла;
	
	НаборыВызовСервера.ДополнитьДоПолногоНабора(ТабличнаяЧасть, МассивСтрок);
	
	Результат = Новый Массив;
	Для Каждого СтрокаТЧ Из МассивСтрок Цикл
		Результат.Добавить(СтрокаТЧ.ПолучитьИдентификатор());
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КолонкиНабора(Форма)
	
	Колонки = Новый Массив;
	Колонки.Добавить("Номенклатура");
	Колонки.Добавить("Характеристика");
	
	Колонки.Добавить("Цена");
	Колонки.Добавить("ВидЦены");
	Колонки.Добавить("Упаковка");
	Колонки.Добавить("Количество");
	Колонки.Добавить("КоличествоУпаковок");
	
	Если Форма.Объект.ХозяйственнаяОперация <> ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
		Если Форма.ИспользоватьРучныеСкидкиВПродажах Тогда
			Колонки.Добавить("ПроцентРучнойСкидки");
			Колонки.Добавить("СуммаРучнойСкидки");
		КонецЕсли;
		Если Форма.ИспользоватьАвтоматическиеСкидкиВПродажах Тогда
			Колонки.Добавить("ПроцентАвтоматическойСкидки");
			Колонки.Добавить("СуммаАвтоматическойСкидки");
		КонецЕсли;
	КонецЕсли;
	
	Если Форма.ИспользоватьПричиныОтменыЗаказовКлиентов Тогда
		Колонки.Добавить("ПричинаОтмены");
	КонецЕсли;
	
	Колонки.Добавить("Отменено");
	
	Колонки.Добавить("СтавкаНДС");
	Колонки.Добавить("СуммаНДС");
	Колонки.Добавить("СуммаСНДС");
	Колонки.Добавить("Сумма");
	
	Возврат Колонки;
	
КонецФункции

&НаКлиенте
// Вызывается через ОписаниеОповещения из общего модуля НаборыКлиент 
Процедура ПриУдаленииКомплектующих(Действие, ДополнительныйПараметр) Экспорт
	
	Если НаборыКлиент.ДействиеРедактироватьНабор(Действие) Тогда
		НаборыКлиент.ПриУдаленииКомплектующих(ЭтаФорма, "Товары", ДополнительныйПараметр);
	ИначеЕсли НаборыКлиент.ДействиеУдалитьВесьНабор(Действие) Тогда
		ПриУдаленииКомплектующихНаСервере("Товары", ДополнительныйПараметр);
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриУдаленииКомплектующихНаСервере(ИмяТЧ, ДополнительныйПараметр)
	НаборыСервер.ПриУдаленииКомплектующих(ЭтаФорма, ИмяТЧ, ДополнительныйПараметр);
КонецПроцедуры

&НаСервере
Функция АдресНабораВоВременномХранилище(Параметры) Экспорт
	
	Возврат НаборыСервер.АдресНабораВоВременномХранилище(ЭтаФорма, Параметры, "Товары");
	
КонецФункции

&НаСервере
Процедура ПриОкончанииРедактированияНабора(АдресВоВременномХранилище)
	
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	
	СтруктураДействийСИзмененнымиСтроками.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействийСИзмененнымиСтроками.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	// Склад будет вставлен позже
	СтруктураДействийСИзмененнымиСтроками.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("ПараметрыУказанияСерий", ПараметрыУказанияСерий));
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПоместитьОбработанныеСтрокиВКэшированныеЗначения");
	СтруктураДействийСДобавленнымиСтроками.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	
	ПараметрыДанных = Новый Структура;
	ПараметрыДанных.Вставить("Данные", ПолучитьИзВременногоХранилища(АдресВоВременномХранилище));
	ПараметрыДанных.Вставить("СтруктураДействийСИзмененнымиСтроками", СтруктураДействийСИзмененнымиСтроками);
	ПараметрыДанных.Вставить("СтруктураДействийСДобавленнымиСтроками", СтруктураДействийСДобавленнымиСтроками);
	ПараметрыДанных.Вставить("КолонкиНабора", КолонкиНабора(ЭтаФорма));
	
	НаборыСервер.ПриОкончанииРедактированияНабора(ЭтаФорма, "Товары", ПараметрыДанных);
	ОбеспечениеСервер.РассчитатьДатуОтгрузкиВСтрокахТабличнойЧасти(КэшированныеЗначения.ОбработанныеСтроки, Объект, Объект.Товары);
	
	СкладыСервер.ПриИзмененииСкладаВТабличнойЧасти(Объект.Товары, ТаблицаСкладов, СкладГруппа);
	ВсегоСкладов = ТаблицаСкладов.Количество();
	СкладыКлиентСервер.ОбновитьКартинкуГруппыСкладов(НадписьНесколькоСкладов, Элементы.КартинкаНесколькоСкладов, ВсегоСкладов);
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОтчетыУТКлиентПереопределяемый.ОткрытьОтчетКарточкаРасчетовСКлиентами("КарточкаРасчетовСКлиентамиПоДокументамКонтекст", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура УстановитьВидимостьПоляПартнер()
	
	ВидимостьКЛ = Элементы.СчитатьКартуЛояльностиКлиент.Видимость;
	Если ВидимостьКЛ Тогда
		ВидимостьКЛ = ПолучитьФункциональнуюОпцию("ИспользоватьКартыЛояльности");
	КонецЕсли;
	
	Элементы.ПартнерБезКЛ.Видимость = НЕ ВидимостьКЛ;
	Элементы.Партнер.Видимость      = ВидимостьКЛ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыеУсловияПеревозкиПриИзменении(Элемент)
	ОсобыеУсловияПеревозкиПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьИнформациюПоДоставкеКонтактами(Команда)
	ДополнитьИнформациюПоДоставкеКонтактамиСервер();
КонецПроцедуры

&НаСервере
Процедура ОсобыеУсловияПеревозкиПриИзмененииСервер()
	ДоставкаТоваров.ОсобыеУсловияПеревозкиПриИзменении(Элементы, Объект);
КонецПроцедуры

&НаСервере
Процедура ДополнитьИнформациюПоДоставкеКонтактамиСервер()
	ДоставкаТоваров.ДополнитьИнформациюПоДоставкеКонтактами(Объект);
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуДопустимогоОтклоненияПредоплатыПоДокументу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС    КАК СуммаСНДС
	|ПОМЕСТИТЬ ВТТоварыЗаказа
	|ИЗ &ТоварыЗаказа КАК Товары
	|;
	|///////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	СУММА(ВЫРАЗИТЬ(Товары.СуммаСНДС * &ДопустимоеОтклонениеМерныхТоваров/100 КАК ЧИСЛО(15,2))) КАК Сумма
	|ИЗ ВТТоварыЗаказа КАК Товары
	|ГДЕ Товары.Номенклатура.ЕдиницаИзмерения.ТипИзмеряемойВеличины В (&МерныеТипыЕдиницИзмерений)";
	
	Запрос.УстановитьПараметр("ДопустимоеОтклонениеМерныхТоваров",
		Константы.ДопустимоеОтклонениеОтгрузкиПриемкиМерныхТоваров.Получить());
	Запрос.УстановитьПараметр("ТоварыЗаказа",Объект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("МерныеТипыЕдиницИзмерений",
		Справочники.УпаковкиЕдиницыИзмерения.МерныеТипыЕдиницИзмерений());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Сумма;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Обновляет отображение индексов СПАРК Риски.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура Подключаемый_ОбновитьОтображениеИндексыСПАРК()

	ОбновитьОтображениеИндексыСПАРК();

КонецПроцедуры

// Обновляет отображение индексов СПАРК Риски.
//
// Параметры:
//  Нет.
//
&НаКлиенте
Процедура ОбновитьОтображениеИндексыСПАРК()

	ПараметрыОтображения = Новый Структура("ВариантОтображения", "Однострочный");
	СПАРКРискиКлиент.ОтобразитьИндексыСПАРК(
		ЭтотОбъект.ИндексыСПАРКРиски,
		Неопределено,
		Объект.Контрагент, // Искать по ссылке
		ЭтотОбъект,
		ПараметрыОтображения,
		Истина);

КонецПроцедуры


////////77w qaws 
 &НаСервере
 Функция ПолучитьМакетНаСервере(ИмяМакета)
	////////77w qaws  
    ЭтотОбъектДок=РеквизитФормыВЗначение("Объект");
    Макет = ЭтотОбъектДок.ПолучитьМакет(ИмяМакета); 
    Возврат Макет;
КонецФункции  


&НаСервере
 Функция УбратьЛидирующиеНули(НомерДокумента)
    
    Попытка
        НомерДокумента = Формат(Число(НомерДокумента), "ЧГ=");
    Исключение
        НомерДокумента = СтрЗаменить(СокрЛ(СтрЗаменить(СокрП(НомерДокумента), "0", " ")), " ", "0");
		
        Префикс = "";
        Пока КодСимвола(НомерДокумента) < 48 Или КодСимвола(НомерДокумента) > 57 Цикл
            Префикс = Префикс + Лев(НомерДокумента, 1);
            НомерДокумента = Сред(НомерДокумента, 2);
        КонецЦикла;
        Если Не ПустаяСтрока(Префикс) Тогда
            НомерДокумента = Префикс + УбратьЛидирующиеНули(НомерДокумента);
        КонецЕсли;
	КонецПопытки;
	
    НомерДокумента = СтрЗаменить(СокрЛП(НомерДокумента), "-", "");
	
    Возврат НомерДокумента;
    
КонецФункции  



&НаСервере
Процедура ПечатьСвидетельстваНаСеменаНаСервере(ТабДок)
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    //ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	
	
	ТабДок.ПолеСнизу = 10;
	
	ТабДок.РазмерКолонтитулаСнизу = 5;
	
	//// Колонтитулы
	//ТабДок.НижнийКолонтитул.Выводить = Истина;
	//ТабДок.НижнийКолонтитул.ТекстСправа = НСтр("ru= 'Лист [&НомерСтраницы] из [&СтраницВсего]'");
	
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;	
	Макет = ПолучитьОбщийМакет("СвидетельствоНаСемена");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	НаименованиеФирмы = "";
	
	ОбластьШапка.Параметры.Заполнить(Объект);
	
	ОбластьШапка.Параметры.Дата = ТекущаяДата();
	//ОбластьШапка.Параметры.НаименованиеФирмы = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , Объект.БанковскийСчет), "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	ОбластьШапка.Параметры.НаименованиеФирмы = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), "ПолноеНаименование,ИНН,,,,,,");
	ОбластьШапка.Параметры.НаименованиеФирмы1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",,ЮридическийАдрес,Телефоны,,,,");
	ОбластьШапка.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата,, ), "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,,,,");
	
	
	НомерСвидетельства_ = Объект.Номер;	
	НомерСвидетельства = УбратьЛидирующиеНули(НомерСвидетельства_);
	
	ОбластьШапка.Параметры.НомерСвидетельства = НомерСвидетельства;
	
	ТабДок.Вывести(ОбластьШапка);
	
	
	Область_Секция_8  = Макет.ПолучитьОбласть("Секция_8");
	
	Ном = 0;
	Для каждого СтрокаТовары Из Объект.Товары Цикл
		
		//Если СтрокаТовары.Отменено Тогда
		//	Продолжить;
		//КонецЕсли; 
		
		
		Если СтрокаТовары.Номенклатура.Ссылка.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.Товар Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтрокаТовары.Номенклатура.Ссылка.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.ТранспортнаяТара Тогда
			Продолжить;
		КонецЕсли; 
		
		
		Ном = Ном+1;
		Область_Секция_8.Параметры.Ном = Ном;
		
		Товар = СокрЛП(СтрокаТовары.Номенклатура.НаименованиеПолное);
		ВидРасфасовки_Есть = СтрокаТовары.Номенклатура.УпаковкаГрузомест;
		
		Если ЗначениеЗаполнено(ВидРасфасовки_Есть) Тогда
			ВидРасфасовки = ", "+ВидРасфасовки_Есть;
		Иначе
			ВидРасфасовки = "";
		КонецЕсли; 
		
		ВесПартии = 0;
		
		Если СтрокаТовары.Номенклатура.ЕдиницаИзмерения.Вес > 0 Тогда
			ВесПартии = СтрокаТовары.Номенклатура.ЕдиницаИзмерения.Вес*СтрокаТовары.Количество;
		КонецЕсли;	 
		
		Если ВесПартии = 0 Тогда
			Если СтрокаТовары.Номенклатура.УпаковкаГрузомест.Вес  > 0 Тогда
				ВесПартии = СтрокаТовары.Номенклатура.УпаковкаГрузомест.Вес*СтрокаТовары.Количество;
			КонецЕсли; 
		КонецЕсли;
		
		Если ВесПартии = 0 Тогда
			Если СтрокаТовары.Упаковка.Вес  > 0 Тогда
				ВесПартии = СтрокаТовары.Количество*СтрокаТовары.Упаковка.Вес;
			КонецЕсли; 
		КонецЕсли;
		
		Если ВесПартии <> 0 Тогда
			//ВесПартии = ",  вес партии "+Строка(ВесПартии)+" кг.";
			ВесПартии = ""+Строка(ВесПартии)+" кг.";
		Иначе
			ВесПартии = "";
		КонецЕсли; 
		
		ВесПартии = ""+ВесПартии+Символы.ПС+""+СтрокаТовары.Количество+" "+СтрокаТовары.Упаковка.ЕдиницаИзмерения.Наименование;
		
		Партия_МССО_Ссылка = СтрокаТовары.Серия.Партия_МССО.Ссылка;
		
		
		Если Партия_МССО_Ссылка.Анализы.Количество() > 0 Тогда
			Для Каждого СтрокаАнализы Из Партия_МССО_Ссылка.Анализы Цикл 
				
				ВсхожестьЕсть = СтрокаАнализы.Всхожесть;
				Если ЗначениеЗаполнено(ВсхожестьЕсть) Тогда
					Всхожесть = "всхожесть "+ВсхожестьЕсть+"%";
				Иначе
					Всхожесть = "";
				КонецЕсли;
				
				ВлажностьЕсть = СтрокаАнализы.Влажность;
				Если ЗначениеЗаполнено(ВлажностьЕсть) Тогда
					Влажность = ", влажность "+ВлажностьЕсть+"%";
				Иначе
					Влажность = "";
				КонецЕсли;
				
				СОКЕсть = СтрокаАнализы.СОК;
				Если ЗначениеЗаполнено(СОКЕсть) Тогда
					СОК = ", семян основной культуры "+СОКЕсть+"%";
				Иначе
					СОК = "";
				КонецЕсли;
				
				ПримесиЕсть = СтрокаАнализы.Примеси;
				Если ЗначениеЗаполнено(ПримесиЕсть) Тогда
					Примеси = ", примесь семян др. растений "+ПримесиЕсть+"%";
				Иначе
					Примеси = "";
				КонецЕсли;
				
				Масса1000семянЕсть = СтрокаАнализы.Масса1000семян;
				Если ЗначениеЗаполнено(Масса1000семянЕсть) Тогда
					Масса1000семян = ", масса 1000 семян "+Масса1000семянЕсть+"г";
				Иначе
					Масса1000семян = "";
				КонецЕсли;
				
				
				Болезни_Вредители_КарантинныеОбъекты = "";
				
				Болезни = ", зараженность болезнями " + СтрокаАнализы.БолезниПроцент+ "%";
				Вредители = ", зараженность вредителями " + СтрокаАнализы.БолезниПроцент+ "%";
				КарантинныеОбъекты = ", карантинные объекты " + СтрокаАнализы.КарантинныеОбъекты+ " 0 шт/кг";
				
				Болезни_Вредители_КарантинныеОбъекты = ""+Болезни+Символы.ПС+Вредители+Символы.ПС+КарантинныеОбъекты;
				
				Область_Секция_8.Параметры.Болезни_Вредители = Болезни_Вредители_КарантинныеОбъекты;
				
				//Если ЗначениеЗаполнено(СтрокаАнализы.Примечание) = Истина Тогда
					Область_Секция_8.Параметры.Прочее = ""+Символы.ПС+СтрокаАнализы.Примечание;
				//КонецЕсли; 
				
				УдостоверениеОКондиционностиЕсть = СтрокаАнализы.УдостоверениеОКондиционности;
				Если ЗначениеЗаполнено(УдостоверениеОКондиционностиЕсть) Тогда
					УдостоверениеОКондиционности = "Удостоверение о качестве семян № "+УдостоверениеОКондиционностиЕсть;
				Иначе
					УдостоверениеОКондиционности = "";
				КонецЕсли;
				                       
				ДатаУдостоверенияЕсть = Формат(СтрокаАнализы.ДатаУдостоверения,"ДЛФ=D");
				Если ЗначениеЗаполнено(ДатаУдостоверенияЕсть) Тогда
					ДатаУдостоверения = " от "+ДатаУдостоверенияЕсть;
				Иначе
					ДатаУдостоверения = "";
				КонецЕсли;
				
				ЛабораторияЕсть = СтрокаАнализы.Лаборатория;
				Если ЗначениеЗаполнено(ЛабораторияЕсть) Тогда
					Лаборатория = ", выданное "+ЛабораторияЕсть;
				Иначе
					Лаборатория = "";
				КонецЕсли;
				
				СрокДействияАнализаЕсть = СтрокаАнализы.СрокДействияАнализа;
				
				Если НЕ ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
					СрокДействияАнализа = ", срок действия до "+Формат(СрокДействияАнализаЕсть,"ДЛФ=D");
					//СрокДействияАнализа = ""+Формат(СрокДействияАнализаЕсть,"ДЛФ=D");
				Иначе
					СрокДействияАнализа = "";
				КонецЕсли;
				
				
			КонецЦикла;
			
		Иначе
			
				ВсхожестьЕсть = Партия_МССО_Ссылка.Всхожесть;
				Если ЗначениеЗаполнено(ВсхожестьЕсть) Тогда
					Всхожесть = "всхожесть "+ВсхожестьЕсть+"%";
				Иначе
					Всхожесть = "";
				КонецЕсли;
				
				ВлажностьЕсть = Партия_МССО_Ссылка.Влажность;
				Если ЗначениеЗаполнено(ВлажностьЕсть) Тогда
					Влажность = ", влажность "+ВлажностьЕсть+"%";
				Иначе
					Влажность = "";
				КонецЕсли;
				
				СОКЕсть = Партия_МССО_Ссылка.СОК;
				Если ЗначениеЗаполнено(СОКЕсть) Тогда
					СОК = ", семян основной культуры "+СОКЕсть+"%";
				Иначе
					СОК = "";
				КонецЕсли;
				
				ПримесиЕсть = Партия_МССО_Ссылка.Примеси;
				Если ЗначениеЗаполнено(ПримесиЕсть) Тогда
					Примеси = ", примесь семян др. растений "+ПримесиЕсть+"%";
				Иначе
					Примеси = "";
				КонецЕсли;
				
				Масса1000семянЕсть = Партия_МССО_Ссылка.Масса1000семян;
				Если ЗначениеЗаполнено(Масса1000семянЕсть) Тогда
					Масса1000семян = ", масса 1000 семян "+Масса1000семянЕсть+"г";
				Иначе
					Масса1000семян = "";
				КонецЕсли;
			
				УдостоверениеОКондиционностиЕсть = Партия_МССО_Ссылка.УдостоверениеОКондиционности;
				Если ЗначениеЗаполнено(УдостоверениеОКондиционностиЕсть) Тогда
					УдостоверениеОКондиционности = "Удостоверение о качестве семян № "+УдостоверениеОКондиционностиЕсть;
				Иначе
					УдостоверениеОКондиционности = "";
				КонецЕсли;
				
				ДатаУдостоверенияЕсть = Формат(Партия_МССО_Ссылка.ДатаУдостоверения,"ДЛФ=D");
				Если ЗначениеЗаполнено(ДатаУдостоверенияЕсть) Тогда
					ДатаУдостоверения = " от "+ДатаУдостоверенияЕсть;
				Иначе
					ДатаУдостоверения = "";
				КонецЕсли;
				
				ЛабораторияЕсть = Партия_МССО_Ссылка.Лаборатория;
				Если ЗначениеЗаполнено(ЛабораторияЕсть) Тогда
					Лаборатория = ", выданное "+ЛабораторияЕсть;
				Иначе
					Лаборатория = "";
				КонецЕсли;
				
				СрокДействияАнализаЕсть = Партия_МССО_Ссылка.СрокДействияАнализа;
				Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
					СрокДействияАнализа = ""+Формат(СрокДействияАнализаЕсть,"ДЛФ=D");
				Иначе
					СрокДействияАнализа = "";
				КонецЕсли;
			
		КонецЕсли; 
		
		
		//////// лук \\\\\\\\\
		
		Дополнительно_Лук = "";
		Лук_НаличиеОтходовВсего = Партия_МССО_Ссылка.Лук_НаличиеОтходовВсего;	
		Если Лук_НаличиеОтходовВсего > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук +Символы.ПС+"наличие отходов и примесей "+Лук_НаличиеОтходовВсего+"%, в том числе: "; 	
		КонецЕсли;	
		
		Лук_БольныеПоврежденные = Партия_МССО_Ссылка.Лук_БольныеПоврежденные; 
		
		Если Лук_БольныеПоврежденные > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук + "луковиц больных, поврежденных  вредителями "+Лук_БольныеПоврежденные+"%"; 	
		КонецЕсли;
		

		Лук_Высохший = Партия_МССО_Ссылка.Лук_Высохший; 

		Если Лук_Высохший > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук + ", высохших "+Лук_Высохший+"%"; 	
		КонецЕсли;
		
		
		
		Лук_СМеханическимиПовреждениями = Партия_МССО_Ссылка.Лук_СМеханическимиПовреждениями; 

		Если Лук_СМеханическимиПовреждениями > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук + ", с механическими повреждениями , проросших, оголенных (при осеннем исп-и) "+Лук_СМеханическимиПовреждениями+"%"; 	
		КонецЕсли;
		
		
		Лук_Примеси = Партия_МССО_Ссылка.Лук_Примеси; 

		Если Лук_Примеси > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук + ", примеси (земля,чешуя и др.) "+Лук_Примеси+"%"; 	
		КонецЕсли;
		
		
		Область_Секция_8.Параметры.Дополнительно_Лук = Дополнительно_Лук; 
		
		Область_Секция_9  = Макет.ПолучитьОбласть("Секция_9");
		
		Область_Секция_9.Параметры.СрокДействияАнализа = ""+Прав(СрокДействияАнализа,10)+" г.";    //////  07-05-2025
		
		//////// лук \\\\\\\\\
		
		
		
		//////// картофель \\\\\\\\\
		Дополнительно_Картофель = "";
		
		
		Если ЗначениеЗаполнено(Партия_МССО_Ссылка.ВнешнийВид) Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"внешний вид "+Партия_МССО_Ссылка.ВнешнийВид;
		КонецЕсли;          
		
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейСПризнакамиУдушья > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней с признаками «удушья».подмороженных, с ожогами, уродливых, с израстаниями и легкообламывающимися наростами, разрезанных, раздавленных, с ободранной кожурой более 1/3 поверхности клубня - "+Партия_МССО_Ссылка.НаличиеКлубнейСПризнакамиУдушья+"%";
		КонецЕсли;
		
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейНеСоответствующихПоРазмер > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней не соответствующих по размеру - "+Партия_МССО_Ссылка.НаличиеКлубнейНеСоответствующихПоРазмер+"%";
		КонецЕсли;
		
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейСПовреждениями > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней с повреждениями инспекция по механическими (порезы, вырывы, трещины семеноводству вмятины тканей клубней глубиной более 5 мм и карантину и длиной более 10 мм) и вредителями (проволочниками более трех ходов, грызунами растений хрущами и сов - "+Партия_МССО_Ссылка.НаличиеКлубнейСПовреждениями+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейДругихБотаническихСортов > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней других ботанических сортов - "+Партия_МССО_Ссылка.НаличиеКлубнейДругихБотаническихСортов+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейСБолезнямиВсего > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней, пораженных болезнями, всего - "+Партия_МССО_Ссылка.НаличиеКлубнейСБолезнямиВсего+"%"+Символы.ПС+" в т.ч.:";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.МокройГнилью > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"мокрой гнилью - "+Партия_МССО_Ссылка.МокройГнилью+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.ЧернойНожкой > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"черной ножкой - "+Партия_МССО_Ссылка.ЧернойНожкой+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.КольцевойГнилью > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"кольцевой гнилью - "+Партия_МССО_Ссылка.КольцевойГнилью+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.Фитофторозом > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Фитофторозом - "+Партия_МССО_Ссылка.Фитофторозом+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.РезиновойСухимиГнилями > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"презиновой, сухими гнилями (фомоз, фузариозантракноз) - "+Партия_МССО_Ссылка.РезиновойСухимиГнилями+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.СтеблевойНематодой > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"стеблевой нематодой - "+Партия_МССО_Ссылка.СтеблевойНематодой+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.ОбыкновеннойПаршой > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"обыкновенной и серебристой паршой (поражение более 1/3 поверхности клубней) - "+Партия_МССО_Ссылка.ОбыкновеннойПаршой+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.Ризоктониозом > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"ризоктониозом (при поражении от 1/10 до 14 включительно, поверхности клубней) - "+Партия_МССО_Ссылка.Ризоктониозом+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.НаличиеЗемлиПостороннихПримесей > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие земли и посторонних примесей - "+Партия_МССО_Ссылка.НаличиеЗемлиПостороннихПримесей+"%";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Партия_МССО_Ссылка.ЗараженностьСемянКарантиннымиОбъектами) Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Зараженность семян карантинными объектами "+Партия_МССО_Ссылка.ЗараженностьСемянКарантиннымиОбъектами;
		КонецЕсли;          
		
		Область_Секция_8.Параметры.Дополнительно_Картофель = Дополнительно_Картофель; 
		
		//////// картофель \\\\\\\\\
		
		
		
		
		
		///// Удостоверение о качестве семян № [ТаблицаВ.ДК], выданное [ТаблицаВ.ДЛ], срок действия до [ТаблицаВ.СД]
		 
		    
		Область_Секция_8.Параметры.Всхожесть = Всхожесть;
		Область_Секция_8.Параметры.Влажность = Влажность;
		Область_Секция_8.Параметры.СОК = СОК;
		Область_Секция_8.Параметры.Примеси = Примеси;
		Область_Секция_8.Параметры.Масса1000семян = Масса1000семян;
		
		Область_Секция_8.Параметры.УдостоверениеОКондиционности = УдостоверениеОКондиционности;
		Область_Секция_8.Параметры.ДатаУдостоверения = ДатаУдостоверения;
		Область_Секция_8.Параметры.Лаборатория = Лаборатория;
		Область_Секция_8.Параметры.СрокДействияАнализа = СрокДействияАнализа;
		
		//[?(ТаблицаВ.ВС="","","всхожесть "+ ТаблицаВ.ВС+"%")]
		//[?(ТаблицаВ.ВЛ="","",", влажность "+ ТаблицаВ.ВЛ+"%")]
		//[?(ТаблицаВ.СОК="","",", семян основной культуры "+ ТаблицаВ.СОК+"%")]
		//[?(ТаблицаВ.ПР="","",", примесь семян др. растений "+ ТаблицаВ.ПР+"%")]
		//[?(ТаблицаВ.М1="","",", масса 1000 семян "+ ТаблицаВ.М1+"г")]
		
		//[?(ТаблицаВ.АктОпр="","","Акт апробации № "+ТаблицаВ.АктОпр)]
		//[?(ТаблицаВ.Свид="","","Сертификат на семена № "+ТаблицаВ.Свид)]
		
		
		/////Репродукция = ?(СтрокаТовары.Серия.Партия_МССО.Репродукция = 1,", репродукция "+СтрокаТовары.Серия.Партия_МССО.Репродукция,"");
		РепродукцияЕсть = Партия_МССО_Ссылка.Репродукция;
		Если ЗначениеЗаполнено(РепродукцияЕсть) Тогда
			Репродукция = ", репродукция "+РепродукцияЕсть;
		Иначе
			Репродукция = "";
		КонецЕсли; 
		
		СортоваяЧистотаЕсть = Партия_МССО_Ссылка.СортоваяЧистота;
		Если ЗначениеЗаполнено(СортоваяЧистотаЕсть) Тогда
			СортоваяЧистота = "Сортовая чистота "+СортоваяЧистотаЕсть;
		Иначе
			СортоваяЧистота = "";
		КонецЕсли; 
		
		
		АктАпробацииЕсть = Партия_МССО_Ссылка.АктАпробации;
		Если ЗначениеЗаполнено(АктАпробацииЕсть) Тогда
			АктАпробации = "Акт апробации № "+АктАпробацииЕсть;
		Иначе
			АктАпробации = "";
		КонецЕсли; 
		
		СвидетельствоЕсть = Партия_МССО_Ссылка.Свидетельство;
		Если ЗначениеЗаполнено(СвидетельствоЕсть) Тогда
			Свидетельство = "Сертификат на семена № "+СвидетельствоЕсть;
		Иначе
			Свидетельство = "";
		КонецЕсли; 
		
		
		
		//Партия_МССО = ", партия № "+Партия_МССО_Ссылка;
		Партия_МССО = ""+Партия_МССО_Ссылка;
		
		Область_Секция_8.Параметры.Товар = Товар;
		Область_Секция_8.Параметры.ВидРасфасовки = ВидРасфасовки;
		Область_Секция_8.Параметры.Репродукция = Репродукция;
		Область_Секция_8.Параметры.Партия_МССО = Партия_МССО;
		Область_Секция_8.Параметры.ВесПартии   = ВесПартии;
		Область_Секция_8.Параметры.ГодУрожая   = ""+Партия_МССО_Ссылка.ГодУрожая;
		
		
		
		Область_Секция_8.Параметры.СортоваяЧистота = СортоваяЧистота;
		Область_Секция_8.Параметры.АктАпробации = АктАпробации;
		Область_Секция_8.Параметры.АктАпробации = Свидетельство;
		
		
		
	//	[СокрЛП(ТаблицаВ.Номенклатура.ПолнНаименование)] [СокрЛП(ТаблицаВ.Номенклатура.ВидРасфасовки)]
	//	[?(СокрЛП(ТаблицаВ.РП)="1", ", репродукция "+ТаблицаВ.РП,?(СокрЛП(ТаблицаВ.РП)="2", ", репродукция "+ТаблицаВ.РП,", "+ТаблицаВ.РП))],
	//	партия № [СокрЛП(ТаблицаВ.Партия)], [ТаблицаВ.К_во][ТаблицаВ.Ед]
	
	
	//   [?(ТаблицаВ.СЧ="0%","","Сортовая чистота "+ТаблицаВ.СЧ)]
	
	
	
		ОбработкаСемян = "-";
		Если ЗначениеЗаполнено(Партия_МССО_Ссылка.ОбработкаСемян) = ИСТИНА Тогда
			ОбработкаСемян = ""+Партия_МССО_Ссылка.ОбработкаСемян;
		КонецЕсли;
	
	    Область_Секция_8.Параметры.ОбработкаСемян = ""+ОбработкаСемян;
	
	
	
		ТабДок.Вывести(Область_Секция_8);
	КонецЦикла; 
		
	
	
	
	
	
	Область_Секция_9  = Макет.ПолучитьОбласть("Секция_9");
	
	Приложения = "";
	Приложения = "ТТН на "+НСтр("ru= 'на [&СтраницВсего]' листах");
	
	Область_Секция_9.Параметры.Приложения = Приложения;
	
	ТабДок.Вывести(Область_Секция_9);
	
	Область_Секция_10  = Макет.ПолучитьОбласть("Секция_10");
	Область_Секция_10.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
	Область_Секция_10.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
	
	ТабДок.Вывести(Область_Секция_10);
	
	// Колонтитулы
	ТабДок.НижнийКолонтитул.Выводить = Истина;
	ТабДок.НижнийКолонтитул.ТекстСправа = НСтр("ru= 'Лист [&НомерСтраницы] из [&СтраницВсего]'");
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСвидетельстваНаСемена(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьСвидетельстваНаСеменаНаСервере(ТабДок);
	//ТабДок.Показать("Печать свидетельства на семена");
	
	Печать(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	
КонецПроцедуры

////////77w qaws 


&НаКлиенте
//Процедура Печать(ИдентификаторКоманды, МассивОбъектов) Экспорт
Процедура Печать(ИдентификаторКоманды, ТабДок) Экспорт
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
    //Типовая часть вывода в стандартное окно++
    ИдентификаторПечатнойФормы = "СвидетельствоНаСемена";
    НазваниеПечатнойФормы = НСтр("ru = 'Свидетельство на семена'");
    
    Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
        ТабДок.Показать(НазваниеПечатнойФормы);
        ДокументыПечатались = Истина;
        Возврат;
    КонецЕсли;     
    МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
    КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
    ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
    ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
    ПечатнаяФорма.ТабличныйДокумент = ТабДок;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
    
    ОбластиОбъектов = Новый СписокЗначений;
    МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

    ДокументыПечатались = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Печать_(ИдентификаторКоманды, ТабДок) Экспорт
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
    //Типовая часть вывода в стандартное окно++
    ИдентификаторПечатнойФормы = "СчетМССО";
    НазваниеПечатнойФормы = НСтр("ru = 'Счет-протокол'");
    
    Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
        ТабДок.Показать(НазваниеПечатнойФормы);
        ДокументыПечатались = Истина;
        Возврат;
    КонецЕсли;     
    МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
    КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
    ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
    ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
    ПечатнаяФорма.ТабличныйДокумент = ТабДок;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
    
    ОбластиОбъектов = Новый СписокЗначений;
    МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

    ДокументыПечатались = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПечатьСети_(ИдентификаторКоманды, ТабДок) Экспорт
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
    //Типовая часть вывода в стандартное окно++
    ИдентификаторПечатнойФормы = "СчетМССОСети";
    НазваниеПечатнойФормы = НСтр("ru = 'Согласование заявки'");
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
        ТабДок.Показать(НазваниеПечатнойФормы);
        ДокументыПечатались = Истина;
        Возврат;
    КонецЕсли;     
    МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
    КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
    ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
    ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
    ПечатнаяФорма.ТабличныйДокумент = ТабДок;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
    
    ОбластиОбъектов = Новый СписокЗначений;
    МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

    ДокументыПечатались = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопроса_77w() Экспорт
    
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = Нстр("ru = 'Данные еще не записаны.
		|Печать возможна только после записи документа.
		|Данные будут записаны.'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуСегментовЗапретаОтгрузкиЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
		
	КонецЕсли;
    

КонецПроцедуры


&НаСервере
Процедура ДляПечатьСчетНаСервере(ТабДок)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПечатьСчетНаСервере(ТабДок);
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект")	
КонецПроцедуры

&НаСервере
Процедура ДляПечатьСчетСетиНаСервере(ТабДок)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПечатьСчетСетиНаСервере(ТабДок);
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект")	
КонецПроцедуры

&НаСервере
Процедура ДляПечатьСчетСетиОМАНаСервере(ТабДок)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПечатьСчетСетиОМАНаСервере(ТабДок);
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект")	
КонецПроцедуры



&НаКлиенте
Процедура ПечатьСчет(Команда)
	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ТекстВопроса = Нстр("ru = 'Данные еще не записаны.
		|Печать возможна только после записи и предварительного проведения документа.
		|Данные будут записаны.'");
		
		ПоказатьВопрос(Новый ОписаниеОповещения("Спросить", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
		Возврат;
		
	КонецЕсли;
	
	//ТабДок = Новый ТабличныйДокумент;
	//ПечатьСчетНаСервере(ТабДок);
	//
	//Печать_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	
	//Если (Объект.Проведен) и (ЭтаФорма.Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.НеСогласован")) Тогда
	Если Объект.Проведен Тогда
		
		Попытка
			//ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);

			
			
			Если ЭтаФорма.Модифицированность Тогда
				ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);      //jadmin перенес сюда, если нету изменений то не перепроводить док
				//Возврат;
			КонецЕсли; 
			
			ТабДок = Новый ТабличныйДокумент;
			//ПечатьСчетНаСервере(ТабДок);
			 ДляПечатьСчетНаСервере(ТабДок);

			
			Печать_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
			
		Исключение
			Возврат;
		КонецПопытки; 
		
		//ТабДок = Новый ТабличныйДокумент;
		//ПечатьСчетНаСервере(ТабДок);
		//
		//Печать_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
		
	Иначе
		
		ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
		
		Если Объект.Проведен Тогда
			ТабДок = Новый ТабличныйДокумент;
			//ПечатьСчетНаСервере(ТабДок);
			  ДляПечатьСчетНаСервере(ТабДок);

			Печать_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
		КонецЕсли;	
		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура Спросить(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;
    
    Попытка
        ЭлементЗаписан = Записать();
		
		ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
		//////// записываем документ и выводим печатную форму
		Если Объект.Проведен Тогда
			ТабДок = Новый ТабличныйДокумент;
			//ПечатьСчетНаСервере(ТабДок);
			
			Печать_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	    КонецЕсли; 

    Исключение
        Возврат;
    КонецПопытки;
    
    Если Не ЭлементЗаписан Тогда
        Возврат;
    КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура СпроситьСети(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Если РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    КонецЕсли;
    
    Попытка
        ЭлементЗаписан = Записать();
		
		ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
		//////// записываем документ и выводим печатную форму
		Если Объект.Проведен Тогда
			ТабДок = Новый ТабличныйДокумент;
			//ПечатьСчетСетиНаСервере(ТабДок);
			
			ПечатьСети_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	    КонецЕсли; 

    Исключение
        Возврат;
    КонецПопытки;
    
    Если Не ЭлементЗаписан Тогда
        Возврат;
    КонецЕсли;

КонецПроцедуры



&НаСервере
Процедура УДАЛИТЬ_ПечатьСчетСетиНаСервере(ТабДок)
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;	
	Макет = ПолучитьМакетНаСервере("СчетМССОСети");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	
	ОбластьШапка.Параметры.ПРОТОКОЛ = "ЗАЯВКА № "+СокрЛ(Объект.Номер)+ " от "+Формат(Объект.Дата,"ДЛФ=DD") +"       "+ Объект.Склад+"      "+Объект.Контрагент;
	
	//ОбластьШапка.Параметры.ЭлАдрес = СокрЛП(Объект.Контрагент.КонтактнаяИнформация[3].АдресЭП);	
	
	Попытка
		ПараметрыСеанса.ВременныйАдресПочты = СокрЛП(Объект.Контрагент.КонтактнаяИнформация[3].АдресЭП);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 	

	
	//ФирмаПеч = "";
	//
	//ОбластьШапка.Параметры.Заполнить(Объект);
	//ФирмаПеч = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), "ПолноеНаименование,,,,,,,");
	//АдресПеч = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",,ЮридическийАдрес,,,,,");
	////ОбластьШапка.Параметры.НаименованиеФирмы = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , Объект.БанковскийСчет), "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	//ОбластьШапка.Параметры.Фирма = ФирмаПеч;
	//ОбластьШапка.Параметры.Адрес  = АдресПеч;
	//ОбластьШапка.Параметры.ИНН = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",ИНН,,,,,,");
	////ОбластьШапка.Параметры.НомерСчета = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",,,,НомерСчета,Банк,БИК,");
	//
	//ОбластьШапка.Параметры.НомерСчета = Объект.БанковскийСчет.НомерСчета;
	//ОбластьШапка.Параметры.Банк = Объект.БанковскийСчет.Банк;
	//ОбластьШапка.Параметры.БанкКод = Объект.БанковскийСчет.Банк.Код;	
	//
	//
	//ОбластьШапка.Параметры.Покупатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), "ПолноеНаименование,,,,,,,");
	//
	//ОбластьШапка.Параметры.РасшифровкаКонтрагента = Объект.Контрагент;  /////// 77w qaws  для рассшифровки ячейки
	//
	//ОбластьШапка.Параметры.ПокупательАдрес = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), ",,ЮридическийАдрес,,,,,");
	//ОбластьШапка.Параметры.ПокупательИНН = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), ",ИНН,,,,,,");
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	БанковскиеСчета.Ссылка КАК Счет,
	//|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	//|	БанковскиеСчета.Банк,
	//|	БанковскиеСчета.Банк.Код
	//|ИЗ
	//|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчета
	//|ГДЕ
	//|	БанковскиеСчета.Владелец = &Владелец";
	//
	//Запрос.УстановитьПараметр("Владелец",Объект.Контрагент);
	//Выборка = Запрос.Выполнить().Выгрузить();
	//
	//Если Выборка.Количество()>0 Тогда
	//	Если ЗначениеЗаполнено(Выборка[0]) Тогда
	//		ОбластьШапка.Параметры.НомерСчетаПокупатель = Выборка[0].НомерСчета;
	//		ОбластьШапка.Параметры.БанкПокупатель = Выборка[0].Банк;
	//		ОбластьШапка.Параметры.БанкКодПокупатель = Выборка[0].БанкКод;	
	//	КонецЕсли;
	//КонецЕсли;

	
	Если ЗначениеЗаполнено(Объект.НомерПоДаннымКлиента) Тогда
		ОбластьШапка.Параметры.НомерПоДаннымКлиента = "Заказ № "+Объект.НомерПоДаннымКлиента+ " от "+Формат(Объект.ДатаПоДаннымКлиента,"ДЛФ=DD");
	Иначе
		ОбластьШапка.Параметры.НомерПоДаннымКлиента = "";
	КонецЕсли; 
	
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапка2  = Макет.ПолучитьОбласть("Шапка2");
	ТабДок.Вывести(ОбластьШапка2);
	
	
	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
	
	Ном = 0;
	Для каждого Строка Из Объект.Товары Цикл
		
		Если Строка.Отменено Тогда
			Продолжить;
		КонецЕсли; 
		
		
		Ном = Ном+1;
		
		ОбластьСтрока.Параметры.Номенклатура = 
		СокрЛП(Строка.Номенклатура.НаименованиеПолное);
		//+ " "+Строка.Номенклатура.УпаковкаГрузомест+" "+?(Строка.Номенклатура.УпаковкаГрузомест.КоэффициентМССО<>0,""+Строка.Номенклатура.УпаковкаГрузомест.КоэффициентМССО,"")
		//+ ""+Строка.Номенклатура.УпаковкаГрузомест.БазоваяЕдиницаМССО;
		//+ ", "+Строка.Номенклатура.СтранаПроисхождения;
		
		ОбластьСтрока.Параметры.Примечание = ""+?(ЗначениеЗаполнено(Строка.Серия.СтранаПроисхождения),Строка.Серия.СтранаПроисхождения,Строка.Номенклатура.СтранаПроисхождения);
		
		Если ОбластьСтрока.Параметры.Примечание = "" Тогда
			ОбластьСтрока.Параметры.Примечание = ""+?(ЗначениеЗаполнено(Строка.Номенклатура.СтранаПроисхождения),Строка.Номенклатура.СтранаПроисхождения,Строка.Номенклатура.СтранаВвоза);
		КонецЕсли; 
				
			
			ШК = "";
			Штрихкод = "";
			
		   ШтрихКод = РегистрыСведений.ШтрихкодыНоменклатуры.НайтиОсновнойШКНоменклатуры(Строка.Номенклатура);
		   
		   Если ШтрихКод  = Неопределено Тогда        //////////77w qaws
			   Если Строка.Номенклатура.ШКДляДжестори.Код <> 0 Тогда
				   Штрихкод = Формат(Строка.Номенклатура.ШКДляДжестори.Код,"ЧГ=0");
			   КонецЕсли; 
		   КонецЕсли; 

		   ОбластьСтрока.Параметры.ПолученныйШтрихКод  =  ШтрихКод;

		
		ОбластьСтрока.Параметры.Ном		   = Ном;			 
		//ОбластьСтрока.Параметры.ПартияМССО = Строка.Серия.Партия_МССО;			 
		//ОбластьСтрока.Параметры.Единица    = Строка.Номенклатура.УпаковкаГрузомест;
		ОбластьСтрока.Параметры.Единица    = Строка.Упаковка;
		
		Если НЕ ЗначениеЗаполнено(Строка.Упаковка) Тогда
		  ОбластьСтрока.Параметры.Единица    = Строка.Номенклатура.УпаковкаГрузомест;
		КонецЕсли; 
		
		ОбластьСтрока.Параметры.Количество = Строка.КоличествоУпаковок;
		ОбластьСтрока.Параметры.Цена       = Строка.Цена; 
		
		ПроцентСкидки = "";
		
		Если Строка.ПроцентАвтоматическойСкидки <> 0 Тогда
			ПроцентСкидки = Строка.ПроцентАвтоматическойСкидки;
		ИначеЕсли Строка.ПроцентРучнойСкидки <> 0 Тогда 
			ПроцентСкидки = Строка.ПроцентРучнойСкидки;
		Иначе	
			ПроцентСкидки = 0;
		КонецЕсли; 
		
		Если ПроцентСкидки = 0 Тогда
			ОбластьСтрока.Параметры.ПроцентСкидки = "";
		Иначе
			ОбластьСтрока.Параметры.ПроцентСкидки = ""+ПроцентСкидки+"%"; 
		КонецЕсли; 
		
		
		
		ОбластьСтрока.Параметры.Сумма        = Строка.Сумма;
		
		Попытка
			ОбластьСтрока.Параметры.ЦенаСоСкидкой = Окр(Строка.Сумма/Строка.КоличествоУпаковок,2);
		Исключение
		КонецПопытки; 
		
		
		
		ОбластьСтрока.Параметры.СтавкаНДС    = Строка.СтавкаНДС;
		ОбластьСтрока.Параметры.СуммаНДС     = Строка.СуммаНДС;
		ОбластьСтрока.Параметры.ВсегоРуб     = Строка.СуммаСНДС;
				
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	
	
	ОбластьИтого.Параметры.ИтогСумма     = Объект.Товары.Итог("Сумма");
	ОбластьИтого.Параметры.ИтогСуммаНДС  = Объект.Товары.Итог("СуммаНДС");
	ОбластьИтого.Параметры.ИтогСуммаСНДС = Объект.Товары.Итог("СуммаСНДС");
	
	ТабДок.Вывести(ОбластьИтого);
	
		
	
	ОбластьПодвал  = Макет.ПолучитьОбласть("Подвал");
	

	ФормСтрока = "Л = ru_RU; ДП = Ложь";
	ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копееек,м,2";
	
	СуммаНДСПрописью = ЧислоПрописью(Объект.Товары.Итог("СуммаНДС"), ФормСтрока, ПарПредмета);
	ОбластьПодвал.Параметры.ИтогСуммаНДС_П =  СуммаНДСПрописью;

	ОбластьПодвал.Параметры.ИтогВсего_П =  ЧислоПрописью(Объект.Товары.Итог("СуммаСНДС"), ФормСтрока, ПарПредмета);;
	
	
	ТабДок.Вывести(ОбластьПодвал);
	
	
	
	ОбластьПодвал2  = Макет.ПолучитьОбласть("Подвал2");
	
	
	//Если Объект.Склад.КонтактнаяИнформация.Количество()> 0 Тогда 		
	//	АдресСклада = Объект.Склад.КонтактнаяИнформация[0].Представление;
	//КонецЕсли; 
	//
	//
	//
	//ОбластьПодвал2.Параметры.ТекстПодвал2 =  "Срок действия протокола (счет-фактуры) 5 дней с "+Формат(Объект.Дата,"ДЛФ=D")+" по "+Формат(Объект.Дата+432000,"ДЛФ=D")
	// 									  + ". Получение товара со " +Объект.Склад+ " по адресу "+АдресСклада  +", при наличии : доверенности, паспорта, копии платежного поручения, этого протокола, договора с оригинальными подписями и печатями." ;
		
	
	
	ТабДок.Вывести(ОбластьПодвал2);

	
	//ПодготовитьДанныедляОтправкиПоЭлПочте(ТабДок);

КонецПроцедуры

&НаКлиенте
Процедура ПечатьСчетСети(Команда)
	
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	
	//	ТекстВопроса = Нстр("ru = 'Данные еще не записаны.
	//	|Печать возможна только после записи и предварительного проведения документа.
	//	|Данные будут записаны.'");
	//	
	//	ПоказатьВопрос(Новый ОписаниеОповещения("СпроситьСети", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	//	Возврат;
	//	
	//КонецЕсли;
	
	//Если Объект.Проведен Тогда
	//	
	//	Попытка
	//		ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	//		
	//		
	//		Если ЭтаФорма.Модифицированность Тогда
	//			Возврат;
	//		КонецЕсли; 
	//		
	//		ТабДок = Новый ТабличныйДокумент;
	//		ПечатьСчетСетиНаСервере(ТабДок);
	//		//ПечатьСчетНаСервере(ТабДок);
	//		ПечатьСети_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	//		
	//	Исключение
	//		Сообщить(ОписаниеОшибки());
	//		Возврат;
	//	КонецПопытки; 
	//	
	//	
	//Иначе
	//	
	//	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
	//	
	//	Если Объект.Проведен Тогда
	//		ТабДок = Новый ТабличныйДокумент;
	//		ПечатьСчетСетиНаСервере(ТабДок);
	//		
	//		ПечатьСети_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	//	КонецЕсли;	
	//	
	//КонецЕсли; 
	
	
	//// 77w qaws
	
			ТабДок = Новый ТабличныйДокумент;
			//ПечатьСчетСетиНаСервере(ТабДок);
			ДляПечатьСчетСетиНаСервере(ТабДок);
			ПечатьСети_(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	
КонецПроцедуры

&НаСервере
Процедура ЗаказТребуетВниманияМенеджераПриИзмененииНаСервере(Заказ)
	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |	РасходныйОрдерНаТоварыОснования.Ссылка
        |ИЗ
        |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
        |ГДЕ
        |	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ";
 
    Запрос.УстановитьПараметр("ВыбЗаказ", Заказ);
 
    РезультатЗапроса = Запрос.Выполнить();
 
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        НашлиОрдер = ВыборкаДетальныеЗаписи.Ссылка;
		
		НашлиОрдерОбъект = НашлиОрдер.ПолучитьОбъект();
		
		НашлиОрдерОбъект.ЗаказТребуетВниманияМенеджера = Ложь;
		НашлиОрдерОбъект.Записать();
		
        Сообщить(НашлиОрдер);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказТребуетВниманияМенеджераПриИзменении(Элемент)
	
	ЗаказТребуетВниманияМенеджераПриИзмененииНаСервере(Объект.Ссылка);
	ЭтаФорма.Элементы.ЗаказТребуетВниманияМенеджера.Доступность  = Объект.ЗаказТребуетВниманияМенеджера;      /////77w  qaws

КонецПроцедуры

&НаСервере
Процедура ПолучитьРазмерСкидкиНаСервере(ВыбКонтрагент)
    
	СкидкаСезоннаяРазмер = 0;
	СкидкаЗаПредоплатуРазмер = 0;
	СкидкаОборотРазмер = 0;

	СкидкаОбщая = 0;
	СуммаОборотаМССО = 0;
	ОбщийМодуль77w.РасчитатьСкидкуКлиента(ВыбКонтрагент,Объект.Ссылка,СуммаОборотаМССО,СкидкаОборотРазмер,СкидкаОбщая);
	
	
	
		Если СкидкаОборотРазмер>0 И Объект.СкидкаИндивидуальная = ЛОЖЬ Тогда
			Объект.СкидкаОборот = ИСТИНА;
			Объект.СкидкаОборотПроцент = СкидкаОборотРазмер;
		Иначе
			Объект.СкидкаОборот = ЛОЖЬ;
			Объект.СкидкаОборотПроцент = 0;
		КонецЕсли;
		
		
		//Предоплата
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница"
		//	ИЛИ Объект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный",ИСТИНА)  
			//ИЛИ Объект.Партнер.ИндивидуальныеСкидки = ИСТИНА 
			Тогда
			Объект.СкидкаЗаПредоплату = ЛОЖЬ; 
			Объект.СкидкаЗаПредоплатуПроцент = 0;


		Иначе
			
			СкидкаЗаПредоплатуРазмер = 0;
			Если Объект.СкидкаЗаПредоплату = ИСТИНА Тогда
				СкидкаЗаПредоплатуРазмер = 5;
				Объект.СкидкаЗаПредоплатуПроцент = СкидкаЗаПредоплатуРазмер;
			Иначе
				Объект.СкидкаЗаПредоплатуПроцент = 0;
			КонецЕсли; 
		КонецЕсли;
		/////
		
		//Скидка Сезонная				
		Если НачалоДня(Объект.Дата) >= Дата("20221024") И ТекущаяДата()<Дата("20230101") Тогда
			
			СкидкаСезоннаяРазмер = 7;
			Объект.СкидкаСезонная = ИСТИНА;
			Объект.СкидкаСезоннаяПроцент = СкидкаСезоннаяРазмер;
			
			
		Иначе
			Объект.СкидкаСезонная = ЛОЖЬ;
			Объект.СкидкаСезоннаяПроцент = 0;
			
		КонецЕсли; 
		///

	
	
	Объект.СкидкаОбщая = СкидкаОбщая;
	Сообщить(" Оборот на текущий момент =  "+СуммаОборотаМССО+" руб. Скидка по обороту = "+СкидкаОборотРазмер+"%.  Сумма общей скидки = "+СкидкаОбщая+"%");	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЭтоРозничныйЗаказ()
	Если (Объект.Соглашение.СВ_РасчетныйНДС = Истина) Тогда
		Возврат Истина;
	КонецЕсли;
		Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПолучитьРазмерСкидки(Команда)
	ОчиститьСообщения();
	ЭтоРозница = ПроверитьЭтоРозничныйЗаказ();
	Объект.СкидкаОбщая = 0;
	//Если (СтрНайти(Строка(Объект.Соглашение),"Розница") > 0)
	Если (ЭтоРозница = Истина)
		или (СтрНайти(Строка(Объект.Соглашение),"Благотворительность") > 0) Тогда
		Возврат;	
	КонецЕсли;	
	
	ПолучитьРазмерСкидкиНаСервере(Объект.Контрагент);
КонецПроцедуры

 
//jadmin
&НаКлиенте
Процедура ПрименитьСкидку(Команда)
	ЭтоРозница = ПроверитьЭтоРозничныйЗаказ();
	Если (ЭтоРозница = Истина)
		или (СтрНайти(Строка(Объект.Соглашение),"Благотворительность") > 0) Тогда
		Возврат;	
	КонецЕсли;	
	
	
	РассчитатьСкидкиНаценкиКлиент();  //Автоматические скидки
	
		//Для Каждого ЭлементСписка Из Объект.Товары Цикл
		//	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		//	
		//	ЭлементСписка.ПроцентРучнойСкидки = Объект.СкидкаОбщая;
		//	
		//	//СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
		//	//
		//	//СтруктураДействий = Новый Структура;
		//	//СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
		//	//СтруктураДействий.Вставить("ПересчитатьСумму");
		//	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		//	//СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		//	//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		//	//СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		//	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		//	//
		//	//ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ЭлементСписка, СтруктураДействий, КэшированныеЗначения);
		//
		//КонецЦикла;	
		
		//РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);    /////////77w qaws	
		
////jadmin Проверка условия срабатывания скидок	
	ПроверитьУсловияСрабатыванияСкидокМССО();

	//Для каждого ЭлементСписка Из Объект.Товары Цикл
	//    Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(ЭлементСписка.Номенклатура, Объект.Дата) = ИСТИНА Тогда
	//		 Продолжить;
	//	КонецЕсли; 
	//	//jadmin Скидка устанавливался общий процент там где не надо. 
	//	//ЭлементСписка.ПроцентРучнойСкидки = Объект.СкидкаОбщая;
	//		
	//	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	//		
	//	СтруктураДействий = Новый Структура;
	//	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	//	СтруктураДействий.Вставить("ПересчитатьСумму");
	//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	//	
	//	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ЭлементСписка, СтруктураДействий, КэшированныеЗначения);
	//	
	//	ДопСкидка = 0;
	//	ЦенаСоСкидкойПоследовательноеПрименение = 0;
	//	ДопСкидка = ПроверитьДопСкидку(ЭлементСписка.Номенклатура,ЭлементСписка.Серия);

	//	Если ДопСкидка>0 Тогда
	//	
	//		ЦенаСоСкидкойПоследовательноеПрименение = Окр(ЭлементСписка.ЦенаСоСкидкой * (100 - ДопСкидка) / 100,2,РежимОкругления.Окр15как10); 
	//	    ПроцентСкидкиСУчетомДопСкидки =  (1 - ЦенаСоСкидкойПоследовательноеПрименение / ЭлементСписка.Цена) * 100;
	//		ЭлементСписка.ПроцентРучнойСкидки = ПроцентСкидкиСУчетомДопСкидки;
	//		
	//		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	//	
	//		СтруктураДействий = Новый Структура;
	//		СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	//		СтруктураДействий.Вставить("ПересчитатьСумму");
	//		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	//		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
	//		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	//		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	//		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	//		
	//		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ЭлементСписка, СтруктураДействий, КэшированныеЗначения);
	//	КонецЕсли;
	//	
	//	
	//КонецЦикла;	
		
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);    /////////77w qaws	
////

		
		
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСерииПо_FIFO_МССОНаСервере(Товар,Количество,Индекс)
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Серия КАК Серия,
	|	ТоварыНаСкладахОстатки.Серия.Номенклатура КАК СерияНоменклатура,
	//|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0)) КАК ВНаличииОстаток,
	|	ТоварыКОтгрузкеОстатки.Склад КАК Склад1,
	|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура1,
	|	ТоварыКОтгрузкеОстатки.Серия КАК Серия1,
	|	ТоварыКОтгрузкеОстатки.Серия.Номенклатура КАК СерияНоменклатура1,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыКОтгрузкеОстатки.ВРезервеОстаток ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ ТоварыКОтгрузкеОстатки.ВРезервеОстаток
	|		КОНЕЦ) КАК ВРезервеОстаток,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
	|		КОНЕЦ) КАК КОтгрузкеОстаток,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеОстатки.КОформлениюОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыКОтгрузкеОстатки.КОформлениюОстаток
	|	КОНЕЦ КАК КОформлениюОстаток,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеОстатки.КСборкеОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыКОтгрузкеОстатки.КСборкеОстаток
	|	КОНЕЦ КАК КСборкеОстаток,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеОстатки.СобираетсяОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыКОтгрузкеОстатки.СобираетсяОстаток
	|	КОНЕЦ КАК СобираетсяОстаток,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеОстатки.СобраноОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыКОтгрузкеОстатки.СобраноОстаток
	|	КОНЕЦ КАК СобраноОстаток,
	//|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.ВРезервеОстаток + ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток + ТоварыКОтгрузкеОстатки.КОформлениюОстаток + ТоварыКОтгрузкеОстатки.КСборкеОстаток + ТоварыКОтгрузкеОстатки.СобираетсяОстаток + ТоварыКОтгрузкеОстатки.СобраноОстаток)) КАК Свободно,
	//|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.ВРезервеОстаток + ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток)) КАК Свободно,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.ВРезервеОстаток + ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток),0)) КАК Свободно,
	|	ТоварыКОтгрузкеОстатки.Серия.ГоденДо КАК СерияГоденДо,
	|	ТоварыНаСкладахОстатки.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияГоденДо1
	//|	ТоварыКОтгрузкеОстатки.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияПартия_МССОСрокДействияАнализаТекущий
	|ИЗ
	//|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(,) КАК ТоварыНаСкладахОстатки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(&Период, ) КАК ТоварыКОтгрузкеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(,) КАК ТоварыКОтгрузкеОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
	|			И ТоварыНаСкладахОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
	|			И ТоварыНаСкладахОстатки.Серия = ТоварыКОтгрузкеОстатки.Серия
	|ГДЕ
	|	ТоварыНаСкладахОстатки.ВНаличииОстаток <> 0
	|	И ТоварыНаСкладахОстатки.Склад = &Склад
	|	И ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
	|	И ТоварыНаСкладахОстатки.Серия.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Склад,
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Серия,
	|	ТоварыНаСкладахОстатки.Серия.Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Склад,
	|	ТоварыКОтгрузкеОстатки.Номенклатура,
	|	ТоварыКОтгрузкеОстатки.Серия,
	|	ТоварыКОтгрузкеОстатки.Серия.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеОстатки.КОформлениюОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыКОтгрузкеОстатки.КОформлениюОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеОстатки.КСборкеОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыКОтгрузкеОстатки.КСборкеОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеОстатки.СобираетсяОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыКОтгрузкеОстатки.СобираетсяОстаток
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыКОтгрузкеОстатки.СобраноОстаток ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ТоварыКОтгрузкеОстатки.СобраноОстаток
	|	КОНЕЦ,
	|	ТоварыКОтгрузкеОстатки.Серия.ГоденДо,
	|	ТоварыНаСкладахОстатки.Серия.ГоденДо";
	
	
	
	
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//		|	ДанныеРегистров.Серия КАК Серия,
	//		|	СУММА(ДанныеРегистров.СвободныйОстаток) КАК СвободныйОстаток
	//		|ИЗ
	//		|	(ВЫБРАТЬ
	//		|		ТоварыНаСкладахОстатки.Серия КАК Серия,
	//		|		ТоварыНаСкладахОстатки.ВНаличииОстаток КАК СвободныйОстаток
	//		|	ИЗ
	//		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
	//		|				,
	//		|				Номенклатура = &Номенклатура
	//		|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	//		|	
	//		|	ОБЪЕДИНИТЬ ВСЕ
	//		|	
	//		|	ВЫБРАТЬ
	//		|		ТоварыКОтгрузкеОстатки.Серия,
	//		|		-ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.ВРезервеОстаток
	//		|	ИЗ
	//		|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
	//		|				,
	//		|				Номенклатура = &Номенклатура
	//		|					И Склад = &Склад
	//		|					И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ТоварыКОтгрузкеОстатки
	//		|	
	//		|	ОБЪЕДИНИТЬ ВСЕ
	//		|	
	//		|	ВЫБРАТЬ
	//		|		ТоварыНаСкладах.Серия,
	//		|		ВЫБОР
	//		|			КОГДА ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//		|				ТОГДА -ТоварыНаСкладах.ВНаличии + ТоварыНаСкладах.КОтгрузке
	//		|			ИНАЧЕ ТоварыНаСкладах.ВНаличии - ТоварыНаСкладах.КОтгрузке
	//		|		КОНЕЦ
	//		|	ИЗ
	//		|		РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
	//		|	ГДЕ
	//		|		ТоварыНаСкладах.Номенклатура = &Номенклатура
	//		|		И ТоварыНаСкладах.Склад = &Склад
	//		|	
	//		|	ОБЪЕДИНИТЬ ВСЕ
	//		|	
	//		|	ВЫБРАТЬ
	//		|		РезервыСерий.Серия,
	//		|		ВЫБОР
	//		|			КОГДА РезервыСерий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//		|				ТОГДА РезервыСерий.КОтгрузке + РезервыСерий.ВРезерве
	//		|			ИНАЧЕ -РезервыСерий.КОтгрузке - РезервыСерий.ВРезерве
	//		|		КОНЕЦ
	//		|	ИЗ
	//		|		РегистрНакопления.ТоварыКОтгрузке КАК РезервыСерий
	//		|	ГДЕ
	//		|		РезервыСерий.Номенклатура = &Номенклатура
	//		|		И РезервыСерий.Склад = &Склад
	//		|		И РезервыСерий.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ДанныеРегистров
	//		|
	//		|СГРУППИРОВАТЬ ПО
	//		|	ДанныеРегистров.Серия";
	//		
	//
	
	
	
	
	Запрос.УстановитьПараметр("Период", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.Дата));
	
	СтрокаДокумента = Объект.Товары.Получить(Индекс);
	
    Если СтрокаДокумента.Склад <> Справочники.Склады.ПустаяСсылка() Тогда
		Запрос.УстановитьПараметр("Склад", СтрокаДокумента.Склад);
	Иначе
	    Запрос.УстановитьПараметр("Склад", Объект.Склад);
	КонецЕсли; 
	//Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Номенклатура", Товар);
	//Запрос.УстановитьПараметр("Серия", Серия);
	
	//СекундДоСрока = Константы.СрокКонтроляДействияАнализа.Получить() *60 * 60 * 24;
	//ПодошелСрокДатыАнализа = Дата(1, 1, 1);
	//СрокДействияАнализа = Дата(1, 1, 1);	
	//
	//СрокДействияАнализа = Строка.СерияГоденДо1;
	//ПодошелСрокДатыАнализа = НачалоДня(СрокДействияАнализа - СекундДоСрока);
	//
	//Запрос.УстановитьПараметр("ПодошелСрокДатыАнализа", ПодошелСрокДатыАнализа);
	//
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	
	А = 1;
	
	
	
	РезультатЗапроса.Сортировать("СерияГоденДо1 Возр");
	
	Для каждого Строка из РезультатЗапроса Цикл
		
		СекундДоСрока = Константы.СрокКонтроляДействияАнализа.Получить() *60 * 60 * 24;
		ПодошелСрокДатыАнализа = Дата(1, 1, 1);
		СрокДействияАнализа = Дата(1, 1, 1);	
		
		СрокДействияАнализа = Строка.СерияГоденДо1;
		
		Попытка
			ПодошелСрокДатыАнализа = НачалоДня(СрокДействияАнализа - СекундДоСрока);
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
		//ПодошелСрокДатыАнализа = НачалоДня(СрокДействияАнализа - СекундДоСрока);
		
		
		//Если СокрЛП(Строка.Номенклатура.ВидТМЦ.Наименование) = "Семена" Тогда
		Если Строка.Номенклатура.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.Семена Тогда
			Попытка
				Если (СрокДействияАнализа - КонецДня(Объект.Дата))<=(СрокДействияАнализа - ПодошелСрокДатыАнализа) Тогда
				//Если (СрокДействияАнализа <= ПодошелСрокДатыАнализа) Тогда
					//Сообщить("  СРОК АНАЛИЗА ИСТЕКАЕТ: "+Товар+"  ПАРТИЯ  "+Строка.Серия);
					//РезультатЗапроса.Удалить(Строка);      //////////// ЕСЛИ УДАЛЯТЬ ТО ЦИКЛ НЕ ВИДИТ ПОТОМ ВТОРУЮ СТРОКУ
					Продолжить;
				КонецЕсли; 
			Исключение
			    //ОписаниеОшибки()
			КонецПопытки; 
		КонецЕсли; 

		
		Если (Строка.ВРезервеОстаток+Строка.КОтгрузкеОстаток+Строка.КОформлениюОстаток+Строка.КСборкеОстаток+Строка.СобираетсяОстаток+Строка.СобраноОстаток) = 0 Тогда
			Строка.Свободно = Строка.ВНаличииОстаток;
		КонецЕсли;	
		
		Если Строка.Свободно < Количество Тогда
			Продолжить;
		КонецЕсли;     
		
		СтрокаДокумента = Объект.Товары.Получить(Индекс);
		СтрокаДокумента.Серия = Строка.Серия;
		СтрокаДокумента.СтатусУказанияСерий = 14;
		
		Прервать;
		
	КонецЦикла; 
	

	Если РезультатЗапроса.Количество() = 0 Тогда
		Сообщить("СРОК АНАЛИЗА ИСТЕКАЕТ. "+"Товар "+Товар+" - серии не заполнены !"+Символы.ПС+"На складе "+Объект.Склад+" не хватает "+Количество+" "+Товар.УпаковкаГрузомест);	
	КонецЕсли; 
	
	
	
	//РезультатЗапроса.Сортировать("СерияГоденДо1 Возр");
	
	//Для каждого Строка из РезультатЗапроса Цикл
	//	Если (Строка.ВРезервеОстаток+Строка.КОтгрузкеОстаток+Строка.КОформлениюОстаток+Строка.КСборкеОстаток+Строка.СобираетсяОстаток+Строка.СобраноОстаток) = 0 Тогда
	//		Строка.Свободно = Строка.ВНаличииОстаток;
	//	КонецЕсли;	
	//	
	//	Если Строка.Свободно < Количество Тогда
	//		Продолжить;
	//	КонецЕсли;     
	//	
	//	СтрокаДокумента = Объект.Товары.Получить(Индекс);
	//	СтрокаДокумента.Серия = Строка.Серия;
	//КонецЦикла; 
	
	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСерииПо_FIFO_МССОСервер()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьСерииПо_FIFO_МССОНаСервере_NEW2022();
	ЗначениеВРеквизитФормы(ОбработкаОбъект,"Объект");
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);

	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");
	
КонецПроцедуры




&НаСервере
Процедура ЗаполнитьСклад()
	
	Для каждого СтрокаДокумента Из Объект.Товары Цикл
		Если СтрокаДокумента.Номенклатура.Родитель <> Справочники.Склады.ПустаяСсылка() Тогда
			 СтрокаДокумента.Склад = СтрокаДокумента.Номенклатура.Родитель.Склад;
		КонецЕсли; 
	КонецЦикла;	 
КонецПроцедуры
 

&НаСервере
Процедура СвернутьТовары(ЭтотДокумент)
	////ЭтотДокумент = РеквизитФормыВЗначение("Объект");
	//ТЗ_Товары_Свернуть = ЭтотДокумент.Товары.Выгрузить();
	//
	//
	//ТЗ_Товары_Свернуть.Свернуть("Склад, СрокПоставки, ДатаОтгрузки, ВидЦены, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, Номенклатура, Серия, Упаковка, ВариантОбеспечения, СтатусУказанияСерий, Цена, ЦенаСоСкидкой, Характеристика, Отменено"
	//
	//,"Количество,КоличествоУпаковок,Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки,СуммаАвтоматическойСкидки");	
	//                                               
	//
	//ЭтотДокумент.Товары.Загрузить(ТЗ_Товары_Свернуть);	
	//
	//Объект.Товары.Загрузить(ТЗ_Товары_Свернуть);	                             
	//
	//
	////ЗначениеВРеквизитФормы(ЭтотДокумент, "Объект");
КонецПроцедуры


&НаСервере
Функция ПолучитьУпаковкуНаСервере(Номенклатура,Упаковка)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	|	ЕСТЬNULL(СпрУпаковки.Ссылка, НЕОПРЕДЕЛЕНО) КАК Упаковка,
	|	ПРЕДСТАВЛЕНИЕ(СпрУпаковки.Ссылка) КАК УпаковкаПредставление,
	|	ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО) КАК ЕдиницаИзмеренияУпаковки,
	|	ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения.Представление, """") КАК ЕдиницаИзмеренияУпаковкиПредставление
	//|	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 0) КАК Коэффициент
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
	|		ПО (СпрУпаковки.Владелец = ВЫБОР
	|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|					ТОГДА СпрНоменклатура.Ссылка
	|				КОГДА СпрНоменклатура.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	|					ТОГДА СпрНоменклатура.НаборУпаковок
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (НЕ СпрУпаковки.ПометкаУдаления)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	| И СпрУпаковки.Ссылка = &Упаковка
	//|	И ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 0) = 1
	//|	И ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО) = СпрНоменклатура.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	//|	Коэффициент,
	|	ЕдиницаИзмеренияУпаковкиПредставление";
	
	//Запрос.Текст = СтрЗаменить(Запрос.Текст,
	//	"&ТекстЗапросаКоэффициентУпаковки",
	//	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	//	"СпрУпаковки", Неопределено));
		
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Коэффициент = 1;
	Если Выборка.Следующий() Тогда
		Коэффициент = Выборка.Упаковка.Числитель;
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции


 &НаСервере
Процедура ЗаполнитьСерииПо_FIFO_МССОНаСервере_NEW_БЛОГОТВОРИТЕЛЬНОСТЬ()
	
	
//jadmin Заполнение склада в товара
	Ошибка = Ложь;
	Для каждого Товар Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(Товар.Склад) Тогда
		    Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Ссылка КАК Ссылка,
				|	Номенклатура.Родитель КАК Родитель,
				|	Номенклатура.Родитель.Склад КАК РодительСклад
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Товар.Номенклатура);
			
			РезЗпр = Запрос.Выполнить().Выбрать();
			
			Пока РезЗпр.Следующий() Цикл
				Товар.Склад = РезЗпр.РодительСклад;
			КонецЦикла;
		КонецЕсли;  
		
		Если Товар.Склад = Справочники.Склады.ПустаяСсылка() Тогда
			Сообщить("Для номенклатуры " + Товар.Номенклатура + " не указан Склад");
			Ошибка = Истина;			
		
		КонецЕсли; 
		
	КонецЦикла; 

	Если Ошибка = Истина Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	  /////
	
		
	
	   //Объект.ОтсутвующиеПозиции = "";
	   
	   ТЗ = Объект.Товары.Выгрузить();
	   
	   ТЗ.Свернуть("Номенклатура,Упаковка,ВидЦены,Цена,СтавкаНДС,Склад,СрокПоставки,ВариантОбеспечения,СтатусУказанияСерий,ДатаОтгрузки,Характеристика,ХарактеристикаНабора,ВариантОформленияПродажи,КратностьУпаковки","КоличествоУпаковок, Количество");
	   
	   Объект.Товары.Очистить();
	   Для каждого СтрокаТЗ Из ТЗ Цикл
	   	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Серия КАК Серия,
		|	ТоварыНаСкладахОстатки.Серия.Номенклатура КАК СерияНоменклатура,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток,
		|	ТоварыКОтгрузкеОстатки.Склад КАК Склад1,
		|	ТоварыКОтгрузкеОстатки.Номенклатура КАК Номенклатура1,
		|	ТоварыКОтгрузкеОстатки.Серия КАК Серия1,
		|	ТоварыКОтгрузкеОстатки.Серия.Номенклатура КАК СерияНоменклатура1,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыКОтгрузкеОстатки.ВРезервеОстаток ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ТоварыКОтгрузкеОстатки.ВРезервеОстаток
		|		КОНЕЦ) КАК ВРезервеОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток
		|		КОНЕЦ) КАК КОтгрузкеОстаток,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.КОформлениюОстаток ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.КОформлениюОстаток
		|	КОНЕЦ КАК КОформлениюОстаток,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.КСборкеОстаток ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.КСборкеОстаток
		|	КОНЕЦ КАК КСборкеОстаток,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.СобираетсяОстаток ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.СобираетсяОстаток
		|	КОНЕЦ КАК СобираетсяОстаток,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.СобраноОстаток ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.СобраноОстаток
		|	КОНЕЦ КАК СобраноОстаток,
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток - (ТоварыКОтгрузкеОстатки.ВРезервеОстаток + ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток) - ТоварыНаСкладахОстатки.ВРезервеОстаток) КАК Свободно,
		|	ТоварыКОтгрузкеОстатки.Серия.ГоденДо КАК СерияГоденДо,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.Серия.ДатаИзготовления = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТоварыКОтгрузкеОстатки.Серия.Партия_МССО.ДатаПриемногоАкта
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.Серия.ДатаИзготовления
		|	КОНЕЦ КАК ДатаИзготовления,
		|	ТоварыНаСкладахОстатки.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияГоденДо1,
		|	СУММА(ТоварыНаСкладахОстатки.ВРезервеОстаток) КАК ВРезервеОстатокСклад
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, ) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Остатки(, ) КАК ТоварыКОтгрузкеОстатки
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыКОтгрузкеОстатки.Номенклатура
		|			И ТоварыНаСкладахОстатки.Склад = ТоварыКОтгрузкеОстатки.Склад
		|			И ТоварыНаСкладахОстатки.Серия = ТоварыКОтгрузкеОстатки.Серия
		|ГДЕ
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток > 0
		|	И ТоварыНаСкладахОстатки.Склад = &Склад
		|	И ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладахОстатки.Серия.Номенклатура = &Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Серия,
		|	ТоварыНаСкладахОстатки.Серия.Номенклатура,
		|	ТоварыКОтгрузкеОстатки.Склад,
		|	ТоварыКОтгрузкеОстатки.Номенклатура,
		|	ТоварыКОтгрузкеОстатки.Серия,
		|	ТоварыКОтгрузкеОстатки.Серия.Номенклатура,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.КОформлениюОстаток ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.КОформлениюОстаток
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.КСборкеОстаток ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.КСборкеОстаток
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.СобираетсяОстаток ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.СобираетсяОстаток
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.СобраноОстаток ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.СобраноОстаток
		|	КОНЕЦ,
		|	ТоварыКОтгрузкеОстатки.Серия.ГоденДо,
		|	ТоварыНаСкладахОстатки.Серия.Партия_МССО.СрокДействияАнализаТекущий,
		|	ВЫБОР
		|		КОГДА ТоварыКОтгрузкеОстатки.Серия.ДатаИзготовления = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ТоварыКОтгрузкеОстатки.Серия.Партия_МССО.ДатаПриемногоАкта
		|		ИНАЧЕ ТоварыКОтгрузкеОстатки.Серия.ДатаИзготовления
		|	КОНЕЦ";
		
		Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("Склад", СтрокаТЗ.Склад);
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТЗ.Номенклатура);
		//Запрос.УстановитьПараметр("Серия", Серия);
		
		
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		
		
		
		Если РезультатЗапроса.Количество() = 0 Тогда
			Сообщить("Нет в наличии: "+ СтрокаТЗ.Номенклатура+" в кол-ве "+СтрокаТЗ.КоличествоУпаковок+" "+СтрокаТЗ.Упаковка);
			//Сообщение = "";
			//Сообщение = "Нет в наличии: "+ СтрокаТЗ.Номенклатура+" в кол-ве "+СтрокаТЗ.КоличествоУпаковок+" "+СтрокаТЗ.Упаковка;
			//Объект.ОтсутвующиеПозиции = Объект.ОтсутвующиеПозиции+Символы.ПС+Сообщение+Символы.ПС;	
		КонецЕсли; 
		
		Для каждого Строка из РезультатЗапроса Цикл
			//Если (Строка.ВРезервеОстаток+Строка.КОтгрузкеОстаток+Строка.КОформлениюОстаток+Строка.КСборкеОстаток+Строка.СобираетсяОстаток+Строка.СобраноОстаток) = 0 Тогда
			
			Если (Строка.ДатаИзготовления = Null) или (Строка.ДатаИзготовления = Дата(1,1,1)) Тогда
				 Строка.ДатаИзготовления = Строка.Серия.ДатаИзготовления;
			КонецЕсли; 
			 
			Если (Строка.ДатаИзготовления = Null) или (Строка.ДатаИзготовления = Дата(1,1,1)) Тогда
				 Строка.ДатаИзготовления = Строка.Серия.Партия_МССО.ДатаПриемногоАкта;
			КонецЕсли; 
			
			Если (Строка.ВРезервеОстаток+Строка.КОтгрузкеОстаток) = 0 Тогда
				Строка.Свободно = Строка.ВНаличииОстаток - Строка.ВРезервеОстатокСклад;
			КонецЕсли;	
		КонецЦикла;	
		
		//РезультатЗапроса.Сортировать("СерияГоденДо1 Возр");
		РезультатЗапроса.Сортировать("ДатаИзготовления Возр, СерияГоденДо1 Возр");
		
		
		РезультатЗапроса.Сортировать("ДатаИзготовления Возр, СерияГоденДо1 Возр");
		
		
		КоличествоОсталосьСписать = 0;
		КоличествоОсталосьСписать =  СтрокаТЗ.КоличествоУпаковок;
		
		
		Для каждого Строка из РезультатЗапроса Цикл
			
            //Если ((Строка.Номенклатура.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.Семена) И (СтрНайти(Строка.Номенклатура,"Картофель") = 0))  Тогда
            //	//Если Строка.Номенклатура.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.Семена Тогда
            //	СекундДоСрока = Константы.СрокКонтроляДействияАнализа.Получить() *60 * 60 * 24;
            //	ПодошелСрокДатыАнализа = НачалоДня(Объект.Дата+СекундДоСрока);
            //	
            //    Попытка
            //        Если Строка.СерияГоденДо1 < ПодошелСрокДатыАнализа Тогда
            //			Продолжить;
            //		КонецЕсли; 
            //    Исключение
            //        //ОписаниеОшибки()
            //    КонецПопытки; 
            //	
            //КонецЕсли;
			
			
			
			
			Если Строка.Свободно <= 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			
			
			
			Если КоличествоОсталосьСписать = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			
			СтрокаТабличнойЧасти = Объект.Товары.Добавить();
			
			//СтрокаТабличнойЧасти = Объект.Товары.Получить(Индекс);
			//СтрокаТабличнойЧасти.СтатусУказанияСерий = 14;
			
			//ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Строка);
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Строка);
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
			
			СтрокаТабличнойЧасти.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
			
			Списываем = 0;
			
			Если КоличествоОсталосьСписать >= Строка.Свободно Тогда
				Списываем = Строка.Свободно;
			Иначе
				Списываем = КоличествоОсталосьСписать;
			КонецЕсли; 
			
			
			
			Коэффициент = 1;
			Попытка
				//Коэффициент = ПолучитьУпаковкуНаСервере(СтрокаТЗ.Номенклатура,СтрокаТЗ.Номенклатура.ЕдиницаИзмерения);
				Коэффициент = ПолучитьУпаковкуНаСервере(СтрокаТЗ.Номенклатура,СтрокаТЗ.Упаковка);
			Исключение
			    //ОписаниеОшибки()
			КонецПопытки; 
			
			
			
			
			СтрокаТабличнойЧасти.КоличествоУпаковок = Списываем;
			СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.КоличествоУпаковок*Коэффициент;
			
			СтрокаТабличнойЧасти.Номенклатура = СтрокаТЗ.Номенклатура;
			СтрокаТабличнойЧасти.Серия = Строка.Серия;
			СтрокаТабличнойЧасти.СтатусУказанияСерий = 14;
			
			
			СтрокаТабличнойЧасти.ВидЦены  = СтрокаТЗ.ВидЦены;
			СтрокаТабличнойЧасти.Цена  = СтрокаТЗ.Цена;
			СтрокаТабличнойЧасти.СтавкаНДС  = СтрокаТЗ.СтавкаНДС;
			СтрокаТабличнойЧасти.Склад  = СтрокаТЗ.Склад;
			СтрокаТабличнойЧасти.ДатаОтгрузки  = СтрокаТЗ.ДатаОтгрузки;
			СтрокаТабличнойЧасти.ВариантОбеспечения  = СтрокаТЗ.ВариантОбеспечения;
			СтрокаТабличнойЧасти.Характеристика  = СтрокаТЗ.Характеристика;
			СтрокаТабличнойЧасти.ВариантОформленияПродажи  = СтрокаТЗ.ВариантОформленияПродажи;
			
			
			//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);

			КоличествоОсталосьСписать = КоличествоОсталосьСписать - Списываем;
			
		КонецЦикла;
		
		Если КоличествоОсталосьСписать > 0 Тогда
			Сообщить("Недостаточно: "+ СтрокаТЗ.Номенклатура+" в кол-ве "+КоличествоОсталосьСписать+" "+СтрокаТЗ.Номенклатура.ЕдиницаИзмерения+" от первоначального кол-ва в  "+СтрокаТЗ.КоличествоУпаковок+" "+СтрокаТЗ.Номенклатура.ЕдиницаИзмерения);
			
			Сообщение = "";
			Сообщение = "Недостаточно: "+ СтрокаТЗ.Номенклатура+" в кол-ве "+КоличествоОсталосьСписать+" "+СтрокаТЗ.Номенклатура.ЕдиницаИзмерения+" от первоначального кол-ва в  "+СтрокаТЗ.КоличествоУпаковок+" "+СтрокаТЗ.Номенклатура.ЕдиницаИзмерения;
			//Объект.ОтсутвующиеПозиции = Объект.ОтсутвующиеПозиции+Символы.ПС+Сообщение+Символы.ПС;	
			Объект.ОтсутвующиеПозиции = Объект.ОтсутвующиеПозиции+Символы.ПС+Сообщение+" ";	
			СтрокаОП = Объект.ОтсутствующиеПозицииНоменклатуры.Добавить();
			СтрокаОП.Номенклатура = СтрокаТЗ.Номенклатура;
			СтрокаОП.Упаковка = СтрокаТЗ.Номенклатура.ЕдиницаИзмерения;
			СтрокаОП.КоличествоПервоначальное = СтрокаТЗ.КоличествоУпаковок;
			
			СтрокаОП.КоличествоВНаличии = СтрокаТЗ.КоличествоУпаковок - КоличествоОсталосьСписать;
			
			Если СтрокаТЗ.КоличествоУпаковок - КоличествоОсталосьСписать = 0 Тогда
				СтрокаОП.Причина = "Отсутствует на складе";
			Иначе
				СтрокаОП.Причина = "Недостаточно на складе";
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	КонецЦикла;
	
	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");
	УстановитьУсловноеОформление();
КонецПроцедуры
 


///jadmin 10-01-2023 оставил получение цены для опта рег цены
&НаСервере
Функция ПолучитьРегулировануюЦену(Номенклатура,Серия,ВидЦены,ЦенаСтроки)   //рег цены
	
		ЕстьРегулированиеЦен_Строка = Ложь;
		
		Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(Номенклатура,Объект.Дата) = Истина Тогда
			ЕстьРегулированиеЦен_Строка = Истина;
		КонецЕсли; 
		
		
		
		Если ЕстьРегулированиеЦен_Строка = Истина Тогда
			
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор КАК Регистратор,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
			|ГДЕ
			|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
			|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия
			|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена <> 0
			|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены";
			
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			Запрос.УстановитьПараметр("Серия", Серия);
			Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
			Запрос.УстановитьПараметр("Период", Объект.Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Цена = 0;
			
			Если РезультатЗапроса.Пустой() Тогда
				Цена = 0;
			КонецЕсли; 
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Цена = ВыборкаДетальныеЗаписи.Цена;
			КонецЦикла;
			
			Возврат Цена;
		Иначе
			Возврат ЦенаСтроки;
		КонецЕсли; 
			
КонецФункции
 


&НаКлиенте
Процедура ЗаполнитьСерииПо_FIFO_МССО(Команда)
	
	//////////////// БЫЛО ДО 9-10 марта 2020 \\\\\\\\\\\\\\\\\
	
	////	//ЗаполнитьСклад();
	////	
	////Для каждого Строка Из Объект.Товары Цикл
	////	
	////	
	////	Индекс = Строка.НомерСтроки-1;
	////	
	////	Товар = Неопределено;
	////	Товар = Строка.Номенклатура;
	////	Количество = Строка.Количество;
	////	//Индекс = Строка.НомерСтроки-1;
	////	ЗаполнитьСерииПо_FIFO_МССОНаСервере(Товар,Количество,Индекс);
	////	Строка.СтатусУказанияСерий = 14;
	////КонецЦикла; 
	
	
	
	
	
	//////////////// будет действовать с 9-10 марта 2020 \\\\\\\\\\\\\\\\\
	
	//ЗаполнитьСерииПо_FIFO_МССОНаСервере_NEW();
	
	//////////////// будет действовать с 28 января 2022 \\\\\\\\\\\\\\\\\
	
	ЗаполнитьСерииПо_FIFO_МССОСервер();
	
	УстановитьУсловноеОформление();

	
	//
	//Для каждого Строка Из Объект.Товары Цикл
	//	Строка.СтатусУказанияСерий = 14;
	//	
	//	
	//	ТекущаяСтрока = Строка;
	//	
	//	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
	//	
	//	СтруктураДействий = Новый Структура;
	//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
	//	Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
	//		СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
	//	Иначе
	//		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
	//	КонецЕсли;
	//	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
	//	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	//	СтруктураДействий.Вставить("ПересчитатьСумму");
	//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
	//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
	//	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	//	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	//	СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
	//	СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
	//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	//	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	//	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
	//	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
	//	ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
	//	СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
	//	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
	//		Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
	//	
	//	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	//		ЭтаФорма.ИмяФормы, "Товары"));

	//	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	//	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
	//	
	//	
	//	Строка.Цена = ПолучитьРегулировануюЦену(Строка.Номенклатура,Строка.Серия,Строка.ВидЦены, Строка.Цена);
	//	Строка.ЦенаСоСкидкой = Строка.Цена;
	//	
	//	Строка.ВидЦены = Строка.ВидЦены;
	//	
	//КонецЦикла; 
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);

	СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);

	
	ПрименитьСкидку("ТоварыОткрытьПодбор");	 /////// идет доп. пересчет ТЧ
	
	УстановитьВидимостьЭлементовФормыДатОтгрузки();
	//////ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);        //////// запись формы автоматом после заполнения партий
	//////ЭтаФорма.ОбновитьОтображениеДанных();
	//////Модифицированность = Истина;

	
КонецПроцедуры




&НаКлиенте
Процедура ЗаполнитьСерииПо_FIFO_МССО_БЛОГОТВОРИТЕЛЬНОСТЬ(Команда)
	
	//////////////// БЫЛО ДО 9-10 марта 2020 \\\\\\\\\\\\\\\\\
	
	////	//ЗаполнитьСклад();
	////	
	////Для каждого Строка Из Объект.Товары Цикл
	////	
	////	
	////	Индекс = Строка.НомерСтроки-1;
	////	
	////	Товар = Неопределено;
	////	Товар = Строка.Номенклатура;
	////	Количество = Строка.Количество;
	////	//Индекс = Строка.НомерСтроки-1;
	////	ЗаполнитьСерииПо_FIFO_МССОНаСервере(Товар,Количество,Индекс);
	////	Строка.СтатусУказанияСерий = 14;
	////КонецЦикла; 
	
	
	
	
	
	//////////////// будет действовать с 9-10 марта 2020 \\\\\\\\\\\\\\\\\
	
	ЗаполнитьСерииПо_FIFO_МССОНаСервере_NEW_БЛОГОТВОРИТЕЛЬНОСТЬ();
	
	Для каждого Строка Из Объект.Товары Цикл
		Строка.СтатусУказанияСерий = 14;
		
		
		ТекущаяСтрока = Строка;
		
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
		Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Объект.Соглашение) Тогда
			СтруктураДействий.Вставить("ЗаполнитьУсловияПродаж", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект));
		Иначе
			СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
		КонецЕсли;
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
		СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
		ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		
		СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			ЭтаФорма.ИмяФормы, "Товары"));

		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);
		
		
		
		
		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
		
		СкидкиНаценкиКлиент.СброситьФлагСкидкиРассчитаны(ЭтаФорма);
		
	КонецЦикла; 
	
	
	
	ПрименитьСкидку("ТоварыОткрытьПодбор");	 /////// идет доп. пересчет ТЧ
	
	УстановитьВидимостьЭлементовФормыДатОтгрузки();
	//////ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);        //////// запись формы автоматом после заполнения партий
	//////ЭтаФорма.ОбновитьОтображениеДанных();
	//////Модифицированность = Истина;

	
КонецПроцедуры


&НаСервере
Процедура СравнитьТЧНаСервере(ТабДок)
	
	
	
	ТаблицаДо = Объект.Товары.Выгрузить();
	ТаблицаПосле = Объект.ТоварыДоКорректировкиОрдером.Выгрузить();	

	//ТаблицаДо = Объект.ТоварыДоКорректировкиОрдером.Выгрузить();
	//ТаблицаПосле = Объект.Товары.Выгрузить();	
	
	
  	ТаблицаДо.Свернуть("Номенклатура,Серия","КоличествоУпаковок");
  	ТаблицаПосле.Свернуть("Номенклатура,Серия","КоличествоУпаковок");

	
	  ТекстЗапроса="Выбрать ";    
	    
	    для каждого эл из ТаблицаДо.Колонки цикл
	        если эл.Имя="КлючСтроки" тогда
	            продолжить;
	        конецесли;
	        ТекстЗапроса = ТекстЗапроса +"
	        | ТТДо."+эл.Имя+",";
	    конеццикла;
	    ТекстЗапроса=Лев(ТекстЗапроса,стрдлина(ТекстЗапроса)-1);
	    ТекстЗапроса = ТекстЗапроса+"
	    |поместить ТаблоДо 
	    |из 
	    |    &ТабДо как ТТДо
	    |;    
	    |Выбрать";
	    для каждого эл из ТаблицаДо.Колонки цикл
	        если эл.Имя="КлючСтроки" тогда
	            продолжить;
	        конецесли;
	        
	        ТекстЗапроса = ТекстЗапроса +"
	        | ТТПосле."+эл.Имя+",";
	    конеццикла;
	    ТекстЗапроса=Лев(ТекстЗапроса,стрдлина(ТекстЗапроса)-1);    
	    ТекстЗапроса = ТекстЗапроса+"
	    |поместить ТаблоПосле 
	    |из 
	    |    &ТабПосле как ТТПосле
	    |;
	    |выбрать" ;
	    для каждого эл из ТаблицаДо.Колонки цикл
	        если эл.Имя="КлючСтроки" тогда
	            продолжить;
	        конецесли;
	        
	        ТекстЗапроса = ТекстЗапроса +"
	        | Сборочный."+эл.Имя+",";
	    конеццикла;
	    ТекстЗапроса = ТекстЗапроса+"
	    | ЕстьNULL(сумма(Сборочный.Контроль),0) как Контроль
	    |из 
	    |    (
	    |выбрать " ;
	    для каждого эл из ТаблицаДо.Колонки цикл
	        если эл.Имя="КлючСтроки" тогда
	            продолжить;
	        конецесли;
	        
	        ТекстЗапроса = ТекстЗапроса +"
	        | ТаблоДо."+эл.Имя+",";
	    конеццикла;
	    ТекстЗапроса = ТекстЗапроса+"
	    |   -1 как Контроль
	    | из  ТаблоДо как ТаблоДо
	    |     
	    |Объединить все
	    |
	    | Выбрать ";
	    для каждого эл из ТаблицаДо.Колонки цикл
	        если эл.Имя="КлючСтроки" тогда
	            продолжить;
	        конецесли;
	        
	        ТекстЗапроса = ТекстЗапроса +"
	        | ТаблоПосле."+эл.Имя+",";
	    конеццикла;
	    ТекстЗапроса = ТекстЗапроса+"
	    |   1
	    | из  ТаблоПосле как ТаблоПосле
	    | ) как Сборочный
	    | сгруппировать по";
	    для каждого эл из ТаблицаДо.Колонки цикл
	        если эл.Имя="КлючСтроки" тогда
	            продолжить;
	        конецесли;
	        
	        ТекстЗапроса = ТекстЗапроса +"
	        | Сборочный."+эл.Имя+",";
	    конеццикла;
	    ТекстЗапроса=Лев(ТекстЗапроса,стрдлина(ТекстЗапроса)-1);    
	    
	    запр = новый Запрос(ТекстЗапроса);
	    
	    Запр.УстановитьПараметр("ТабДо",ТаблицаДо);
	    Запр.УстановитьПараметр("ТабПосле",ТаблицаПосле);
	    
	    ВЫЗаДН = запр.Выполнить().Выгрузить();
	    ТаблицаРасхождений=ВЫЗаДН.Скопировать();
		
		НулевыеСтроки = ТаблицаРасхождений.НайтиСтроки(Новый Структура("Контроль",0));
		Для каждого СтрокаТаблицы Из НулевыеСтроки Цикл
			ТаблицаРасхождений.Удалить(СтрокаТаблицы);
		КонецЦикла;	
		
	    ТаблицаРасхождений_=ТаблицаРасхождений.Скопировать();
		
		Строки_1 = ТаблицаРасхождений.НайтиСтроки(Новый Структура("Контроль",1));
		Для каждого СтрокаТаблицы Из Строки_1 Цикл
			ТаблицаРасхождений.Удалить(СтрокаТаблицы);
		КонецЦикла;	
		
		
		Если Объект.Товары.Количество() <= Объект.ТоварыДоКорректировкиОрдером.Количество()  Тогда
			Строки_1 = ТаблицаРасхождений_.НайтиСтроки(Новый Структура("Контроль",-1));
			Для каждого СтрокаТаблицы Из Строки_1 Цикл
				ТаблицаРасхождений_.Удалить(СтрокаТаблицы);
			КонецЦикла;	
		КонецЕсли; 
		
		//Строки_1 = ТаблицаРасхождений_.НайтиСтроки(Новый Структура("Контроль",-1));
		//Для каждого СтрокаТаблицы Из Строки_1 Цикл
		//	ТаблицаРасхождений_.Удалить(СтрокаТаблицы);
		//КонецЦикла;	
		
		
		
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
		ТабДок.АвтоМасштаб = Истина;
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.ОтображатьЗаголовки = Ложь;
		ТабДок.ТолькоПросмотр = Истина;	
		Макет = ПолучитьМакетНаСервере("Расхождения");
		
		ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
		
		Заголовок = ""+Объект.Ссылка+" расхождения после корректировки складским ордером";
		ОбластьШапка.Параметры.Заголовок = Заголовок;
		ТабДок.Вывести(ОбластьШапка);

		//Для каждого Строка Из ТаблицаРасхождений_  Цикл
		//	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
		//	
		//	ОбластьСтрока.Параметры.НоменклатураДО = Строка.Номенклатура;
		//	ОбластьСтрока.Параметры.СерияДО = Строка.Серия;
		//	ОбластьСтрока.Параметры.КоличествоДО = Строка.КоличествоУпаковок;
		//	
		//	НайденнаяСтрока = ТаблицаРасхождений.Найти(Строка.Номенклатура);
		//	
		//	Если НайденнаяСтрока <> Неопределено Тогда
		//		ОбластьСтрока.Параметры.НоменклатураПОСЛЕ = НайденнаяСтрока.Номенклатура;
		//		ОбластьСтрока.Параметры.СерияПОСЛЕ = НайденнаяСтрока.Серия;
		//		ОбластьСтрока.Параметры.КоличествоПОСЛЕ = НайденнаяСтрока.КоличествоУпаковок;
		//	Иначе
		//		ОбластьСтрока.Параметры.НоменклатураПОСЛЕ = "";
		//		ОбластьСтрока.Параметры.СерияПОСЛЕ = "";
		//		ОбластьСтрока.Параметры.КоличествоПОСЛЕ = 0;
		//	КонецЕсли;

		//	Попытка
		//		Если НайденнаяСтрока.Контроль = -1 Тогда
		//			//ОбластьСтрока.Параметры.НоменклатураДО = "";
		//			//ОбластьСтрока.Параметры.СерияДО = "";
		//			//ОбластьСтрока.Параметры.КоличествоДО = 0;
		//		КонецЕсли; 
		//	Исключение
		//	    //ОписаниеОшибки()
		//	КонецПопытки; 
		//	
		//	
		//	Расхождение  = ОбластьСтрока.Параметры.КоличествоПОСЛЕ - ОбластьСтрока.Параметры.КоличествоДО;
		//	//Расхождение  = ОбластьСтрока.Параметры.КоличествоДО - ОбластьСтрока.Параметры.КоличествоПОСЛЕ ;
		//	ОбластьСтрока.Параметры.Расхождение = Расхождение;
		//	
		//	ТабДок.Вывести(ОбластьСтрока);
		
		
		ПоследняяCтрока = 0; //1                              jadmin
		
		Для каждого Строка Из ТаблицаРасхождений_  Цикл
			ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
			
			ОбластьСтрока.Параметры.НоменклатураДО = Строка.Номенклатура;
			ОбластьСтрока.Параметры.СерияДО = Строка.Серия;
			ОбластьСтрока.Параметры.КоличествоДО = Строка.КоличествоУпаковок;
			
			НайденнаяСтрока = ТаблицаРасхождений.Найти(Строка.Номенклатура);
			
			Если НайденнаяСтрока <> Неопределено Тогда
				ОбластьСтрока.Параметры.НоменклатураПОСЛЕ = НайденнаяСтрока.Номенклатура;
				ОбластьСтрока.Параметры.СерияПОСЛЕ = НайденнаяСтрока.Серия;
				ОбластьСтрока.Параметры.КоличествоПОСЛЕ = НайденнаяСтрока.КоличествоУпаковок;
			Иначе
				ОбластьСтрока.Параметры.НоменклатураПОСЛЕ = "";
				ОбластьСтрока.Параметры.СерияПОСЛЕ = "";
				ОбластьСтрока.Параметры.КоличествоПОСЛЕ = 0;
			КонецЕсли;
			
			Попытка
				Если НайденнаяСтрока.Контроль = -1 Тогда
					//ОбластьСтрока.Параметры.НоменклатураДО = "";
					//ОбластьСтрока.Параметры.СерияДО = "";
					//ОбластьСтрока.Параметры.КоличествоДО = 0;
				КонецЕсли; 
			Исключение
				//ОписаниеОшибки()
			КонецПопытки; 
			
			
			Расхождение  = ОбластьСтрока.Параметры.КоличествоПОСЛЕ - ОбластьСтрока.Параметры.КоличествоДО;
			//Расхождение  = ОбластьСтрока.Параметры.КоличествоДО - ОбластьСтрока.Параметры.КоличествоПОСЛЕ ;
			ОбластьСтрока.Параметры.Расхождение = Расхождение;
			
			ТабДок.Вывести(ОбластьСтрока);
			
			ПоследняяCтрока = ПоследняяCтрока+1;          //1       jadmin
			
			
		КонецЦикла;
		
		// объединение ячеек jadmin
		НомерСтроки = 0;
		НомерЯчейки = 5;
		Для Строка=6 По ПоследняяCтрока+5 Цикл
			НомерСтроки = Строка;
			Если ЗначениеЗаполнено(ТабДок.Область(НомерСтроки,НомерЯчейки).Текст)
			И ТабДок.Область(НомерСтроки,НомерЯчейки).Текст=ТабДок.Область(НомерСтроки+1,НомерЯчейки).Текст
			И ТабДок.Область(НомерСтроки,НомерЯчейки+1).Текст=ТабДок.Область(НомерСтроки+1,НомерЯчейки+1).Текст Тогда 
				ТабДок.Область(НомерСтроки,НомерЯчейки,НомерСтроки+1,НомерЯчейки).Объединить();
				ТабДок.Область(НомерСтроки,НомерЯчейки+1,НомерСтроки+1,НомерЯчейки+1).Объединить();
				ТабДок.Область(НомерСтроки,НомерЯчейки+2,НомерСтроки+1,НомерЯчейки+2).Объединить();
			Иначе
				Продолжить;
			КонецЕсли;	
		КонецЦикла;		
	  ///////	
		
		
КонецПроцедуры

&НаКлиенте
Процедура СравнитьТЧ(Команда)
	
		
	Если Объект.ТоварыДоКорректировкиОрдером.Количество() = 0 Тогда
		ПоказатьПредупреждение(,
        "Заказ не изменялся.",0, "Предупреждение" );
		//Сообщить("Заказ не изменялся.");
		Возврат;
	КонецЕсли; 
	
	ТабДок = Новый ТабличныйДокумент;
	СравнитьТЧНаСервере(ТабДок);
	ТабДок.Показать("Отчет о расхождениях");
КонецПроцедуры



&НаКлиенте
Процедура Печать_Отбор(ИдентификаторКоманды, ТабДок) Экспорт
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
    //Типовая часть вывода в стандартное окно++
    ИдентификаторПечатнойФормы = "ЗаданиеНаОтборРазмещениеТовара";
    НазваниеПечатнойФормы = НСтр("ru = 'Задание на отбор товара'");
    
    Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
        ТабДок.Показать(НазваниеПечатнойФормы);
        ДокументыПечатались = Истина;
        Возврат;
    КонецЕсли;     
    МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
    КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
    ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
    ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
    ПечатнаяФорма.ТабличныйДокумент = ТабДок;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
    
    ОбластиОбъектов = Новый СписокЗначений;
    МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

    ДокументыПечатались = Истина;
КонецПроцедуры


&НаСервере
Процедура ПечатьЗаданиеНаОтборТовараНаСервере(ТабДок)
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;	
	
	Макет = ПолучитьМакетНаСервере("ЗаданиеНаОтборРазмещениеТовара");
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ТекстЗаголовка = "";
	//ТекстЗаголовка = "Задание на отбор "+" "+Объект.Ссылка.Склад;
	ТекстЗаголовка = "Задание на отбор";
	
	ПредставлениеРаспоряжения = "";
	ПредставлениеРаспоряжения = ""+Объект.Ссылка+"    ("+Объект.Ссылка.Контрагент+")";
	
	ПредставлениеСклада = "";
	ПредставлениеСклада = Объект.Ссылка.Склад;
	
	
	ОбластьШапка.Параметры.ТекстЗаголовка =  ТекстЗаголовка;
	ОбластьШапка.Параметры.ПредставлениеРаспоряжения =  ПредставлениеРаспоряжения;
	ОбластьШапка.Параметры.ПредставлениеСклада =  ПредставлениеСклада;
	
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	
	ТЗ_Товары = Новый ТаблицаЗначений;
	ТЗ_Товары = Объект.Товары.Выгрузить();
	ТЗ_Товары.Свернуть("Номенклатура,Серия","КоличествоУпаковок");
	
	
	
	НомерСтроки = 0;
	//Для каждого Строка Из Объект.Товары Цикл
	  Для каждого Строка Из ТЗ_Товары Цикл
		
		НомерСтроки = НомерСтроки+1;	
		ОбластьСтрока  = Макет.ПолучитьОбласть("СтрокаТаблицы");
		
		ОбластьСтрока.Параметры.НомерСтроки =  НомерСтроки;
		
		ТоварНаим = Строка.Номенклатура;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ШтрихкодыНоменклатуры.Штрихкод,
			|	ШтрихкодыНоменклатуры.Номенклатура
			|ИЗ
			|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ШтрихКод = ВыборкаДетальныеЗаписи.Штрихкод;
		КонецЦикла;
		
		
		Если ШтрихКод  = "" Тогда
			 Если Строка.Номенклатура.Ссылка.ШКДляДжестори.Код <> 0 Тогда
			 	 Штрихкод = Формат(Строка.Номенклатура.Ссылка.ШКДляДжестори.Код,"ЧГ=0");
			 КонецЕсли; 
			 
			 Сообщить("Строка № "+НомерСтроки+"   "+Строка.Номенклатура+"    не заполнен штрих-код");
			 
		КонецЕсли; 
		
		
		ОбластьСтрока.Параметры.Товар = ""+ТоварНаим+"     "+ШтрихКод;
		ОбластьСтрока.Параметры.Партия =  Строка.Серия;
		
		
		Партия_МССО_Ссылка = Строка.Серия.Партия_МССО.Ссылка;
		
		СрокДействияАнализа = "";
		Если Партия_МССО_Ссылка.Анализы.Количество() > 0 Тогда
			Для Каждого СтрокаАнализы Из Партия_МССО_Ссылка.Анализы Цикл 
				СрокДействияАнализаЕсть = СтрокаАнализы.СрокДействияАнализа;
				
					Если НЕ ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
						Продолжить;
					КонецЕсли;

					Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
						СрокДействияАнализа = ""+Формат(СрокДействияАнализаЕсть,"ДЛФ=D");
					Иначе
						СрокДействияАнализа = "";
					КонецЕсли;
			КонецЦикла;
		Иначе
				СрокДействияАнализаЕсть = Партия_МССО_Ссылка.СрокДействияАнализа;
					Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
						СрокДействияАнализа = ""+Формат(СрокДействияАнализаЕсть,"ДЛФ=D");
					Иначе
						СрокДействияАнализа = "";
					КонецЕсли;
		КонецЕсли;
		
		ОбластьСтрока.Параметры.СрокАнализа =  СрокДействияАнализа;
		ОбластьСтрока.Параметры.КоличествоУпаковок =  Строка.КоличествоУпаковок;
		ОбластьСтрока.Параметры.ПредставлениеЕдининицыИзмеренияУпаковки =  Строка.Номенклатура.ЕдиницаИзмерения;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗаданиеНаОтборТовара(Команда)
	
	ОчиститьСообщения();	
	
	ТабДок = Новый ТабличныйДокумент;
	ПечатьЗаданиеНаОтборТовараНаСервере(ТабДок);
	
	Печать_Отбор(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	
	//ТабДок.Показать("");
	
КонецПроцедуры


Функция ПолучитьКоличествоВНаборе(Номенклатура) 
	КолВоВНаборе = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
		|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
		|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("Н-р для опта",ИСТИНА));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолВоВНаборе = ВыборкаДетальныеЗаписи.Числитель;
	КонецЦикла;   
	
	Если РезультатЗапроса.Пустой() Тогда
	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
			|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|ГДЕ
			|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
			|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения
			|	И УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Владелец", Номенклатура);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("упак",ИСТИНА));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КолВоВНаборе = ВыборкаДетальныеЗаписи.Числитель;
		КонецЦикла; 
   		
	КонецЕсли;

	
	Возврат КолВоВНаборе;
КонецФункции


&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)     ///////77w qaws
	// SWI jadmin
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Попытка
		ТекущаяСтрока.КратностьУпаковки = ПолучитьКоличествоВНаборе(ТекущаяСтрока.Номенклатура);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки;  
	
	Если ТекущаяСтрока <> Неопределено Тогда
		Если СВ_РасчетныйНДС Тогда
			НДС = 0;
			СуммаСкидкиОбщаяСНДС = 0;
			ЦенаСоСкидкойСНДС = 0;
			НДССоСкидкой = 0;
			Цена = ОбщийМодуль77w.ПолучитьЦенуНаСервере_Розница(ТекущаяСтрока.Номенклатура,ТекущаяСтрока.Серия,Объект.Дата);
			Попытка
				
				ЦенаСоСкидкойСНДС =  Окр(Цена * (1-ТекущаяСтрока.ПроцентАвтоматическойСкидки/100) * (1-ТекущаяСтрока.ПроцентРучнойСкидки/100),2);
				
				Если ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
					НДС = Окр(Цена /6 , 2, РежимОкругления.Окр15как20);
				ИначеЕсли ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
					НДС = Окр(Цена /11 , 2, РежимОкругления.Окр15как20);	
				Иначе
					НДС = 0;
				КонецЕсли;
				
				Если ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
					НДССоСкидкой = Окр(ЦенаСоСкидкойСНДС /6 , 2, РежимОкругления.Окр15как20);
				ИначеЕсли ТекущаяСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
					НДССоСкидкой = Окр(ЦенаСоСкидкойСНДС /11 , 2, РежимОкругления.Окр15как20);	
				Иначе
					НДССоСкидкой = 0;
				КонецЕсли;

				
					ТекущаяСтрока.Цена = Окр((Цена - НДС),2);
					////ТекущаяСтрока.ЦенаСоСкидкой = ТекущаяСтрока.Цена;
					//ТекущаяСтрока.ЦенаСоСкидкой = Окр(ТекущаяСтрока.Цена * (1-ТекущаяСтрока.ПроцентАвтоматическойСкидки/100) * (1-ТекущаяСтрока.ПроцентРучнойСкидки/100),2);
					ТекущаяСтрока.ЦенаСоСкидкой = Окр((ЦенаСоСкидкойСНДС - НДССоСкидкой),2);
					
					ТекущаяСтрока.ПроцентРучнойСкидки = 0;
					ТекущаяСтрока.СуммаРучнойСкидки = 0;
					ТекущаяСтрока.ПроцентАвтоматическойСкидки = 0;
					ТекущаяСтрока.СуммаАвтоматическойСкидки = 0;
					
					ТекущаяСтрока.СуммаНДС = Окр(НДССоСкидкой * ТекущаяСтрока.КоличествоУпаковок,2);
					
					ТекущаяСтрока.Сумма = ТекущаяСтрока.ЦенаСоСкидкой * ТекущаяСтрока.КоличествоУпаковок;	

					ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Сумма + ТекущаяСтрока.СуммаНДС;

				Исключение
				КонецПопытки;
			ИначеЕсли ПолучитьТипСклада(Объект.Склад) = ПредопределенноеЗначение("Перечисление.ТипыСкладов.ОптовыйСклад") Тогда    //jadmin РегЦены
				
				ТекущаяСтрока.Цена = ПолучитьРегулировануюЦену(ТекущаяСтрока.Номенклатура,ТекущаяСтрока.Серия,ТекущаяСтрока.ВидЦены,ТекущаяСтрока.Цена); //jadmin		

		КонецЕсли;
	КонецЕсли;
	
	РазукраситьТоварыНаСервере();
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма); 
	
КонецПроцедуры

&НаСервере
Процедура РазукраситьТоварыНаСервере()
	ТЧ = Объект.Товары.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВнешнийИсточник.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_ВнешнийИсточник
	               |ИЗ
	               |	&ТЧ КАК ВнешнийИсточник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВнешнийИсточник.Номенклатура КАК Номенклатура,
	               |	СУММА(1) КАК КолВо
	               |ПОМЕСТИТЬ ТАБ
	               |ИЗ
	               |	ВТ_ВнешнийИсточник КАК ВТ_ВнешнийИсточник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВнешнийИсточник.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТАБ.Номенклатура КАК Номенклатура,
	               |	ТАБ.КолВо КАК КолВо
	               |ИЗ
	               |	ТАБ КАК ТАБ
	               |ГДЕ
	               |	ТАБ.КолВо > 1
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТАБ.Номенклатура,
	               |	ТАБ.КолВо";    
	
	  Запрос.УстановитьПараметр("ТЧ",ТЧ);
	  
	  РезультатЗапроса = Запрос.Выполнить();
	  
	  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	  
	  Ном = 0;
	  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	      Ном = Ном + 1;
		  НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",ВыборкаДетальныеЗаписи.Номенклатура));
		  
		  Для каждого стрНайд Из НайденныеСтроки Цикл
		  
		  	  стрНайд.Ном = Ном;
		  
		  КонецЦикла;
	     
	  КонецЦикла;  
	  	  
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьУпаковкамиНаСервере()
	Для каждого СтрокаТовары Из Объект.Товары Цикл
		
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
			|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
			|	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
			|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
			|	УпаковкиЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|ГДЕ
			|	УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ
			|	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец ";
			//|	И УпаковкиЕдиницыИзмерения.Владелец.ДвеЦеныВЦеннике = ИСТИНА";
			
			//Запрос.УстановитьПараметр("Владелец", СтрокаТовары.Номенклатура);
			
			Если СтрокаТовары.Номенклатура.НаборУпаковок = ПредопределенноеЗначение("Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры") Тогда
				Запрос.УстановитьПараметр("Владелец", СтрокаТовары.Номенклатура);
			Иначе
				Запрос.УстановитьПараметр("Владелец", СтрокаТовары.Номенклатура.НаборУпаковок);
			КонецЕсли;	
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			

		Если Объект.ТоварыДоКорректировкиОрдером.Количество() = 0  Тогда
			
			Коэффициент = 1;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если Найти(ВыборкаДетальныеЗаписи.Ссылка.Наименование, "упак") = 1 Тогда
					Коэффициент = 1;
					Коэффициент = ВыборкаДетальныеЗаписи.Числитель;
					СтрокаТовары.Упаковка = ВыборкаДетальныеЗаписи.Ссылка;
					СтрокаТовары.Количество = СтрокаТовары.КоличествоУпаковок*Коэффициент;
				КонецЕсли; 
				
			КонецЦикла;
			
		Иначе      ////////////////  после расхождений при сборке складом
			
			Коэффициент = 1;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если Найти(ВыборкаДетальныеЗаписи.Ссылка.Наименование, "упак") = 1 Тогда
					Коэффициент = 1;
					Коэффициент = ВыборкаДетальныеЗаписи.Числитель;
					СтрокаТовары.Упаковка = ВыборкаДетальныеЗаписи.Ссылка;
					КоличествоПервоначальноеШТ = 0;
					КоличествоПервоначальноеШТ = СтрокаТовары.КоличествоУпаковок;
					Если Коэффициент <> 0 Тогда
						СтрокаТовары.КоличествоУпаковок = КоличествоПервоначальноеШТ/Коэффициент;
						СтрокаТовары.Количество = КоличествоПервоначальноеШТ;
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли; 
	
			
	КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУпаковками(Команда)
	ЗаполнитьУпаковкамиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаНеОсуществляетсяПриИзменении(Элемент)
	ОтгрузкаНеОсуществляетсяВыделитьЦветом();
КонецПроцедуры


#КонецОбласти


#Область Доработки
////
&НаСервере
Процедура СоглашениеВыборСервер(Соглашение)
	Если ЗначениеЗаполнено(Соглашение) Тогда
		//Если Соглашение.СВ_РасчетныйНДС Тогда
			//СВ_РасчетныйНДСЗначение = ПолучитьРасчетныйНДС(Объект.Дата);
		//КонецЕсли;
		
		УстановитьВидимостьРасчетныйНДС(Соглашение.СВ_РасчетныйНДС);
		ОбработкаВыбораСервер(); //j
	КонецЕсли;	
КонецПроцедуры
////
&НаСервере
Функция ПолучитьРасчетныйНДС(ДатаОтчета)
	НДСЗначение = 0;
	
	Запрос = Новый Запрос;			
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаОтчета));
			
	Запрос.Текст = "ВЫБРАТЬ
	|					НДС					
	|				ИЗ
	|					РегистрСведений.СВ_РасчетныйНДС.СрезПоследних(&ДатаКон)";
			
	РезЗпр = Запрос.Выполнить().Выбрать();
	Пока РезЗпр.Следующий() Цикл
		НДСЗначение = РезЗпр.НДС;		
	КонецЦикла;
	
	Возврат НДСЗначение;
КонецФункции
////
&НаСервере
Функция ПолучитьТипНДС()
    Возврат Перечисления.СтавкиНДС.Расчетная;
КонецФункции

////
&НаСервере
Процедура УстановитьВидимостьРасчетныйНДС(Видимость)
	СВ_РасчетныйНДС = Видимость;
	Элементы.ПолеРасчетныйНДС.Видимость = Видимость;
	//Элементы.ПолеРасчетныйНДСЗначение.Видимость = Видимость;
	
	Если Видимость Тогда
		ЦенаВключаетНДС = Ложь;
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	Иначе
		ЦенаВключаетНДС = Истина;
		//НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;

	КонецЕсли;
КонецПроцедуры
////
&НаКлиенте
Процедура ПолеРасчетныйНДСПриИзменении(Элемент)
	ПолеРасчетныйНДСПриИзмененииНаСервере();
КонецПроцедуры 
////
&НаСервере
Процедура ПолеРасчетныйНДСПриИзмененииНаСервере()
	УстановитьВидимостьРасчетныйНДС(СВ_РасчетныйНДС);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСебестоимостиНаСервере()
			
		ТЗ = Объект.Товары.Выгрузить();
		
		ТЗ.Свернуть("Склад, Номенклатура,Серия,Цена,СтавкаНДС,СтатусУказанияСерий,ЦенаСоСкидкой,ДатаОтгрузки, Отменено,ВариантОбеспечения,СрокПоставки","КоличествоУпаковок,Количество,Сумма,СуммаНДС,СуммаСНДС");
		
		Объект.Товары.Загрузить(ТЗ);
	
	Для каждого Строка Из Объект.Товары Цикл
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
		|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Серия КАК АналитикаУчетаНоменклатурыСерия,
		|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Склад КАК АналитикаУчетаНоменклатурыСклад,
		|	СебестоимостьТоваровОстатки.КоличествоОстаток КАК Количество,
		|	СебестоимостьТоваровОстатки.СтоимостьРеглОстаток КАК СтоимостьРегл
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров.Остатки(&Период, ) КАК СебестоимостьТоваровОстатки
		|ГДЕ
		|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
		|	И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Серия = &Серия
		|	И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Склад = &Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
		|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Серия,
		|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Склад,
		|	СебестоимостьТоваровОстатки.КоличествоОстаток,
		|	СебестоимостьТоваровОстатки.СтоимостьРеглОстаток";
	
		Запрос.УстановитьПараметр("Период", Объект.Дата);
		
		Запрос.УстановитьПараметр("Склад", Объект.Склад);
		Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
		Запрос.УстановитьПараметр("Серия", Строка.Серия);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		СебестоимостьИзРегистра = 0;
		КоличествоИзРегистра = 0;
		
		
		Пока РезультатЗапроса.Следующий() Цикл
			СебестоимостьИзРегистра = РезультатЗапроса.СтоимостьРегл;///////+РезультатЗапроса.СуммаДопРасходовБезНДС;
			КоличествоИзРегистра    = РезультатЗапроса.Количество;
		КонецЦикла; 
		
		СтоимостьЕдТовара = 0;
		Если КоличествоИзРегистра <> 0 Тогда
			СтоимостьЕдТовара =  СебестоимостьИзРегистра/КоличествоИзРегистра;
		КонецЕсли; 
		
		
		Строка.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
		Строка.Цена = Окр(СтоимостьЕдТовара,2);
		Строка.ЦенаСоСкидкой = Строка.Цена;
		
		
		Строка.СуммаРучнойСкидки = 0;
		Строка.ПроцентРучнойСкидки = 0;
		
		Если Окр(СтоимостьЕдТовара,2) = 0 Тогда
		
			Строка.Сумма = Окр(СтоимостьЕдТовара * Строка.КоличествоУпаковок,2);
		
		КонецЕсли; 
		
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСебестоимости(Команда)
	ЗаполнитьПоСебестоимостиНаСервере();
	ПолучитьРазмерСкидки("");
	//ПрименитьСкидку("Цена");       ////////77w qaws
	//ТоварыСуммаРучнойСкидкиПриИзменении("СуммаРучнойСкидки");
	ПрименитьСкидку("");       ////////77w qaws
	ТоварыСтавкаНДСПриИзменении("СтавкаНДС");
	//
	//Для каждого Строка Из Объект.Товары Цикл
	//	ПрименитьСкидку("");       ////////77w qaws
	//	ТоварыСтавкаНДСПриИзменении("СтавкаНДС");
	//КонецЦикла; 	
	//
	Для каждого Строка Из Объект.Товары Цикл
		Строка.СтатусУказанияСерий = 14;
		
		
		ТекущаяСтрока = Строка;
		
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
		
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
		СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
		ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		
		СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			ЭтаФорма.ИмяФормы, "Товары"));
			
		Если Строка.Цена <> 0 Тогда

			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		Иначе	
			
		     Строка.СтатусУказанияСерий = 14;
			 Строка.Цена = 0.01;
			 Строка.ЦенаСоСкидкой = 0.01;

			 Если Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
				 Строка.СуммаНДС = Окр(Строка.Сумма * 0.2,2);  
			 ИначеЕсли Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда	
				 Строка.СуммаНДС = Окр(Строка.Сумма * 0.1,2); 
			 Иначе
				 Строка.СуммаНДС = 0;
			 КонецЕсли; 
			 
			 Строка.СуммаСНДС = Строка.Сумма + Строка.СуммаНДС;
			 Строка.СуммаРучнойСкидки = 0;
			 Строка.СуммаАвтоматическойСкидки = 0;
			 Строка.ПроцентАвтоматическойСкидки = 0;
			 Строка.ПроцентРучнойСкидки = 0;
			 
 
			 СтруктураДействий = Новый Структура;
			 СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
			 СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
			 СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			 СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
			 
			 СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
			 СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
			 СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			 СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			 //СтруктураДействий.Вставить("ПересчитатьСумму");
			 СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
			 СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
			 СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
			 СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
			 СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
			 СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
			 СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
			 СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
			 СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
			 СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
			 ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
			 СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
			 СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			 Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
			 
			 СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			 ЭтаФорма.ИмяФормы, "Товары"));
			 
			 ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
			 Строка.ЦенаСоСкидкой = 0.01;
			 
			 
		 КонецЕсли;

	КонецЦикла; 
	
		ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);

		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоСебестоимостиНаКлиенте()
	ЗаполнитьПоСебестоимостиНаСервере();
	ПолучитьРазмерСкидки("");
	//ПрименитьСкидку("Цена");       ////////77w qaws
	//ТоварыСуммаРучнойСкидкиПриИзменении("СуммаРучнойСкидки");
	ПрименитьСкидку("");       ////////77w qaws
	ТоварыСтавкаНДСПриИзменении("СтавкаНДС");
	//
	//Для каждого Строка Из Объект.Товары Цикл
	//	ПрименитьСкидку("");       ////////77w qaws
	//	ТоварыСтавкаНДСПриИзменении("СтавкаНДС");
	//КонецЦикла; 	
	//
	Для каждого Строка Из Объект.Товары Цикл
		Строка.СтатусУказанияСерий = 14;
		
		
		ТекущаяСтрока = Строка;
		
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
		СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
		СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
		
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
		СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
		ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
		СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
		СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
		
		СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			ЭтаФорма.ИмяФормы, "Товары"));
			
		Если Строка.Цена <> 0 Тогда

			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		
		Иначе	
			
		     Строка.СтатусУказанияСерий = 14;
			 Строка.Цена = 0.01;
			 Строка.ЦенаСоСкидкой = 0.01;

			 Если Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
				 Строка.СуммаНДС = Окр(Строка.Сумма * 0.2,2);  
			 ИначеЕсли Строка.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда	
				 Строка.СуммаНДС = Окр(Строка.Сумма * 0.1,2); 
			 Иначе
				 Строка.СуммаНДС = 0;
			 КонецЕсли; 
			 
			 Строка.СуммаСНДС = Строка.Сумма + Строка.СуммаНДС;
			 Строка.СуммаРучнойСкидки = 0;
			 Строка.СуммаАвтоматическойСкидки = 0;
			 Строка.ПроцентАвтоматическойСкидки = 0;
			 Строка.ПроцентРучнойСкидки = 0;
			 
 
			 СтруктураДействий = Новый Структура;
			 СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
			 СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
			 СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
			 СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(Объект, СкладГруппа));
			 
			 СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
			 СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
			 СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			 СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
			 //СтруктураДействий.Вставить("ПересчитатьСумму");
			 СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Истина));
			 СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Истина));
			 СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
			 СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
			 СтруктураДействий.Вставить("ЗаполнитьПризнакВариантОформленияПродажи", Новый Структура("Номенклатура", "ВариантОформленияПродажи"));
			 СтруктураДействий.Вставить("ЗаполнитьСодержание", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСодержанияУслугиВСтрокеТЧ(Объект, Ложь));
			 СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
			 СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
			 СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
			 СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
			 ПараметрыДействия = ОбеспечениеКлиентСервер.ПараметрыДействияПроверитьЗаполнитьОбеспечение(ВариантыОбеспечения, Объект.ЖелаемаяДатаОтгрузки);
			 СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия);
			 СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
			 Новый Структура("ЕстьРаботы, ЕстьОтменено", Истина, Истина));
			 
			 СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			 ЭтаФорма.ИмяФормы, "Товары"));
			 
			 ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
			 Строка.ЦенаСоСкидкой = 0.01;
			 
			 
		 КонецЕсли;

	КонецЦикла; 
	
		ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Товары, ДатаОтгрузкиОбязательна, СкладОбязателен);

		РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
КонецПроцедуры


&НаСервере
Процедура ТекстСуммаПросроченоНажатиеНаСервере()
	
		УстановитьПривилегированныйРежим(Истина);

	табл = ПолучитьТаблицуПлатежей();	
//	СуммаПросрочено = 0;

СуммаБлижПросрочки = 0;
ПланируемыйДолг = 0;

	СуммаПросрочено = табл.Итог("ДолгКлиентаПросрочено");
	//Элементы.ТекстСуммаПросрочено.Заголовок = "Сумма просрочено: " + СокрЛП(СуммаПросрочено);
	
	
	
	
	ТаблБлижПросрочки = табл.Скопировать();
	ТаблБлижПросрочки.Свернуть("ДатаПлатежа","ДолгКлиента,ДолгКлиентаПросрочено");
	//Если табл.Итог("ДолгКлиентаПросрочено")=0 Тогда
	    Для каждого стр  Из табл  Цикл
			Если стр.ДатаПлатежа = Дата(1,1,1) ИЛИ стр.ДатаПлатежа = Неопределено ИЛИ стр.ДатаПлатежа = NULL ИЛИ стр.ДатаПлатежа = "" 
				ИЛИ стр.ДолгКлиентаПросрочено <> 0 Тогда
		        	Продолжить;
			Иначе
				ДатаБлижПлатежа = стр.ДатаПлатежа;
		   	    Прервать; 
		   КонецЕсли; 
		КонецЦикла; 
	//КонецЕсли;
	
	Для каждого стрПросрочка Из ТаблБлижПросрочки Цикл
	   Если стрПросрочка.ДатаПлатежа = ДатаБлижПлатежа Тогда
	        СуммаБлижПросрочки = стрПросрочка.ДолгКлиента;
	   	    Прервать; 
	   КонецЕсли; 
	КонецЦикла; 
	
	ДнейОтсрочки = Объект.Договор.ОтсрочкаОплатыПоДоговору;
	
	Объект.СуммаПросроченногоДолга = СуммаПросрочено;
	Если Объект.СуммаПросроченногоДолга <> NULL Тогда
		Элементы.ТекстСуммаПросрочено.Заголовок = "Сумма просрочено: " + СокрЛП(Объект.СуммаПросроченногоДолга) + " BYN";
	Иначе 
		Элементы.ТекстСуммаПросрочено.Заголовок = "Сумма просрочено: 0 BYN";
	КонецЕсли;

	
	ПланируемыйДолг = СуммаБлижПросрочки + СуммаПросрочено;
    Попытка
        ДатаБлижПлатежаТекст = ДатаБлижПлатежа + 86400;	
    Исключение
        //ОписаниеОшибки()
    КонецПопытки; 
    
	Если ДатаБлижПлатежа = Дата(1,1,1) ИЛИ ДатаБлижПлатежа = Неопределено ИЛИ ДатаБлижПлатежа = NULL ИЛИ ДатаБлижПлатежа >= ТекущаяДата() + 86400*365*2 Тогда
	    Элементы.ТекстДатаИСуммаДоПросрочки.Заголовок = "Все документы оплачены"; 
	Иначе	
	    Элементы.ТекстДатаИСуммаДоПросрочки.Заголовок = "" + Формат(ДатаБлижПлатежаТекст,"ДФ=dd.MM.yyyy") + ", сумма проср.долга составит:" + ПланируемыйДолг + " руб"; 

	КонецЕсли; 
	
	Объект.ДатаИСуммаБлижПросрочки =  Элементы.ТекстДатаИСуммаДоПросрочки.Заголовок;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ТекстСуммаПросроченоНажатие(Элемент)
	ТекстСуммаПросроченоНажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьДатыПлатежаКлиента(МенеджерВременныхТаблиц, ДатаОстатков) Экспорт
	Если ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоДокументам)
		И ПравоДоступа("Чтение",Метаданные.РегистрыНакопления.РасчетыСКлиентами) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                      |	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		                      |	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
		                      |	Расчеты.Валюта КАК Валюта,
		                      |	ВЫБОР
		                      |		КОГДА Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток > 0
		                      |			ТОГДА Расчеты.КОплатеОстаток
		                      |		ИНАЧЕ Расчеты.СуммаОстаток
		                      |	КОНЕЦ КАК ДолгОстаток,
		                      |	ВЫБОР
		                      |		КОГДА Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток > 0
		                      |			ТОГДА Расчеты.КОплатеОстаток
		                      |		ИНАЧЕ Расчеты.СуммаОстаток
		                      |	КОНЕЦ КАК ДолгОстатокНаКонецПериода,
		                      |	&ДатаОстатков КАК ДатаПлатежа,
		                      |	ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, 1) КАК Период,
		                      |	ИСТИНА КАК ПросроченнаяЗадолженность
		                      |ПОМЕСТИТЬ ТаблицаОстатковКлиентов
		                      |ИЗ
		                      |	РегистрНакопления.РасчетыСКлиентами.Остатки(&ДатаОстатков, АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК Расчеты
		                      |ГДЕ
		                      |	Расчеты.КОплатеОстаток > 0
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	Расчеты.АналитикаУчетаПоПартнерам,
		                      |	Расчеты.ЗаказКлиента,
		                      |	Расчеты.Валюта,
		                      |	ВЫБОР
		                      |		КОГДА Расчеты.КОплатеОстаток < 0
		                      |			ТОГДА Расчеты.СуммаОстаток
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток > 0
		                      |					ТОГДА Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток
		                      |				ИНАЧЕ Расчеты.КОплатеОстаток
		                      |			КОНЕЦ
		                      |	КОНЕЦ,
		                      |	ВЫБОР
		                      |		КОГДА Расчеты.КОплатеОстаток < 0
		                      |			ТОГДА Расчеты.СуммаОстаток
		                      |		ИНАЧЕ ВЫБОР
		                      |				КОГДА Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток > 0
		                      |					ТОГДА Расчеты.СуммаОстаток - Расчеты.КОплатеОстаток
		                      |				ИНАЧЕ Расчеты.КОплатеОстаток
		                      |			КОНЕЦ
		                      |	КОНЕЦ,
		                      |	&ДатаОстатков,
		                      |	ДОБАВИТЬКДАТЕ(&ДатаОстатков, СЕКУНДА, 1),
		                      |	ЛОЖЬ
		                      |ИЗ
		                      |	РегистрНакопления.РасчетыСКлиентами.Остатки(&ДатаОстатков, АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК Расчеты
		                      |ГДЕ
		                      |	Расчеты.КОплатеОстаток <= 0
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	1 КАК Поле1
		                      |ПОМЕСТИТЬ ТаблицаОтгрузокКлиентов
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	1 КАК Поле1
		                      |ПОМЕСТИТЬ ТаблицаПериодовКлиентов");
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.Выполнить();
		
 		Запрос.Текст = "
		|УНИЧТОЖИТЬ ТаблицаПериодовКлиентов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОтгрузокКлиентов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Расчеты.АналитикаУчетаПоПартнерам                  КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ЗаказКлиента                               КАК ЗаказКлиента,
		|	Расчеты.Валюта                                     КАК Валюта,
		|	МАКСИМУМ(НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа, День)) КАК ДатаПлатежа,
		|	МАКСИМУМ(Расчеты.Период)                           КАК Период,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность          КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаПериодовКлиентов
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКлиентов КАК ТаблицаОстатков
		|		ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|			И Расчеты.ЗаказКлиента = ТаблицаОстатков.ЗаказКлиента
		|			И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|			И ТаблицаОстатков.ДолгОстаток <> 0
		|ГДЕ
		|	Расчеты.Активность
		|	И Расчеты.Период <= &ДатаОстатков
		|	И Расчеты.Период < ТаблицаОстатков.Период
		|	И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КОтгрузке <> 0)
		|	И ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.ЗаказКлиента,
		|	Расчеты.Валюта,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Расчеты.АналитикаУчетаПоПартнерам                  КАК АналитикаУчетаПоПартнерам,
		|	Расчеты.ЗаказКлиента                               КАК ЗаказКлиента,
		|	Расчеты.Валюта                                     КАК Валюта,
		|	МИНИМУМ(НАЧАЛОПЕРИОДА(Расчеты.ДатаПлатежа, День))  КАК ДатаПлатежа,
		|	МИНИМУМ(Расчеты.Период)                            КАК Период,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность          КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКлиентов КАК ТаблицаОстатков
		|		ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		|			И Расчеты.ЗаказКлиента = ТаблицаОстатков.ЗаказКлиента
		|			И Расчеты.Валюта = ТаблицаОстатков.Валюта
		|			И ТаблицаОстатков.ДолгОстаток <> 0
		|ГДЕ
		|	(Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Расчеты.КОплате < 0))
		|	И Расчеты.Активность
		|	И Расчеты.Период > &ДатаОстатков
		|	И Расчеты.Период > ТаблицаОстатков.Период
		|	И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КОтгрузке <> 0)
		|	И НЕ ТаблицаОстатков.ПросроченнаяЗадолженность
		|
		|СГРУППИРОВАТЬ ПО
		|	Расчеты.АналитикаУчетаПоПартнерам,
		|	Расчеты.ЗаказКлиента,
		|	Расчеты.Валюта,
		|	ТаблицаОстатков.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Периоды.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказКлиента                          КАК ЗаказКлиента,
		|	Периоды.Валюта                                КАК Валюта,
		|	Периоды.Период                                КАК Период,
		|	НАЧАЛОПЕРИОДА(ВЫБОР КОГДА Периоды.ЗаказКлиента ССЫЛКА Справочник.ДоговорыКонтрагентов
		|		И Расчеты.Регистратор ССЫЛКА Документ.ГрафикИсполненияДоговора
		|		ТОГДА Расчеты.ДатаПлатежа
		|		КОГДА Расчеты.ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1)
		|		ТОГДА Расчеты.Период
		|		ИНАЧЕ Периоды.ДатаПлатежа
		|	КОНЕЦ, ДЕНЬ)                                  КАК ДатаПлатежа,
		|	СУММА(ВЫБОР КОГДА ЕСТЬNULL(Расчеты.КОплате, 0) < 0
		|			ТОГДА 0 - Расчеты.КОплате
		|			ИНАЧЕ ЕСТЬNULL(Расчеты.КОплате, 0)
		|	КОНЕЦ)                                        КАК Долг,
		|	Периоды.ПросроченнаяЗадолженность             КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаОтгрузокКлиентов
		|ИЗ
		|	ТаблицаПериодовКлиентов КАК Периоды
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК Расчеты
		|	ПО Периоды.АналитикаУчетаПоПартнерам   = Расчеты.АналитикаУчетаПоПартнерам
		|		И Периоды.ЗаказКлиента             = Расчеты.ЗаказКлиента
		|		И Периоды.Валюта                   = Расчеты.Валюта
		|		И Расчеты.Активность
		|		И Расчеты.Период = Периоды.Период
		|		И (Расчеты.КОплате <> 0 ИЛИ Расчеты.КОтгрузке <> 0)
		|		И (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Расчеты.КОплате < 0))
		|СГРУППИРОВАТЬ ПО
		|	Периоды.АналитикаУчетаПоПартнерам,
		|	Периоды.ЗаказКлиента,
		|	Периоды.Валюта,
		|	Периоды.Период,
		|	НАЧАЛОПЕРИОДА(ВЫБОР КОГДА Периоды.ЗаказКлиента ССЫЛКА Справочник.ДоговорыКонтрагентов
		|		И Расчеты.Регистратор ССЫЛКА Документ.ГрафикИсполненияДоговора
		|		ТОГДА Расчеты.ДатаПлатежа
		|		КОГДА Расчеты.ДатаПлатежа <> ДАТАВРЕМЯ(1,1,1)
		|		ТОГДА Расчеты.Период
		|		ИНАЧЕ Периоды.ДатаПлатежа
		|	КОНЕЦ, ДЕНЬ),
		|	Периоды.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам                   КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказКлиента                                КАК ЗаказКлиента,
		|	Остатки.Валюта                                      КАК Валюта,
		|	ВЫБОР КОГДА Остатки.ДолгОстаток > ЕСТЬNULL(Отгрузки.Долг, 0)
		|			ТОГДА Остатки.ДолгОстаток - ЕСТЬNULL(Отгрузки.Долг, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ                                               КАК НовыйДолгОстаток,
		|	ВЫБОР КОГДА ЕСТЬNULL(Отгрузки.Долг, 0) = 0
		|		ТОГДА Остатки.ДолгОстатокНаКонецПериода
		|		ИНАЧЕ ВЫБОР КОГДА Остатки.ДолгОстаток > Отгрузки.Долг
		|			ТОГДА Отгрузки.Долг
		|			ИНАЧЕ Остатки.ДолгОстаток
		|		КОНЕЦ
		|	КОНЕЦ                                               КАК ДолгОстатокНаКонецПериода,
		|	Отгрузки.Период                                     КАК Период,
		|	ЕСТЬNULL(Отгрузки.ДатаПлатежа, Остатки.ДатаПлатежа) КАК ДатаПлатежа,
		|	Остатки.ПросроченнаяЗадолженность                   КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ НовыеОстаткиКлиентов
		|ИЗ
		|	ТаблицаОстатковКлиентов КАК Остатки
		|
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОтгрузокКлиентов КАК Отгрузки
		|	ПО Остатки.АналитикаУчетаПоПартнерам = Отгрузки.АналитикаУчетаПоПартнерам
		|		И Остатки.ЗаказКлиента = Отгрузки.ЗаказКлиента
		|		И Остатки.Валюта  = Отгрузки.Валюта
		|		И Остатки.ПросроченнаяЗадолженность = Отгрузки.ПросроченнаяЗадолженность
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТаблицаОстатковКлиентов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.АналитикаУчетаПоПартнерам    КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ЗаказКлиента                 КАК ЗаказКлиента,
		|	Остатки.Валюта                       КАК Валюта,
		|	Остатки.Период                       КАК Период,
		|	Остатки.ДатаПлатежа                  КАК ДатаПлатежа,
		|	Остатки.НовыйДолгОстаток             КАК ДолгОстаток,
		|	Остатки.ДолгОстатокНаКонецПериода    КАК ДолгОстатокНаКонецПериода,
		|	Остатки.ПросроченнаяЗадолженность    КАК ПросроченнаяЗадолженность
		|ПОМЕСТИТЬ ТаблицаОстатковКлиентов
		|ИЗ
		|	НовыеОстаткиКлиентов КАК Остатки
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам,
		|	ЗаказКлиента,
		|	Валюта
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НовыеОстаткиКлиентов
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	1
		|ИЗ ТаблицаПериодовКлиентов
		|";
		
		Результат = Запрос.Выполнить();
		Счетчик = 0;
		МаксимальноеКоличествоИтераций = 1000;
		Пока Не Результат.Пустой() Цикл 
			Результат = Запрос.Выполнить();
			Счетчик = Счетчик + 1;
			Если Счетчик >= МаксимальноеКоличествоИтераций Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		               |	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
		               |	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
		               |	Расчеты.Валюта КАК Валюта,
		               |	ТаблицаОстатков.ДатаПлатежа КАК ДатаПлатежа,
		               |	ТаблицаОстатков.ДолгОстатокНаКонецПериода КАК Долг,
		               |	Расчеты.АналитикаУчетаПоПартнерам.Договор.ОтсрочкаОплатыПоДоговору КАК ОтсрочкаОплатыПоДоговору
		               |ПОМЕСТИТЬ ТаблицаОстатковКлиентовПоДокументам
		               |ИЗ
		               |	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&ДатаОстатков, ) КАК Расчеты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОстатковКлиентов КАК ТаблицаОстатков
		               |		ПО Расчеты.АналитикаУчетаПоПартнерам = ТаблицаОстатков.АналитикаУчетаПоПартнерам
		               |			И Расчеты.ЗаказКлиента = ТаблицаОстатков.ЗаказКлиента
		               |			И Расчеты.Валюта = ТаблицаОстатков.Валюта
		               |ГДЕ
		               |	Расчеты.ДолгОстаток > 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |УНИЧТОЖИТЬ ТаблицаОстатковКлиентов
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		               |	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
		               |	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
		               |	Расчеты.Валюта КАК Валюта,
					   //|	Расчеты.ДатаПлатежа               КАК ДатаПлатежа,                     ///////////  ниже 77w qaws для корректного расчета просроченной задолженности для МССО
					   |	ЕСТЬNULL(Расчеты.РасчетныйДокумент.ДатаПлатежа, Расчеты.ДатаПлатежа)  КАК ДатаПлатежа,      
					   //|	ЕСТЬNULL(Расчеты.РасчетныйДокумент.ДатаПлатежа, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПлатежа,    ///////////////// 77w qaws
		               |	Расчеты.Долг КАК КОплате,
		               |	Расчеты.Долг КАК ДолгОстаток
		               |ПОМЕСТИТЬ ТаблицаОстатковКлиентов
		               |ИЗ
		               |	ТаблицаОстатковКлиентовПоДокументам КАК Расчеты";
		Запрос.Выполнить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПлатежей()
	УстановитьПривилегированныйРежим(Истина);
	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	РассчитатьДатыПлатежаКлиента(ВременныеТаблицы, ТекущаяДата());
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	Сегменты.Партнер КАК Партнер,
	                      |	Сегменты.Сегмент КАК СегментПартнеров,
	                      |	ИСТИНА КАК ИспользуетсяОтборПоСегментуПартнеров
	                      |ПОМЕСТИТЬ ОтборПоСегментуПартнеров
	                      |ИЗ
	                      |	РегистрСведений.ПартнерыСегмента КАК Сегменты
	                      |{ГДЕ
	                      |	Сегменты.Сегмент.* КАК СегментПартнеров,
	                      |	Сегменты.Партнер.* КАК Партнер}
	                      |
	                      |ИНДЕКСИРОВАТЬ ПО
	                      |	Партнер,
	                      |	ИспользуетсяОтборПоСегментуПартнеров
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	КурсВалюты.Валюта КАК Валюта,
	                      |	КурсВалюты.Курс * КурсВалютыОтчета.Кратность / (КурсВалюты.Кратность * КурсВалютыОтчета.Курс) КАК КоэффициентПересчета
	                      |ПОМЕСТИТЬ КурсыВалют
	                      |ИЗ
	                      |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОстатков, ) КАК КурсВалюты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаОстатков, Валюта = &Валюта) КАК КурсВалютыОтчета
	                      |		ПО (ИСТИНА)
	                      |ГДЕ
	                      |	КурсВалюты.Кратность <> 0
	                      |	И КурсВалютыОтчета.Курс <> 0
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	                      |	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	                      |	Расчеты.ЗаказКлиента.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	                      |	Расчеты.Валюта КАК Валюта,
	                      |	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	                      |	Остатки.ДатаПлатежа КАК ДатаПлатежа,
	                      |	-(Расчеты.КВозвратуОстаток + Расчеты.ПредоплатаОстаток) КАК НашДолг,
	                      |	ВЫБОР
	                      |		КОГДА &ДанныеОтчета = 1
	                      |			ТОГДА ВЫБОР
	                      |					КОГДА Расчеты.ДолгУпрОстаток + Расчеты.ПредоплатаУпрОстаток < 0
	                      |						ТОГДА -(Расчеты.ДолгУпрОстаток + Расчеты.ПредоплатаУпрОстаток)
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ
	                      |		КОГДА &ДанныеОтчета = 3
	                      |			ТОГДА ВЫБОР
	                      |					КОГДА Расчеты.ДолгРеглОстаток + Расчеты.ПредоплатаРеглОстаток < 0
	                      |						ТОГДА -(Расчеты.ДолгРеглОстаток + Расчеты.ПредоплатаРеглОстаток)
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ
	                      |	КОНЕЦ КАК НашДолгВВалютеОтчета,
	                  						  //|	ВЫБОР
						  //|		КОГДА Расчеты.ДолгОстаток > ЕСТЬNULL(Остатки.КОплате, Расчеты.ДолгОстаток)
						  //|			ТОГДА Остатки.КОплате
						  //|		ИНАЧЕ Расчеты.ДолгОстаток
						  //|	КОНЕЦ КАК ДолгКлиента,
						  |  Расчеты.ДолгУпрОстаток КАК ДолгКлиента,
						  //|	ВЫБОР
						  //|		КОГДА &ДанныеОтчета = 1
						  //|			ТОГДА ВЫБОР
						  //|					КОГДА Расчеты.ДолгОстаток > ЕСТЬNULL(Остатки.КОплате, Расчеты.ДолгОстаток)
						  //|						ТОГДА ВЫРАЗИТЬ(Расчеты.ДолгУпрОстаток / Расчеты.ДолгОстаток * Остатки.КОплате КАК ЧИСЛО(15, 2))
						  //|					ИНАЧЕ Расчеты.ДолгУпрОстаток
						  //|				КОНЕЦ
						  //|		КОГДА &ДанныеОтчета = 3
						  //|			ТОГДА ВЫБОР
						  //|					КОГДА Расчеты.ДолгОстаток > ЕСТЬNULL(Остатки.КОплате, Расчеты.ДолгОстаток)
						  //|						ТОГДА ВЫРАЗИТЬ(Расчеты.ДолгРеглОстаток / Расчеты.ДолгОстаток * Остатки.КОплате КАК ЧИСЛО(15, 2))
						  //|					ИНАЧЕ Расчеты.ДолгРеглОстаток
						  //|				КОНЕЦ
						  //|	КОНЕЦ КАК ДолгКлиентаВВалютеОтчета,
						  |   Расчеты.ДолгУпрОстаток КАК ДолгКлиентаВВалютеОтчета,  
						 //
	                      |	0 КАК КОтгрузке,
	                      |	0 КАК КОтгрузкеВВалютеОтчета,
	                      |	АналитикаУчета.Партнер КАК Партнер,
	                      |	АналитикаУчета.Организация КАК Организация,
	                      |	АналитикаУчета.Контрагент КАК Контрагент,
	                      |	АналитикаУчета.Договор КАК Договор,
	                      |	АналитикаУчета.НаправлениеДеятельности КАК НаправлениеДеятельности,
	                      |	ОтборПоСегментуПартнеров.СегментПартнеров КАК СегментПартнеров
	                      |ПОМЕСТИТЬ ТаблицаЗадолженностейПросроченная
	                      |ИЗ
	                      |	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&ДатаОстатков, АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК Расчеты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	                      |		ПО Расчеты.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	                      |			И Расчеты.АналитикаУчетаПоПартнерам.Контрагент = АналитикаУчета.Контрагент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	                      |		ПО Расчеты.Валюта = КурсыВалют.Валюта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковКлиентов КАК Остатки
	                      |		ПО Расчеты.АналитикаУчетаПоПартнерам = Остатки.АналитикаУчетаПоПартнерам
	                      |			И Расчеты.ЗаказКлиента = Остатки.ЗаказКлиента
	                      |			И Расчеты.РасчетныйДокумент = Остатки.РасчетныйДокумент
	                      |			И Расчеты.Валюта = Остатки.Валюта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ОтборПоСегментуПартнеров КАК ОтборПоСегментуПартнеров
	                      |		ПО (АналитикаУчета.Партнер = ОтборПоСегментуПартнеров.Партнер)
	                      |			И (ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)
	                      |ГДЕ
	                      |	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	                      |	И АналитикаУчета.Контрагент = &Контрагент
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Расчеты.АналитикаУчетаПоПартнерам,
	                      |	Расчеты.ЗаказКлиента,
	                      |	Расчеты.ЗаказКлиента.ГруппаФинансовогоУчета,
	                      |	Расчеты.Валюта,
	                      |	NULL,
	                      |	ДАТАВРЕМЯ(1, 1, 1),
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	0,
	                      |	ВЫБОР
	                      |		КОГДА Расчеты.КОтгрузкеОстаток < 0
	                      |			ТОГДА -Расчеты.КОтгрузкеОстаток
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ,
	                      |	ВЫБОР
	                      |		КОГДА Расчеты.КОтгрузкеОстаток < 0
	                      |			ТОГДА -Расчеты.КОтгрузкеОстаток
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ * ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1),
	                      |	АналитикаУчета.Партнер,
	                      |	АналитикаУчета.Организация,
	                      |	АналитикаУчета.Контрагент,
	                      |	АналитикаУчета.Договор,
	                      |	АналитикаУчета.НаправлениеДеятельности,
	                      |	ОтборПоСегментуПартнеров.СегментПартнеров
	                      |ИЗ
	                      |	РегистрНакопления.РасчетыСКлиентами.Остатки(&ДатаОстатков, ) КАК Расчеты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	                      |		ПО Расчеты.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	                      |		ПО Расчеты.Валюта = КурсыВалют.Валюта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ОтборПоСегментуПартнеров КАК ОтборПоСегментуПартнеров
	                      |		ПО (АналитикаУчета.Партнер = ОтборПоСегментуПартнеров.Партнер)
	                      |			И (ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)
	                      |ГДЕ
	                      |	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	                      |	Таблица.ЗаказКлиента КАК ЗаказКлиента,
	                      |	Таблица.РасчетныйДокумент КАК РасчетныйДокумент,
	                      |	Таблица.Валюта КАК Валюта,
	                      |	СУММА(Таблица.ДолгКлиента) КАК ДолгКлиента,
	                      |	СУММА(Таблица.ДолгКлиентаВВалютеОтчета) КАК ДолгКлиентаВВалютеОтчета
	                      |ПОМЕСТИТЬ ВсегоПросрочено
	                      |ИЗ
	                      |	ТаблицаЗадолженностейПросроченная КАК Таблица
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Таблица.АналитикаУчетаПоПартнерам,
	                      |	Таблица.ЗаказКлиента,
	                      |	Таблица.РасчетныйДокумент,
	                      |	Таблица.Валюта
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	Расчеты.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	                      |	Расчеты.ЗаказКлиента КАК ЗаказКлиента,
	                      |	Расчеты.ЗаказКлиента.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	                      |	Расчеты.Валюта КАК Валюта,
	                      |	Расчеты.РасчетныйДокумент КАК РасчетныйДокумент,
	                      |	&ДатаОтчета КАК ДатаПлатежа,
	                      |	-(Расчеты.КВозвратуОстаток + Расчеты.ПредоплатаОстаток) КАК НашДолг,
	                      |	ВЫБОР
	                      |		КОГДА &ДанныеОтчета = 1
	                      |			ТОГДА ВЫБОР
	                      |					КОГДА Расчеты.ДолгУпрОстаток + Расчеты.ПредоплатаУпрОстаток < 0
	                      |						ТОГДА -(Расчеты.ДолгУпрОстаток + Расчеты.ПредоплатаУпрОстаток)
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ
	                      |		КОГДА &ДанныеОтчета = 3
	                      |			ТОГДА ВЫБОР
	                      |					КОГДА Расчеты.ДолгРеглОстаток + Расчеты.ПредоплатаРеглОстаток < 0
	                      |						ТОГДА -(Расчеты.ДолгРеглОстаток + Расчеты.ПредоплатаРеглОстаток)
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ
	                      |	КОНЕЦ КАК НашДолгВВалютеОтчета,
	                      |	Расчеты.ДолгОстаток - ЕСТЬNULL(Остатки.ДолгКлиента, Расчеты.ДолгОстаток) КАК ДолгКлиента,
	                      |	ВЫБОР
	                      |		КОГДА &ДанныеОтчета = 1
	                      |			ТОГДА Расчеты.ДолгУпрОстаток - Остатки.ДолгКлиентаВВалютеОтчета
	                      |		КОГДА &ДанныеОтчета = 3
	                      |			ТОГДА Расчеты.ДолгРеглОстаток - Остатки.ДолгКлиентаВВалютеОтчета
	                      |	КОНЕЦ КАК ДолгКлиентаВВалютеОтчета,
	                      |	0 КАК КОтгрузке,
	                      |	0 КАК КОтгрузкеВВалютеОтчета,
	                      |	АналитикаУчета.Партнер КАК Партнер,
	                      |	АналитикаУчета.Организация КАК Организация,
	                      |	АналитикаУчета.Контрагент КАК Контрагент,
	                      |	АналитикаУчета.Договор КАК Договор,
	                      |	АналитикаУчета.НаправлениеДеятельности КАК НаправлениеДеятельности,
	                      |	ОтборПоСегментуПартнеров.СегментПартнеров КАК СегментПартнеров
	                      |ПОМЕСТИТЬ ТаблицаЗадолженностей
	                      |ИЗ
	                      |	РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&ДатаОстатков, АналитикаУчетаПоПартнерам.Контрагент = &Контрагент) КАК Расчеты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчета
	                      |		ПО Расчеты.АналитикаУчетаПоПартнерам = АналитикаУчета.КлючАналитики
	                      |			И Расчеты.АналитикаУчетаПоПартнерам.Контрагент = АналитикаУчета.Контрагент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
	                      |		ПО Расчеты.Валюта = КурсыВалют.Валюта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВсегоПросрочено КАК Остатки
	                      |		ПО Расчеты.АналитикаУчетаПоПартнерам = Остатки.АналитикаУчетаПоПартнерам
	                      |			И Расчеты.ЗаказКлиента = Остатки.ЗаказКлиента
	                      |			И Расчеты.РасчетныйДокумент = Остатки.РасчетныйДокумент
	                      |			И Расчеты.Валюта = Остатки.Валюта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ОтборПоСегментуПартнеров КАК ОтборПоСегментуПартнеров
	                      |		ПО (АналитикаУчета.Партнер = ОтборПоСегментуПартнеров.Партнер)
	                      |			И (ОтборПоСегментуПартнеров.ИспользуетсяОтборПоСегментуПартнеров = &ИспользуетсяОтборПоСегментуПартнеров)
	                      |ГДЕ
	                      |	АналитикаУчета.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.НашеПредприятие)
	                      |	И Расчеты.ДолгОстаток - ЕСТЬNULL(Остатки.ДолгКлиента, 0) <> 0
	                      |	И АналитикаУчета.Контрагент = &Контрагент
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Расчеты.АналитикаУчетаПоПартнерам,
	                      |	Расчеты.ЗаказКлиента,
	                      |	Расчеты.ГруппаФинансовогоУчета,
	                      |	Расчеты.Валюта,
	                      |	Расчеты.РасчетныйДокумент,
	                      |	Расчеты.ДатаПлатежа,
	                      |	Расчеты.НашДолг,
	                      |	Расчеты.НашДолгВВалютеОтчета,
	                      |	Расчеты.ДолгКлиента,
	                      |	Расчеты.ДолгКлиентаВВалютеОтчета,
	                      |	Расчеты.КОтгрузке,
	                      |	Расчеты.КОтгрузкеВВалютеОтчета,
	                      |	Расчеты.Партнер,
	                      |	Расчеты.Организация,
	                      |	Расчеты.Контрагент,
	                      |	Расчеты.Договор,
	                      |	Расчеты.НаправлениеДеятельности,
	                      |	Расчеты.СегментПартнеров
	                      |ИЗ
	                      |	ТаблицаЗадолженностейПросроченная КАК Расчеты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	ТаблицаЗадолженностей.ДатаПлатежа КАК ДатаНачала,
	                      |	ГрафикиРаботы.Дата КАК ДатаОкончания,
	                      |	ВЫБОР
	                      |		КОГДА ГрафикиРаботы.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	                      |				ИЛИ ГрафикиРаботы.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный)
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 0
	                      |	КОНЕЦ КАК РабочийДень
	                      |ПОМЕСТИТЬ Графики
	                      |ИЗ
	                      |	ТаблицаЗадолженностей КАК ТаблицаЗадолженностей
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроизводственногоКалендаря КАК ГрафикиРаботы
	                      |		ПО (ГрафикиРаботы.ПроизводственныйКалендарь = &Календарь)
	                      |ГДЕ
	                      |	ГрафикиРаботы.Дата МЕЖДУ ТаблицаЗадолженностей.ДатаПлатежа И &ДатаОтчета
	                      |	И ТаблицаЗадолженностей.ДатаПлатежа <> ДАТАВРЕМЯ(1, 1, 1)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВложенныйЗапрос.ДатаНачала КАК ДатаНачала,
	                      |	ВложенныйЗапрос.ДатаОкончания КАК ДатаОкончания,
	                      |	ЕСТЬNULL(СУММА(Графики.РабочийДень), 0) КАК КоличествоДней
	                      |ПОМЕСТИТЬ РазностиДат
	                      |ИЗ
	                      |	Графики КАК ВложенныйЗапрос
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Графики КАК Графики
	                      |		ПО ВложенныйЗапрос.ДатаНачала = Графики.ДатаНачала
	                      |			И ВложенныйЗапрос.ДатаОкончания > Графики.ДатаОкончания
	                      |ГДЕ
	                      |	ВложенныйЗапрос.ДатаОкончания = НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕНЬ)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВложенныйЗапрос.ДатаНачала,
	                      |	ВложенныйЗапрос.ДатаОкончания
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	&СтрокаСостояниеВзаиморасчетов КАК ГруппировкаВсего,
	                      |	ТаблицаЗадолженностей.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	                      |	ТаблицаЗадолженностей.ЗаказКлиента КАК ЗаказКлиента,
	                      |	ТаблицаЗадолженностей.Договор КАК Договор,
	                      |	ТаблицаЗадолженностей.НаправлениеДеятельности КАК НаправлениеДеятельности,
	                      |	ТаблицаЗадолженностей.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	                      |	ТаблицаЗадолженностей.Валюта КАК Валюта,
	                      |	ТаблицаЗадолженностей.РасчетныйДокумент КАК РасчетныйДокумент,
	                      |	ТаблицаЗадолженностей.ДатаПлатежа КАК ДатаПлатежа,
	                      |	ТаблицаЗадолженностей.Партнер КАК Партнер,
	                      |	ТаблицаЗадолженностей.Организация КАК Организация,
	                      |	ТаблицаЗадолженностей.Контрагент КАК Контрагент,
	                      |	ТаблицаЗадолженностей.НашДолг КАК НашДолг,
	                      |	ТаблицаЗадолженностей.ДолгКлиента КАК ДолгКлиента,
	                      |	ТаблицаЗадолженностей.КОтгрузке КАК КОтгрузке,
	                      |	ТаблицаЗадолженностей.НашДолгВВалютеОтчета КАК НашДолгВВалютеОтчета,
	                      |	ТаблицаЗадолженностей.ДолгКлиентаВВалютеОтчета КАК ДолгКлиентаВВалютеОтчета,
	                      |	ТаблицаЗадолженностей.КОтгрузкеВВалютеОтчета КАК КОтгрузкеВВалютеОтчета,
	                      |	ВЫБОР
	                      |		КОГДА НЕ РазностиДат.КоличествоДней ЕСТЬ NULL
	                      |			ТОГДА ВЫБОР
	                      |					КОГДА РазностиДат.КоличествоДней > 0
	                      |						ТОГДА РазностиДат.КоличествоДней
	                      |					ИНАЧЕ 0
	                      |				КОНЕЦ
	                      |		ИНАЧЕ ВЫБОР
	                      |				КОГДА ТаблицаЗадолженностей.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	                      |					ТОГДА 0
	                      |				ИНАЧЕ ВЫБОР
	                      |						КОГДА РАЗНОСТЬДАТ(ТаблицаЗадолженностей.ДатаПлатежа, &ДатаОтчета, ДЕНЬ) > 0
	                      |							ТОГДА РАЗНОСТЬДАТ(ТаблицаЗадолженностей.ДатаПлатежа, &ДатаОтчета, ДЕНЬ)
	                      |						ИНАЧЕ 0
	                      |					КОНЕЦ
	                      |			КОНЕЦ
	                      |	КОНЕЦ КАК КоличествоДней,
	                      |	ВЫБОР
	                      |		КОГДА ВЫБОР
	                      |				КОГДА НЕ РазностиДат.КоличествоДней ЕСТЬ NULL
	                      |					ТОГДА ВЫБОР
	                      |							КОГДА РазностиДат.КоличествоДней > 0
	                      |								ТОГДА РазностиДат.КоличествоДней
	                      |							ИНАЧЕ 0
	                      |						КОНЕЦ
	                      |				ИНАЧЕ ВЫБОР
	                      |						КОГДА ТаблицаЗадолженностей.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫБОР
	                      |								КОГДА РАЗНОСТЬДАТ(ТаблицаЗадолженностей.ДатаПлатежа, &ДатаОтчета, ДЕНЬ) > 0
	                      |									ТОГДА РАЗНОСТЬДАТ(ТаблицаЗадолженностей.ДатаПлатежа, &ДатаОтчета, ДЕНЬ)
	                      |								ИНАЧЕ 0
	                      |							КОНЕЦ
	                      |					КОНЕЦ
	                      |			КОНЕЦ = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ТаблицаЗадолженностей.ДолгКлиента
	                      |	КОНЕЦ КАК ДолгКлиентаПросрочено,
	                      |	ВЫБОР
	                      |		КОГДА ВЫБОР
	                      |				КОГДА НЕ РазностиДат.КоличествоДней ЕСТЬ NULL
	                      |					ТОГДА ВЫБОР
	                      |							КОГДА РазностиДат.КоличествоДней > 0
	                      |								ТОГДА РазностиДат.КоличествоДней
	                      |							ИНАЧЕ 0
	                      |						КОНЕЦ
	                      |				ИНАЧЕ ВЫБОР
	                      |						КОГДА ТаблицаЗадолженностей.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫБОР
	                      |								КОГДА РАЗНОСТЬДАТ(ТаблицаЗадолженностей.ДатаПлатежа, &ДатаОтчета, ДЕНЬ) > 0
	                      |									ТОГДА РАЗНОСТЬДАТ(ТаблицаЗадолженностей.ДатаПлатежа, &ДатаОтчета, ДЕНЬ)
	                      |								ИНАЧЕ 0
	                      |							КОНЕЦ
	                      |					КОНЕЦ
	                      |			КОНЕЦ = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ТаблицаЗадолженностей.ДолгКлиентаВВалютеОтчета
	                      |	КОНЕЦ КАК ДолгКлиентаПросроченоВВалютеОтчета,
	                      |	ЕСТЬNULL(Интервалы.НаименованиеИнтервала, &СтрокаДолгНеПросрочен) КАК НаименованиеИнтервала,
	                      |	ЕСТЬNULL(Интервалы.НомерСтроки, 0) КАК НомерИнтервала,
	                      |	ЕСТЬNULL(Интервалы.НижняяГраницаИнтервала, 0) КАК НижняяГраницаИнтервала,
	                      |	ТаблицаЗадолженностей.СегментПартнеров КАК СегментПартнеров
	                      |ИЗ
	                      |	ТаблицаЗадолженностей КАК ТаблицаЗадолженностей
	                      |		{ЛЕВОЕ СОЕДИНЕНИЕ РазностиДат КАК РазностиДат
	                      |		ПО (РазностиДат.ДатаНачала = ТаблицаЗадолженностей.ДатаПлатежа)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКлассификацииЗадолженности.Интервалы КАК Интервалы
	                      |		ПО (Интервалы.Ссылка = &ВариантКлассификацииЗадолженности)
	                      |			И (ВЫБОР
	                      |				КОГДА НЕ РазностиДат.КоличествоДней ЕСТЬ NULL
	                      |					ТОГДА ВЫБОР
	                      |							КОГДА РазностиДат.КоличествоДней > 0
	                      |								ТОГДА РазностиДат.КоличествоДней
	                      |							ИНАЧЕ 0
	                      |						КОНЕЦ
	                      |				ИНАЧЕ ВЫБОР
	                      |						КОГДА ТаблицаЗадолженностей.ДатаПлатежа = ДАТАВРЕМЯ(1, 1, 1)
	                      |							ТОГДА 0
	                      |						ИНАЧЕ ВЫБОР
	                      |								КОГДА РАЗНОСТЬДАТ(ТаблицаЗадолженностей.ДатаПлатежа, &ДатаОтчета, ДЕНЬ) > 0
	                      |									ТОГДА РАЗНОСТЬДАТ(ТаблицаЗадолженностей.ДатаПлатежа, &ДатаОтчета, ДЕНЬ)
	                      |								ИНАЧЕ 0
	                      |							КОНЕЦ
	                      |					КОНЕЦ
	                      |			КОНЕЦ МЕЖДУ Интервалы.НижняяГраницаИнтервала И Интервалы.ВерхняяГраницаИнтервала)}
	                      |ГДЕ
	                      |	ТаблицаЗадолженностей.Контрагент = &Контрагент");
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	//Запрос.УстановитьПараметр("ДатаОтчета", Объект.Дата);
	//Запрос.УстановитьПараметр("ДатаОстатков", Объект.Дата);
	Запрос.УстановитьПараметр("ДатаОтчета", ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДата());

	Запрос.УстановитьПараметр("Валюта", Справочники.Валюты.НайтиПоНаименованию("Белорусский рубль"));
	Запрос.УстановитьПараметр("ДанныеОтчета", 3);
	Запрос.УстановитьПараметр("ИспользуетсяОтборПоСегментуПартнеров", ЛОЖЬ);
	Запрос.УстановитьПараметр("Календарь", Константы.ОсновнойКалендарьПредприятия.Получить());
	Запрос.УстановитьПараметр("СтрокаСостояниеВзаиморасчетов", "СтрокаСостояниеВзаиморасчетов");
	Запрос.УстановитьПараметр("СтрокаДолгНеПросрочен", "СтрокаДолгНеПросрочен");
	Запрос.УстановитьПараметр("ВариантКлассификацииЗадолженности", ОбщегоНазначенияУТВызовСервера.ВариантКлассификацииЗадолженностиПоУмолчанию());
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

&НаКлиенте
Процедура ПечатьОП(ИдентификаторКоманды, ТабДок) Экспорт
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
    //Типовая часть вывода в стандартное окно++
    ИдентификаторПечатнойФормы = "СвидетельствоНаСеменаПечатьОтсутствующихПозиций";
    НазваниеПечатнойФормы = НСтр("ru = 'Печать отсутствующих позиций'");
    
    Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
        ТабДок.Показать(НазваниеПечатнойФормы);
        ДокументыПечатались = Истина;
        Возврат;
    КонецЕсли;     
    МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
    КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
    ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
    ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
    ПечатнаяФорма.ТабличныйДокумент = ТабДок;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
    
    ОбластиОбъектов = Новый СписокЗначений;
    МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

    ДокументыПечатались = Истина;
КонецПроцедуры

&НаСервере
Процедура ПечатьОтсутствующихПозицийНаСервере(ТабДок)
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;	
	Макет = ПолучитьМакетНаСервере("ПечатьОтсутствующихПозиций");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	ЗаголовокОП = "";
	
	ЗаголовокОП = "Отсутствующие позиции номенклатуры"+Символы.ПС+""+ЭтотОбъект.Объект.Ссылка+Символы.ПС+"("+ЭтотОбъект.Объект.Контрагент+")"; 
	
	ОбластьШапка.Параметры.ЗаголовокОП = ЗаголовокОП;
	ТабДок.Вывести(ОбластьШапка);
	Номер = 0;
	Для каждого Строка Из Объект.ОтсутствующиеПозицииНоменклатуры Цикл
		Номер = Номер +1;
		ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
		Номенклатура = Строка.Номенклатура;
		
		
		ОбластьСтрока.Параметры.Номер = Номер;
		ОбластьСтрока.Параметры.Номенклатура = Номенклатура;
		
		Количество = Строка.КоличествоПервоначальное - Строка.КоличествоВНаличии;
		ОбластьСтрока.Параметры.Количество = Количество;
		ОбластьСтрока.Параметры.Причина = Строка.Причина;
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьОтсутствующихПозиций(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьОтсутствующихПозицийНаСервере(ТабДок);
	
	ПечатьОП(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
КонецПроцедуры

&НаКлиенте
Процедура ПечатьСети_Ома(ИдентификаторКоманды, ТабДок) Экспорт
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
	//ТабДок = ПолучитьТабличныйДокументПриказаТ5(МассивОбъектов);
    //Типовая часть вывода в стандартное окно++
    ИдентификаторПечатнойФормы = "СчетМССОСетиОма";
    НазваниеПечатнойФормы = НСтр("ru = 'Заявка для сети ""Ома""'");
	Если Не ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
        ТабДок.Показать(НазваниеПечатнойФормы);
        ДокументыПечатались = Истина;
        Возврат;
    КонецЕсли;     
    МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");     
    КоллекцияПечатныхФорм = МодульУправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
    ПечатнаяФорма = МодульУправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
    ПечатнаяФорма.СинонимМакета = НазваниеПечатнойФормы;
    ПечатнаяФорма.ТабличныйДокумент = ТабДок;
    ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
    
    ОбластиОбъектов = Новый СписокЗначений;
    МодульУправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);

    ДокументыПечатались = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ПечатьСчетСетиОма(Команда)
	
	ТабДок = Новый ТабличныйДокумент;
	//ПечатьСчетСетиОмаНаСервере(ТабДок);
	ДляПечатьСчетСетиОМАНаСервере(ТабДок);
	ПечатьСети_Ома(,ТабДок);	 ///////// для отображения стандартного диалога печати (КНОПКА ПЕЧАТЬ)
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШтукамиНаСервере()
	Для каждого СтрокаТовары Из Объект.Товары Цикл
		
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
			|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель,
			|	УпаковкиЕдиницыИзмерения.Знаменатель КАК Знаменатель,
			|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
			|	УпаковкиЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|ГДЕ
			|	УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ
			|	И УпаковкиЕдиницыИзмерения.Владелец = &Владелец ";
			//|	И УпаковкиЕдиницыИзмерения.Владелец.ДвеЦеныВЦеннике = ИСТИНА";
			
			//Запрос.УстановитьПараметр("Владелец", СтрокаТовары.Номенклатура);
			
			Если СтрокаТовары.Номенклатура.НаборУпаковок = ПредопределенноеЗначение("Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры") Тогда
				Запрос.УстановитьПараметр("Владелец", СтрокаТовары.Номенклатура);
			Иначе
				Запрос.УстановитьПараметр("Владелец", СтрокаТовары.Номенклатура.НаборУпаковок);
			КонецЕсли;	
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			

			Коэффициент = 1;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если СтрНайти(ВыборкаДетальныеЗаписи.Ссылка.Наименование, "шт") = 1 Тогда
					Коэффициент = 1;
					Коэффициент = СтрокаТовары.Упаковка.Числитель;
					СтрокаТовары.Упаковка = ВыборкаДетальныеЗаписи.Ссылка;
					КоличествоПервоначальноеШТ = 0;
					КоличествоПервоначальноеШТ = СтрокаТовары.КоличествоУпаковок;
					Если Коэффициент <> 0 Тогда
						СтрокаТовары.КоличествоУпаковок = КоличествоПервоначальноеШТ;
						СтрокаТовары.Количество = КоличествоПервоначальноеШТ*Коэффициент;
					КонецЕсли; 
				КонецЕсли; 
				
			КонецЦикла;
		КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШтуками(Команда)
    ЗаполнитьШтукамиНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьЦеныПоДоставкеНаСервере()
    
    ВидЦенДоставки = Неопределено;
    
	//Если Объект.ЗонаДоставки.Наименование <> "Минск" Тогда            
	
	    ВидЦенДоставки = Справочники.ВидыЦен.НайтиПоНаименованию("Доставка_Области",Истина);
	
	//ВидЦенДоставки = Справочники.ВидыЦен.НайтиПоНаименованию("Доставка_Области",Истина);
	
	//Иначе
	//	ВидЦенДоставки = Справочники.ВидыЦен.НайтиПоНаименованию("Доставка_Минск",Истина);
	//КонецЕсли; 
    
    
    Если СтрНайти(Строка(Объект.Соглашение),"Оптовые") > 0 Тогда
        Если Объект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента	Тогда
            Для каждого Строка Из Объект.Товары Цикл
				
				
				Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(Строка.Номенклатура,Объект.Дата) = Истина Тогда
                	 Продолжить;
				КонецЕсли; 
				 
                Если Строка.Номенклатура.ПлатнаяДоставка = Ложь Тогда
                	 Продолжить;
                КонецЕсли; 
                
                ЦенаДоставки = 0;
                
                Запрос = Новый Запрос;
                Запрос.Текст = 
                "ВЫБРАТЬ
                |	ЦеныНоменклатурыСрезПоследних.Период,
                |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
                |	ЦеныНоменклатурыСрезПоследних.ВидЦены,
                |	ЦеныНоменклатурыСрезПоследних.Валюта,
                |	ЦеныНоменклатурыСрезПоследних.Цена
                |ИЗ
                |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
                |ГДЕ
                |	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
                |	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
                
                
                
                Запрос.УстановитьПараметр("ВидЦены",ВидЦенДоставки);
                Запрос.УстановитьПараметр("НаДату", Объект.Дата);
                Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
                
                РезультатЗапроса = Запрос.Выполнить();
                
                ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
                
                Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
                    ЦенаДоставки = ВыборкаДетальныеЗаписи.Цена;
                КонецЦикла;
                
                Если ЦенаДоставки > 0 Тогда
                    Строка.ВидЦены = ВидЦенДоставки;
                    Строка.Цена = ЦенаДоставки;
                    Строка.ЦенаСоСкидкой = ЦенаДоставки;
                КонецЕсли; 
                
            КонецЦикла;
            
        Иначе
            Для каждого Строка Из Объект.Товары Цикл
				
				Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(Строка.Номенклатура,Объект.Дата) = Истина Тогда
                	 Продолжить;
				КонецЕсли; 
				
				
                Если Строка.Номенклатура.ПлатнаяДоставка = Ложь Тогда
                	 Продолжить;
                КонецЕсли; 
                
                ЦенаДоставки = 0;
                
                Запрос = Новый Запрос;
                Запрос.Текст = 
                "ВЫБРАТЬ
                |	ЦеныНоменклатурыСрезПоследних.Период,
                |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
                |	ЦеныНоменклатурыСрезПоследних.ВидЦены,
                |	ЦеныНоменклатурыСрезПоследних.Валюта,
                |	ЦеныНоменклатурыСрезПоследних.Цена
                |ИЗ
                |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
                |ГДЕ
                |	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
                |	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
                
                
                
                Запрос.УстановитьПараметр("ВидЦены", Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",Истина));
                Запрос.УстановитьПараметр("НаДату", Объект.Дата);
                Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
                
                РезультатЗапроса = Запрос.Выполнить();
                
                ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
                
                Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
                    ЦенаДоставки = ВыборкаДетальныеЗаписи.Цена;
                КонецЦикла;
                
                Если ЦенаДоставки > 0 Тогда
                    Строка.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",Истина);
                    Строка.Цена = ЦенаДоставки;
                    Строка.ЦенаСоСкидкой = ЦенаДоставки;
                КонецЕсли; 
                
            КонецЦикла;
        КонецЕсли;
        
    	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Объект);
        
        КэшированныеЗначения = Неопределено;
    	СтруктураДействий = Новый Структура;
    	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
    	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
    	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Объект.НалогообложениеНДС);
    	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
    	СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
    	СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", Объект.ВернутьМногооборотнуюТару);
    	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
    	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
    	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, КэшированныеЗначения);
    	ОбновитьДубликатыЗависимыхРеквизитов();
    	
    	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);
            
    КонецЕсли;	
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЦеныПоДоставке(Команда)
	УстановитьЦеныПоДоставкеНаСервере();
	
	Для Каждого ЭлементСписка Из Объект.Товары Цикл
		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		
		ЭлементСписка.ПроцентРучнойСкидки = Объект.СкидкаОбщая;
		
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ЭлементСписка, СтруктураДействий, КэшированныеЗначения);
		
	КонецЦикла;	
	
	РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);    /////////77w qaws	
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
    П = Новый Структура("АдресДоставки", Объект.АдресДоставки);
    ОткрытьФорму("Справочник.КонтактныеЛица.ФормаВыбора",П,Элемент);    

КонецПроцедуры



#КонецОбласти



Функция ПолучитьТипСклада(Склад)

	Возврат Склад.ТипСклада;	

КонецФункции // ()


//jadmin
Функция ПроверитьКоординатыАдресаДоставки(АдресДоставки)

	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПунктыРазгрузкиПогрузкиКлиентов.Ссылка КАК Ссылка,
		|	ПунктыРазгрузкиПогрузкиКлиентов.ВерсияДанных КАК ВерсияДанных,
		|	ПунктыРазгрузкиПогрузкиКлиентов.ПометкаУдаления КАК ПометкаУдаления,
		|	ПунктыРазгрузкиПогрузкиКлиентов.Владелец КАК Владелец,
		|	ПунктыРазгрузкиПогрузкиКлиентов.Код КАК Код,
		|	ПунктыРазгрузкиПогрузкиКлиентов.Наименование КАК Наименование,
		|	ПунктыРазгрузкиПогрузкиКлиентов.Координаты_СШ КАК Координаты_СШ,
		|	ПунктыРазгрузкиПогрузкиКлиентов.Координаты_ВД КАК Координаты_ВД,
		|	ПунктыРазгрузкиПогрузкиКлиентов.ОсновноеКонтактноеЛицо КАК ОсновноеКонтактноеЛицо,
		|	ПунктыРазгрузкиПогрузкиКлиентов.Предопределенный КАК Предопределенный,
		|	ПунктыРазгрузкиПогрузкиКлиентов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ПунктыРазгрузкиПогрузкиКлиентов КАК ПунктыРазгрузкиПогрузкиКлиентов
		|ГДЕ
		|	(ПунктыРазгрузкиПогрузкиКлиентов.Наименование = &Наименование
		|		ИЛИ ПунктыРазгрузкиПогрузкиКлиентов.Ссылка = &Наименование)";
	
	Запрос.УстановитьПараметр("Наименование", АдресДоставки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат ЛОЖЬ;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	

КонецФункции // ()
 

Функция ПолучитьНомерЗнП(Распоряжение)

	НомерЗнП = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераЗаданийНаПеревозку.Распоряжение КАК Распоряжение,
		|	НомераЗаданийНаПеревозку.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
		|	НомераЗаданийНаПеревозку.НомерЗнП КАК НомерЗнП
		|ИЗ
		|	РегистрСведений.НомераЗаданийНаПеревозку КАК НомераЗаданийНаПеревозку
		|ГДЕ
		|	НомераЗаданийНаПеревозку.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НомерЗнП = ВыборкаДетальныеЗаписи.НомерЗнП;
	КонецЦикла;
	
	Возврат НомерЗнП;

КонецФункции // ()

Функция ПолучитьНакладнуюИзРегистра(ЗаказСсылка)

	  Накладная = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыВыписанаНакладная.РеализацияСсылка КАК РеализацияСсылка
		|ИЗ
		|	РегистрСведений.ЗаказыВыписанаНакладная КАК ЗаказыВыписанаНакладная
		|ГДЕ
		|	ЗаказыВыписанаНакладная.ЗаказСсылка = &ЗаказСсылка";
	
	Запрос.УстановитьПараметр("ЗаказСсылка", ЗаказСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Накладная = ВыборкаДетальныеЗаписи.РеализацияСсылка;
	КонецЦикла;
	
	Возврат Накладная;

КонецФункции // ()
 

//jadmin 01-12-2022
Процедура ПроверитьУсловияСрабатыванияСкидокМССО()

	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
									 
		СкидкаСезоннаяРазмер = 0;
		СкидкаЗаПредоплатуРазмер = 0;
		СкидкаОборотРазмер = 0;

		
		СуммаОборотаМССО = 0;
		СкидкаОбщая = 0;
		ОбщийМодуль77w.РасчитатьСкидкуКлиента(Объект.Контрагент,Объект.Ссылка,СуммаОборотаМССО,СкидкаОборотРазмер,СкидкаОбщая);
		
		Если Объект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный",ИСТИНА)   Тогда
			//Объект.СкидкаЗаПредоплату = ЛОЖЬ; 
			//Объект.СкидкаЗаПредоплатуПроцент = 0;
			Объект.СкидкаОборот = ЛОЖЬ; 
			Объект.СкидкаОборотПроцент = 0;
			Объект.СкидкаСезонная = ЛОЖЬ; 
			Объект.СкидкаСезоннаяПроцент = 0;      
			
			СкидкаСезоннаяРазмер = 0;
			СкидкаЗаПредоплатуРазмер = 0;
			СкидкаОборотРазмер = 0;
		КонецЕсли; 
		
		Если СкидкаОборотРазмер>0 И Объект.СкидкаИндивидуальная = ЛОЖЬ Тогда
			Объект.СкидкаОборот = ИСТИНА;
			Объект.СкидкаОборотПроцент = СкидкаОборотРазмер;
		Иначе
			Объект.СкидкаОборот = ЛОЖЬ;
			Объект.СкидкаОборотПроцент = 0;
		КонецЕсли;
		
		
		//Предоплата
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница"
			ИЛИ НЕ Объект.Соглашение.ВидЦен = Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",Истина)
			//ИЛИ Объект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный",ИСТИНА)
			//ИЛИ Объект.Партнер.ИндивидуальныеСкидки = ИСТИНА 
			Тогда
			Объект.СкидкаЗаПредоплату = ЛОЖЬ; 
			Объект.СкидкаЗаПредоплатуПроцент = 0;

		Иначе
			
			СкидкаЗаПредоплатуРазмер = 0;
			Если Объект.СкидкаЗаПредоплату = ИСТИНА Тогда
				СкидкаЗаПредоплатуРазмер = 5;
				Объект.СкидкаЗаПредоплатуПроцент = СкидкаЗаПредоплатуРазмер;
			Иначе
				Объект.СкидкаЗаПредоплатуПроцент = 0;
			КонецЕсли; 
		КонецЕсли;
		/////
		
		//Скидка Сезонная	
		
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница"
			ИЛИ Объект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный",ИСТИНА)  
			ИЛИ Объект.Партнер.ИндивидуальныеСкидки = ИСТИНА 
			Тогда
			Объект.СкидкаСезонная = ЛОЖЬ;
			Объект.СкидкаСезоннаяПроцент = 0;

		Иначе
			
			
			Если НачалоДня(Объект.Дата) >= Дата("20221024") И ТекущаяДата()<Дата("20230101") Тогда
				
				СкидкаСезоннаяРазмер = 7;
				Объект.СкидкаСезонная = ИСТИНА;
				Объект.СкидкаСезоннаяПроцент = СкидкаСезоннаяРазмер;
				
				
			ИначеЕсли НачалоДня(Объект.Дата) >= Дата("20231001") И  НачалоДня(Объект.Дата)<Дата("20231221")
				ИЛИ НачалоДня(Объект.Дата) >= Дата("20241001") И  НачалоДня(Объект.Дата)<Дата("20241221")
                ИЛИ НачалоДня(Объект.Дата) >= Дата("20251001") И  НачалоДня(Объект.Дата)<Дата("20251221")
				Тогда
				
				СкидкаСезоннаяРазмер = 10;
				Объект.СкидкаСезонная = ИСТИНА;
				Объект.СкидкаСезоннаяПроцент = СкидкаСезоннаяРазмер;   
					
			Иначе
				
				Объект.СкидкаСезонная = ЛОЖЬ;
				Объект.СкидкаСезоннаяПроцент = 0;
				
			КонецЕсли;   
			
			КолВоДнейОтрочки = 0;
			СкидкаИндивидуальнаяРазмер = 0;
			ПолучитьКоличествоДнейОтсрочкиПоДоговору(КолВоДнейОтрочки,СкидкаИндивидуальнаяРазмер);
			//Объект.КоличествоДнейОтсрочкиПоДоговору = ПолучитьКоличествоДнейОтсрочкиПоДоговору();
			Объект.КоличествоДнейОтсрочкиПоДоговору = КолВоДнейОтрочки;
			Объект.СкидкаИндивидуальнаяПроцент = СкидкаИндивидуальнаяРазмер;
			
			Если СкидкаИндивидуальнаяРазмер > 0
				ИЛИ Объект.Договор.СкидкаИндивидуальная = ИСТИНА Тогда
				
				Объект.СкидкаИндивидуальная = Истина;
				Элементы.ГруппаИндивидуальная.ТолькоПросмотр = ЛОЖЬ;
				Элементы.СкидкаИндивидуальная.ТолькоПросмотр = ИСТИНА;
				
				Объект.СкидкаИндивидуальнаяПроцент = СкидкаИндивидуальнаяРазмер;

				Объект.СкидкаСезонная = ЛОЖЬ;
				Объект.СкидкаСезоннаяПроцент = 0;
				Объект.СкидкаОборот = ЛОЖЬ;
			Иначе
				Объект.СкидкаИндивидуальная = ЛОЖЬ;
				Объект.СкидкаИндивидуальнаяПроцент = 0;
			КонецЕсли;
					
			
			
			
		КонецЕсли;
		///
		
		
		
		ТЗ_Скидки = Объект.СкидкиНаценки.Выгрузить();
		ПересчетВСЕЙТЧ = ЛОЖЬ;

	
		 Для каждого стрТовары Из Объект.Товары Цикл
			 
			Если Объект.СкидкаИндивидуальная = Истина Тогда
				стрТовары.ПроцентРучнойСкидки = Объект.СкидкаИндивидуальнаяПроцент; //jadmin
			Иначе
				Если стрТовары.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Оптовые",ИСТИНА)
					ИЛИ стрТовары.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Доставка_Области",ИСТИНА)
					ИЛИ стрТовары.ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Доставка_Минск",ИСТИНА) Тогда			
					стрТовары.ПроцентРучнойСкидки = Объект.СкидкаОборотПроцент;	
				Иначе
					стрТовары.ПроцентРучнойСкидки = 0;
				КонецЕсли;
			КонецЕсли;
			
			

			 
			 Если ОбщийМодуль77w.ПроверитьВозможностьПримененияСкидок_Опт(стрТовары.Номенклатура,Объект.Дата) = ИСТИНА Тогда			 
				 
				 НайденнаяСтрока = ТЗ_Скидки.Найти(стрТовары.КлючСвязи,"КлючСвязи"); 
				 Если НайденнаяСтрока <> Неопределено Тогда
					 Если НайденнаяСтрока.СкидкаНаценка.НеУчитыватьСкидкуЗаОборот = ИСТИНА Тогда			 
						 //стрТовары.ПроцентРучнойСкидки = ?(стрТовары.ПроцентРучнойСкидки - СкидкаОбщая<0,0,стрТовары.ПроцентРучнойСкидки - СкидкаОбщая) ;
						 стрТовары.ПроцентРучнойСкидки = 0;						 
					 КонецЕсли; 
				
				 КонецЕсли; 
				 
				 Если стрТовары.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")
						ИЛИ стрТовары.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") 
						ИЛИ стрТовары.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") 
						ИЛИ стрТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")
						ИЛИ стрТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020") // скидка картошка
 						Тогда
				 
				 	    стрТовары.ПроцентРучнойСкидки = 0;
				 
				 КонецЕсли;
				 
				 
				 					
				//Предоплата Применение
				 Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
					 ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница"
					 //ИЛИ Объект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный",ИСТИНА)  
					 //ИЛИ Объект.Партнер.ИндивидуальныеСкидки = ИСТИНА 
					 Тогда
					 
				 Иначе
					 
					Если Объект.СкидкаЗаПредоплату = ИСТИНА Тогда
						 стрТовары.ПроцентРучнойСкидки = стрТовары.ПроцентРучнойСкидки + СкидкаЗаПредоплатуРазмер;
					КонецЕсли; 
				КонецЕсли;
				/////
				
				
				КэшированныеЗначения = Неопределено;
				
				СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
				
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
				СтруктураДействий.Вставить("ПересчитатьСумму");
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
				СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());

				
				// Сезонная применение
				
				СкидкаСезоннаяРазмер = 0;
				Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
					ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
					 ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
					 ИЛИ Объект.СкидкаИндивидуальная = ИСТИНА Тогда
					     ПересчетВСЕЙТЧ = ИСТИНА;
						СкидкаСезоннаяРазмер = 0; 
				 Иначе
					 
					 Если НачалоДня(Объект.Дата) >= Дата("20221024") И ТекущаяДата()<Дата("20230101")
						 ИЛИ НачалоДня(Объект.Дата) >= Дата("20231001") И НачалоДня(Объект.Дата)<Дата("20231221") 
						 ИЛИ НачалоДня(Объект.Дата) >= Дата("20241001") И НачалоДня(Объект.Дата)<Дата("20241221")
						 ИЛИ НачалоДня(Объект.Дата) >= Дата("20251001") И  НачалоДня(Объект.Дата)<Дата("20251221")
						 //ТекущаяДата()<Дата("20231221") 
						 Тогда      //jadmin Сезонная скидка
						 
						 Если стрТовары.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")   //Овощи фасованные 
							 ИЛИ стрТовары.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
							 ИЛИ стрТовары.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")   //Цветы фасованные 
							 ИЛИ стрТовары.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
							 Тогда
							 Если Месяц(Объект.Дата) = 10 
								 ИЛИ Месяц(Объект.Дата) = 11 
								 ИЛИ (Месяц(Объект.Дата) = 12 И НачалоДня(Объект.Дата) < Дата("20251221")) 
								 Тогда  
								 СкидкаСезоннаяРазмер = Объект.СкидкаСезоннаяПроцент;
							 КонецЕсли;  
						 КонецЕсли; 
						 
					 КонецЕсли;
					 
					стрТовары.ПроцентРучнойСкидки = стрТовары.ПроцентРучнойСкидки + СкидкаСезоннаяРазмер;
					
					
										
					 ///jadmin ДопСкидка
					ПроцентДопСкидки = 0;
					ЦенаСоСкидкойПоследовательноеПрименение = 0;
					ПроцентДопСкидки = ПроверитьДопСкидку(стрТовары.Номенклатура,стрТовары.Серия);
					Если ПроцентДопСкидки<>1 Тогда

						ПроцентСкидкиСУчетомДопСкидки = (1-(1 - стрТовары.ПроцентРучнойСкидки / 100) * ПроцентДопСкидки) * 100;
						стрТовары.ПроцентРучнойСкидки = ПроцентСкидкиСУчетомДопСкидки;

						
						
					//
					//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стрТовары, СтруктураДействий, КэшированныеЗначения);

					
						//ЦенаСоСкидкойПоследовательноеПрименение = стрТовары.ЦенаСоСкидкой * (100 - ДопСкидка) / 100; 
						//ПроцентСкидкиСУчетомДопСкидки =  (1 - ЦенаСоСкидкойПоследовательноеПрименение / стрТовары.Цена) * 100;
						//стрТовары.ПроцентРучнойСкидки = ПроцентСкидкиСУчетомДопСкидки;
						
					//	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Объект);
					//
					//	СтруктураДействий = Новый Структура;
					//	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
					//	СтруктураДействий.Вставить("ПересчитатьСумму");
					//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
					//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
					//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
					//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
					//	
					//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(стрТовары, СтруктураДействий, КэшированныеЗначения);
					//Иначе	
					//	ПересчетВСЕЙТЧ = ИСТИНА;
					КонецЕсли;					
					
					ПересчетВСЕЙТЧ = ИСТИНА;

					
				 КонецЕсли 
			 Иначе
				 стрТовары.ПроцентРучнойСкидки = 0;
				 стрТовары.ПроцентАвтоматическойСкидки = 0;				 
			 КонецЕсли;			 
		 КонецЦикла; 	
		 
		 
		 Если ПересчетВСЕЙТЧ = Истина Тогда							
			ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Товары, СтруктураДействий, КэшированныеЗначения);
		КонецЕсли; 
		 
		Объект.СкидкаОбщая = Объект.СкидкаЗаПредоплатуПроцент + Объект.СкидкаСезоннаяПроцент + Объект.СкидкаОборотПроцент + Объект.СкидкаИндивидуальнаяПроцент;
	//КонецЕсли; 
	
КонецПроцедуры


Функция ПроверитьДопСкидку(Номенклатура,Серия)
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	ДопСкидка = 0;
	ПроцентДопСкидки = 1;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидкиАкцииОптТовары.Номенклатура КАК Номенклатура,
		|	СкидкиАкцииОптТовары.Ссылка.ПроцентСкидки КАК ПроцентСкидки,
		|	СкидкиАкцииОптТовары.Ссылка.Скидка КАК Скидка,
		|	СкидкиАкцииОптТовары.Ссылка.Проведен КАК Проведен
		|ИЗ
		|	Документ.СкидкиАкцииОпт.Товары КАК СкидкиАкцииОптТовары
		|ГДЕ
		|	&Дата МЕЖДУ СкидкиАкцииОптТовары.Ссылка.НачалоДействия И СкидкиАкцииОптТовары.Ссылка.ОкончаниеДействия
		|	И СкидкиАкцииОптТовары.Ссылка.Проведен = ИСТИНА
		|	И СкидкиАкцииОптТовары.Номенклатура = &Номенклатура
		|	И СкидкиАкцииОптТовары.Ссылка.Скидка = &Скидка
		|	И СкидкиАкцииОптТовары.Ссылка.НеПрименятьВ1С = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Скидка", Справочники.РозничныеСкидки_МССО.НайтиПоКоду("000000002"));       //процентная скидка
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДопСкидка = ВыборкаДетальныеЗаписи.ПроцентСкидки;	
		ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
	КонецЦикла;
	
	
	Если Объект.Дата >= Дата("20231009") И Объект.Дата <= Дата("20240126235959") Тогда
			
			Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
				И Серия.ДатаИзготовления <  Дата("20230101")
				Тогда			
				ДопСкидка = 15;	
				ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
			КонецЕсли;
	КонецЕсли;

	Если Объект.Дата >= Дата("20240127") И Объект.Дата <= Дата("20241231235959") Тогда
		
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002"))
			И Серия.ДатаИзготовления <  Дата("20230101") Тогда
			ДопСкидка = 30;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
			
			
		ИначеЕсли (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
			И Серия.ДатаИзготовления <  Дата("20230101")
			Тогда			
			ДопСкидка = 40;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;
	КонецЕсли;

	
	Если Объект.Дата >= Дата("20241202") И Объект.Дата <= Дата("20241231235959") Тогда
		
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002"))
			И Серия.ДатаИзготовления <  Дата("20240101") Тогда
			ДопСкидка = 10;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;	
			
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
			И Серия.ДатаИзготовления <  Дата("20240101")
			Тогда			
			ДопСкидка = 10;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;
	КонецЕсли;   
	
	
	Если Объект.Дата >= Дата("20250109") И Объект.Дата <= Дата("20250130235959") Тогда
		
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002"))
			И Серия.ДатаИзготовления <  Дата("20240101") Тогда
			ДопСкидка = 10;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;	
			
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
			И Серия.ДатаИзготовления <  Дата("20240101")
			Тогда			
			ДопСкидка = 10;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;
	КонецЕсли; 
	
	
	Если Объект.Дата >= Дата("20250131") И Объект.Дата <= Дата("20250228235959") Тогда
		
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002"))
			И Серия.ДатаИзготовления <  Дата("20240101") Тогда
			ДопСкидка = 20;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;	
			
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
			И Серия.ДатаИзготовления <  Дата("20240101")
			Тогда			
			ДопСкидка = 20;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;
	КонецЕсли;

	

	////Приказ 21 от 22.01.2025
	Если Объект.Дата >= Дата("20250123") И Объект.Дата <= Дата("20250331235959") Тогда
		
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002"))
			И Серия.ДатаИзготовления <  Дата("20230101") Тогда
			ДопСкидка = 40;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;	
			
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
			И Серия.ДатаИзготовления <  Дата("20230101")
			Тогда			
			ДопСкидка = 40;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;
	КонецЕсли;  
	
		////Приказ 21 от 22.01.2025
	Если Объект.Дата >= Дата("20250306") И Объект.Дата <= Дата("20250430235959") Тогда
		
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002"))
			И Серия.ДатаИзготовления <  Дата("20240101") Тогда
			ДопСкидка = 20;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;	
			
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
			И Серия.ДатаИзготовления <  Дата("20240101")
			Тогда			
			ДопСкидка = 20;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;
	КонецЕсли;

	////Приказ 151 от 02.05.2025
	Если Объект.Дата >= Дата("20250505") И Объект.Дата <= Дата("20250531235959") Тогда
		
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002"))
			И Серия.ДатаИзготовления <  Дата("20240101") Тогда
			ДопСкидка = 20;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;	
			
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
			И Серия.ДатаИзготовления <  Дата("20240101")
			Тогда			
			ДопСкидка = 20;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;
	КонецЕсли;
	
		////Приказ 151 от 02.05.2025
	Если Объект.Дата >= Дата("20250603") И Объект.Дата <= Дата("20250630235959") Тогда
		
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002"))
			И Серия.ДатаИзготовления <  Дата("20240101") Тогда
			ДопСкидка = 20;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;	
			
		Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
			ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003"))
			И Серия.ДатаИзготовления <  Дата("20240101")
			Тогда			
			ДопСкидка = 20;	
			ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);
		КонецЕсли;
	КонецЕсли;
	
	
	//Приказ на семена старой фасовки 254 от 01.10.25
	Если Объект.Дата >= Дата("20251002") И Объект.Дата <= Дата("20260130235959") Тогда
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
            ИЛИ Объект.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",ИСТИНА) 
			ИЛИ Объект.СкидкаИндивидуальная = ИСТИНА 
			Тогда
			
		Иначе
			
			Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")) Тогда
				Если Серия.ДатаИзготовления < Дата("20230101") Тогда						
					ДопСкидка = 50;	  
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли Серия.ДатаИзготовления >=  Дата("20230101") И Серия.ДатаИзготовления <  Дата("20240101") Тогда					
					ДопСкидка = 40;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли  Серия.ДатаИзготовления >=  Дата("20240101") И Серия.ДатаИзготовления <  Дата("20250101") Тогда					
					ДопСкидка = 15;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;

	
	//Приказ на семена старой фасовки 18 от 02.02.26
	Если Объект.Дата >= Дата("20260202") И Объект.Дата <= Дата("20260228235959") Тогда
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
            ИЛИ Объект.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",ИСТИНА) 
			ИЛИ Объект.СкидкаИндивидуальная = ИСТИНА 
			Тогда
			
		Иначе
			
			Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")) Тогда
				Если Серия.ДатаИзготовления < Дата("20230101") Тогда						
					ДопСкидка = 50;	  
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли Серия.ДатаИзготовления >=  Дата("20230101") И Серия.ДатаИзготовления <  Дата("20240101") Тогда					
					ДопСкидка = 40;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли  Серия.ДатаИзготовления >=  Дата("20240101") И Серия.ДатаИзготовления <  Дата("20250101") Тогда					
					ДопСкидка = 15;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;

	
	
	//Приказ на семена старой фасовки  от 02.03.26
	Если Объект.Дата >= Дата("20260302") И Объект.Дата <= Дата("20260331235959") Тогда
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
            ИЛИ Объект.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",ИСТИНА) 
			ИЛИ Объект.СкидкаИндивидуальная = ИСТИНА 
			Тогда
			
		Иначе
			
			Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")) Тогда
				Если Серия.ДатаИзготовления < Дата("20230101") Тогда						
					ДопСкидка = 50;	  
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли Серия.ДатаИзготовления >=  Дата("20230101") И Серия.ДатаИзготовления <  Дата("20240101") Тогда					
					ДопСкидка = 40;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли  Серия.ДатаИзготовления >=  Дата("20240101") И Серия.ДатаИзготовления <  Дата("20250101") Тогда					
					ДопСкидка = 30;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли; 
	
	 
	
	//Приказ на семена старой фасовки  от 02.03.26
	Если Объект.Дата >= Дата("20260325") И Объект.Дата <= Дата("20260529235959") Тогда
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
            ИЛИ Объект.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",ИСТИНА) 
			ИЛИ Объект.СкидкаИндивидуальная = ИСТИНА 
			Тогда
			
		Иначе
			
			Если (Номенклатура = Справочники.Номенклатура.НайтиПоКоду("00-00000963")
				И Серия = Справочники.СерииНоменклатуры.НайтиПоКоду("00-00137921")) Тогда
				
				ДопСкидка = 50;	
				ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100); 
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	//Приказ на семена старой фасовки 93 от 02.04.26
	Если Объект.Дата >= Дата("20260402") И Объект.Дата <= Дата("20260430235959") Тогда
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
            ИЛИ Объект.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",ИСТИНА) 
			ИЛИ Объект.СкидкаИндивидуальная = ИСТИНА 
			Тогда
			
		Иначе
			
			Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")) Тогда
				Если Серия.ДатаИзготовления < Дата("20230101") Тогда						
					ДопСкидка = 50;	  
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли Серия.ДатаИзготовления >=  Дата("20230101") И Серия.ДатаИзготовления <  Дата("20240101") Тогда					
					ДопСкидка = 40;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли  Серия.ДатаИзготовления >=  Дата("20240101") И Серия.ДатаИзготовления <  Дата("20250101") Тогда					
					ДопСкидка = 30;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	
	//Приказ на семена старой фасовки 129 от 04.05.26
	Если Объект.Дата >= Дата("20260504") И Объект.Дата <= Дата("20260529235959") Тогда
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
            ИЛИ Объект.Соглашение <> Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",ИСТИНА) 
			ИЛИ Объект.СкидкаИндивидуальная = ИСТИНА 
			Тогда
			
		Иначе
			
			Если (Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000002") 
				ИЛИ Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000003")) Тогда
				Если Серия.ДатаИзготовления < Дата("20230101") Тогда						
					ДопСкидка = 50;	  
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли Серия.ДатаИзготовления >=  Дата("20230101") И Серия.ДатаИзготовления <  Дата("20240101") Тогда					
					ДопСкидка = 40;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				ИначеЕсли  Серия.ДатаИзготовления >=  Дата("20240101") И Серия.ДатаИзготовления <  Дата("20250101") Тогда					
					ДопСкидка = 30;	
					ПроцентДопСкидки = ПроцентДопСкидки*(1-ДопСкидка/100);

				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ПроцентДопСкидки;
КонецФункции

Функция ПроверитьСкидкуТрава(Номенклатура)     //jadmin доп скидка на траву с 21-11-2022 по 31.12.2022
	
	ДопСкидка = 0;
	Если Объект.Дата >= Дата("20221121") И Объект.Дата <= Дата("20221231235959") Тогда
		Если Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "РУПС" 
			ИЛИ Объект.Партнер.ВидПартнераКонтрагента.Наименование = "Розница" 
			ИЛИ Объект.СкидкаИндивидуальная = ИСТИНА Тогда
			
		Иначе
			
			Если Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")
				ИЛИ Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")
				ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014") Тогда			
				ДопСкидка = 15;		
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	Возврат ДопСкидка;
	
КонецФункции


&НаСервере
Процедура СкидкаЗаПредоплатуПриИзмененииНаСервере()
	// ПРИМЕНИТЬ СКИДКУ ЗА ПРЕДПОЛАТУ  И ИЗМЕНИТЬ УСЛОВИЯ ОПЛАТЫ
	
	//СкидкаЗаПредоплату = 0;
	
	Если Объект.СкидкаЗаПредоплату = ИСТИНА Тогда
			
		СкидкаЗаПредоплату = 5;
		Объект.СкидкаЗаПредоплатуПроцент = СкидкаЗаПредоплату;
		//
		//Объект.СкидкаОбщая = Объект.СкидкаОбщая + СкидкаЗаПредоплату;
		
		//Заполнение этапов оплаты
		Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
		
		Объект.ЭтапыГрафикаОплаты.Очистить();
		стрЭтапПредоплата = Объект.ЭтапыГрафикаОплаты.Добавить();
		стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
		стрЭтапПредоплата.ДатаПлатежа = Объект.Дата + 86400*3;
		//стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
		стрЭтапПредоплата.ПроцентПлатежа = 100;
		стрЭтапПредоплата.СуммаПлатежа = Объект.СуммаДокумента;
		
		
		
	Иначе		                     
		СкидкаЗаПредоплату = 0;
		Объект.СкидкаЗаПредоплатуПроцент = СкидкаЗаПредоплату;

		
		Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным;	
		Объект.ЭтапыГрафикаОплаты.Очистить();
			
	КонецЕсли; 	

  НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура СкидкаЗаПредоплатуПриИзменении(Элемент)
	СкидкаЗаПредоплатуПриИзмененииНаСервере();
	ПрименитьСкидку("");  
	
КонецПроцедуры

&НаСервере
Процедура СрокДействияЗаказаПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		ДатаОплатыПлан = НачалоДня(Объект.Дата)+86400*3;
	Иначе
		ДатаОплатыПлан = НачалоДня(ТекущаяДата())+86400*3;	
	КонецЕсли; 
	
	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда	
		Для каждого стр Из Объект.ЭтапыГрафикаОплаты Цикл
		    Если стр.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки Тогда
			    ДатаОплатыПлан = стр.ДатаПлатежа;
				Прервать;
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;

	Если РольДоступна("АдминистраторСистемы")
		ИЛИ РольДоступна("MSSO_МенеджерыПродажРуководитель")Тогда
		
	Иначе
		
		Если Объект.СрокДействияЗаказа > (ДатаОплатыПлан + 86400*2)  Тогда
			Сообщить("Нельзя устанавливать срок действия заявки больше, чем 5 дней от даты оплаты(при предоплате) или даты заявки");
			Объект.СрокДействияЗаказа = ДатаОплатыПлан + 86400*2;
		КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияЗаказаПриИзменении(Элемент)
	СрокДействияЗаказаПриИзмененииНаСервере();
КонецПроцедуры



Функция ПроверитьДоступностьВШт(Номенклатура,Серия,Склад)
	
	Доступно = 0;
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзвешенныеТоварыОстатки.Склад КАК Склад,
		|	ВзвешенныеТоварыОстатки.Номенклатура КАК Номенклатура,
		|	ВзвешенныеТоварыОстатки.Серия КАК Серия,
		|	ВзвешенныеТоварыОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ВзвешенныеТоварыОстатки.ВРезервеОстаток КАК ВРезервеОстаток
		|ИЗ
		|	РегистрНакопления.ВзвешенныеТовары.Остатки КАК ВзвешенныеТоварыОстатки
		|ГДЕ
		|	ВзвешенныеТоварыОстатки.Склад = &Склад
		|	И ВзвешенныеТоварыОстатки.Номенклатура = &Номенклатура
		|	И ВзвешенныеТоварыОстатки.Серия = &Серия";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Серия", Серия);
	Запрос.УстановитьПараметр("Склад", Склад);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Доступно =  ВыборкаДетальныеЗаписи.КоличествоОстаток - ВыборкаДетальныеЗаписи.ВРезервеОстаток;
	КонецЦикла;
	

	Возврат Доступно;

КонецФункции // ()
 
Функция НайтиОрдерКОтгрузке(Распоряжение)
	НашлиОрдер = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение КАК Распоряжение,
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
		|	И (РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = &Статус1
		|		ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = &Статус2
		|		ИЛИ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = &Статус3)";
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);
	Запрос.УстановитьПараметр("Статус1", Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
	Запрос.УстановитьПараметр("Статус2", Перечисления.СтатусыРасходныхОрдеров.Отгружен);
	Запрос.УстановитьПараметр("Статус3", Перечисления.СтатусыРасходныхОрдеров.Проверен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		НашлиОрдер = ИСТИНА;
	КонецЕсли;
	
	Возврат НашлиОрдер;
	

КонецФункции // ()


Функция ПроверитьЗаявкуНаЛук(ТЧ_Товары)

	ЭтоЛук = ИСТИНА;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ_Товары.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ТЗ_ТОВАРЫ
		|ИЗ
		|	&ТЗ_Товары КАК ТЗ_Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыТЧ.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_ТЗ_ТОВАРЫ КАК ТоварыТЧ
		|ГДЕ
		|	НЕ (ТоварыТЧ.Номенклатура В ИЕРАРХИИ(&Родитель))";
	
		Запрос.УстановитьПараметр("Родитель", Справочники.Номенклатура.НайтиПоКоду("00-00000016"));  ///6.  Лук-севок и чеснок
		Запрос.УстановитьПараметр("ТЗ_Товары", ТЧ_Товары);
	//Запрос.УстановитьПараметр("ТипСклада", ТипСклада);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();	

	Если РезультатЗапроса.Количество() > 0 Тогда
	
		ЭтоЛук = ЛОЖЬ;
	
	КонецЕсли;
	
	Возврат ЭтоЛук;
	
КонецФункции

Функция ПроверитьКонтрагентаНаПризнакОтгрузкуРазрешил(Контрагент)
	ЕстьРазрешение = ЛОЖЬ;
	
	НаборЗаписей = РегистрыСведений.СписокКлиентовСПризнакомОтгрузкуРазрешил.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество()>0 Тогда
	
		ЕстьРазрешение = ИСТИНА;
	
	КонецЕсли; 
	
	Возврат ЕстьРазрешение;
КонецФункции // ()

Функция ПолучитьТоварыСЗапретомОтгрузки(ТЧ_Товары)
	ЗапретДоставки = ЛОЖЬ;
	Для каждого стр Из ТЧ_Товары Цикл
	    Номенклатура = стр.Номенклатура;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗапретДоставкиТоваров.Номенклатура КАК Номенклатура
			|ИЗ
			|	РегистрСведений.ЗапретДоставкиТоваров КАК ЗапретДоставкиТоваров
			|ГДЕ
			|	(ЗапретДоставкиТоваров.Номенклатура = &Номенклатура
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель1
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель2
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель3
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель4
			|			ИЛИ ЗапретДоставкиТоваров.Номенклатура = &НоменклатураРодитель5)";
		
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НоменклатураРодитель1", Номенклатура.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель2", Номенклатура.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель3", Номенклатура.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель4", Номенклатура.Родитель.Родитель.Родитель.Родитель);
	Запрос.УстановитьПараметр("НоменклатураРодитель5", Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель);

		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщить("Строка" +стр.НомерСтроки + " "+ стр.Номенклатура + " установлен запрет доставки товара, необходимо выбрать самовывоз или согласовать другие условия доставки!" );
			ЗапретДоставки = ИСТИНА;
		КонецЦикла;

	КонецЦикла; 
	
	Возврат ЗапретДоставки;
КонецФункции // ()
  

Функция ПроверитьВыписанаНакладная(Ссылка)

    НакладнаяВыписана = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента = &ЗаказКлиента
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.ЗаказКлиента";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НакладнаяВыписана = ИСТИНА;
	КонецЦикла;
	
	Возврат НакладнаяВыписана;

КонецФункции // ()


&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент) 
	А = 1;
	// Вставить содержимое обработчика.
КонецПроцедуры

