
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОрганизацияСсылка				= Параметры.ОрганизацияСсылка;
	ВидОрганизации					= Параметры.ВидОрганизации;
	ПрименятьРайонныйКоэффициент	= Параметры.ПрименятьРайонныйКоэффициент;
	ПрименятьСевернуюНадбавку		= Параметры.ПрименятьСевернуюНадбавку;
	РайонныйКоэффициент				= Параметры.РайонныйКоэффициент;
	РайонныйКоэффициентРФ			= Параметры.РайонныйКоэффициентРФ;
	ГрафикРаботыСотрудников			= Параметры.ГрафикРаботыСотрудников;
	ПроцентСевернойНадбавки			= Параметры.ПроцентСевернойНадбавки;
	
	
	УстановитьДоступностьЭлементовФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы,, ТекстПредупреждения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Возврат;	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Возврат;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименятьРайонныйКоэффициентПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормы(ЭтаФорма);
	РайонныйКоэффициент   = 1;
	РайонныйКоэффициентРФ = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПрименятьСевернуюНадбавкуПриИзменении(Элемент)
	
	Если НЕ ПрименятьСевернуюНадбавку Тогда
		ПрименятьСевернуюНадбавкуПриИзмененииНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТерриториальныеУсловияПФРПриИзменении(Элемент)
	ПриИзмененииТерриториальныхУсловий(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СохранитьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ТерриториальныеУсловияПФРИстория(Команда)
	Возврат;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрименятьСевернуюНадбавкуПриИзмененииНаСервере()
	
	Возврат;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииТерриториальныхУсловий(Форма)
	
	Возврат;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементовФормы(Форма)
	Форма.Элементы.РайонныйКоэффициент.Доступность = Форма.ПрименятьРайонныйКоэффициент;
	Форма.Элементы.РайонныйКоэффициентРФ.Доступность = Форма.ПрименятьРайонныйКоэффициент;
	Форма.Элементы.ПрименятьСевернуюНадбавку.Доступность = Форма.ПрименятьРайонныйКоэффициент;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	Возврат // В УТ 11.1 код данного обработчика пустой
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть() Экспорт

	Оповещение = Новый ОписаниеОповещения("СохранитьИЗакрытьЗавершение", ЭтотОбъект);
	СохранитьДанные(Ложь, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрытьЗавершение(Отказ, ДополнительныеПараметры) Экспорт 
	
	Если Не Отказ Тогда
		Модифицированность = Ложь;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ПрименятьРайонныйКоэффициент", ПрименятьРайонныйКоэффициент);
		СтруктураПараметров.Вставить("ПрименятьСевернуюНадбавку",    ПрименятьСевернуюНадбавку);
		СтруктураПараметров.Вставить("РайонныйКоэффициент",          РайонныйКоэффициент);
		СтруктураПараметров.Вставить("РайонныйКоэффициентРФ",        РайонныйКоэффициентРФ);
		СтруктураПараметров.Вставить("ГрафикРаботыСотрудников",      ГрафикРаботыСотрудников);
		СтруктураПараметров.Вставить("ПроцентСевернойНадбавки",      ПроцентСевернойНадбавки);
		
		Закрыть(СтруктураПараметров);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьДанные(Отказ, ОповещениеЗавершения = Неопределено)
	
	Возврат; // В УТ обработчик пустой
	
КонецПроцедуры


#КонецОбласти
