
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Рассчитывает сумму неотмененных строк заказа
// 
//Параметры:
//	ТолькоЗалогЗаТару - Булево - признак залога за тару
//
// Возвращаемое значение:
//	Число - сумма заменяющих строк
//
Функция ПолучитьСуммуЗаказанныхСтрок(ТолькоЗалогЗаТару = Ложь) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.Отменено КАК Отменено
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Отменено
	|	И (((Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИЛИ (НЕ &ВернутьМногооборотнуюТару) ИЛИ &ТребуетсяЗалогЗаТару)
	|			И НЕ &ТолькоЗалогЗаТару)
	|		ИЛИ (Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			И &ВернутьМногооборотнуюТару
	|			И &ТребуетсяЗалогЗаТару
	|			И &ТолькоЗалогЗаТару))
	|");
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаСНДС,Отменено"));
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	Запрос.УстановитьПараметр("ТолькоЗалогЗаТару", ТолькоЗалогЗаТару);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаЗаказанныхСтрок = Выгрузка[0].СуммаСНДС;
	Возврат СуммаЗаказанныхСтрок;
	
КонецФункции




// Рассчитывает количество заказанных строк заказа
//
Функция ПолучитьКоличествоЗаказанныхСтрок() Экспорт
	
	НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("Отменено", Ложь));
	Возврат НайденныеСтроки.Количество();
	
КонецФункции

// Заполняет табличную часть ЭтапыГрафикаОплаты
//
Процедура ЗаполнитьЭтапыГрафикаОплаты(СуммаКорректировки = 0, ТолькоРаспределять = Ложь) Экспорт
	
	СуммаЗаказано       = ПолучитьСуммуЗаказанныхСтрок();
	СуммаЗалогаЗаТару   = ПолучитьСуммуЗаказанныхСтрок(Истина);
	
	Если СуммаЗаказано = 0 И СуммаЗалогаЗаТару = 0 Тогда
		ЭтапыГрафикаОплаты.Очистить();
		Возврат;
	КонецЕсли;
	
	Если НЕ ТолькоРаспределять Тогда
		ЭтапыГрафикаОплаты.Очистить();
	Иначе
		СуммаЗаказано = СуммаЗаказано - СуммаЗалогаЗаТару;
	КонецЕсли;
	
	ГрафикСоглашенияЗаполнен = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
		И ПродажиВызовСервера.ГрафикСоглашенияЗаполнен(Соглашение);
	ГрафикЗаполнен = ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты")
		И ЗначениеЗаполнено(ГрафикОплаты);
	
	ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПродажи(
		ЭтотОбъект,
		ГрафикСоглашенияЗаполнен,
		ГрафикЗаполнен,
		СуммаЗаказано,
		СуммаЗалогаЗаТару,,,ТолькоРаспределять);
		
	ЭтапыОплатыСервер.РаспределитьСуммуОтклоненияПоЭтапамГрафикаОплаты(
							ЭтотОбъект.ЭтапыГрафикаОплаты,
							СуммаКорректировки);
							
	Если ЭтапыГрафикаОплаты.Количество() = 0 Тогда
		
		ЭтапыОплатыКлиентСервер.ДобавитьЭтапОплатыПоУмолчанию(
			ЭтотОбъект,
			Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки,
			ЖелаемаяДатаОтгрузки,
			СуммаЗаказано,
			СуммаЗалогаЗаТару,
			СуммаКорректировки);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет условия продаж в заказе клиента
//
// Параметры:
//	УсловияПродаж - Структура - Структура для заполнения
//
Процедура ЗаполнитьУсловияПродаж(Знач УсловияПродаж) Экспорт
	
	Если УсловияПродаж = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Валюта = УсловияПродаж.ВалютаВзаиморасчетов;
	ХозяйственнаяОперация = УсловияПродаж.ХозяйственнаяОперация;
	
	Если ЗначениеЗаполнено(УсловияПродаж.ГрафикОплаты) Тогда
		ГрафикОплаты = УсловияПродаж.ГрафикОплаты;
	КонецЕсли;
	
	НалогообложениеНДС   		   = УсловияПродаж.НалогообложениеНДС;
	ЦенаВключаетНДС      		   = УсловияПродаж.ЦенаВключаетНДС;
	ВернутьМногооборотнуюТару 	   = УсловияПродаж.ВозвращатьМногооборотнуюТару;
	СрокВозвратаМногооборотнойТары = УсловияПродаж.СрокВозвратаМногооборотнойТары;
	ТребуетсяЗалогЗаТару 		   = УсловияПродаж.ТребуетсяЗалогЗаТару;
	НаправлениеДеятельности 	   = УсловияПродаж.НаправлениеДеятельности;
	
	ИзмененаОрганизация = ЗначениеЗаполнено(УсловияПродаж.Организация) И УсловияПродаж.Организация <> Организация;
	ИзмененаФормаОплаты = ЗначениеЗаполнено(УсловияПродаж.ФормаОплаты) И УсловияПродаж.ФормаОплаты <> ФормаОплаты;
	
	ФормаОплаты = УсловияПродаж.ФормаОплаты;
	
	Если ИзмененаОрганизация Тогда
		Организация = УсловияПродаж.Организация;
	КонецЕсли;
	
	Если ИзмененаОрганизация Или ИзмененаФормаОплаты Тогда
		
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация    			= Организация;
		СтруктураПараметров.НаправлениеДеятельности = НаправлениеДеятельности;
		
		//jadmin
		Если НЕ ЗначениеЗаполнено(БанковскийСчет) Тогда
			БанковскийСчет = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);		
		КонецЕсли; 
		///
		
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация    			= Организация;
		СтруктураПараметров.НаправлениеДеятельности = НаправлениеДеятельности;
		СтруктураПараметров.ФормаОплаты 			= ФормаОплаты;

		Касса  = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
		
	КонецЕсли;
	
	Если Не УсловияПродаж.Типовое Тогда
		Если ЗначениеЗаполнено(УсловияПродаж.Контрагент) Тогда
			Контрагент = УсловияПродаж.Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	
	Если Не УсловияПродаж.Типовое Тогда
		Если ЗначениеЗаполнено(УсловияПродаж.КонтактноеЛицо) 
			И НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
			КонтактноеЛицо = УсловияПродаж.КонтактноеЛицо;
		КонецЕсли;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Партнер, КонтактноеЛицо);
	
	Если УсловияПродаж.ИспользуютсяДоговорыКонтрагентов <> Неопределено И УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда

		Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, ХозяйственнаяОперация, Валюта);
		
		ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчет, БанковскийСчетКонтрагента);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности") Тогда
			НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(НаправлениеДеятельности, Соглашение, Договор);
		КонецЕсли;
		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(УсловияПродаж.ИспользуютсяДоговорыКонтрагентов) 
		ИЛИ НЕ УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда
		ПорядокОплаты = УсловияПродаж.ПорядокОплаты;
	Иначе
		ПорядокОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокОплаты");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПродаж.Склад) Тогда
		Склад = УсловияПродаж.Склад;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПродаж.ГруппаФинансовогоУчета) Тогда
		ГруппаФинансовогоУчета = УсловияПродаж.ГруппаФинансовогоУчета;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПродаж.СрокПоставки)
		И ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента")
		И ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента") Тогда
		ДатаНачала = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата());
		ЖелаемаяДатаОтгрузки = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаНачала,Перечисления.Периодичность.День, УсловияПродаж.СрокПоставки) + 1;
	Иначе
		ЖелаемаяДатаОтгрузки = Дата(1,1,1);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет условия продаж по умолчанию в заказе клиента
//
Процедура ЗаполнитьУсловияПродажПоУмолчанию() Экспорт
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
	Если ЗначениеЗаполнено (Партнер) ИЛИ Не ИспользоватьСоглашенияСКлиентами Тогда
		
		УсловияПродажПоУмолчанию = ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(
			Партнер,
			Новый Структура("УчитыватьГруппыСкладов, ВыбранноеСоглашение, ПустаяСсылкаДокумента", 
			Истина, 
			Соглашение,
			Документы.ЗаказКлиента.ПустаяСсылка()));
			
		
		Если УсловияПродажПоУмолчанию <> Неопределено Тогда
			
			Если НЕ ИспользоватьСоглашенияСКлиентами ИЛИ 
				(Соглашение <> УсловияПродажПоУмолчанию.Соглашение И ЗначениеЗаполнено(УсловияПродажПоУмолчанию.Соглашение)) Тогда
			
				Соглашение = УсловияПродажПоУмолчанию.Соглашение;
				ЗаполнитьУсловияПродаж(УсловияПродажПоУмолчанию);
				
				Если ИспользоватьСоглашенияСКлиентами Тогда
					СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
					ПродажиСервер.ЗаполнитьЦены(
						Товары,
						, // Массив строк или структура отбора
						Новый Структура( // Параметры заполнения
							"Дата, Валюта, Соглашение, РасчитыватьНаборы, ПоляЗаполнения",
							Дата,
							Валюта,
							Соглашение,
							Истина,
							"Цена, СтавкаНДС, ВидЦены, СрокПоставки"
						),
						Новый Структура( // Структура действий с измененными строками
							"ПересчитатьСумму, ПересчитатьСуммуСНДС, ПересчитатьСуммуНДС, ПересчитатьСуммуРучнойСкидки, ОчиститьАвтоматическуюСкидку, ПересчитатьСуммуСУчетомРучнойСкидки",
							"КоличествоУпаковок", СтруктураПересчетаСуммы, СтруктураПересчетаСуммы, "КоличествоУпаковок", Неопределено, Новый Структура("Очищать", Ложь)));
						КонецЕсли;
			Иначе
				Соглашение = УсловияПродажПоУмолчанию.Соглашение;
			КонецЕсли;
		Иначе
			ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
			Соглашение = Неопределено;
		КонецЕсли;
		
		БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
		
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Партнер,КонтактноеЛицо);
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		АдресДоставки = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(Партнер);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НалогообложениеНДС) И ИспользоватьСоглашенияСКлиентами Тогда
		НалогообложениеНДС = ЗначениеНастроекПовтИсп.ПолучитьНалогообложениеНДС(Организация, Склад, Дата);
	КонецЕсли;
		
КонецПроцедуры

// Заполняет условия продаж по соглашению в заказе клиента
//
Процедура ЗаполнитьУсловияПродажПоСоглашению() Экспорт
	
	УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина);
	ЗаполнитьУсловияПродаж(УсловияПродаж);
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
	ПродажиСервер.ЗаполнитьЦены(
		Товары,
		, // Массив строк или структура отбора
		Новый Структура( // Параметры заполнения
			"Дата, Валюта, Соглашение, РасчитыватьНаборы, ПоляЗаполнения",
			Дата,
			Валюта,
			Соглашение,
			Истина,
			"Цена, СтавкаНДС, ВидЦены, СрокПоставки"
		),
		Новый Структура( // Структура действий с измененными строками
			"ПересчитатьСумму, ПересчитатьСуммуСНДС, ПересчитатьСуммуНДС, ПересчитатьСуммуРучнойСкидки, ОчиститьАвтоматическуюСкидку, ПересчитатьСуммуСУчетомРучнойСкидки",
			"КоличествоУпаковок", СтруктураПересчетаСуммы, СтруктураПересчетаСуммы, "КоличествоУпаковок", Неопределено, Новый Структура("Очищать", Ложь)));
			
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    			= Организация;
	СтруктураПараметров.БанковскийСчет 			= БанковскийСчет;
	СтруктураПараметров.НаправлениеДеятельности = УсловияПродаж.НаправлениеДеятельности;
	БанковскийСчет            = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
	
	БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
	
	Если Не ЗначениеЗаполнено(НалогообложениеНДС) Тогда
		НалогообложениеНДС = ЗначениеНастроекПовтИсп.ПолучитьНалогообложениеНДС(Организация, Склад, Дата);
	КонецЕсли;
	
		
		 ЗаполнитьЦеныПоСериям();
	
КонецПроцедуры

// Устанавливает статус для объекта документа
//
// Параметры:
//	НовыйСтатус - Строка - Имя статуса, который будет установлен у заказов
//	ДополнительныеПараметры - Структура - Структура дополнительных параметров установки статуса
//
// Возвращаемое значение:
//	Булево - Истина, в случае успешной установки нового статуса
//
Функция УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаказовКлиентов[НовыйСтатус];
	
	Если ЗначениеНовогоСтатуса = Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
		
		Если Согласован Тогда
			Согласован = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		
		ЗаказИзменен = ЗаказыСервер.СкорректироватьСтрокиЗаказа(ЭтотОбъект, ДополнительныеПараметры);
		
	КонецЕсли;
	
	Статус = ЗначениеНовогоСтатуса;
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента);
	
	ЭтоЗаказСоСклада = ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента")
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента");
	
	Если ЭтоЗаказСоСклада Тогда
		ОбеспечениеСервер.ЗаполнитьВариантОбеспеченияПоУмолчанию(Товары, Ложь, Статус);
	КонецЕсли;
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	
	Возврат ПроверитьЗаполнение();
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий


&НаСервере   
Функция ЭтоАдминистратор(ТекущийПользователь);  /////////77w qaws
	  КтоИмя = Справочники.Пользователи.НайтиПоНаименованию(ТекущийПользователь,Истина);
	  Если КтоИмя <> Справочники.Пользователи.ПустаяСсылка() Тогда
	  	   Если СокрЛП(КтоИмя.Наименование) = "Администратор" Тогда
		   	    Возврат("Администратор"); 
		   КонецЕсли;  
	  КонецЕсли; 
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
	//Банкрот = ОбщийМодуль77w.ПроверитьВхождениеВРеесстрОБанкротсвеИзРегистра(ЭтотОбъект.Контрагент.ИНН);
	//
	//Если Банкрот = ИСТИНА Тогда
	//    Сообщить( "Внимание! Контрагент включен в ""Единый государственный реестр сведений о банкротстве!""");
	//    //Отказ = Истина;
	//КонецЕсли; 
    
    
    
    //Если ЭтотОбъект.Модифицированность() = Ложь Тогда
    
    //	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
    //			
    //	КтоЭто = ЭтоАдминистратор(ТекущийПользователь);
    
    //	Если КтоЭто <> "Администратор"  Тогда
    //		Если ЭтотОбъект.Автор <> ТекущийПользователь Тогда
    //			Сообщить("У Вас нет прав удалять или делать не проведенной не свою заявку!");
    //			Отказ = Истина;
    //		КонецЕсли;
    //	КонецЕсли;	
    //КонецЕсли;
	
    Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
			
			Если ЭтотОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
				 Если ТипЗнч(ЭтотОбъект.АдресДоставки) = Тип("СправочникСсылка.ПунктыРазгрузкиПогрузкиКлиентов") Тогда
					 Если (НЕ ЗначениеЗаполнено(ЭтотОбъект.АдресДоставки.Координаты_СШ)) или  
						 (НЕ ЗначениеЗаполнено(ЭтотОбъект.АдресДоставки.Координаты_ВД)) Тогда
						    Сообщить("Не заполнены географические координаты в адресе доставки ");
						 	Отказ = Истина;
					  КонецЕсли; 
				 КонецЕсли; 
			КонецЕсли; 
		
		КонецЕсли;
				
		
		Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
			ЕстьПросроченныеАнализы = ОбщийМодуль77w.ПроверкаНаСрокАнализовДляЛука(ЭтотОбъект,Товары);
                                                            
		
			Если ЕстьПросроченныеАнализы = Истина Тогда
				Отказ = Истина;
			КонецЕсли; 
		
		КонецЕсли; 
		
	КонецЕсли;
	
    Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин И ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Отменен Тогда
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 10
        |	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
        |	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
        |	СостоянияЗаказовКлиентов.Заказ.Ссылка КАК ЗаказСсылка,
        |	СостоянияЗаказовКлиентов.Заказ.Статус КАК ЗаказСтатус,
        |	СостоянияЗаказовКлиентов.Заказ.ДокументОснование КАК ЗаказДокументОснование
        |ИЗ
        |	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
        |ГДЕ
        |	СостоянияЗаказовКлиентов.Заказ.Ссылка = &Ссылка";
        
        Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
        
        РезЗпр = Запрос.Выполнить().Выбрать();
        
        ЗаказЗакрыт = ЛОЖЬ;
        Пока РезЗпр.Следующий() Цикл         
            Если РезЗпр.Состояние = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
                ЗаказЗакрыт = ИСТИНА;
            Иначе
                ЗаказЗакрыт = ЛОЖЬ;
                Прервать;
            КонецЕсли;           
        КонецЦикла;
        
        Если ЗаказЗакрыт = ИСТИНА Тогда
            Сообщить("По заказу выписана накладная");
            Отказ = Истина;
        КонецЕсли;	
        
    КонецЕсли; 
	
	//jadmin СтрокВЭквиваленте
	ТЧ_Товары = ЭтотОбъект.Товары.Выгрузить();	
	ЭтотОбъект.КоличествоСтрокВЭквиваленте = ОбщийМодуль77w.ПолучитьКолВоСтрокЭквивалентОбщий(ТЧ_Товары,ЭтотОбъект.Склад,ЭтотОбъект.Дата);
	////
    
    ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь(); 
    
    Если РольДоступна("АдминистраторСистемы")  Тогда
        
    Иначе
        Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
            Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
                Сообщить("Нет прав на отмену проведения заказа");
                Отказ = Истина;
            КонецЕсли;
        КонецЕсли;
    КонецЕсли;
    
    
    Если ОбменДанными.Загрузка Тогда
        Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Ссылка <> Документы.ЗаказКлиента.ПустаяСсылка() Тогда
		ПрименитьСкидки();  //jadmin Перерасчет скидок при проведении 28-09-2022
	КонецЕсли; 
	
	Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован 
		И ЭтотОбъект.Товары_v1.Количество() = 0 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
	    ТЧ_Товары = ЭтотОбъект.Товары.Выгрузить();
		ЭтотОбъект.Товары_v1.Загрузить(ТЧ_Товары);	
		ЭтотОбъект.СуммаЗаказа_v1 = ТЧ_Товары.Итог("СуммаСНДС");
	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		 ЭтотОбъект.Новый = Истина;
		 ЭтотОбъект.ДатаСозданияЗаказа = ТекущаяДата();
	 Иначе
		 Если НачалоДня(ЭтотОбъект.Дата) <> НачалоДня(ЭтотОбъект.ДатаСозданияЗаказа) Тогда	 
		 	 ЭтотОбъект.Новый = ЛОЖЬ;	 
		 КонецЕсли;
	
	КонецЕсли; 
	
	Если ЭтотОбъект.Контрагент.СостояниеНалогоплательщика = Перечисления.СостоянияНалогоплательщиков.Ликвидирован Тогда
	    Сообщить(""+ЭтотОбъект.Контрагент + " - Ликвидирован! Отгрузка запрещена!");
		Отказ = ИСТИНА;
	
	КонецЕсли;
	
	
    ////77w qaws
	ЕстьЛук = Ложь;    
	ЭтотОбъект.ЛукЕсть = Ложь;
	ЭтотОбъект.РассадаЕсть = Ложь;
	ЭтотОбъект.КартошкаЕсть = Ложь;
	
	ТоварыСПредоплатой = Ложь;
    РассчитанныйВес = 0; СуммаПредоплаты = 0;
    Если ЭтотОбъект.Товары.Количество()>0 Тогда
		Для каждого СтрокаТовара Из ЭтотОбъект.Товары Цикл 
			
			
			/////Проверка на наличие Лука
			
			Если ((СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")    //2.	Саженцы и рассада
				ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")    //2.	Саженцы и рассада
				ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016"))    //2.	Саженцы и рассада
				И НЕ СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000019")) //Чеснок
				
				Тогда
				
				ЭтотОбъект.ЛукЕсть = Истина;
				
			КонецЕсли;
			
			
			Если ((СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004")    //ЛукСевок
				ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004")    //ЛукСевок
				ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000004")))    //ЛукСевок
				 				
				Тогда 
				
				ЭтотОбъект.РассадаЕсть = Истина;
				
			КонецЕсли;
			
			
			
			
			Если СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")    //Картофель
				 				
				Тогда 
				
				ЭтотОбъект.КартошкаЕсть = Истина;
				
			КонецЕсли;
			
			
			///
            ВесСтроки = 0;	
            ВесСтроки =  СтрокаТовара.Номенклатура.ВесЧислитель*СтрокаТовара.Количество;     //jadmin
            РассчитанныйВес = РассчитанныйВес+ВесСтроки;
			
			//Заполнение даты отгрузки   jadmin 010322
			Если ЗначениеЗаполнено(ЭтотОбъект.ДатаОтгрузки) Тогда		
				СтрокаТовара.ДатаОтгрузки = ЭтотОбъект.ДатаОтгрузки;
			КонецЕсли; 
                     
            //jadmin для корректного резервирования товаров перезаполняю статус товара
            Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
				СтрокаТовара.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;	
			КонецЕсли; 
			
			////Проверка на наличие Лука
			//Если ЭтотОбъект.Дата < Дата("20220418") Тогда

			//	Если СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//		ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//		ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//		
			//		ИЛИ СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
			//		ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
			//		ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
			//		
			//		ИЛИ ((СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")    //ЛукСевок
			//			ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")    //ЛукСевок
			//			ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016"))    //ЛукСевок
			//				И НЕ СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000019")) //Чеснок
			//		
			//		Тогда
			//		ЕстьЛук = Истина;
			//		
			//		//Определяем сумму предоплаты
			//		СуммаПредоплаты = СуммаПредоплаты + СтрокаТовара.СуммаСНДС;
			//		
			//		ТоварыСПредоплатой = Истина;
			//	КонецЕсли;
			//
			//			
			//Иначе
			//	
			//	Если СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//		ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//		ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000014")      //  Газонная трава
			//						
			//		//ИЛИ ((СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")    //ЛукСевок
			//		//	ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016")    //ЛукСевок
			//		//	ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000016"))    //ЛукСевок
			//		//		И НЕ СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000019")) //Чеснок
			//		//
			//		Тогда
			//		ЕстьЛук = Истина;
			//		
			//		//Определяем сумму предоплаты
			//		СуммаПредоплаты = СуммаПредоплаты + СтрокаТовара.СуммаСНДС;
			//		
			//		ТоварыСПредоплатой = Истина;
			//	КонецЕсли;

			//
			//КонецЕсли; 

	//		//jadmin Запрет на картофель и весовые семена
	//		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//			
	//			Если ЭтотОбъект.Соглашение.Наименование <> "Благотворительность" Тогда
	//				
	//				
	//				Если СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
	//					ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
	//					ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
	//					
	//					ИЛИ ЭтотОбъект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный") Тогда
	//					
	//					Сообщить("Отгрузка картофеля и весовых семян запрещена");
	//						Если РольДоступна("АдминистраторСистемы") Тогда
	//
	//	                    Иначе
	//							ОТКАЗ = ИСТИНА;
	//						КонецЕсли;
	//				КонецЕсли;
	//			КонецЕсли; 
	//			
	//		КонецЕсли; 
			
		КонецЦикла; 
	КонецЕсли; 
    
    ЭтотОбъект.ОриентировочныйВес = РассчитанныйВес;
	
   
	
	УсловиеПредоплата = ЭтотОбъект.ЭтапыГрафикаОплаты.Найти(Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки, "ВариантОплаты"); 
	
	//Отключена предоплата 18082022     jadmin
		ТоварыСПредоплатой = ЛОЖЬ;
	////
	
	//Если ЭтотОбъект.Дата >= Дата("20220314") Тогда 	
	//	//Заполняем Этапы оплат по графику Суммы
	//    
	//		Если ЭтотОбъект.КоличествоДнейОтсрочки = 0
	//			И ЭтотОбъект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые")
	//			И ЭтотОбъект.Партнер.ВидПартнераКонтрагента <> Справочники.ВидПартнераКонтрагента.НайтиПоКоду("000000007") Тогда
	//            
	//                ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	//                
	//                ЭтотОбъект.ЭтапыГрафикаОплаты.Очистить();
	//				стрЭтапПредоплата = ЭтотОбъект.ЭтапыГрафикаОплаты.Добавить();
	//				стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
	//				стрЭтапПредоплата.ДатаПлатежа = ЭтотОбъект.Дата + 86400*5;
	//				//стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
	//				стрЭтапПредоплата.ПроцентПлатежа = 100;
	//				стрЭтапПредоплата.СуммаПлатежа = СуммаДокумента;
	//            
	//		Иначе
	//        
	//            
	//			Если ТоварыСПредоплатой = ИСТИНА 
	//				И ЭтотОбъект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые")
	//				И ЭтотОбъект.Партнер.ВидПартнераКонтрагента <> Справочники.ВидПартнераКонтрагента.НайтиПоКоду("000000007") Тогда
	//				
	//				ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	//				
	//				ЭтотОбъект.ЭтапыГрафикаОплаты.Очистить();
	//				стрЭтапПредоплата = ЭтотОбъект.ЭтапыГрафикаОплаты.Добавить();
	//				стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
	//				стрЭтапПредоплата.ДатаПлатежа = ЭтотОбъект.Дата + 86400*5;
	//				//стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
	//				стрЭтапПредоплата.ПроцентПлатежа = Окр(СуммаПредоплаты/СуммаДокумента * 100 - 0.005,2);
	//				стрЭтапПредоплата.СуммаПлатежа = Окр(СуммаДокумента * стрЭтапПредоплата.ПроцентПлатежа / 100,2);

	//				Если стрЭтапПредоплата.ПроцентПлатежа < 100 Тогда
	//				
	//					стрЭтапКредит = ЭтотОбъект.ЭтапыГрафикаОплаты.Добавить();
	//					стрЭтапКредит.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки;
	//					стрЭтапКредит.ДатаПлатежа = ЭтотОбъект.Дата + 86400 * ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору;
	//					стрЭтапКредит.СуммаПлатежа = СуммаДокумента - СуммаПредоплаты;
	//					стрЭтапКредит.ПроцентПлатежа = 100 - стрЭтапПредоплата.ПроцентПлатежа;
	//					//стрЭтапКредит.СуммаПлатежа = Окр(СуммаДокумента * стрЭтапКредит.ПроцентПлатежа / 100,2);

	//				
	//				КонецЕсли;
	//				ЭтотОбъект.СуммаПредоплатыДоОтгрузки = стрЭтапПредоплата.СуммаПлатежа;
	//				СуммаПредоплаты = ЭтотОбъект.СуммаПредоплатыДоОтгрузки;
	//			Иначе
	//				
	//				////jadmin 17-01-2023 отключил чтобы не сбивались условия оплаты
	//				//Если НЕ ЭтотОбъект.РучноеРаспределениеОплат = ИСТИНА Тогда
	//				//	ЭтотОбъект.ЭтапыГрафикаОплаты.Очистить();
	//				//    ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным;
	//				//	СуммаПредоплаты = 0;
	//				//	ЭтотОбъект.СуммаПредоплатыДоОтгрузки = 0;
	//				//КонецЕсли; 
	//				////
	//			КонецЕсли; 
	//	   КонецЕсли;
	//	
	//		//Проверка на предоплату
	//	Если ТоварыСПредоплатой = ИСТИНА 
	//		И УсловиеПредоплата = Неопределено
	//		И ЭтотОбъект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые")
	//		И ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке 
	//		И ЭтотОбъект.Партнер.ВидПартнераКонтрагента <> Справочники.ВидПартнераКонтрагента.НайтиПоКоду("000000007") Тогда    //Торговые сети
	//		
	//		ЕстьОбещанныйПлатеж = ПреверкаОбещанногоПлатежа(ЭтотОбъект.Ссылка);
	//		
	//		Если ЕстьОбещанныйПлатеж = ЛОЖЬ Тогда
	//		    Сообщить("НАРУШЕНЫ УСЛОВИЯ ОПЛАТЫ. Имеются товары, которые отгружаются только по ПРЕДОПЛАТЕ "+ЭтотОбъект.Ссылка);
	//			
	//				ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
	//				Если СтрНайти(Строка(ТекущийПользователь), "Администратор") = 1 
	//					ИЛИ СтрНайти(Строка(ТекущийПользователь), "Волкова Ирина") = 1 
	//						ИЛИ СтрНайти(Строка(ТекущийПользователь), "ШКД_TSD") = 1 Тогда
	//				Иначе
	//					Отказ = ИСТИНА;	
	//				КонецЕсли;	
	//		КонецЕсли;     
	//	КонецЕсли; 
	//КонецЕсли;
	
	///jadmin Если вариант оплаты по заказам и условие кредит после отгрузки 100%, 
	////тогда меняем на порядок расчетов по накладным.
    
    
    Если ЭтотОбъект.Склад.ТипСклада <> Перечисления.ТипыСкладов.РозничныйМагазин Тогда 
        Если ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда
            Для каждого стрОплаты Из ЭтотОбъект.ЭтапыГрафикаОплаты Цикл
                Если стрОплаты.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки
                    И стрОплаты.ПроцентПлатежа = 100 Тогда
                    ЭтотОбъект.ЭтапыГрафикаОплаты.Очистить();
                    ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным;
                КонецЕсли;
            КонецЦикла;
        КонецЕсли;
    КонецЕсли;

	////	

    Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин И ЭтотОбъект.ИнтернетЗаказ = Ложь Тогда 
        
        ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
        ЭтотОбъект.СрокДействияЗаказа =  ЭтотОбъект.Дата + 86400*5;

        ЭтотОбъект.ЭтапыГрафикаОплаты.Очистить();
        
        стрЭтапПредоплата = ЭтотОбъект.ЭтапыГрафикаОплаты.Добавить();
		стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
		стрЭтапПредоплата.ДатаПлатежа = ЭтотОбъект.Дата + 86400*5;
		//стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
		стрЭтапПредоплата.ПроцентПлатежа = 100;
		стрЭтапПредоплата.СуммаПлатежа = ПолучитьСуммуЗаказанныхСтрок();
    
    КонецЕсли;
    
	//Если ЭтотОбъект.СкидкаЗаПредоплату = Истина Тогда
	//     ЭтотОбъект.ЭтапыГрафикаОплаты.Очистить();
	//	стрЭтапПредоплата = ЭтотОбъект.ЭтапыГрафикаОплаты.Добавить();
	//	стрЭтапПредоплата.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки;
	//	стрЭтапПредоплата.ДатаПлатежа = ЭтотОбъект.Дата + 86400*3;
	//	//стрЭтапПредоплата.СуммаПлатежа = СуммаПредоплаты;
	//	стрЭтапПредоплата.ПроцентПлатежа = 100;
	//	стрЭтапПредоплата.СуммаПлатежа = ПолучитьСуммуЗаказанныхСтрок();
	//	
	//	ЭтотОбъект.СуммаПредоплатыДоОтгрузки = ПолучитьСуммуЗаказанныхСтрок();
	//КонецЕсли; 
	
	

	
	
	//jadmin Срок Действия заказа
	Если РольДоступна("АдминистраторСистемы") Тогда
		
	Иначе
		
		ЗаполнитьСрокДействияЗаказа() ;
	
	КонецЕсли;

	
//откл

	//Если ЭтотОбъект.Дата < Дата("20220314") Тогда 	
	//	
	//	ЭтотОбъект.ЭтапыГрафикаОплаты.Очистить();
	//	КредитПослеОтгр = ЭтотОбъект.ЭтапыГрафикаОплаты.Добавить();
	//	КредитПослеОтгр.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки;
	//	КредитПослеОтгр.ДатаПлатежа = ЭтотОбъект.Дата + 86400*5;
	//	КредитПослеОтгр.ПроцентПлатежа = 100;
	//	КредитПослеОтгр.СуммаПлатежа = ЭтотОбъект.СуммаДокумента;
	//    ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	//    
	//	РеализацияОбъект = ЭтотОбъект.ВыписанаНакладная.ПолучитьОбъект();
	//	РеализацияОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;
	//	РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//КонецЕсли;
	//
	//Если ЭтотОбъект.Дата < Дата("20220423") И ЭтотОбъект.Дата >= Дата("20220314") Тогда 
	//	Попытка
	//	
	//		РеализацияОбъект = ЭтотОбъект.ВыписанаНакладная.ПолучитьОбъект();
	//		РеализацияОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным;
	//		РеализацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//
	//	
	//	Исключение
	//	
	//	КонецПопытки;
	//КонецЕсли;
////
	
	////
	    
    ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
    
    ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
    
    ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
    ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
    
    ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);
    
    ЗаказыСервер.УстановитьКлючВСтрокахТабличнойЧасти(ЭтотОбъект, "Товары");
    
    Если (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
        Или Не ВернутьМногооборотнуюТару)
        И ТребуетсяЗалогЗаТару Тогда
        	ТребуетсяЗалогЗаТару = Ложь;
    КонецЕсли;
    
    СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
    СуммаВозвратнойТары = ПолучитьСуммуВозвратнойТары();
    
    ПорядокРасчетов = ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЭтотОбъект);
    
    Если Константы.КонтрольПорядокРасчетовВЗаказахКлиентов.Получить() = Истина Тогда
        Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
            Сообщить("В заказе установлен порядок расчетов по накладным, а нужно по договорам");
            Отказ = Истина;		
        КонецЕсли; 
    КонецЕсли; 
    
    ГрафикИсполненияВДоговоре = Ложь;
    Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
        И ЗначениеЗаполнено(Договор) Тогда
        ГрафикИсполненияВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ЗаданГрафикИсполнения");
    КонецЕСли;
    
    Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
        Или ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным
        Или ГрафикИсполненияВДоговоре Тогда
        
        ЭтапыГрафикаОплаты.Очистить();
        СуммаАвансаДоОбеспечения = 0;
        СуммаПредоплатыДоОтгрузки = 0;
        
    Иначе
        
        Если Не ТребуетсяЗалогЗаТару Тогда
            Для Каждого ЭтапОплаты Из ЭтапыГрафикаОплаты Цикл
                ЭтапОплаты.СуммаЗалогаЗаТару = 0;
            КонецЦикла;
        КонецЕсли;
        
        ПродажиСервер.ЗаполнитьСуммыАвансаПредоплаты(ЭтотОбъект);
        
    КонецЕсли;
    
    Если Не НеОтгружатьЧастями Тогда
        НоваяДатаОтгрузки = Дата(1,1,1);
        
        Если Товары.Количество() > 0 Тогда
            
            Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению
                ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
                ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
                
                ПараметрыОтбора = Новый Структура;
                ПараметрыОтбора.Вставить("Отменено", Ложь);
                СтрокиКОбеспечению = Товары.НайтиСтроки(ПараметрыОтбора);
                
                Если СтрокиКОбеспечению.Количество() > 0 Тогда
                    
                    ТаблицаСтрокКОбеспечению = Товары.Выгрузить(СтрокиКОбеспечению, "ДатаОтгрузки");
                    ТаблицаСтрокКОбеспечению.Сортировать("ДатаОтгрузки Возр");
                    НоваяДатаОтгрузки = ТаблицаСтрокКОбеспечению[0].ДатаОтгрузки;
                    
                КонецЕсли;
                
            КонецЕсли;
            
        КонецЕсли;
        
        ДатаОтгрузки = НоваяДатаОтгрузки;
    Иначе
        ОбеспечениеСервер.ЗаполнитьДатыОтгрузкиВТаблице(ДатаОтгрузки, Товары, "ДатаОтгрузки");
    КонецЕсли;
    
    ДокументСогласован = Согласован;
    
    ОбщегоНазначенияУТ.ИзменитьПризнакСогласованностиДокумента(
    ЭтотОбъект,
    РежимЗаписи,
    Перечисления.СтатусыЗаказовКлиентов.НеСогласован);
    
    // Установим дату согласования, если документ согласован
    Если Не ДокументСогласован И Согласован Тогда
        ДатаСогласования = ТекущаяДатаСеанса();
    КонецЕсли;
    
    // Очистим реквизиты документа не используемые для хозяйственной операции.
    МассивВсехРеквизитов = Новый Массив;
    МассивРеквизитовОперации = Новый Массив;
    Документы.ЗаказКлиента.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
    ХозяйственнаяОперация,
    МассивВсехРеквизитов,
    МассивРеквизитовОперации);
    ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
    ЭтотОбъект,
    МассивВсехРеквизитов,
    МассивРеквизитовОперации);
    
    МассивРеквизитов = Новый Массив;
    Если ФормаОплаты <> Перечисления.ФормыОплаты.Наличная Тогда
        МассивРеквизитов.Добавить("Касса");
    КонецЕсли;
    
    ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(ЭтотОбъект, МассивРеквизитов, Новый Массив);
    
    НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект, НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента));
    
    Если Не ЗначениеЗаполнено(Назначение) Тогда
        
        Обособленно          = Перечисления.ВариантыОбеспечения.Обособленно;
        ОтгрузитьОбособленно = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;
        ТребуетсяНазначение = Ложь;
        
        Для Каждого Строка Из Товары Цикл
            Если Строка.ВариантОбеспечения = Обособленно Или Строка.ВариантОбеспечения = ОтгрузитьОбособленно Тогда
                ТребуетсяНазначение = Истина;
            КонецЕсли;
        КонецЦикла;
        
        Если ТребуетсяНазначение Тогда
            Назначение = Справочники.Назначения.ПолучитьСсылкуДляНовогоЗаказа(НаправлениеДеятельности);
        КонецЕсли;
        
    КонецЕсли;
    
    Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
        УстановитьНовыйНомер();
    КонецЕсли;
    
    Если ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоНакладным Тогда
        ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(ЭтотОбъект);
    Иначе
        ИдентификаторПлатежа = Неопределено;
    КонецЕсли; 
    
	
	
	

	//// Заполнение ключа связи при отсутствии
	Для каждого стрТовар Из ЭтотОбъект.Товары Цикл
	
		Если НЕ ЗначениеЗаполнено(стрТовар.КлючСвязи) Тогда
		
			стрТовар.КлючСвязи = стрТовар.НомерСтроки;
		
		КонецЕсли; 
		
		Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
		
			стрТовар.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
		
		КонецЕсли;
		
	КонецЦикла; 
	
	//jadmin Проверка на выполнение условий оплат по предоплате 
	СуммаОплат = 0;
	Сч = 0;
	СуммаДокумента = ЭтотОбъект.Товары.Итог("СуммаСНДС");	
	Для каждого стрЭтапОплаты Из ЭтотОбъект.ЭтапыГрафикаОплаты Цикл
		Сч = Сч + 1;
		Если Сч = ЭтотОбъект.ЭтапыГрафикаОплаты.Количество() И СуммаОплат <> СуммаДокумента Тогда	
			стрЭтапОплаты.СуммаПлатежа =  СуммаДокумента - СуммаОплат;
		Иначе
			стрЭтапОплаты.СуммаПлатежа = Окр(СуммаДокумента * стрЭтапОплаты.ПроцентПлатежа/100,2);
			СуммаОплат = СуммаОплат + стрЭтапОплаты.СуммаПлатежа; 
		КонецЕсли; 
	КонецЦикла; 
	///

	//jadmin отключил - исправляем в бух
//	Если ЭтотОбъект.ПометкаУдаления = Истина Тогда
//	     
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Ссылка,
//			|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Заказ,
//			|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма КАК Сумма,
//			|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки
//			|ИЗ
//			|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
//			|ГДЕ
//			|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
//			|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = &ЗаказСсылка
//			|
//			|УПОРЯДОЧИТЬ ПО
//			|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата УБЫВ";
//		
//		Запрос.УстановитьПараметр("ЗаказСсылка", ЭтотОбъект.Ссылка);
//		
//		
//		РезультатЗапроса = Запрос.Выполнить().Выбрать();
//		
//			Пока РезультатЗапроса.Следующий() Цикл
//				
//				
//				ПоступлениеДССсылка = РезультатЗапроса.Ссылка.ПолучитьОбъект();
//				
//				Для каждого стрДС Из ПоступлениеДССсылка.РасшифровкаПлатежа Цикл
//				
//				    Если стрДС.Заказ = ЭтотОбъект.Ссылка Тогда
//				        стрДС.ОснованиеПлатежа = Документы.ЗаказКлиента.ПустаяСсылка();
//						стрДС.Заказ = ЭтотОбъект.Договор;
//					
//					КонецЕсли;
//			
//				КонецЦикла; 
//				
//		      	ПоступлениеДССсылка.Записать(РежимЗаписиДокумента.Проведение);

//		КонецЦикла; 
//	КонецЕсли;
//	
	
 
    //Если ЭтотОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОтгрузке") Тогда
    //	 ЭтотОбъект.ВремяГотовности = ТекущаяДата();
    //КонецЕсли;
    
	//
	//ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
	//
	//
	//Если Найти(Строка(ТекущийПользователь), "Бычков Леонид") = 1 Тогда
	//    Если ЭтотОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовКлиентов.КОбеспечению") Тогда
	//        Если ЭтотОбъект.ОтправитьНаПодтверждение = Истина Тогда
	//            
	//            Запрос = Новый Запрос;
	//            Запрос.Текст = 
	//            "ВЫБРАТЬ
	//            |	УчетныеЗаписиЭлектроннойПочты.Ссылка КАК Ссылка
	//            |ИЗ
	//            |	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	//            |ГДЕ
	//            |	УчетныеЗаписиЭлектроннойПочты.ПометкаУдаления = ЛОЖЬ
	//            |	И УчетныеЗаписиЭлектроннойПочты.Наименование = &Наименование";
	//            
	//            Запрос.УстановитьПараметр("Наименование", "l.bychkov@msso.by");
	//            
	//            РезультатЗапроса = Запрос.Выполнить();
	//            
	//            ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//            
	//            Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//                
	//                УстановитьПривилегированныйРежим(Истина);
	//                Пароли = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ВыборкаДетальныеЗаписи.Ссылка, "Пароль, ПарольSMTP");
	//                ПарольПочты = СокрЛП(Пароли.Пароль);
	//                А = 1;
	//            КонецЦикла;
	//            
	//            
	//            ПрофильПодключения = Новый ИнтернетПочтовыйПрофиль;
	//            ПрофильПодключения.АдресСервераSMTP ="mailbe04.hoster.by";
	//            
	//            ПрофильПодключения.ИспользоватьSSLSMTP=Истина;
	//            
	//            //Так как мы подключаемся через SSL, указываем порт 465. Если подключение
	//            //не защищенное, то используем порт 25
	//            ПрофильПодключения.ПортSMTP = 465;
	//            
	//            ПрофильПодключения.ПользовательSMTP = "l.bychkov@msso.by";
	//            ПрофильПодключения.ПарольSMTP = ПарольПочты;
	//            
	//            //Создаем объект ИнтернетПочта
	//            Почта = Новый ИнтернетПочта;
	//            
	//            //Пытаемся подключится к серверу используя наши настройки.
	//            Попытка
	//                Почта.Подключиться(ПрофильПодключения);
	//            Исключение
	//                Сообщить("Не удалось подключиться к серверу smtp");
	//                Сообщить(ОписаниеОшибки());
	//            КонецПопытки;
	//            
	//            //Определяемся с текстом письма
	//            Тело="Добрый день!
	//            |Создан новый заказ клиента (Гомель):
	//            |
	//            |"+ЭтотОбъект.Ссылка;
	//            
	//            //Создаем сообщение
	//            Письмо = Новый ИнтернетПочтовоеСообщение;
	//            
	//            //Добавляем наш текст в письмо
	//            Письмо.Тексты.Добавить(Тело);
	//            
	//            //Добавляем тему
	//            Письмо.Тема = "Новый заказ клиента (Гомель)";
	//            
	//            ////Добавляем ту же почту, через которую подключаемся к серверу
	//            
	//            Письмо.Отправитель = "l.bychkov@msso.by";
	//            
	//            //Добавляем имя отправителя
	//            Письмо.ИмяОтправителя = "Новый заказ клиента (Гомель)";
	//            
	//            ////Добавляем получателя
	//            
	//            Письмо.Получатели.Добавить("seedgatovo@msso.by");
	//            
	//            Попытка
	//                Почта.Послать(Письмо);
	//            Исключение
	//                Сообщить("Не удалось отправить письмо ");
	//                Сообщить(ОписаниеОшибки());
	//            КонецПопытки;	
	//            
	//            //Обязательно отключаемся от почтового сервера по завершении отправки письма.	
	//            Почта.Отключиться();
	//            
	//        КонецЕсли; 
	//    КонецЕсли;
	//КонецЕсли;	
    
	/////ПерераспределениеОплат jadmin
	//Если НЕ Отказ Тогда
	//
	//	ПерераспределениеСуммОплат(СуммаПредоплаты);
	//
	//КонецЕсли; 
	
	
	
    ВсеПользователи = Справочники.ГруппыПользователей.ВсеПользователи;

    Запрос = Новый Запрос;
    
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ГруппыСостав.Ссылка КАК Группа
    |ИЗ
    |   Справочник.ГруппыПользователей.Состав КАК ГруппыСостав
    |ГДЕ
    |   ГруппыСостав.Пользователь = &Пользователь
    |
    |ОБЪЕДИНИТЬ ВСЕ
    |
    |ВЫБРАТЬ
    |   ГруппыПользователей.Ссылка
    |ИЗ
    |   Справочник.ГруппыПользователей КАК ГруппыПользователей
    |ГДЕ
    |   ГруппыПользователей.Ссылка = &ВсеПользователи";
    
    Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());     
    Запрос.УстановитьПараметр("ВсеПользователи", ВсеПользователи);
    
    ТаблицаГрупп = Запрос.Выполнить().Выгрузить();
    МассивГрупп = ТаблицаГрупп.ВыгрузитьКолонку("Группа");
  
    
    
    
    МенеджерыПродаж = Справочники.ГруппыПользователей.НайтиПоНаименованию("Менеджеры по продажам");

    ТорговыеПредставители = Справочники.ГруппыПользователей.НайтиПоНаименованию("Торговые представители");
   
    
    
    
    ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
    
    
            
    Если (МассивГрупп.Найти(МенеджерыПродаж) <> Неопределено) ИЛИ (МассивГрупп.Найти(ТорговыеПредставители) <> Неопределено) Тогда
	    Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	        Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда	
	            Если ЭтотОбъект.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента Тогда
	                Если НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ЭтотОбъект.ДатаОтгрузки) Тогда
						    Если ЕстьЛук = Ложь Тогда
						        Сообщить("*Запрещено проведения заказов в статусе ""к отгрузке"" при условии доставки ""нашей транспортной службой""  сегодня-на сегодня.");
						        Отказ = Истина;
						    КонецЕсли; 
	                КонецЕсли; 
	            КонецЕсли; 	
	        КонецЕсли; 	
	    КонецЕсли; 
	КонецЕсли; 
	
	
	
	Если Не Отказ Тогда
		  		
		ЗаполнитьДляОбменаСБух();
		
	КонецЕсли;
	

	
	    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ
		И Не ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		РегистрыСведений.РеестрДокументов.ИнициализироватьИЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
		
	КонецЕсли;

	Справочники.Назначения.СоздатьОбновитьНазначение(Ссылка, Назначение, Партнер, Номер, Дата, ПометкаУдаления, НаправлениеДеятельности);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.Партнеры") Тогда
		ЗаполнитьДокументНаОснованииПартнера(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СделкиСКлиентами") Тогда
		ЗаполнитьДокументНаОснованииСделкиПоПродаже(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
		ЗаполнитьДокументНаОснованииКоммерческогоПредложенияКлиенту(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
		ЗаполнитьДокументНаОснованииИндивидуальногоСоглашенияСКлиентом(ДанныеЗаполнения);
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаданиеТорговомуПредставителю") Тогда
		ЗаполнитьДокументНаОснованииЗаданияТорговомуПредставителю(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьУсловияПродаж();
	ИнициализироватьДокумент(ДанныеЗаполнения);
    ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
    ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
		
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Склад);
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Склад, СкладГруппа, Товары, Ложь);
	
	Если Не ЗначениеЗаполнено(ПорядокОплаты) Тогда
		ВалютаОплаты              = ДенежныеСредстваСервер.ПолучитьВалютуОплаты(ФормаОплаты, БанковскийСчет, Касса);
		ПорядокОплаты             = Перечисления.ПорядокОплатыПоСоглашениям.ПолучитьПорядокОплатыПоУмолчанию(Валюта,НалогообложениеНДС,ВалютаОплаты);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НалогообложениеНДС) Или Не ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
		НалогообложениеНДС = ЗначениеНастроекПовтИсп.ПолучитьНалогообложениеНДС(Организация, Склад, Дата);
	КонецЕсли;
		
	Приоритет = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Приоритет);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	//jadmin Проверка на выполнение условий оплат по предоплате 
	СуммаОплат = 0;
	Сч = 0;
	СуммаДокумента = ЭтотОбъект.Товары.Итог("СуммаСНДС");	
	Для каждого стрЭтапОплаты Из ЭтотОбъект.ЭтапыГрафикаОплаты Цикл
		Сч = Сч + 1;
		Если Сч = ЭтотОбъект.ЭтапыГрафикаОплаты.Количество() И СуммаОплат <> СуммаДокумента Тогда	
			стрЭтапОплаты.СуммаПлатежа =  СуммаДокумента - СуммаОплат;
		Иначе
			стрЭтапОплаты.СуммаПлатежа = Окр(СуммаДокумента * стрЭтапОплаты.ПроцентПлатежа/100,2);
			СуммаОплат = СуммаОплат + стрЭтапОплаты.СуммаПлатежа; 
		КонецЕсли; 
	КонецЦикла; 
	///
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);
	
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);
	
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
												НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента),
												Отказ,
												МассивНепроверяемыхРеквизитов);
	
	НоменклатураСервер.ПроверитьЗаполнениеСодержания(ЭтотОбъект,Отказ,"Товары");

	// Срок действия заказа должен быть не меньше даты документа
	Если Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован
		И ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента")
		И ЗначениеЗаполнено(ДатаСогласования) И ДатаСогласования < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Дата согласования должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата, "ДЛФ=DD"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаСогласования",
			,
			Отказ);
		
	КонецЕсли;
	
	ВсеСтрокиОтменены = ОбщегоНазначенияУТ.ВсеСтрокиОтменены(ЭтотОбъект, "Товары", "Отменено");
	
	МассивНепроверяемыхРеквизитов.Добавить("ДатаОтгрузки");
	
	// Желаемая дата отгрузки в шапке должна быть не меньше даты документа
	Если ЗначениеЗаполнено(ЖелаемаяДатаОтгрузки) И ЖелаемаяДатаОтгрузки < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Желаемая дата отгрузки должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ЖелаемаяДатаОтгрузки",
			,
			Отказ);
		
	КонецЕсли;
	
	// Дата отгрузки в шапке должна быть не меньше даты документа
	Если НеОтгружатьЧастями И 
		ЗначениеЗаполнено(ДатаОтгрузки) И 
		ДатаОтгрузки < НачалоДня(Дата)
		И НЕ ВсеСтрокиОтменены Тогда
	
		ТекстОшибки = НСтр("ru='Дата отгрузки должна быть не меньше даты документа %Дата%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Дата%", Формат(Дата,"ДЛФ=DD"));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			ЭтотОбъект,
			"ДатаОтгрузки",
			,
			Отказ);

	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ПричинаОтмены");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ДатаОтгрузки");
	
	ДатаОтгрузкиОбязательна = Ложь;
	ШаблонТекста = НСтр("ru='Не заполнена колонка ""Дата отгрузки"" в строке %НомерСтроки% списка ""Товары""'");
	ИзЗаказов = Перечисления.ВариантыОбеспечения.ИзЗаказов;
	СоСклада  = Перечисления.ВариантыОбеспечения.СоСклада;
	Отгрузить  = Перечисления.ВариантыОбеспечения.Отгрузить;
	ОтгрузитьОбособленно  = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно;
	ВариантНеТребуется = Перечисления.ВариантыОбеспечения.НеТребуется;
	Для ТекИндекс = 0 По Товары.Количество()-1 Цикл
		
		АдресОшибки = НСтр("ru=' в строке %НомерСтроки% списка ""Товары""'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Товары[ТекИндекс].НомерСтроки);
		
		СтрокаТовары = Товары[ТекИндекс];
		ДатаОтгрузкиВСтрокеОбязательна = Не СтрокаТовары.Отменено
											И СтрокаТовары.ВариантОбеспечения <> ВариантНеТребуется
											И (Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению
												ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
												ИЛИ Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт
												ИЛИ (Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован
													И (СтрокаТовары.ВариантОбеспечения = ИзЗаказов
														ИЛИ СтрокаТовары.ВариантОбеспечения = СоСклада
														ИЛИ СтрокаТовары.ВариантОбеспечения = ОтгрузитьОбособленно
														ИЛИ СтрокаТовары.ВариантОбеспечения = Отгрузить)));
		
		Если ДатаОтгрузкиВСтрокеОбязательна И Не НеОтгружатьЧастями И Не ЗначениеЗаполнено(СтрокаТовары.ДатаОтгрузки) Тогда
			
			ТекстОшибки   = СтрЗаменить(ШаблонТекста, "%НомерСтроки%", СтрокаТовары.НомерСтроки);
			ПутьКТабЧасти = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", СтрокаТовары.НомерСтроки, "ДатаОтгрузки");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, ПутьКТабЧасти,, Отказ);

		КонецЕсли;
		ДатаОтгрузкиОбязательна = ДатаОтгрузкиОбязательна Или ДатаОтгрузкиВСтрокеОбязательна;
		
		// Причина отмены обязательна для заполнения в строках без признака Отменено
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовКлиентов")
			И Товары[ТекИндекс].Отменено И
			Не ЗначениеЗаполнено(Товары[ТекИндекс].ПричинаОтмены) Тогда
			
			ТекстОшибки = НСтр("ru='Необходимо указать причину отмены'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + АдресОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "ПричинаОтмены"),
				,
				Отказ);
			
		КонецЕсли;
		
		// Дата отгрузки в тч Товары должна быть не меньше даты документа
		Если Не НеОтгружатьЧастями 
			И ЗначениеЗаполнено(Товары[ТекИндекс].ДатаОтгрузки) 
			И Товары[ТекИндекс].ДатаОтгрузки < НачалоДня(Дата) Тогда
			
			ТекстОшибки = НСтр("ru='Дата отгрузки должна быть не меньше даты документа ""%Дата%""'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки,"%Дата%", Формат(Дата, "ДЛФ=DD"));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + АдресОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "ДатаОтгрузки"),
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ДатаОтгрузкиОбязательна И НеОтгружатьЧастями И Не ЗначениеЗаполнено(ДатаОтгрузки) Тогда
		
		ТекстОшибки = НСтр("ru='Поле ""Дата отгрузки"" не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ДатаОтгрузки", , Отказ);
		
	КонецЕсли;
	
	ПорядокРасчетовПоДокументу = ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЭтотОбъект);
	
	ГрафикИсполненияВДоговоре = Ложь;
	Если ПорядокРасчетовПоДокументу = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
		И ЗначениеЗаполнено(Договор) Тогда
		ГрафикИсполненияВДоговоре = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ЗаданГрафикИсполнения");
	КонецЕСли;
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		И ПорядокРасчетовПоДокументу <> Перечисления.ПорядокРасчетов.ПоНакладным
		И Не ГрафикИсполненияВДоговоре Тогда
		
		СуммаЗаказанныхСтрок = ПолучитьСуммуЗаказанныхСтрок();
		СуммаЗалоговойТары = ПолучитьСуммуЗаказанныхСтрок(Истина);
		
		ПродажиСервер.ПроверитьКорректностьЭтаповГрафикаОплаты(
			ЭтотОбъект,
			СуммаЗаказанныхСтрок,
			СуммаЗалоговойТары,
			Истина,
			Отказ,
			Истина);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Соглашение) ИЛИ НЕ ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Соглашение, "ИспользуютсяДоговорыКонтрагентов") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Договор");
	КонецЕсли;
	
	ДоставкаТоваров.ПроверитьЗаполнениеРеквизитовДоставки(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ);
	
	Если ЗначениеЗаполнено(НаправлениеДеятельности) 
		ИЛИ НЕ НаправленияДеятельностиСервер.УказаниеНаправленияДеятельностиОбязательно(ХозяйственнаяОперация) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НаправлениеДеятельности");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	ПроверитьИзменениеХозяйственнойОперации(Отказ);
	
	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;
	СуммаДокумента = ПолучитьСуммуЗаказанныхСтрок();
	СуммаВозвратнойТары = ПолучитьСуммуВозвратнойТары();
	
	ПродажиСервер.ПроверитьКорректностьЗаполненияДокументаПродажи(ЭтотОбъект, Отказ);
	
	Если Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
		
		ПродажиСервер.ПроверитьЗапретОтгрузки(Партнер, Отказ);
		
	КонецЕсли;
																							
КонецПроцедуры

//jadmin 01-12-2022
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
	//Если ЭтотОбъект.СпособДоставки <> Перечисления.СпособыДоставки.Самовывоз Тогда
	//    Если ЭтотОбъект.ПунктРазгрузкиПогрузкиКлиента <> "Пункты разгрузки погрузки клиентов" Тогда
	//        Сообщить("В адресе доставки нужно выбрать адрес из списка, а не писать руками");
	//        Отказ = Истина;
	//    КонецЕсли;    
	//КонецЕсли; 
	
	
	
  //  
  //  ВсеПользователи = Справочники.ГруппыПользователей.ВсеПользователи;

  //  Запрос = Новый Запрос;
  //  
  //  Запрос.Текст = 
  //  "ВЫБРАТЬ
  //  |   ГруппыСостав.Ссылка КАК Группа
  //  |ИЗ
  //  |   Справочник.ГруппыПользователей.Состав КАК ГруппыСостав
  //  |ГДЕ
  //  |   ГруппыСостав.Пользователь = &Пользователь
  //  |
  //  |ОБЪЕДИНИТЬ ВСЕ
  //  |
  //  |ВЫБРАТЬ
  //  |   ГруппыПользователей.Ссылка
  //  |ИЗ
  //  |   Справочник.ГруппыПользователей КАК ГруппыПользователей
  //  |ГДЕ
  //  |   ГруппыПользователей.Ссылка = &ВсеПользователи";
  //  
  //  Запрос.УстановитьПараметр("Пользователь", ПользователиКлиентСервер.ТекущийПользователь());     
  //  Запрос.УстановитьПараметр("ВсеПользователи", ВсеПользователи);
  //  
  //  ТаблицаГрупп = Запрос.Выполнить().Выгрузить();
  //  МассивГрупп = ТаблицаГрупп.ВыгрузитьКолонку("Группа");
  //
  //  
  //  
  //  
  //  МенеджерыПродаж = Справочники.ГруппыПользователей.НайтиПоНаименованию("Менеджеры по продажам");

  //  ТорговыеПредставители = Справочники.ГруппыПользователей.НайтиПоНаименованию("Торговые представители");
  //  
  //      
  //  
  //  
  //  
  //  ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
  //  
  //  ВыбМагазин = Справочники.Пользователи.ПустаяСсылка();
  //  ВыбМагазин = ПользователиКлиентСервер.ТекущийПользователь().СкладМагазин;   

  //  
  //          
  //  Если (МассивГрупп.Найти(МенеджерыПродаж) <> Неопределено) ИЛИ (МассивГрупп.Найти(ТорговыеПредставители) <> Неопределено) Тогда
  //  	
  //  	Если НачалоДня(ЭтотОбъект.ЖелаемаяДатаОтгрузки) = НачалоДня(ЭтотОбъект.Дата)   Тогда
  //  		Сообщить("Дата отгрузки должна быть больше чем дата заказа");
  //  		Отказ = Истина;
  //  	КонецЕсли; 
  //  	
  //  КонецЕсли;
	
  
  
    
  Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда
	  
	ОбщийМодуль77w.ПроверкаЗапретаОтгрузки(ЭтотОбъект.Ссылка,Отказ);

  	ОбщийМодуль77w.ПроверитьЗаказКлиента(ЭтотОбъект.Ссылка,ЭтотОбъект.Товары,Отказ,"Проверка");  //jadmin
  
  КонецЕсли; 
  
	
	Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.Отменен Тогда
		
		
		//ДопустимыйКредит = ЭтотОбъект.Договор.ДопустимаяСуммаЗадолженности;
		//ОстатокДопустимогоКредита = ОстатокДопустимогоКредита(ЭтотОбъект.Договор,ДопустимыйКредит);
		//
		//Если ЭтотОбъект.СуммаДокумента > ОстатокДопустимогоКредита Тогда
		//	Сообщить("Сумма заказа превышает остаток допустимого кредита");
		//	
		//	Отказ = Истина;
		//КонецЕсли;  
		
		// Инициализация дополнительных свойств для проведения документа
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
		
		// Инициализация данных документа
		Документы.ЗаказКлиента.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		// Подготовка наборов записей
		ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		ЗаказыСервер.ОтразитьЗаказыКлиентов(ДополнительныеСвойства, Движения, Отказ);
		
		ЗаказыСервер.ОтразитьГрафикОтгрузкиТоваров(ДополнительныеСвойства, Движения, Отказ);
		
		Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда 
			Если ТипЗнч(ЭтотОбъект.ДокументОснование) <> Тип("ДокументСсылка.ИнтернетЗаказРозничный") Тогда 
				ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
			КонецЕсли; 
		КонецЕсли;
		
		//Если ЭтотОбъект.Склад.ТипСклада <> Перечисления.ТипыСкладов.РозничныйМагазин ИЛИ ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда	
		Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда 
			ЗаказыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);	
		КонецЕсли;
		//КонецЕсли;
		
		ЗапасыСервер.ОтразитьОбеспечениеЗаказовРаботами(ДополнительныеСвойства, Движения, Отказ);
		
		ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);

		ВзаиморасчетыСервер.ОтразитьРасчетыСКлиентами(ДополнительныеСвойства, Движения, Отказ);
		
		РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
			
		СформироватьСписокРегистровДляКонтроля();
		
		ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		
		Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован Тогда  //jadmin  откл проверку остатков на несогласованных заказх
			
		Иначе
			ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
		КонецЕсли;
		
		РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(Ссылка, Отказ);
		
		ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
		
		ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
		
		ПродажиСервер.ВыполнитьКонтрольЗаказаПослеПроведения(Ссылка, Отказ);
		
		
	    //////77w qaws
	    
	    Запрос = Новый Запрос;
	    Запрос.Текст = 
	        "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	РасходныйОрдерНаТоварыОснования.Ссылка
	        |ИЗ
	        |	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
	        |ГДЕ
	        |	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ";
	 
	    Запрос.УстановитьПараметр("ВыбЗаказ", ЭтотОбъект.Ссылка);
	 
	    РезультатЗапроса = Запрос.Выполнить();
	 
	    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	        НашлиОрдер = ВыборкаДетальныеЗаписи.Ссылка;
	    	
	    	Если НашлиОрдер.ТоварыПоРаспоряжениям.Количество() > 0 Тогда
	    		
	    		Если НашлиОрдер.ТоварыПоРаспоряжениям[0].Распоряжение.Ссылка = ЭтотОбъект.Ссылка Тогда
	    			
	    			Если НашлиОрдер.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке Тогда
	    				НовыйНаборЗаписей = РегистрыСведений.СостоянияЗаказовКлиентов.СоздатьНаборЗаписей();
	    				НовыйНаборЗаписей.Отбор.Заказ.Установить(ЭтотОбъект.Ссылка);
	    				
	    				НовыйНаборЗаписей.Прочитать();
	    				Для каждого СтрТЗ Из НовыйНаборЗаписей Цикл
	    					//Сообщить(" "+  СтрТЗ.Состояние); //было
	    					СтрТЗ.Состояние = Перечисления.СостоянияЗаказовКлиентов.ГотовКОтгрузке;
	    					СтрТЗ.ЕстьРасхожденияОрдерНакладная = Ложь;
	    				КонецЦикла;
	    				
	    				НовыйНаборЗаписей.Записать();
	    			КонецЕсли; 
	    		КонецЕсли; 
	    	
	    	КонецЕсли; 
	    	
		КонецЦикла;
		
		////jadmin    Резервирование для исключени товара из переоценки
		Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) Тогда
				
				
				// ТоварыНаСкладах
				Движения.ТоварыНаСкладах.Записывать = Истина;
				Движения.ТоварыНаСкладах.Очистить();
				
				Для каждого стр из Товары Цикл
					
					Движение = Движения.ТоварыНаСкладах.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Номенклатура = стр.Номенклатура;
					Движение.Серия = стр.Серия;
					Движение.Склад = Склад;
					
					Движение.ВРезерве = стр.КоличествоУпаковок;
					
				КонецЦикла;
				
				
			КонецЕсли; 
		КонецЕсли;
		
	Иначе
		               //130722  Снятие с резерва при исключени товара из переоценки
		Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда	
			ОбработкаУдаленияПроведения(Отказ);	
			
			
			 //jadmin   // ТоварыНаСкладах
			Движения.ТоварыНаСкладах.Записывать = Истина;
			Движения.ТоварыНаСкладах.Очистить();
			
			Для каждого стр из Товары Цикл
	
				Движение = Движения.ТоварыНаСкладах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Номенклатура = стр.Номенклатура;
				Движение.Серия = стр.Серия;
				Движение.Склад = Склад;
				
				Движение.ВРезерве = стр.КоличествоУпаковок;
				
				
				Движение = Движения.ТоварыНаСкладах.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = ДатаОтменыЗаказа;
				Движение.Номенклатура = стр.Номенклатура;
				Движение.Серия = стр.Серия;
				Движение.Склад = Склад;
				
				Движение.ВРезерве = стр.КоличествоУпаковок;
				
		    КонецЦикла;

		КонецЕсли;

			
			 	//jadmin   переоценка

						
				СебестоимостьСписания = 0;
				СуммаНДССписания = 0;
				ПроцентНДССписания = 0;			
				РозничнаяСтоимостьСписания = 0;
				НаценкаСписания = 0;
				
				СебестоимостьПриход = 0;
				СуммаНДСПриход = 0;
				ПроцентНДСПриход = 0;
				РозничнаяСтоимостьПриход = 0;
				НаценкаПриход = 0;
				
				Сумма = 0;
				СуммаНДС = 0;
				СуммаНаценки = 0;
				
				Для каждого Товар Из ЭтотОбъект.Товары Цикл
				    //списываемый  товар
					Если ЗначениеЗаполнено(Товар.Номенклатура.СтавкаНДСРозн) Тогда
						СтавкаНДС_Розн = Товар.Номенклатура.СтавкаНДСРозн;
					Иначе
						СтавкаНДС_Розн = Товар.Номенклатура.СтавкаНДС;
					КонецЕсли; 
					
					ПроцентНДССписания = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС_Розн);
					
					
					 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) - ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток,0) КАК Остаток,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОтмены, ) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыНаСкладахОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("ДатаОтмены", ЭтотОбъект.ДатаОтменыЗаказа+1);
	Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
	Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Остаток = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Остаток = ВыборкаДетальныеЗаписи.Остаток;
	КонецЦикла;
	
	КоличествоТовара = 0;
	Если Товар.КоличествоУпаковок > Остаток Тогда
	    КоличествоТовара = Остаток;
	Иначе
		КоличествоТовара = Товар.КоличествоУпаковок;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

					
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура КАК АналитикаУчетаНоменклатурыНоменклатура,
					|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Серия КАК АналитикаУчетаНоменклатурыСерия,
					|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Склад КАК АналитикаУчетаНоменклатурыСклад,
					|	СебестоимостьТоваровОстатки.КоличествоОстаток КАК Количество,
					|	СебестоимостьТоваровОстатки.СтоимостьРеглОстаток КАК СтоимостьРегл
					|ИЗ
					|	РегистрНакопления.СебестоимостьТоваров.Остатки(&Период, ) КАК СебестоимостьТоваровОстатки
					|ГДЕ
					|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура
					//|	И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Серия = &Серия
					|	И СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Склад = &Склад
					|
					|СГРУППИРОВАТЬ ПО
					|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура,
					|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Серия,
					|	СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Склад,
					|	СебестоимостьТоваровОстатки.КоличествоОстаток,
					|	СебестоимостьТоваровОстатки.СтоимостьРеглОстаток";
					
					
					
					Запрос.УстановитьПараметр("Период", ЭтотОбъект.ДатаОтменыЗаказа+1);
					Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
					Запрос.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
					//Запрос.УстановитьПараметр("Серия", Товар.Серия);
					
					
					//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
					РезультатЗапроса = Запрос.Выполнить().Выбрать();
					
					СебестоимостьИзРегистра = 0;
					КоличествоИзРегистра = 0;
					
					
					Пока РезультатЗапроса.Следующий() Цикл
						СебестоимостьИзРегистра = РезультатЗапроса.СтоимостьРегл;///////+РезультатЗапроса.СуммаДопРасходовБезНДС;
						КоличествоИзРегистра    = РезультатЗапроса.Количество;
					КонецЦикла; 
					
					СтоимостьЕдТовара = 0;
					Если КоличествоИзРегистра <> 0 Тогда
						СтоимостьЕдТовара =  СебестоимостьИзРегистра/КоличествоИзРегистра;
					КонецЕсли; 
					
					СебестоимостьСписания = Окр(СтоимостьЕдТовара * КоличествоТовара,2);			
					
					
					Товар_ЦенаНовая =0;
					
					ЗапросЦ = Новый Запрос;
					ЗапросЦ.Текст = 
					"ВЫБРАТЬ
					|	ЦеныНоменклатурыСрезПоследних.Период,
					|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
					|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
					|	ЦеныНоменклатурыСрезПоследних.Валюта,
					|	ЦеныНоменклатурыСрезПоследних.Цена
					|ИЗ
					|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
					|ГДЕ
					|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
					|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
					
					
					
					ЗапросЦ.УстановитьПараметр("ВидЦены", ЭтотОбъект.Склад.РозничныйВидЦены);
					ЗапросЦ.УстановитьПараметр("НаДату", ЭтотОбъект.ДатаОтменыЗаказа);
					ЗапросЦ.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
					
					РезультатЗапросаЦ = ЗапросЦ.Выполнить();
					
					ВыборкаДетальныеЗаписиЦ = РезультатЗапросаЦ.Выбрать();
					
					Пока ВыборкаДетальныеЗаписиЦ.Следующий() Цикл
						Товар_ЦенаНовая = ВыборкаДетальныеЗаписиЦ.Цена;
					КонецЦикла;
					
                    
                    
                    
					Товар_ЦенаНаДатуЗаказа =0;
					
					ЗапросЦ = Новый Запрос;
					ЗапросЦ.Текст = 
					"ВЫБРАТЬ
					|	ЦеныНоменклатурыСрезПоследних.Период,
					|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
					|	ЦеныНоменклатурыСрезПоследних.ВидЦены,
					|	ЦеныНоменклатурыСрезПоследних.Валюта,
					|	ЦеныНоменклатурыСрезПоследних.Цена
					|ИЗ
					|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НаДату, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
					|ГДЕ
					|	ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены
					|	И ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура";
					
					
					
					ЗапросЦ.УстановитьПараметр("ВидЦены", ЭтотОбъект.Склад.РозничныйВидЦены);
					ЗапросЦ.УстановитьПараметр("НаДату", ЭтотОбъект.Дата);
					ЗапросЦ.УстановитьПараметр("Номенклатура", Товар.Номенклатура);
					
					РезультатЗапросаЦ = ЗапросЦ.Выполнить();
					
					ВыборкаДетальныеЗаписиЦ = РезультатЗапросаЦ.Выбрать();
					
					Пока ВыборкаДетальныеЗаписиЦ.Следующий() Цикл
						Товар_ЦенаНаДатуЗаказа = ВыборкаДетальныеЗаписиЦ.Цена;
					КонецЦикла;
                    
                    
                    ///////// Попадал в регистр СуммыПереоценкиРозницы по интеренет-магазину
                    /////// рознич.цена сравнивалась за минусом НДС (реквизит "Цена")
                    
                    Если Товар_ЦенаНовая = Товар_ЦенаНаДатуЗаказа Тогда
                    	   Продолжить;
                    КонецЕсли; 
                    
                    
                    
					СуммаНДССписания = КоличествоТовара * Окр(Товар.СуммаСНДС / Товар.КоличествоУпаковок * ПроцентНДССписания / (1 + ПроцентНДССписания),2);
					//РозничнаяСтоимостьСписания = Товар.Количество * Товар.ЦенаСоСкидкой;	
					РозничнаяСтоимостьСписания = Товар.Цена *КоличествоТовара + СуммаНДССписания;	/////////////// с июля 2021 по новой методике расчета.
					
					
					//НаценкаСписания =  РозничнаяСтоимостьСписания - СебестоимостьСписания - СуммаНДССписания; 
					НаценкаСписания =  РозничнаяСтоимостьСписания  - СуммаНДССписания; 
					
					//Приходуемый товар
					
					СебестоимостьПриход = КоличествоТовара * СтоимостьЕдТовара;
					
					Если ЗначениеЗаполнено(Товар.Номенклатура.СтавкаНДСРозн) Тогда
						СтавкаНДС_Розн = Товар.Номенклатура.СтавкаНДСРозн;
					Иначе
						СтавкаНДС_Розн = Товар.Номенклатура.СтавкаНДС;
					КонецЕсли; 
					
					ПроцентНДСПриход = ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС_Розн);
					
					СуммаНДСПриход = Окр(КоличествоТовара * Товар_ЦенаНовая * ПроцентНДСПриход / (1 + ПроцентНДСПриход),2);
					РозничнаяСтоимостьПриход = Окр(КоличествоТовара * Товар_ЦенаНовая,2);
					НаценкаПриход =  РозничнаяСтоимостьПриход - СуммаНДСПриход;
					//Итог
					Сумма = Сумма + РозничнаяСтоимостьПриход - РозничнаяСтоимостьСписания; 
					СуммаНДС = СуммаНДС + СуммаНДСПриход - СуммаНДССписания;
					//СуммаНаценки = СуммаНаценки + НаценкаПриход - НаценкаСписания;
					СуммаНаценки = СуммаНаценки + НаценкаПриход - НаценкаСписания;

				КонецЦикла; 
				
					Если Сумма <> 0 Тогда
						НаборЗаписей = РегистрыСведений.СуммыПереоценкиРозницы.СоздатьНаборЗаписей();

						НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
						НаборЗаписей.Прочитать();
						
						НоваяЗапись = НаборЗаписей.Добавить();			
						НоваяЗапись.ДокументПереоценки = ЭтотОбъект.Ссылка;
						НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка;
						//НоваяЗапись.Период = ЭтотОбъект.Дата;
						НоваяЗапись.Период = ЭтотОбъект.ДатаОтменыЗаказа;
						НоваяЗапись.ДатаПереоценки = ЭтотОбъект.ДатаОтменыЗаказа;
						НоваяЗапись.Магазин = ЭтотОбъект.Склад;
						НоваяЗапись.Сумма = Сумма;
						НоваяЗапись.СуммаНДС = СуммаНДС;
						НоваяЗапись.СуммаНаценки = СуммаНаценки;
					
						Попытка
						НаборЗаписей.Записать(Истина);			
						Исключение
						    //ОписаниеОшибки()
						КонецПопытки; 
					КонецЕсли; 
					
			
		КонецЕсли;
		

	//jadmin Взвешенные товары Резерв
	Движения.ВзвешенныеТовары.Записывать = Истина;
	
	Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
		Для каждого стрТовар Из ЭтотОбъект.Товары Цикл
			
			Если стрТовар.Номенклатура.Родитель.ВесКонтроль = Истина 
				ИЛИ стрТовар.Номенклатура.ВесКонтроль = Истина Тогда
			
			КолВоВУпаковке = ПолучитьКоличествоВУпаковке(стрТовар.Номенклатура,Дата);
			Если КолВоВУпаковке = Неопределено Тогда
			
				Сообщить("В номенклатуре "+стрТовар.Номенклатура+ " не заполнено кол-во кг в одном грузовом месте (мешке)");				
			    КолВоМест = 0;
			Иначе
				КолВоМест = Окр(стрТовар.Количество / КолВоВУпаковке,0);		
			КонецЕсли; 
			
					
				Движение = Движения.ВзвешенныеТовары.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Склад = Склад;
				Движение.Номенклатура = стрТовар.Номенклатура;
				Движение.Характеристика = стрТовар.Характеристика;
				Движение.Серия = стрТовар.Серия;
				//Движение.Количество = ТекСтрокаТовары.КолВоГрузовыхМест;
				//Движение.ВесБрутто = ТекСтрокаТовары.ВесБрутто;
				
				Если НЕ ЗначениеЗаполнено(стрТовар.КолВоГрузовыхМест) Тогда
					Движение.ВРезерве =  КолВоМест;
				Иначе
					Движение.ВРезерве =  стрТовар.КолВоГрузовыхМест;
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла;		
	КонецЕсли;
	
	
	Если НЕ Отказ Тогда
	
		МССО_ДвиженияРегистров.ЗаполнитьРСКонтрольЗаданийНаПеревозку(ЭтотОбъект.Ссылка);
	
	КонецЕсли; 


	Если Не Отказ Тогда
		  		
		ЗаполнитьДляОбменаСБух();
		
	КонецЕсли;

	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	


	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws
	
		Если ЭтотОбъект.Партнер = Справочники.Партнеры.НайтиПоНаименованию("Магазин N12",ИСТИНА) Тогда
		Если СтрНайти(Строка(ТекущийПользователь), "Поплавская") = 1 
			ИЛИ СтрНайти(Строка(ТекущийПользователь), "Проскурнин") = 1 
			ИЛИ СтрНайти(Строка(ТекущийПользователь), "Афанасьев Алексей") = 1 
			ИЛИ РольДоступна("АдминистраторСистемы") Тогда
		
		Иначе
			Отказ = ИСТИНА;		
		КонецЕсли;
	КонецЕсли;
	

	
	//КтоЭто = ЭтоАдминистратор(ТекущийПользователь);
	//
	//	Если КтоЭто <> "Администратор"  Тогда
	//		Если ЭтотОбъект.Автор <> ТекущийПользователь Тогда
	//			Сообщить("У Вас нет прав делать не проведенной не свою заявку");
	//			Отказ = Истина;
	//		КонецЕсли; 
	//   КонецЕсли; 
	
	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	РасходныйОрдерНаТоварыОснования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
		|ГДЕ
		|	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ
		|	И РасходныйОрдерНаТоварыОснования.Ссылка.Проведен = ИСТИНА";
		
		Запрос.УстановитьПараметр("ВыбЗаказ", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НашлиОрдер = ВыборкаДетальныеЗаписи.Ссылка;
			Сообщить("Установлен запрет на удаление заявки, т.к выписан расходный ордер:"+Символы.ПС+НашлиОрдер);
			
			Если РольДоступна("АдминистраторСистемы") Тогда       //j временное 
				
			Иначе				
				Отказ = Истина;
			КонецЕсли; 

		КонецЦикла;	 
		
		
		//jadmin Заполняем Заказы по предоплате для выгрузки в бух
		Если Не Отказ Тогда
			НаборЗаписей = РегистрыСведений.Обмен_ЗаказыПоПредоплате.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗаказСсылка.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Прочитать();
			//Если НаборЗаписей.Количество() > 0 Тогда
			  	Для каждого стр Из НаборЗаписей Цикл		
					стр.ПометкаУдаления = 1;
					стр.ПризнакОбработано = 0;
				КонецЦикла;	
				НаборЗаписей.Записать(ИСТИНА);
		КонецЕсли;
		///
	
	// Инициализация дополнительных свойств для удаления проведения документа
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля();
	
	// Запись наборов записей
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(Ссылка, Отказ, Истина);	
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ, Истина);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус                 = Перечисления.СтатусыЗаказовКлиентов.ПустаяСсылка();
	ЖелаемаяДатаОтгрузки   = Дата(1,1,1);
	ДатаОтгрузки           = Дата(1,1,1);
	ДатаСогласования       = Дата(1,1,1);
	МаксимальныйКодСтроки  = 0;
	Согласован             = Ложь;
	ДокументОснование      = Неопределено;
	НомерПоДаннымКлиента   = "";
	ДатаПоДаннымКлиента    = Дата(1,1,1);
	Назначение             = Неопределено;
	ИдентификаторПлатежа   = Неопределено;
	СостояниеЗаполненияМногооборотнойТары = Перечисления.СостоянияЗаполненияМногооборотнойТары.ПустаяСсылка();
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Статус") = Перечисления.СтатусыДоговоровКонтрагентов.Закрыт Тогда
		Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ЗначениеЗаполнено(Соглашение) Тогда
		УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина);
		Если УсловияПродаж.СтатусСоглашения <> Перечисления.СтатусыСоглашенийСКлиентами.Закрыто Тогда
			Если ЗначениеЗаполнено(УсловияПродаж.СрокПоставки) И ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
				ЖелаемаяДатаОтгрузки = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(
					ТекущаяДатаСеанса(),
					Перечисления.Периодичность.День,
					УсловияПродаж.СрокПоставки) + 1;
			КонецЕсли;
		Иначе
			Соглашение = Неопределено;
		КонецЕсли;
	КонецЕсли;

	
	
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		
		СтрокаТЧ.КодСтроки      = 0;
		СтрокаТЧ.ДатаОтгрузки   = Дата(1,1,1);
		СтрокаТЧ.Отменено = Ложь;
		СтрокаТЧ.ПричинаОтмены = Справочники.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка();
		
	КонецЦикла;
	
	ЭтотОбъект.ЗаполнитьЭтапыГрафикаОплаты();
	
	СкидкиНаценкиСервер.ОтменитьСкидки(ЭтотОбъект, "Товары", Истина,,Истина);
	
	ИнициализироватьДокумент(ОбъектКопирования);
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьДокументНаОснованииПартнера(Знач Основание)
	
	Партнер = Основание;
	ПродажиСервер.ПроверитьВозможностьВводаНаОснованииПартнераКлиента(Партнер);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
		ЗаполнитьУсловияПродажПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииСделкиПоПродаже(Основание)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СделкиСКлиентами.Ссылка КАК Сделка,
		|	СделкиСКлиентами.Партнер КАК Партнер,
		|	СделкиСКлиентами.СоглашениеСКлиентом КАК Соглашение,
		|	СделкиСКлиентамиПартнерыИКонтактныеЛица.КонтактноеЛицо КАК КонтактноеЛицо
		|ИЗ
		|	Справочник.СделкиСКлиентами КАК СделкиСКлиентами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкиСКлиентами.ПартнерыИКонтактныеЛица КАК СделкиСКлиентамиПартнерыИКонтактныеЛица
		|		ПО (СделкиСКлиентамиПартнерыИКонтактныеЛица.Ссылка = СделкиСКлиентами.Ссылка)
		|			И (СделкиСКлиентамиПартнерыИКонтактныеЛица.Партнер = СделкиСКлиентами.Партнер)
		|			И (СделкиСКлиентамиПартнерыИКонтактныеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка))
		|ГДЕ
		|	СделкиСКлиентами.Ссылка = &Основание");
		
	Запрос.УстановитьПараметр("Основание",Основание);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСделкиПоПродаже(Выборка.Партнер);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
		Если ЗначениеЗаполнено(Соглашение) Тогда
			ЗаполнитьУсловияПродажПоСоглашению();
		Иначе
			ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииИндивидуальногоСоглашенияСКлиентом(Знач ДокументОснование)
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	СоглашениеСКлиентом.Ссылка         КАК Соглашение,
		|	СоглашениеСКлиентом.Партнер        КАК Партнер,
		|	СоглашениеСКлиентом.КонтактноеЛицо КАК КонтактноеЛицо,
		|
		|	СоглашениеСКлиентом.Статус      КАК СтатусДокумента,
		|	ВЫБОР
		|		КОГДА
		|			СоглашениеСКлиентом.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|		ТОГДА
		|			ЛОЖЬ
		|		ИНАЧЕ
		|			ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	СоглашениеСКлиентом.Типовое КАК ЕстьОшибкиТиповое,
		|	СоглашениеСКлиентом.НаправлениеДеятельности КАК НаправлениеДеятельности
		|
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашениеСКлиентом
		|ГДЕ
		|	СоглашениеСКлиентом.Ссылка = &ДокументОснование
		|");
		
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыСоглашенийСКлиентами.Действует);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСоглашения(Выборка.ЕстьОшибкиТиповое);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Выборка.Соглашение,
		Выборка.СтатусДокумента,
		,
		Выборка.ЕстьОшибкиСтатус,
		МассивДопустимыхСтатусов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	ЗаполнитьУсловияПродажПоСоглашению();

КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииКоммерческогоПредложенияКлиенту(Знач Основание)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	КоммерческоеПредложениеКлиенту.Ссылка КАК ДокументОснование,
		|	КоммерческоеПредложениеКлиенту.Партнер КАК Партнер,
		|	КоммерческоеПредложениеКлиенту.Сделка КАК Сделка,
		|	КоммерческоеПредложениеКлиенту.Валюта КАК Валюта,
		|	КоммерческоеПредложениеКлиенту.СуммаДокумента КАК СуммаДокумента,
		|	КоммерческоеПредложениеКлиенту.СрокПоставки КАК СрокПоставки,
		|	КоммерческоеПредложениеКлиенту.ГрафикОплаты КАК ГрафикОплаты,
		|	КоммерческоеПредложениеКлиенту.Организация КАК Организация,
		|	КоммерческоеПредложениеКлиенту.Соглашение КАК Соглашение,
		|	КоммерческоеПредложениеКлиенту.Соглашение.ПорядокОплаты КАК ПорядокОплаты,
		|	КоммерческоеПредложениеКлиенту.Соглашение.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	КоммерческоеПредложениеКлиенту.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	КоммерческоеПредложениеКлиенту.НалогообложениеНДС КАК НалогообложениеНДС,
		|	КоммерческоеПредложениеКлиенту.ФормаОплаты КАК ФормаОплаты,
		|	КоммерческоеПредложениеКлиенту.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	КоммерческоеПредложениеКлиенту.Склад КАК Склад,
		|	КоммерческоеПредложениеКлиенту.Статус КАК СтатусДокумента,
		|	КоммерческоеПредложениеКлиенту.КартаЛояльности КАК КартаЛояльности,
		|	КоммерческоеПредложениеКлиенту.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
		|	КоммерческоеПредложениеКлиенту.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
		|	КоммерческоеПредложениеКлиенту.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
		|	КоммерческоеПредложениеКлиенту.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
		|	(НЕ КоммерческоеПредложениеКлиенту.Проведен) КАК ЕстьОшибкиПроведен,
		|	ВЫБОР
		|		КОГДА КоммерческоеПредложениеКлиенту.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКоммерческихПредложенийКлиентам.Действует)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	КоммерческоеПредложениеКлиенту.СпособДоставки КАК СпособДоставки,
		|	КоммерческоеПредложениеКлиенту.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		КлючСвязи КАК КлючСвязи,
		|		НоменклатураНабора КАК НоменклатураНабора,
		|		ХарактеристикаНабора КАК ХарактеристикаНабора,
		|		Номенклатура КАК Номенклатура,
		|		Номенклатура.НаименованиеПолное КАК НаименованиеНоменклатурыПолное,
		|		Характеристика КАК Характеристика,
		|		Характеристика.НаименованиеПолное КАК НаименованиеХарактеристикиПолное,
		|		Номенклатура.ВариантОформленияПродажи КАК ВариантОформленияПродажи,
		|		Упаковка КАК Упаковка,
		|		КоличествоУпаковок КАК КоличествоУпаковок,
		|		Количество КАК Количество,
		|		ВидЦены КАК ВидЦены,
		|		Цена КАК Цена,
		|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|		СтавкаНДС КАК СтавкаНДС,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаСНДС КАК СуммаСНДС,
		|		Сумма КАК Сумма,
		|		Активность КАК Активность,
		|		ВЫБОР
		|			КОГДА КоммерческоеПредложениеКлиенту.Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|					ИЛИ КоммерческоеПредложениеКлиенту.Склад.ЭтоГруппа
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ИНАЧЕ КоммерческоеПредложениеКлиенту.Склад
		|		КОНЕЦ КАК Склад
		|	) КАК Товары,
		|	КоммерческоеПредложениеКлиенту.СкидкиНаценки.(
		|		КлючСвязи КАК КлючСвязи,
		|		СкидкаНаценка КАК СкидкаНаценка,
		|		Сумма КАК Сумма
		|	) КАК СкидкиНаценки,
		|	КоммерческоеПредложениеКлиенту.КонтактноеЛицо КАК КонтактноеЛицо
		|ИЗ
		|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложениеКлиенту
		|ГДЕ
		|	КоммерческоеПредложениеКлиенту.Ссылка = &Основание");

	Запрос.УстановитьПараметр("Основание",Основание);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Выборка.ДокументОснование,
		Выборка.СтатусДокумента,
		Выборка.ЕстьОшибкиПроведен,
		Выборка.ЕстьОшибкиСтатус,
		МассивДопустимыхСтатусов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ДатаНачала = ?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата());
	
	Если ЗначениеЗаполнено(Выборка.СрокПоставки) И ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента")Тогда
		ЖелаемаяДатаОтгрузки = ОбщегоНазначенияУТКлиентСервер.РассчитатьДатуОкончанияПериода(ДатаНачала, Перечисления.Периодичность.День, Выборка.СрокПоставки) + 1;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Активность", Истина);
	
	ТаблицаТовары = Выборка.Товары.Выгрузить();
	ТаблицаТовары = ТаблицаТовары.Скопировать(ПараметрыОтбора);
	ТаблицаТовары.Сортировать("НомерСтроки Возр");
	
	Для Каждого ТекСтрока Из ТаблицаТовары Цикл
		
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		
		Если ТекСтрока.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.АктВыполненныхРабот Тогда
			НоваяСтрока.Содержание = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
				ТекСтрока.НаименованиеНоменклатурыПолное, 
				ТекСтрока.НаименованиеХарактеристикиПолное);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СоответствиеСтрокиДляУдаления = Новый Соответствие;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	
	Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, ХозяйственнаяОперация, Валюта);
	
	ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчет, БанковскийСчетКонтрагента);
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Истина);
	СтруктураПараметры.Вставить("УправляемыеСкидки", Новый СписокЗначений);
	
	СкидкиНаценки.Загрузить(Выборка.СкидкиНаценки.Выгрузить());
	СкидкиНаценкиСервер.РассчитатьПоЗаказуКлиента(ЭтотОбъект, СтруктураПараметры);
	СкидкиРассчитаны = Истина;
	
	СуммаЗаказанныхСтрок = ПолучитьСуммуЗаказанныхСтрок();
	СуммаЗалоговойТары = ПолучитьСуммуЗаказанныхСтрок(Истина);
			
	Если ЗначениеЗаполнено(ГрафикОплаты) Тогда
		ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПродажиПоГрафикуОплаты(
			ЭтотОбъект,
			СуммаЗаказанныхСтрок - СуммаЗалоговойТары,
			СуммаЗалоговойТары,
			Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииЗаданияТорговомуПредставителю(Знач Основание)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаданиеТорговомуПредставителю.Ссылка КАК ДокументОснование,
		|	ЗаданиеТорговомуПредставителю.Организация КАК Организация,
		|	ЗаданиеТорговомуПредставителю.Партнер КАК Партнер,
		|	ЗаданиеТорговомуПредставителю.Контрагент КАК Контрагент,
		|	ЗаданиеТорговомуПредставителю.Договор КАК Договор,
		|	ЗаданиеТорговомуПредставителю.Соглашение КАК Соглашение,
		|	ЗаданиеТорговомуПредставителю.Соглашение.ПорядокОплаты КАК ПорядокОплаты,
		|	ЗаданиеТорговомуПредставителю.Валюта КАК Валюта,
		|	ЗаданиеТорговомуПредставителю.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	ЗаданиеТорговомуПредставителю.ГрафикОплаты КАК ГрафикОплаты,
		|	ЗаданиеТорговомуПредставителю.Склад КАК Склад,
		|	ЗаданиеТорговомуПредставителю.ФормаОплаты КАК ФормаОплаты,
		|	ЗаданиеТорговомуПредставителю.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
		|	ЗаданиеТорговомуПредставителю.НеОтгружатьЧастями КАК НеОтгружатьЧастями,
		|	ЗаданиеТорговомуПредставителю.Статус КАК СтатусДокумента,
		|	ЗаданиеТорговомуПредставителю.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ЗаданиеТорговомуПредставителю.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ЗаданиеТорговомуПредставителю.СостояниеЗаполненияМногооборотнойТары КАК СостояниеЗаполненияМногооборотнойТары,
		|	ЗаданиеТорговомуПредставителю.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
		|	ЗаданиеТорговомуПредставителю.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
		|	ЗаданиеТорговомуПредставителю.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
		|	ВЫБОР
		|		КОГДА ЗаданиеТорговомуПредставителю.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийТорговымПредставителям.Отработано)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	ЗаданиеТорговомуПредставителю.Товары.(
		|		Номенклатура КАК Номенклатура,
		|		Характеристика КАК Характеристика,
		|		Количество КАК Количество,
		|		Упаковка КАК Упаковка,
		|		КоличествоУпаковок КАК КоличествоУпаковок,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма,
		|		ВидЦены КАК ВидЦены,
		|		СтавкаНДС КАК СтавкаНДС,
		|		СуммаНДС КАК СуммаНДС,
		|		СуммаСНДС КАК СуммаСНДС,
		|		ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|		СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|		ПричинаОтмены КАК ПричинаОтмены,
		|		Содержание КАК Содержание,
		|		ВЫБОР
		|			КОГДА ЗаданиеТорговомуПредставителю.Товары.ПричинаОтмены = ЗНАЧЕНИЕ(Справочник.ПричиныОтменыЗаказовКлиентов.ПустаяСсылка)
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ КАК Отменено,
		|		ВЫБОР
		|			КОГДА ЗаданиеТорговомуПредставителю.Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|				ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ИНАЧЕ ЗаданиеТорговомуПредставителю.Склад
		|		КОНЕЦ КАК Склад
		|	) КАК Товары,
		|	ЗаданиеТорговомуПредставителю.ЭтапыГрафикаОплаты.(
		|		ВариантОплаты КАК ВариантОплаты,
		|		ДатаПлатежа КАК ДатаПлатежа,
		|		ПроцентПлатежа КАК ПроцентПлатежа,
		|		СуммаПлатежа КАК СуммаПлатежа,
		|		ПроцентЗалогаЗаТару КАК ПроцентЗалогаЗаТару,
		|		СуммаЗалогаЗаТару КАК СуммаЗалогаЗаТару,
		|		НомерСтроки КАК НомерСтроки
		|	) КАК ЭтапыГрафикаОплаты
		|ИЗ
		|	Документ.ЗаданиеТорговомуПредставителю КАК ЗаданиеТорговомуПредставителю
		|ГДЕ
		|	ЗаданиеТорговомуПредставителю.Ссылка = &Основание");
	
	Запрос.УстановитьПараметр("Основание",Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыЗаданийТорговымПредставителям.Отработано);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Выборка.ДокументОснование,
		Выборка.СтатусДокумента,
		,
		Выборка.ЕстьОшибкиСтатус,
		МассивДопустимыхСтатусов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(ЭтотОбъект, ХозяйственнаяОперация, Валюта);
	КонецЕсли;
	
	ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчет, БанковскийСчетКонтрагента);
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	КонецЕсли;
	
	ТаблицаТовары = Выборка.Товары.Выгрузить();
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Количество",0);
	ТаблицаТовары = Выборка.Товары.Выгрузить();
	
	// Найдем и удалим из таблицы строки с нулевым количеством
	НулевыеСтроки = ТаблицаТовары.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого ТекЭлемент Из НулевыеСтроки Цикл
		ТаблицаТовары.Удалить(ТекЭлемент);
	КонецЦикла;
	
	Товары.Загрузить(ТаблицаТовары);

	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ПрименятьКОбъекту",                Истина);
	СтруктураПараметры.Вставить("ТолькоПредварительныйРасчет",      Ложь);
	СтруктураПараметры.Вставить("ВосстанавливатьУправляемыеСкидки", Ложь);
	СтруктураПараметры.Вставить("УправляемыеСкидки", Неопределено);
	
	СкидкиНаценкиСервер.РассчитатьПоЗаказуКлиента(ЭтотОбъект, СтруктураПараметры);
	СкидкиРассчитаны = Истина;
	
	ТаблицаЭтаповОплаты = Выборка.ЭтапыГрафикаОплаты.Выгрузить();
	
	СуммаЗаказанныхСтрок = ПолучитьСуммуЗаказанныхСтрок();
	СуммаЗалоговойТары = ПолучитьСуммуЗаказанныхСтрок(Истина);
	
	// Если в задании заполнены этапы графиков оплаты - скопируем их
	Если ТаблицаЭтаповОплаты.Количество() > 0 Тогда
		ЭтапыГрафикаОплаты.Загрузить(ТаблицаЭтаповОплаты);
	ИначеЕсли ЗначениеЗаполнено(ГрафикОплаты) Тогда
		ЭтапыОплатыСервер.ЗаполнитьЭтапыОплатыДокументаПродажиПоГрафикуОплаты(
			ЭтотОбъект,
			СуммаЗаказанныхСтрок - СуммаЗалоговойТары,
			СуммаЗалоговойТары,
			Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)
	
	Если ДанныеЗаполнения.Свойство("Партнер") Тогда
		
		Партнер = ДанныеЗаполнения.Партнер;
		ПродажиСервер.ПроверитьВозможностьВводаНаОснованииПартнераКлиента(Партнер);
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
			ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Менеджер                  = Пользователи.ТекущийПользователь();
	Валюта                    = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Валюта);
	Организация               = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    			= Организация;
	СтруктураПараметров.БанковскийСчет 			= БанковскийСчет;
	БанковскийСчет            = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
		
	БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(
		Контрагент, , 
		БанковскийСчетКонтрагента);
		
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    	= Организация;
	СтруктураПараметров.ФормаОплаты 	= ФормаОплаты;
	СтруктураПараметров.Касса 			= Касса;
	Касса                     = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
		
	Склад                     = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад,
		ПолучитьФункциональнуюОпцию("ИспользоватьСкладыВТабличнойЧастиДокументовПродажи"));
	Приоритет                 = Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Приоритет);
	НеОтгружатьЧастями        = Истина;
	ПорядокРасчетов           = ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЭтотОбъект);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		Статус                    = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПострочнуюОтгрузкуВЗаказеКлиента") Тогда
			ДатаОтгрузки = ТекущаяДатаСеанса();
		КонецЕсли;
	Иначе
		Статус                    = Перечисления.СтатусыЗаказовКлиентов.НеСогласован;
	КонецЕсли; 
	ЗаполнитьОбособленно = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Соглашение, "ОбеспечиватьЗаказыОбособленно");
	ОбеспечениеСервер.ЗаполнитьВариантОбеспеченияПоУмолчанию(Товары, ЗаполнитьОбособленно, Статус);

	
КонецПроцедуры

Процедура ИнициализироватьУсловияПродаж()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И Не ЗначениеЗаполнено(ДокументОснование) Тогда
		ЗаполнитьУсловияПродажПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;

	Массив.Добавить(Движения.ОбеспечениеЗаказов);

	Если Не ДополнительныеСвойства.ЭтоНовый Тогда
		Массив.Добавить(Движения.ЗаказыКлиентов);
		Массив.Добавить(Движения.ОбеспечениеЗаказовРаботами);
	КонецЕсли;
	
	// Контроль выполняется при перепроведении, отмене проведения или если используются серии, 
	// чтобы проверить возможность резервирования серий
	
	Если Не ДополнительныеСвойства.ЭтоНовый
		Или НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.ЗаказКлиента).ИспользоватьСерииНоменклатуры Тогда
		Массив.Добавить(Движения.ТоварыКОтгрузке);
	КонецЕсли;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		Массив.Добавить(Движения.СвободныеОстатки);
		Массив.Добавить(Движения.ГрафикОтгрузкиТоваров);
		Массив.Добавить(Движения.РасчетыСКлиентами);

	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
КонецПроцедуры

Процедура ПроверитьИзменениеХозяйственнойОперации(Отказ)
	
	Если Не ЭтоНовый() И ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда
	
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РасчетыСКлиентами.СуммаРасход КАК СуммаОплаты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Обороты(,,Период,
		|		ЗаказКлиента = &Ссылка
		|	) КАК РасчетыСКлиентами
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Документ.ЗаказКлиента КАК ДанныеДокумента
		|	ПО
		|		ДанныеДокумента.Ссылка = &Ссылка
		|		И ДанныеДокумента.ХозяйственнаяОперация <> &ХозяйственнаяОперация
		|ГДЕ
		|	РасчетыСКлиентами.СуммаРасход > 0
		|");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Заказ клиента оплачен. Нельзя устанавливать операцию %1'"),
				ХозяйственнаяОперация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ЭтотОбъект,
				"ХозяйственнаяОперация",
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуВозвратнойТары()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС,
	|	Товары.Отменено КАК Отменено
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	НЕ Товары.Отменено
	|	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	И &ВернутьМногооборотнуюТару
	|	И НЕ &ТребуетсяЗалогЗаТару
	|");
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаСНДС,Отменено"));
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаВозвратнойТарыЗаказанныхСтрок = Выгрузка[0].СуммаСНДС;
	Возврат СуммаВозвратнойТарыЗаказанныхСтрок;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли


Функция ПреверкаОбещанногоПлатежа(Заказ)

	ЕстьОбещанныйПлатеж = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбещанныйПлатежЗаказы.Заказ.Ссылка КАК ЗаказСсылка,
		|	ОбещанныйПлатежЗаказы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОбещанныйПлатеж.Заказы КАК ОбещанныйПлатежЗаказы
		|ГДЕ
		|	ОбещанныйПлатежЗаказы.Заказ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
	
		ЕстьОбещанныйПлатеж = ИСТИНА;
	
	КонецЕсли; 
	
	Возврат ЕстьОбещанныйПлатеж;

КонецФункции // ПреверкаОбещанногоПлатежа(Заказ)()
 
&НаСервере
Процедура ПерераспределениеСуммОплат(СуммаПредоплаты)

	ЗаказСсылка = ЭтотОбъект.Ссылка;
	
	Оплачено = ПроверкаСуммОплат(ЗаказСсылка);
	
	Если Оплачено > СуммаПредоплаты Тогда
	    ПредоплатаСверхЗаказа = Оплачено - СуммаПредоплаты;
		ОтрегулироватьОплатыПоЗаказу(ЗаказСсылка,ПредоплатаСверхЗаказа);
	КонецЕсли; 

КонецПроцедуры


Процедура ОтрегулироватьОплатыПоЗаказу(ЗаказСсылка,ПредоплатаСверхЗаказа)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка КАК Ссылка,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ КАК Заказ,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Сумма КАК Сумма,
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
		|ГДЕ
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
		|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Заказ = &ЗаказСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ЗаказСсылка", ЗаказСсылка);
	
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
    
		
		Пока РезультатЗапроса.Следующий() Цикл
			
			Если ПредоплатаСверхЗаказа = 0 Тогда			
				Прервать;
			КонецЕсли;
			
			
			ПоступлениеДССсылка = РезультатЗапроса.Ссылка.ПолучитьОбъект();
			
			НС = ПоступлениеДССсылка.РасшифровкаПлатежа.Количество()-1;
			
			Для стр = -НС По 0 Цикл
				
				СуммаУменьшенияНашегоДолга = 0;
				стрДС = ПоступлениеДССсылка.РасшифровкаПлатежа[-стр];
	
			    Если стрДС.Заказ = ЗаказСсылка Тогда
			
					Если ПредоплатаСверхЗаказа > стрДС.Сумма  Тогда
					   СуммаУменьшенияНашегоДолга = стрДС.Сумма;
				    Иначе
					   СуммаУменьшенияНашегоДолга = ПредоплатаСверхЗаказа;		
					КонецЕсли;

					Если стрДС.Сумма - СуммаУменьшенияНашегоДолга = 0 Тогда
						ПоступлениеДССсылка.РасшифровкаПлатежа.Удалить(стрДС);
						
					Иначе
						стрДС.Сумма = стрДС.Сумма - СуммаУменьшенияНашегоДолга;
						стрДС.СуммаВзаиморасчетов = стрДС.Сумма;

					КонецЕсли;
					
						стрДСНовая = ПоступлениеДССсылка.РасшифровкаПлатежа.Добавить();
						ЗаполнитьЗначенияСвойств(стрДСНовая,стрДС);
						
						стрДСНовая.Сумма = СуммаУменьшенияНашегоДолга;
						стрДСНовая.ОснованиеПлатежа= Документы.ЗаказКлиента.ПустаяСсылка();
						стрДСНовая.Заказ = ЭтотОбъект.Договор;
						стрДСНовая.СуммаВзаиморасчетов = СуммаУменьшенияНашегоДолга;

					ПредоплатаСверхЗаказа = ПредоплатаСверхЗаказа - СуммаУменьшенияНашегоДолга;
					
					Если ПредоплатаСверхЗаказа = 0 Тогда			
						Прервать;
					КонецЕсли;

				КонецЕсли;
		
			КонецЦикла; 
			
			//ПоступлениеДССсылка.СуммаДокумента = ПоступлениеДССсылка.РасшифровкаПлатежа.Итог("Сумма");
			
			//Если ПоступлениеДССсылка.СуммаДокумента = 0 Тогда
			//	
			//    ПоступлениеДССсылка.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//	ПоступлениеДССсылка.УстановитьПометкуУдаления(Истина);

			//Иначе
				ПоступлениеДССсылка.Записать(РежимЗаписиДокумента.Проведение);
			//КонецЕсли;

		КонецЦикла; 
	
КонецПроцедуры




Функция ПроверкаСуммОплат(ЗаказСсылка) //jadmin

	Оплачено = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
		|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
		|	СостоянияЗаказовКлиентов.ДатаСобытия КАК ДатаСобытия,
		|	СостоянияЗаказовКлиентов.СуммаОплаты КАК СуммаОплаты,
		|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты,
		|	СостоянияЗаказовКлиентов.СуммаОтгрузки КАК СуммаОтгрузки,
		|	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузки,
		|	СостоянияЗаказовКлиентов.СуммаДолга КАК СуммаДолга,
		|	СостоянияЗаказовКлиентов.ПроцентДолга КАК ПроцентДолга,
		|	СостоянияЗаказовКлиентов.ЕстьРасхожденияОрдерНакладная КАК ЕстьРасхожденияОрдерНакладная
		|ИЗ
		|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|ГДЕ
		|	СостоянияЗаказовКлиентов.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", ЗаказСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Оплачено =  Оплачено + ВыборкаДетальныеЗаписи.СуммаОплаты; 
	КонецЦикла;
	
	Возврат Оплачено;
	
КонецФункции // ()
 

//jadmin 280922 Расчет скидок при проведении (для исключения ошибок при выравнии ордера и заявки)
//jadmin 01-12-2022
Процедура ПрименитьСкидки() Экспорт
	
	Если ЭтотОбъект.Ссылка <> Документы.ЗаказКлиента.ПустаяСсылка() Тогда
		
		ЭтоРозница = ПроверитьЭтоРозничныйЗаказ();
		Если (ЭтоРозница = Истина)
			или (СтрНайти(Строка(ЭтотОбъект.Соглашение),"Благотворительность") > 0) Тогда
			Возврат;	
		КонецЕсли;	
		

		
			//Для Каждого ЭлементСписка Из ЭтотОбъект.Товары Цикл
			//	
			//	ЭлементСписка.ПроцентРучнойСкидки = ЭтотОбъект.СкидкаОбщая;
			//			
			//КонецЦикла;	
			
			//РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);    /////////77w qaws	
			
	////jadmin Проверка условия срабатывания скидок	
		//ПроверитьУсловияСрабатыванияСкидокМССО();  //jadmin отключил т.к. в след процедуре пересчитываются скидки. Если включать то надо доработать процедуру (обнулить процент скидки в строке под условия)
		
		ЗаполнитьЦеныПоСериям(); //jadmin перезаполняю ТЧ для проверки Цен по сериям Рег цены


		//Для каждого ЭлементСписка Из ЭтотОбъект.Товары Цикл
		//
		//	//ЭлементСписка.ПроцентРучнойСкидки = Объект.СкидкаОбщая;
		//		
		//	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
		//	КэшированныеЗначения = Неопределено;
		//	
		//	СтруктураДействий = Новый Структура;
		//	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
		//	СтруктураДействий.Вставить("ПересчитатьСумму");
		//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		//	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		//	
		//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ЭлементСписка, СтруктураДействий, КэшированныеЗначения);
		//	
		//КонецЦикла;	
			
		//РассчитатьИтоговыеПоказателиЗаказа(ЭтаФорма);    /////////77w qaws	
	////

	КонецЕсли; 
		
		
КонецПроцедуры

&НаСервере
Функция ПроверитьЭтоРозничныйЗаказ()
	Если (ЭтотОбъект.Соглашение.СВ_РасчетныйНДС = Истина) Тогда
		Возврат Истина;
	КонецЕсли;
		Возврат Ложь;
КонецФункции


//jadmin 01-12-2022
Процедура ЗаполнитьЦеныПоСериям()
	

	 	/////////// пересчет цен если есть уена по сериям \\\\\\\\\\
	Если НачалоДня(ЭтотОбъект.Дата) >= Дата("20221105") Тогда
		
		ТЧ_Товары = Неопределено;
		ОбщийМодуль77w.ПроверитьЗаказКлиента(ЭтотОбъект.Ссылка,ЭтотОбъект.Товары,ЛОЖЬ,"Пересчет", ТЧ_Товары);  
		
		Если ТЧ_Товары <> Неопределено Тогда	
				ЭтотОбъект.Товары.Загрузить(ТЧ_Товары);
		КонецЕсли;

		//Для каждого ЭлементСписка Из ЭтотОбъект.Товары Цикл
		//
		//	Если ЭтотОбъект.ИнтернетЗаказ = ИСТИНА И ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		//		ЭлементСписка.Цена = ПолучитьЦенуНаСервере_Розница(ЭлементСписка.Номенклатура,ЭлементСписка.Серия);
		//	ИначеЕсли ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад  Тогда
		//		ЭлементСписка.Цена = ПолучитьЦенуНаСервере_Опт(ЭлементСписка.Номенклатура,ЭлементСписка.Серия,ЭлементСписка.ВидЦены);
		//	КонецЕсли;
		//	
		//	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
		//	КэшированныеЗначения = Неопределено;
		//	
		//	СтруктураДействий = Новый Структура;
		//	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
		//	СтруктураДействий.Вставить("ПересчитатьСумму");
		//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
		//	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомАвтоматическойСкидки", Новый Структура("Очищать", Ложь));
		//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		//	//СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
		//	
		//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ЭлементСписка, СтруктураДействий, КэшированныеЗначения);
		//	
		//КонецЦикла;	
	КонецЕсли; 

	

КонецПроцедуры


Процедура ЗаполнитьСрокДействияЗаказа()

	Если ЭтотОбъект.Партнер.ВидПартнераКонтрагента.Наименование = "Торговые сети"  ТОГДА
		
	Иначе
		
		Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда	
			ДатаОплатыПлан = НачалоДня(ЭтотОбъект.Дата);
		Иначе
			ДатаОплатыПлан = НачалоДня(ТекущаяДата());	
		КонецЕсли; 
		
		Если ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда	
			Для каждого стр Из ЭтотОбъект.ЭтапыГрафикаОплаты Цикл
				Если стр.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки Тогда
					ДатаОплатыПлан = ДобавитьРабочиеДни(стр.ДатаПлатежа,2);
					Прервать;
				КонецЕсли; 
			КонецЦикла;	
		КонецЕсли;
		
		ЭтотОбъект.СрокДействияЗаказа = ДобавитьРабочиеДни(ДатаОплатыПлан,2);
		
	КонецЕсли;

КонецПроцедуры
 
Функция ДобавитьРабочиеДни(Дата,КолВоДнейВперед)
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	НоваяДата = Дата;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 30
		|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь КАК ПроизводственныйКалендарь,
		|	ДанныеПроизводственногоКалендаря.Дата КАК Дата,
		|	ДанныеПроизводственногоКалендаря.Год КАК Год,
		|	ДанныеПроизводственногоКалендаря.ВидДня КАК ВидДня
		|ИЗ
		|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
		|ГДЕ
		|	ДанныеПроизводственногоКалендаря.Дата >= &Дата
		|	И ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
		|	И ДанныеПроизводственногоКалендаря.ВидДня = &ВидДня";
	
	Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Справочники.ПроизводственныеКалендари.НайтиПоКоду("РБ"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	НоваяДата = РезультатЗапроса[КолВоДнейВперед].Дата;
	
	Возврат НоваяДата;

КонецФункции

Функция ПолучитьКоличествоВУпаковке(Номенклатура,Дата) Экспорт

		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзвешенныеТоварыКоличествоВУпаковкеСрезПоследних.Период КАК Период,
		|	ВзвешенныеТоварыКоличествоВУпаковкеСрезПоследних.Номенклатура КАК Номенклатура,
		|	ВзвешенныеТоварыКоличествоВУпаковкеСрезПоследних.КолВо КАК КолВо
		|ИЗ
		|	РегистрСведений.ВзвешенныеТоварыКоличествоВУпаковке.СрезПоследних(&Дата, ) КАК ВзвешенныеТоварыКоличествоВУпаковкеСрезПоследних
		|ГДЕ
		|	ВзвешенныеТоварыКоличествоВУпаковкеСрезПоследних.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КолВоВУпак = Неопределено;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолВоВУпак = ВыборкаДетальныеЗаписи.КолВо;
	КонецЦикла;
	
	Возврат КолВоВУпак;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции // ()


Процедура ЗаполнитьДляОбменаСБух()

	 	//jadmin Заполняем Заказы по предоплате для выгрузки в бух
		
		Если ЭтотОбъект.ПометкаУдаления = ЛОЖЬ Тогда
			ПомУдал = 0;
		Иначе
			ПомУдал = 1;
		КонецЕсли;

		
			НаборЗаписей = РегистрыСведений.Обмен_ЗаказыПоПредоплате.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЗаказСсылка.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				
				ЕстьИзменения = ЛОЖЬ;
				Для каждого стр Из НаборЗаписей Цикл
					
					
					Если НачалоДня(стр.ДатаОтгрузки) <> НачалоДня(ЭтотОбъект.ДатаОтгрузки) Тогда
						стр.ДатаОтгрузки = ЭтотОбъект.ДатаОтгрузки;
						ЕстьИзменения = ИСТИНА;				
					КонецЕсли;

					Если НачалоДня(стр.ДатаЗаказа) <> НачалоДня(ЭтотОбъект.Дата) Тогда
						стр.ДатаЗаказа = ЭтотОбъект.Дата;
						ЕстьИзменения = ИСТИНА;				
					КонецЕсли;
					
					Если стр.УНП <> СокрЛП(ЭтотОбъект.Контрагент.ИНН) Тогда
						стр.УНП = СокрЛП(ЭтотОбъект.Контрагент.ИНН);
						ЕстьИзменения = ИСТИНА;
					КонецЕсли;
					
					Если стр.КодФилиалаКонтрагента <> ЭтотОбъект.Контрагент.КодФилиала Тогда
						стр.КодФилиалаКонтрагента = ЭтотОбъект.Контрагент.КодФилиала;
						ЕстьИзменения = ИСТИНА;
					КонецЕсли;
					
					Если стр.ПредоплатаСумма <> ЭтотОбъект.СуммаПредоплатыДоОтгрузки Тогда
						стр.ПредоплатаСумма = ЭтотОбъект.СуммаПредоплатыДоОтгрузки;
						ЕстьИзменения = ИСТИНА;
					КонецЕсли;
					
					Если стр.UID_DOG <> ЭтотОбъект.Договор.Ссылка.УникальныйИдентификатор() Тогда
						стр.UID_DOG = ЭтотОбъект.Договор.Ссылка.УникальныйИдентификатор();
						ЕстьИзменения = ИСТИНА;
					КонецЕсли;
					
					Если стр.ПорядокРасчетов <> ЭтотОбъект.ПорядокРасчетов Тогда
						стр.ПорядокРасчетов = ЭтотОбъект.ПорядокРасчетов;
						ЕстьИзменения = ИСТИНА;
					КонецЕсли;
							
					
					Если ЭтотОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
						И ЭтотОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
							ЕстьИзменения = ИСТИНА;
						 	ПомУдал = 1;
					КонецЕсли;

					
					//Проверка на изменение условий оплаты
					Если ЭтотОбъект.ПорядокРасчетов <> Перечисления.ПорядокРасчетов.ПоЗаказамНакладным
						//ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению 
						Тогда
					     ЕстьИзменения = ИСТИНА;
						 ПомУдал = 1;
					КонецЕсли;
					 
					Если стр.ПометкаУдаления <> ПомУдал Тогда
						стр.ПометкаУдаления = ПомУдал;
						ЕстьИзменения = ИСТИНА;
					КонецЕсли;

					
					Если ЕстьИзменения = ИСТИНА Тогда
						стр.ПризнакОбработано = 0;
					КонецЕсли;
					
				КонецЦикла; 
				
				Если ЕстьИзменения = ИСТИНА Тогда
					НаборЗаписей.Записать(ИСТИНА);
				КонецЕсли;
				
			Иначе
				
			//Если ЭтотОбъект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые")
			//	И ЭтотОбъект.Партнер.ВидПартнераКонтрагента <> Справочники.ВидПартнераКонтрагента.НайтиПоКоду("000000007") 
			//	Тогда
				
				//Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению 
				//	ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
					
				Если ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке
					ИЛИ ЭтотОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению Тогда
					
					Если ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда
						Если ЭтотОбъект.СуммаПредоплатыДоОтгрузки > 0 Тогда
							МенеджерЗаписей = РегистрыСведений.Обмен_ЗаказыПоПредоплате.СоздатьМенеджерЗаписи();
							МенеджерЗаписей.ЗаказСсылка = ЭтотОбъект.Ссылка;
							
							МенеджерЗаписей.НомерЗаказа = ""+ЭтотОбъект.Номер;
							
							МенеджерЗаписей.ДатаЗаказа = ЭтотОбъект.Дата;


							МенеджерЗаписей.ДатаОтгрузки = ЭтотОбъект.ДатаОтгрузки;
							
							
							МенеджерЗаписей.ЗаказСтрока = ""+ЭтотОбъект.Ссылка;
							
							МенеджерЗаписей.ПредоплатаСумма = ЭтотОбъект.СуммаПредоплатыДоОтгрузки;
							
							МенеджерЗаписей.UID_DOC = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
							МенеджерЗаписей.UID_DOG = ЭтотОбъект.Договор.Ссылка.УникальныйИдентификатор();
							МенеджерЗаписей.УНП = ""+СокрЛП(ЭтотОбъект.Контрагент.ИНН);
							МенеджерЗаписей.КодФилиалаКонтрагента = ""+ЭтотОбъект.Контрагент.КодФилиала;
							МенеджерЗаписей.ПорядокРасчетов = ЭтотОбъект.ПорядокРасчетов;
							
							МенеджерЗаписей.ПометкаУдаления = ПомУдал;
							МенеджерЗаписей.ПризнакОбработано = 0;
							
							МенеджерЗаписей.Регистратор = ЭтотОбъект.Ссылка;
							МенеджерЗаписей.Записать(ИСТИНА);
						КонецЕсли; 				
					КонецЕсли;					
				КонецЕсли; 
				
			//КонецЕсли; 
		КонецЕсли;
	///


КонецПроцедуры





&НаСервере
Процедура ПечатьСчетНаСервере(ТабДок) Экспорт
	
	   //ОбработкаВопроса_77w();
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	
	//	ТекстВопроса = Нстр("ru = 'Данные еще не записаны.
	//	|Печать возможна только после записи документа.
	//	|Данные будут записаны.'");
	//	
	//	ПоказатьВопрос(Новый ОписаниеОповещения("ОткрытьФормуСегментовЗапретаОтгрузкиЗавершение", ЭтотОбъект), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
	//	Возврат;
	//	
	//КонецЕсли;
	
	Объект = ЭтотОбъект.Ссылка;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;	
    ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	//Макет = ПолучитьМакетНаСервере("СчетМССО");
	
	Макет = ЭтотОбъект.ПолучитьМакет("СчетМССО");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	Если Объект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		
		Разделитель = "-";
		СтрокаНомер = СтрРазделить(СокрЛ(Объект.Номер),Разделитель);
		НомерПеч = СтрокаНомер[2-1];
			
		Префикс = Объект.Склад.НомерМагазинаДляОтчетов;

		Пока СтрДлина(Префикс) <> 4 Цикл
			Префикс = "0" + Префикс;
		КонецЦикла; 
 
		НомерСчФактуры = ""+Префикс+"-"+НомерПеч; 

		
	Иначе 
		
		НомерСчФактуры = СокрЛ(Объект.Номер)	
	
	КонецЕсли; 
	
	ОбластьШапка.Параметры.ПРОТОКОЛ = "ПРОТОКОЛ (СЧЕТ-ФАКТУРА) № "+ НомерСчФактуры + " от "+Формат(Объект.Дата,"ДЛФ=DD") + "согласования отпускных цен.";
	

	Попытка
	ПараметрыСеанса.ВременныйАдресПочты = СокрЛП(Объект.Контрагент.КонтактнаяИнформация[3].АдресЭП);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	ФирмаПеч = "";
	
	ОбластьШапка.Параметры.Заполнить(Объект);
	ФирмаПеч = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), "ПолноеНаименование,,,,,,,");
	АдресПеч = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",,ЮридическийАдрес,,,,,");
	//ОбластьШапка.Параметры.НаименованиеФирмы = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , Объект.БанковскийСчет), "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	ОбластьШапка.Параметры.Фирма = ФирмаПеч;
	ОбластьШапка.Параметры.Адрес  = АдресПеч;
	ОбластьШапка.Параметры.ИНН = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",ИНН,,,,,,");
	//ОбластьШапка.Параметры.НомерСчета = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",,,,НомерСчета,Банк,БИК,");
	
	
	
	
	Если ЗНАЧЕНИЕЗАПОЛНЕНО(Объект.БанковскийСчет.НомерСчета) Тогда
		
		ОбластьШапка.Параметры.НомерСчета = Объект.БанковскийСчет.НомерСчета;
		ОбластьШапка.Параметры.Банк = Объект.БанковскийСчет.Банк;
		ОбластьШапка.Параметры.БанкКод = Объект.БанковскийСчет.Банк.Код;	
	Иначе
		ИщемСчет = ""+"BY47BAPB30122768700100000000";
		НашлиНашСчет = Справочники.БанковскиеСчетаОрганизаций.НайтиПоРеквизиту("НомерСчета",ИщемСчет,,Объект.Организация);
		Если НашлиНашСчет <> Справочники.БанковскиеСчетаОрганизаций.ПустаяСсылка() Тогда
			Объект.БанковскийСчет = НашлиНашСчет;
			
		ОбластьШапка.Параметры.НомерСчета = Объект.БанковскийСчет.НомерСчета;
		ОбластьШапка.Параметры.Банк = Объект.БанковскийСчет.Банк;
		ОбластьШапка.Параметры.БанкКод = Объект.БанковскийСчет.Банк.Код;	
			
		КонецЕсли; 
		
		
	КонецЕсли; 	
	
	
	
	
	ОбластьШапка.Параметры.Покупатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), "ПолноеНаименование,,,,,,,");
	
	ОбластьШапка.Параметры.РасшифровкаКонтрагента = Объект.Контрагент;  /////// 77w qaws  для рассшифровки ячейки
	
	ОбластьШапка.Параметры.ПокупательАдрес = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), ",,ЮридическийАдрес,,,,,");
	Если ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
	
		ОбластьШапка.Параметры.ПокупательАдрес = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), ",,ЮридическийАдрес,,,,,")+", "+ Объект.АдресДоставки;
	
	КонецЕсли;
	

	
	ОбластьШапка.Параметры.ПокупательИНН = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), ",ИНН,,,,,,");
	//ОбластьШапка.Параметры.НомерСчетаПокупатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), ",,,,НомерСчета,Банк,БИК,");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Счет,
	|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	|	БанковскиеСчета.Банк КАК Банк,
	|	БанковскиеСчета.Банк.Код КАК БанкКод
	|ИЗ
	|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Владелец
	|	И БанковскиеСчета.Закрыт = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец",Объект.Контрагент);
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество()>0 Тогда
		Если ЗначениеЗаполнено(Выборка[0]) Тогда
			ОбластьШапка.Параметры.НомерСчетаПокупатель = СокрЛП(Выборка[0].НомерСчета);
			ОбластьШапка.Параметры.БанкПокупатель = СокрЛП(Выборка[0].Банк);
			ОбластьШапка.Параметры.БанкКодПокупатель = СокрЛП(Выборка[0].БанкКод);
			
			Если НЕ ЗначениеЗаполнено(Выборка[0].БанкКод) = Истина Тогда
			 	ОбластьШапка.Параметры.БанкКодПокупатель = СокрЛП(Выборка[0].Счет.СВИФТБанка);	
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Выборка[0].Банк) = Истина Тогда
			 	ОбластьШапка.Параметры.БанкПокупатель = СокрЛП(Выборка[0].Счет.НаименованиеБанка);	
			КонецЕсли; 
			
		КонецЕсли;
	КонецЕсли;

	
	ТабДок.Вывести(ОбластьШапка);
    
    
    Если Пользователи.ТекущийПользователь().Наименование = "Дите Марина" Тогда
    	Область  = Макет.ПолучитьОбласть("Дите");
    	Область.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
    	Область.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
    	ТабДок.Вывести(Область);
 
    ИначеЕсли Пользователи.ТекущийПользователь().Наименование = "Агейчик Алла" Тогда
    	Область  = Макет.ПолучитьОбласть("АгейчикАлла");
    	Область.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
    	Область.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
    	ТабДок.Вывести(Область);   
        
    ИначеЕсли Пользователи.ТекущийПользователь().Наименование = "Рымашевская Ольга" Тогда
    	Область  = Макет.ПолучитьОбласть("Рымашевская");
    	Область.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
    	Область.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
    	ТабДок.Вывести(Область);
    ИначеЕсли Пользователи.ТекущийПользователь().Наименование = "Тулатин Евгений" Тогда
    	Область  = Макет.ПолучитьОбласть("Тулатин");
    	Область.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
    	Область.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
    	ТабДок.Вывести(Область);
	//ИначеЕсли Пользователи.ТекущийПользователь().Наименование = "Качан Екатерина" Тогда
    //ИначеЕсли Пользователи.ТекущийПользователь().Наименование = "Рык Татьяна" Тогда  
    ИначеЕсли Пользователи.ТекущийПользователь().Наименование = "Слипчук Марина" Тогда  
    	Область  = Макет.ПолучитьОбласть("Качан");
    	Область.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
    	Область.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
    	ТабДок.Вывести(Область);
    ИначеЕсли Пользователи.ТекущийПользователь().Наименование = "Проскурнин Павел" Тогда
    	Область  = Макет.ПолучитьОбласть("Проскурнин");
    	Область.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
    	Область.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
    	ТабДок.Вывести(Область);
    Иначе     
        ОбластьШапка1  = Макет.ПолучитьОбласть("Шапка1");
        ОбластьШапка1.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
        ОбластьШапка1.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
        ТабДок.Вывести(ОбластьШапка1);
    
    КонецЕсли; 
    
    
    
    
    
    
	ОбластьШапка2  = Макет.ПолучитьОбласть("Шапка2");
	ТабДок.Вывести(ОбластьШапка2);
	
	
	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
	
	Ном = 0;
	
	
	
//jadmin Для Ускорения формирования документа	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
		|	ЗаказКлиентаТовары.Цена КАК Цена,
		|	ЗаказКлиентаТовары.Сумма КАК Сумма,
		|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
		|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
		|	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
		|	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
		|	ЗаказКлиентаТовары.Отменено КАК Отменено,
		|	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
		|	ЗаказКлиентаТовары.Склад КАК Склад,
		|	ЗаказКлиентаТовары.СрокПоставки КАК СрокПоставки,
		|	ЗаказКлиентаТовары.Содержание КАК Содержание,
		|	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ЗаказКлиентаТовары.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора,
		|	ЗаказКлиентаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ЗаказКлиентаТовары.КолВоГрузовыхМест КАК КолВоГрузовыхМест,
		|	ЗаказКлиентаТовары.СкидкаЗаПредоплату КАК СкидкаЗаПредоплату,
		|	ЗаказКлиентаТовары.СкидкаЗаОборот КАК СкидкаЗаОборот,
		|	ЗаказКлиентаТовары.СкидкаСезонная КАК СкидкаСезонная
		|ПОМЕСТИТЬ ТАБЗАКАЗ
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Серия КАК Серия,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт КАК РегЦена_Опт,
		|	РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница КАК РегЦена_Розница
		|ПОМЕСТИТЬ ТАБРеГ
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегулируемыеЦеныНаНоменклатуре.СрезПоследних(&ДатаДок, ) КАК РегулируемыеЦеныНаНоменклатуреСрезПоследних
		|		ПО (ЗаказКлиентаТовары.Номенклатура = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура)
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Ссылка
		|	И ВЫБОР
		|			КОГДА &ТипСклада = ЗНАЧЕНИЕ(Перечисление.ТипыСкладов.ОптовыйСклад)
		|				ТОГДА РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт = ИСТИНА
		|			ИНАЧЕ РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница = ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЗаказ.Ссылка КАК Ссылка,
		|	ТабЗаказ.НомерСтроки КАК НомерСтроки,
		|	ТабЗаказ.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ТабЗаказ.Номенклатура КАК Номенклатура,
		|	ТабЗаказ.Характеристика КАК Характеристика,
		|	ТабЗаказ.Упаковка КАК Упаковка,
		|	ТабЗаказ.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ТабЗаказ.Количество КАК Количество,
		|	ТабЗаказ.ВидЦены КАК ВидЦены,
		|	ТабЗаказ.Цена КАК Цена,
		|	ТабЗаказ.Сумма КАК Сумма,
		|	ТабЗаказ.СтавкаНДС КАК СтавкаНДС,
		|	ТабЗаказ.СуммаНДС КАК СуммаНДС,
		|	ТабЗаказ.СуммаСНДС КАК СуммаСНДС,
		|	ТабЗаказ.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		|	ТабЗаказ.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		|	ТабЗаказ.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		|	ТабЗаказ.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		|	ТабЗаказ.ПричинаОтмены КАК ПричинаОтмены,
		|	ТабЗаказ.КодСтроки КАК КодСтроки,
		|	ТабЗаказ.Отменено КАК Отменено,
		|	ТабЗаказ.КлючСвязи КАК КлючСвязи,
		|	ТабЗаказ.Склад КАК Склад,
		|	ТабЗаказ.СрокПоставки КАК СрокПоставки,
		|	ТабЗаказ.Содержание КАК Содержание,
		|	ТабЗаказ.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ТабЗаказ.ВариантОбеспечения КАК ВариантОбеспечения,
		|	ТабЗаказ.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
		|	ТабЗаказ.Серия КАК Серия,
		|	ТабЗаказ.НоменклатураНабора КАК НоменклатураНабора,
		|	ТабЗаказ.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ТабЗаказ.КолВоГрузовыхМест КАК КолВоГрузовыхМест,
		|	ТабЗаказ.СкидкаЗаПредоплату КАК СкидкаЗаПредоплату,
		|	ТабЗаказ.СкидкаЗаОборот КАК СкидкаЗаОборот,
		|	ТабЗаказ.СкидкаСезонная КАК СкидкаСезонная,
		|	ТАБРеГ.РегЦена_Опт КАК РегЦена_Опт,
		|	ТАБРеГ.РегЦена_Розница КАК РегЦена_Розница
		|ИЗ
		|	ТАБЗАКАЗ КАК ТабЗаказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТАБРеГ КАК ТАБРеГ
		|		ПО (ТАБРеГ.Номенклатура = ТабЗаказ.Номенклатура)
		|			И (ТАБРеГ.Серия = ТабЗаказ.Серия)
		|			И (ТАБРеГ.НомерСтроки = ТабЗаказ.НомерСтроки)";
		
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		//	|	ЗаказКлиентаТовары.НомерСтроки КАК НомерСтроки,
		//	|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки,
		//	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		//	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		//	|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		//	|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		//	|	ЗаказКлиентаТовары.Количество КАК Количество,
		//	|	ЗаказКлиентаТовары.ВидЦены КАК ВидЦены,
		//	|	ЗаказКлиентаТовары.Цена КАК Цена,
		//	|	ЗаказКлиентаТовары.Сумма КАК Сумма,
		//	|	ЗаказКлиентаТовары.СтавкаНДС КАК СтавкаНДС,
		//	|	ЗаказКлиентаТовары.СуммаНДС КАК СуммаНДС,
		//	|	ЗаказКлиентаТовары.СуммаСНДС КАК СуммаСНДС,
		//	|	ЗаказКлиентаТовары.ПроцентРучнойСкидки КАК ПроцентРучнойСкидки,
		//	|	ЗаказКлиентаТовары.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
		//	|	ЗаказКлиентаТовары.ПроцентАвтоматическойСкидки КАК ПроцентАвтоматическойСкидки,
		//	|	ЗаказКлиентаТовары.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
		//	|	ЗаказКлиентаТовары.ПричинаОтмены КАК ПричинаОтмены,
		//	|	ЗаказКлиентаТовары.КодСтроки КАК КодСтроки,
		//	|	ЗаказКлиентаТовары.Отменено КАК Отменено,
		//	|	ЗаказКлиентаТовары.КлючСвязи КАК КлючСвязи,
		//	|	ЗаказКлиентаТовары.Склад КАК Склад,
		//	|	ЗаказКлиентаТовары.СрокПоставки КАК СрокПоставки,
		//	|	ЗаказКлиентаТовары.Содержание КАК Содержание,
		//	|	ЗаказКлиентаТовары.СтатусУказанияСерий КАК СтатусУказанияСерий,
		//	|	ЗаказКлиентаТовары.ВариантОбеспечения КАК ВариантОбеспечения,
		//	|	ЗаказКлиентаТовары.ЦенаСоСкидкой КАК ЦенаСоСкидкой,
		//	|	ЗаказКлиентаТовары.Серия КАК Серия,
		//	|	ЗаказКлиентаТовары.НоменклатураНабора КАК НоменклатураНабора,
		//	|	ЗаказКлиентаТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		//	|	ЗаказКлиентаТовары.КолВоГрузовыхМест КАК КолВоГрузовыхМест,
		//	|	ЗаказКлиентаТовары.СкидкаЗаПредоплату КАК СкидкаЗаПредоплату,
		//	|	ЗаказКлиентаТовары.СкидкаЗаОборот КАК СкидкаЗаОборот,
		//	|	ЗаказКлиентаТовары.СкидкаСезонная КАК СкидкаСезонная,
		//	|	ВЫБОР
		//	|		КОГДА ЗаказКлиентаТовары.Номенклатура = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|			ТОГДА РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Опт
		//	|		ИНАЧЕ ЛОЖЬ
		//	|	КОНЕЦ КАК РегЦена_Опт,
		//	|	ВЫБОР
		//	|		КОГДА ЗаказКлиентаТовары.Номенклатура = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|				ИЛИ ЗаказКлиентаТовары.Номенклатура.Родитель.Родитель.Родитель.Родитель = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|			ТОГДА РегулируемыеЦеныНаНоменклатуреСрезПоследних.РегЦена_Розница
		//	|		ИНАЧЕ ЛОЖЬ
		//	|	КОНЕЦ КАК РегЦена_Розница
		//	|ИЗ
		//	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		//	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.РегулируемыеЦеныНаНоменклатуре.СрезПоследних(&ДатаДок, ) КАК РегулируемыеЦеныНаНоменклатуреСрезПоследних
		//	|		ПО ЗаказКлиентаТовары.Номенклатура = РегулируемыеЦеныНаНоменклатуреСрезПоследних.Номенклатура
		//	|ГДЕ
		//	|	ЗаказКлиентаТовары.Ссылка = &Ссылка";		
			
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ДатаДок", Объект.Дата);
	Запрос.УстановитьПараметр("ТипСклада", Объект.Склад.ТипСклада);
	
	ТЗ_Товары = Запрос.Выполнить().Выгрузить();
	
	
	
	
	//Для каждого Строка Из Объект.Товары Цикл
	Для каждого Строка Из ТЗ_Товары Цикл
		
		Если Строка.Отменено Тогда
			Продолжить;
		КонецЕсли; 
		
		Ном = Ном+1;
		
		ОбластьСтрока.Параметры.Номенклатура = 
		СокрЛП(Строка.Номенклатура.НаименованиеПолное)
		//+ " "+Строка.Номенклатура.УпаковкаГрузомест+" "+?(Строка.Номенклатура.УпаковкаГрузомест.КоэффициентМССО<>0,""+Строка.Номенклатура.УпаковкаГрузомест.КоэффициентМССО,"")
		//+ ""+Строка.Номенклатура.УпаковкаГрузомест.БазоваяЕдиницаМССО
		//+ ", "+Строка.Номенклатура.СтранаПроисхождения;
		+ ", "+?(ЗначениеЗаполнено(Строка.Серия.СтранаПроисхождения),Строка.Серия.СтранаПроисхождения,Строка.Номенклатура.СтранаПроисхождения);
		
		
        Если Строка.Номенклатура.ВесЕдиницаИзмерения.ТипИзмеряемойВеличины = Перечисления.ТипыИзмеряемыхВеличин.Вес Тогда		
			ОбластьСтрока.Параметры.Номенклатура = 
			СокрЛП(Строка.Номенклатура.НаименованиеПолное)
			+ ", "+?(ЗначениеЗаполнено(Строка.Серия.СтранаВвоза),Строка.Серия.СтранаВвоза,Строка.Номенклатура.СтранаВвоза);
		КонецЕсли;
		
		
		
		ОбластьСтрока.Параметры.Ном		   = Ном;			 
		ОбластьСтрока.Параметры.ПартияМССО = Строка.Серия.Партия_МССО;			 
		//ОбластьСтрока.Параметры.Единица    = Строка.Номенклатура.УпаковкаГрузомест;
		ОбластьСтрока.Параметры.Единица    = Строка.Упаковка;
		
		Если НЕ ЗначениеЗаполнено(Строка.Упаковка) Тогда
		  ОбластьСтрока.Параметры.Единица    = Строка.Номенклатура.УпаковкаГрузомест;
		КонецЕсли; 
		
		ОбластьСтрока.Параметры.Количество = Строка.КоличествоУпаковок;
		ОбластьСтрока.Параметры.Цена       = Строка.Цена; 
		
        //ПроцентСкидки = "";
		ПроцентСкидки = 0;
        
		Если Строка.ПроцентАвтоматическойСкидки <> 0 Тогда
			ПроцентСкидки = ПроцентСкидки + Строка.ПроцентАвтоматическойСкидки;
		КонецЕсли;
		
		Если Строка.ПроцентРучнойСкидки <> 0 Тогда 
			ПроцентСкидки = ПроцентСкидки +Строка.ПроцентРучнойСкидки;
		КонецЕсли; 
		
		Если ПроцентСкидки = 0 Тогда
			ОбластьСтрока.Параметры.ПроцентСкидки = "";
		Иначе
			ОбластьСтрока.Параметры.ПроцентСкидки = ""+ПроцентСкидки+"%"; 
		КонецЕсли; 
		//
		////jadmin  значение расчетного НДС в печатную форму
		//Если Строка.СтавкаНДС = Перечисления.СтавкиНДС.Расчетная Тогда
		//    Строка.СтавкаНДС = ПолучитьРасчетныйНДС(Объект.Дата);
		//КонецЕсли;
		//
		
		ОбластьСтрока.Параметры.Сумма        = Строка.Сумма;
		ОбластьСтрока.Параметры.СтавкаНДС    = Строка.СтавкаНДС;
		
		Если объект.Соглашение.Валюта.Код =  "643" Тогда
			ОбластьСтрока.Параметры.СтавкаНДС    = Перечисления.СтавкиНДС.НДС0;
		КонецЕсли; 
		
		ОбластьСтрока.Параметры.СуммаНДС     = Строка.СуммаНДС;
		ОбластьСтрока.Параметры.ВсегоРуб     = Строка.СуммаСНДС;
		
		
		
/////////////////jadmin Заполнение примечания Рег цен 	
		Примечание = "";

		ЕстьРегулированиеЦен_Строка = Ложь;
			
		Если Объект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
			//Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(Строка.Номенклатура,Объект.Дата)= ИСТИНА Тогда
			//	ЕстьРегулированиеЦен_Строка = Истина;
			//КонецЕсли;
			Если Строка.РегЦена_Опт = ИСТИНА Тогда
			     ЕстьРегулированиеЦен_Строка = Истина;
			КонецЕсли;    
			 
			Если Строка.Номенклатура.ПравилаРегулированияЦен = Справочники.ПравилаРегулированиеЦен.НайтиПоКоду("000000001") Тогда     //Средства защиты растений Постановление № 114			 
			 	 ЕстьРегулированиеЦен_Строка = ЛОЖЬ;
			КонецЕсли;

			 
		Иначе
			//Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Розничных(Строка.Номенклатура,Объект.Дата) = Истина Тогда
			//	ЕстьРегулированиеЦен_Строка = Истина;
			//КонецЕсли;
			Если Строка.РегЦена_Розница = ИСТИНА Тогда
			     ЕстьРегулированиеЦен_Строка = Истина;
			КонецЕсли; 
		КонецЕсли;  
		
		
		
			
			Если ЕстьРегулированиеЦен_Строка = Истина Тогда
				//СтрокаТовара = Строка;           //Заменяю переменную 
				
				Цена_В_примечание = "";
				
				ОтпускнаяЦена = 0;
				ОтпускнаяЦена = Строка.Серия.ЦенаПоставщика;
				
				ЦенаСоСкидкой = 0;
				ЦенаСоСкидкой = Окр(Строка.Сумма/Строка.КоличествоУпаковок,2);	
				
				ДопРасходыСумма = 0;
				ДопРасходыСумма = Строка.Серия.ДополнительныеРасходы;
			
				ФСОФСН = "";
				ВидСкидки = "";
					
					Если Строка.Серия.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика Тогда
						ФСОФСН = Строка.Серия.ФСОФСН;
						ВидСкидки = Строка.Серия.ВидСкидкиПоставщика;
						Если ЗначениеЗаполнено(ВидСкидки) Тогда
							ВидСкидки = "Скидка " + НРЕГ(ВидСкидки);
						КонецЕсли; 
						
					Иначе	
						ФСОФСН = Перечисления.ФСОФСН.ФСО;
						//ТЗ_Заказы = СтрокаДокумента.Ссылка.Товары.Выгрузить();
						//ТЗ_Заказы.Свернуть("ЗаказКлиента");
						//Для каждого стрЗаказ Из ТЗ_Заказы Цикл
						//	Если стрЗаказ.ЗаказКлиента.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда		 
						//		ФСОФСН = Перечисления.ФСОФСН.ФСО;
						//		Прервать;
						//	Иначе
						//		ФСОФСН = Перечисления.ФСОФСН.ФСН;
						//		Прервать;
						//	КонецЕсли;
						//КонецЦикла; 
					КонецЕсли;
					
				ФСОФСНТекст = "";
				Если ЗначениеЗаполнено(ФСОФСН) Тогда
					ФСОФСНТекст = "Отпускная цена сформирована на условиях " + ФСОФСН; 
				КонецЕсли;
				
				Если ОтпускнаяЦена > 0 Тогда
					Цена_В_примечание = "Отпускная цена "+Формат(ОтпускнаяЦена,"ЧДЦ=2")+" руб., ";
				КонецЕсли; 
				
				
				КодОКРБ = "";
				//КодОКРБ = "код товара согласно ОКРБ 007-2012 - "+СтрокаТовара.Номенклатура.КодОКРБ.Код;
				СкидкаНаценка = "";
				НадбавкаОпт = "";
				Если ОтпускнаяЦена > 0 Тогда
					Процент = 0;
					РазмерСкидки = 0;
					НадбавкаОпт="";
					ДопРасходы = "";

					Если Строка.Серия.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика Тогда
					    Процент = Строка.Серия.ПроцентСкидкиПоставщика;
						РазмерСкидки = Строка.Серия.РазмерСкидкиПоставщика;
						ВидСкидки =  НРЕГ(Строка.Серия.ВидСкидкиПоставщика);
						Если РазмерСкидки = 0 Тогда
							 СкидкаНаценка = "";
							 //СкидкаНаценка = "скидка с отпускной цены "+Формат(Процент,"ЧДЦ=2; ЧН=0")+"% " + Символы.ПС;
						Иначе
							 СкидкаНаценка = "скидка " + ВидСкидки + " "+ РазмерСкидки + " руб. (" +Формат(Процент,"ЧДЦ=2; ЧН=0")+"%) " + Символы.ПС;
						КонецЕсли; 
						
						Если ЦенаСоСкидкой >= ОтпускнаяЦена Тогда
							Процент = 0;
							Процент = ((ЦенаСоСкидкой/(ОтпускнаяЦена-РазмерСкидки+ДопРасходыСумма))-1)*100;
							НадбавкаОпт = "оптовая надбавка "+Формат(Процент,"ЧДЦ=2; ЧН=0")+"%" + Символы.ПС;
						КонецЕсли; 

						Если ДопРасходыСумма > 0 Тогда
							ДопРасходы = "сумма расходов по доставке товаров -  "+Формат(ДопРасходыСумма,"ЧДЦ=2")+" руб., "+ Символы.ПС;;
						КонецЕсли; 

						
					Иначе	
						//ЦенаСоСкидкой = 0;
						//ЦенаСоСкидкой = Окр(СтрокаТовара.Сумма/СтрокаТовара.КоличествоУпаковок,2);
						Процент = 0;
						Процент = ((ОтпускнаяЦена/ЦенаСоСкидкой)-1)*100;
						РазмерСкидки = 0;
						РазмерСкидки = ОтпускнаяЦена - ЦенаСоСкидкой;
						
						Если ЦенаСоСкидкой < ОтпускнаяЦена Тогда
							СкидкаНаценка = "отпускная цена с учетом скидки "+ ЦенаСоСкидкой + " руб., Вид скидки - с отпускной цены " + Символы.ПС;
							//СкидкаНаценка = "скидка с отпускной цены "++ РазмерСкидки + " руб. (" +Формат(Процент,"ЧДЦ=2; ЧН=0")+"%) " + Символы.ПС;
						ИначеЕсли ЦенаСоСкидкой = ОтпускнаяЦена Тогда
							СкидкаНаценка = "";
							//СкидкаНаценка = "скидка с отпускной цены "+Формат(Процент,"ЧДЦ=2; ЧН=0")+"% " + Символы.ПС;
						КонецЕсли; 
						
					КонецЕсли;
					

					
				КонецЕсли; 				
				
				Примечание	 = ""+Цена_В_примечание+Символы.ПС+СкидкаНаценка + НадбавкаОпт + ДопРасходы +  ФСОФСНТекст;
				
			Иначе
				КодОКРБ = "";
				Цена_В_примечание = "";
				СкидкаНаценка = "";
				НадбавкаОпт = "";
				Примечание	 = "";
			КонецЕсли; 
			
            Если ЭтотОбъект.Склад = Справочники.Склады.Склад3 Тогда 
                АнализДо = Дата(1,1,1);
                АнализДо = Формат(Строка.Серия.Партия_МССО.СрокДействияАнализаТекущий,"ДЛФ=D");  
                
               Если НЕ ЗначениеЗаполнено(Примечание) Тогда
            	   Примечание	 = "Анализ до: "+АнализДо;
               Иначе
                   Примечание	 = Примечание +Символы.ПС +"Анализ до: "+АнализДо;
               КонецЕсли;
               
            КонецЕсли;
            
		ОбластьСтрока.Параметры.Примечание = Примечание;

/////////////////////////
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	
	
	ОбластьИтого.Параметры.ИтогСумма     = Объект.Товары.Итог("Сумма");
	ОбластьИтого.Параметры.ИтогСуммаНДС  = Объект.Товары.Итог("СуммаНДС");
	ОбластьИтого.Параметры.ИтогСуммаСНДС = Объект.Товары.Итог("СуммаСНДС");
	
	ТабДок.Вывести(ОбластьИтого);
	
	
	
	ОбластьПодвал  = Макет.ПолучитьОбласть("Подвал");
	

	ФормСтрока = "Л = ru_RU; ДП = Ложь";
	ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копееек,м,2";
	
	СуммаНДСПрописью = ЧислоПрописью(Объект.Товары.Итог("СуммаНДС"), ФормСтрока, ПарПредмета);
	ОбластьПодвал.Параметры.ИтогСуммаНДС_П =  СуммаНДСПрописью;

	ОбластьПодвал.Параметры.ИтогВсего_П =  ЧислоПрописью(Объект.Товары.Итог("СуммаСНДС"), ФормСтрока, ПарПредмета);;
	
	
	ТабДок.Вывести(ОбластьПодвал);
	
	
	
	ОбластьПодвал2  = Макет.ПолучитьОбласть("Подвал2");
	
	
	Если Объект.Склад.КонтактнаяИнформация.Количество()> 0 Тогда 		
		АдресСклада = Объект.Склад.КонтактнаяИнформация[0].Представление;
	КонецЕсли; 
    
    
    
    ////УсловиеПредоплата = Объект.ЭтапыГрафикаОплаты.Найти(Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки, "ВариантОплаты"); 
    
    
    ЕстьПредоплата = Ложь;
    ЕстьКредит   = Ложь;
   
    ПроцентКредита = 0;
    СуммаКредита = 0;
    ТекстУсловияОплаты = "";
    ТекстУсловияОплатыПредоплата = "";
    ТекстУсловияОплатыКредит = "";
	НаимВалюты = " руб. ";
	
	Если объект.Соглашение.Валюта.Код =  "643" Тогда
		НаимВалюты = " рос.руб. ";
	КонецЕсли; 
	
	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда
	    Для каждого Строка Из Объект.ЭтапыГрафикаОплаты Цикл
	        Если Строка.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки Тогда
	           ЕстьПредоплата = Истина;
	           ТекстУсловияОплатыПредоплата = ""+"Условия оплаты: Предоплата "+Строка.ПроцентПлатежа+"%  в размере "+ Строка.СуммаПлатежа+НаимВалюты+" до "+ Формат(Строка.ДатаПлатежа,"ДЛФ=D");
	        КонецЕсли; 
	        Если Строка.ВариантОплаты = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки Тогда
	            ЕстьКредит = Истина;
	            ПроцентКредита = Строка.ПроцентПлатежа;
	            СуммаКредита = Строка.СуммаПлатежа;
				ТекстУсловияОплатыКредит = ""+"Условия оплаты: отсрочка платежа после отгрузки в течении " + Объект.Договор.ОтсрочкаОплатыПоДоговору+ " календарных дней";
	        КонецЕсли; 
		КонецЦикла;
	Иначе	
		ЕстьКредит = Истина;
        Если Объект.КоличествоДнейОтсрочки <> 0 Тогда
		    ТекстУсловияОплатыКредит = ""+"Условия оплаты: отсрочка платежа после отгрузки в течении " + Объект.КоличествоДнейОтсрочки+ " календарных дней";
        Иначе
		    ТекстУсловияОплатыКредит = ""+"Условия оплаты: отсрочка платежа после отгрузки в течении " + Объект.Договор.ОтсрочкаОплатыПоДоговору+ " календарных дней";
        КонецЕсли; 
	КонецЕсли;
    
    Если ЕстьПредоплата = Истина И ЕстьКредит = Ложь Тогда
        ОбластьПодвал2.Параметры.ТекстУсловияОплаты = ТекстУсловияОплатыПредоплата;
    КонецЕсли; 
    
    Если ЕстьПредоплата = Ложь И ЕстьКредит = Истина Тогда
        ОбластьПодвал2.Параметры.ТекстУсловияОплаты  = ТекстУсловияОплатыКредит;
    КонецЕсли; 
    
    
    Если ЕстьПредоплата = Истина И ЕстьКредит = Истина Тогда
        ОбластьПодвал2.Параметры.ТекстУсловияОплаты = ТекстУсловияОплатыПредоплата+Символы.ПС+"                              "+ПроцентКредита+"%  в размере "+СуммаКредита+ "руб. согласно условий договора";
    КонецЕсли; 
    
    
	ЗаЧейСчетБанкет = "";
	
	Если Объект.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз Тогда
		ЗаЧейСчетБанкет = "Доставка осуществляется за счет Покупателя.";
	Иначе
		ЗаЧейСчетБанкет = "Доставка осуществляется за счет Продавца.";
	КонецЕсли; 
	
	
	ОбластьПодвал2.Параметры.ТекстПодвал2 =  "Данный протокол(счет-фактура) согласования отпускных цен действителен в течении 5 рабочих дней, включая день выставления счета (с "+Формат(Объект.Дата,"ДЛФ=D")+" по "+Формат(Объект.Дата+432000,"ДЛФ=D")+")";
    
                                      //+ ". Получение товара со " +Объект.Склад+ " по адресу "+АдресСклада  +", при наличии : доверенности, паспорта, копии платежного поручения, этого протокола, договора с оригинальными подписями и печатями."+Символы.ПС
                                      //    + Символы.ПС + ЗаЧейСчетБанкет;
		
	
	ОбластьПодвал2.Параметры.ТекстПодвал3 = "Получение товара со " +Объект.Склад+ " по адресу "+АдресСклада  +", при наличии : доверенности, паспорта, копии платежного поручения, этого протокола, договора с оригинальными подписями и печатями."+Символы.ПС
										  + Символы.ПС + ЗаЧейСчетБанкет;
                                          
                                          
                                          
   ТабДок.Вывести(ОбластьПодвал2);
	
КонецПроцедуры




&НаСервере
Процедура ПечатьСчетСетиНаСервере(ТабДок) Экспорт
	
	Объект = ЭтотОбъект.Ссылка;

	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;	
	//Макет = ПолучитьМакетНаСервере("СчетМССОСети");
	Макет = ЭтотОбъект.ПолучитьМакет("СчетМССОСети");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	
	ОбластьШапка.Параметры.ПРОТОКОЛ = "ЗАЯВКА № "+СокрЛ(Объект.Номер)+ " от "+Формат(Объект.Дата,"ДЛФ=DD") +"       "+ Объект.Склад+"      "+Объект.Контрагент;
	
	//ОбластьШапка.Параметры.ЭлАдрес = СокрЛП(Объект.Контрагент.КонтактнаяИнформация[3].АдресЭП);	
	
	Попытка
		ПараметрыСеанса.ВременныйАдресПочты = СокрЛП(Объект.Контрагент.КонтактнаяИнформация[3].АдресЭП);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 	

		
	Если ЗначениеЗаполнено(Объект.НомерПоДаннымКлиента) Тогда
		ОбластьШапка.Параметры.НомерПоДаннымКлиента = "Заказ № "+Объект.НомерПоДаннымКлиента+ " от "+Формат(Объект.ДатаПоДаннымКлиента,"ДЛФ=DD");
	Иначе
		ОбластьШапка.Параметры.НомерПоДаннымКлиента = "";
	КонецЕсли; 
	
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапка2  = Макет.ПолучитьОбласть("Шапка2");
	ТабДок.Вывести(ОбластьШапка2);
	
	
	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
	
	Ном = 0;
	Для каждого Строка Из Объект.Товары Цикл
		
		Если Строка.Отменено Тогда
			Продолжить;
		КонецЕсли; 
		
		
		Ном = Ном+1;
		
		ОбластьСтрока.Параметры.Номенклатура = 
		СокрЛП(Строка.Номенклатура.НаименованиеПолное);
		//+ " "+Строка.Номенклатура.УпаковкаГрузомест+" "+?(Строка.Номенклатура.УпаковкаГрузомест.КоэффициентМССО<>0,""+Строка.Номенклатура.УпаковкаГрузомест.КоэффициентМССО,"")
		//+ ""+Строка.Номенклатура.УпаковкаГрузомест.БазоваяЕдиницаМССО;
		//+ ", "+Строка.Номенклатура.СтранаПроисхождения;
		
		ОбластьСтрока.Параметры.Примечание = ""+?(ЗначениеЗаполнено(Строка.Серия.СтранаПроисхождения),Строка.Серия.СтранаПроисхождения,Строка.Номенклатура.СтранаПроисхождения);
		
		Если ОбластьСтрока.Параметры.Примечание = "" Тогда
			ОбластьСтрока.Параметры.Примечание = ""+?(ЗначениеЗаполнено(Строка.Номенклатура.СтранаПроисхождения),Строка.Номенклатура.СтранаПроисхождения,Строка.Номенклатура.СтранаВвоза);
		КонецЕсли; 
				
			
			ШК = "";
			Штрихкод = "";
			
		   ШтрихКод = РегистрыСведений.ШтрихкодыНоменклатуры.НайтиОсновнойШКНоменклатуры(Строка.Номенклатура);
		   
		   Если ШтрихКод  = Неопределено Тогда        //////////77w qaws
			   Если Строка.Номенклатура.ШКДляДжестори.Код <> 0 Тогда
				   Штрихкод = Формат(Строка.Номенклатура.ШКДляДжестори.Код,"ЧГ=0");
			   КонецЕсли; 
		   КонецЕсли; 

		   ОбластьСтрока.Параметры.ПолученныйШтрихКод  =  ШтрихКод;

		
		ОбластьСтрока.Параметры.Ном		   = Ном;			 
		//ОбластьСтрока.Параметры.ПартияМССО = Строка.Серия.Партия_МССО;			 
		//ОбластьСтрока.Параметры.Единица    = Строка.Номенклатура.УпаковкаГрузомест;
		ОбластьСтрока.Параметры.Единица    = Строка.Упаковка;
		
		Если НЕ ЗначениеЗаполнено(Строка.Упаковка) Тогда
		  ОбластьСтрока.Параметры.Единица    = Строка.Номенклатура.УпаковкаГрузомест;
		КонецЕсли; 
		
		ОбластьСтрока.Параметры.Количество = Строка.КоличествоУпаковок;
		ОбластьСтрока.Параметры.Цена       = Строка.Цена; 
		
		ПроцентСкидки = "";
		
		Если Строка.ПроцентАвтоматическойСкидки <> 0 Тогда
			ПроцентСкидки = Строка.ПроцентАвтоматическойСкидки;
		ИначеЕсли Строка.ПроцентРучнойСкидки <> 0 Тогда 
			ПроцентСкидки = Строка.ПроцентРучнойСкидки;
		Иначе	
			ПроцентСкидки = 0;
		КонецЕсли; 
		
		Если ПроцентСкидки = 0 Тогда
			ОбластьСтрока.Параметры.ПроцентСкидки = "";
		Иначе
			ОбластьСтрока.Параметры.ПроцентСкидки = ""+ПроцентСкидки+"%"; 
		КонецЕсли; 
		
		
		
		ОбластьСтрока.Параметры.Сумма        = Строка.Сумма;
		
		Попытка
			ОбластьСтрока.Параметры.ЦенаСоСкидкой = Окр(Строка.Сумма/Строка.КоличествоУпаковок,2);
		Исключение
		КонецПопытки; 
		
		
		
		ОбластьСтрока.Параметры.СтавкаНДС    = Строка.СтавкаНДС;
		ОбластьСтрока.Параметры.СуммаНДС     = Строка.СуммаНДС;
		ОбластьСтрока.Параметры.ВсегоРуб     = Строка.СуммаСНДС;
				
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	
	
	ОбластьИтого.Параметры.ИтогСумма     = Объект.Товары.Итог("Сумма");
	ОбластьИтого.Параметры.ИтогСуммаНДС  = Объект.Товары.Итог("СуммаНДС");
	ОбластьИтого.Параметры.ИтогСуммаСНДС = Объект.Товары.Итог("СуммаСНДС");
	
	ТабДок.Вывести(ОбластьИтого);
	
		
	
	ОбластьПодвал  = Макет.ПолучитьОбласть("Подвал");
	

	ФормСтрока = "Л = ru_RU; ДП = Ложь";
	ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копееек,м,2";
	
	СуммаНДСПрописью = ЧислоПрописью(Объект.Товары.Итог("СуммаНДС"), ФормСтрока, ПарПредмета);
	ОбластьПодвал.Параметры.ИтогСуммаНДС_П =  СуммаНДСПрописью;

	ОбластьПодвал.Параметры.ИтогВсего_П =  ЧислоПрописью(Объект.Товары.Итог("СуммаСНДС"), ФормСтрока, ПарПредмета);;
	
	
	ТабДок.Вывести(ОбластьПодвал);
	
	
	
	ОбластьПодвал2  = Макет.ПолучитьОбласть("Подвал2");
	
	
	//Если Объект.Склад.КонтактнаяИнформация.Количество()> 0 Тогда 		
	//	АдресСклада = Объект.Склад.КонтактнаяИнформация[0].Представление;
	//КонецЕсли; 
	//
	//
	//
	//ОбластьПодвал2.Параметры.ТекстПодвал2 =  "Срок действия протокола (счет-фактуры) 5 дней с "+Формат(Объект.Дата,"ДЛФ=D")+" по "+Формат(Объект.Дата+432000,"ДЛФ=D")
	// 									  + ". Получение товара со " +Объект.Склад+ " по адресу "+АдресСклада  +", при наличии : доверенности, паспорта, копии платежного поручения, этого протокола, договора с оригинальными подписями и печатями." ;
		
	
	
	ТабДок.Вывести(ОбластьПодвал2);

	////j
	//ПодготовитьДанныедляОтправкиПоЭлПочте(ТабДок,"СчетМССОСети");

КонецПроцедуры



&НаСервере
Процедура ПечатьСчетСетиОмаНаСервере(ТабДок) Экспорт
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;	
	
	//Макет = ПолучитьМакетНаСервере("СчетМССОСетиОма");
	Макет = ЭтотОбъект.ПолучитьМакет("СчетМССОСетиОма");

	Объект = ЭтотОбъект.Ссылка;
	

	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	
	
	ОбластьШапка.Параметры.ПРОТОКОЛ = "Приложение 3 к договору № "+СокрЛ(Объект.Договор.Наименование);
	ОбластьШапка.Параметры.ДоговорНомер = СокрЛ(Объект.Договор.Номер);
	ОбластьШапка.Параметры.ДоговорДата = Формат(Объект.Договор.Дата,"ДЛФ=D");
	ОбластьШапка.Параметры.АдресПунктаРазгрузки = СокрЛП(Объект.Контрагент.КонтактнаяИнформация[0].Представление);
	
	Если Объект.ВыписанаНакладная <> Документы.РеализацияТоваровУслуг.ПустаяСсылка() Тогда
		 ОбластьШапка.Параметры.НомерНакладной = Объект.ВыписанаНакладная.НомерБСО;
		 ОбластьШапка.Параметры.ДатаНакладной = Формат(Объект.ВыписанаНакладная.Дата,"ДЛФ=D");
	КонецЕсли; 
	
	//ОбластьШапка.Параметры.ЭлАдрес = СокрЛП(Объект.Контрагент.КонтактнаяИнформация[3].АдресЭП);	
	
	Попытка
		ПараметрыСеанса.ВременныйАдресПочты = СокрЛП(Объект.Контрагент.КонтактнаяИнформация[3].АдресЭП);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 	

	
	//ФирмаПеч = "";
	//
	//ОбластьШапка.Параметры.Заполнить(Объект);
	//ФирмаПеч = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), "ПолноеНаименование,,,,,,,");
	//АдресПеч = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",,ЮридическийАдрес,,,,,");
	////ОбластьШапка.Параметры.НаименованиеФирмы = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , Объект.БанковскийСчет), "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	//ОбластьШапка.Параметры.Фирма = ФирмаПеч;
	//ОбластьШапка.Параметры.Адрес  = АдресПеч;
	//ОбластьШапка.Параметры.ИНН = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",ИНН,,,,,,");
	////ОбластьШапка.Параметры.НомерСчета = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",,,,НомерСчета,Банк,БИК,");
	//
	//ОбластьШапка.Параметры.НомерСчета = Объект.БанковскийСчет.НомерСчета;
	//ОбластьШапка.Параметры.Банк = Объект.БанковскийСчет.Банк;
	//ОбластьШапка.Параметры.БанкКод = Объект.БанковскийСчет.Банк.Код;	
	//
	//
	//ОбластьШапка.Параметры.Покупатель = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), "ПолноеНаименование,,,,,,,");
	//
	//ОбластьШапка.Параметры.РасшифровкаКонтрагента = Объект.Контрагент;  /////// 77w qaws  для рассшифровки ячейки
	//
	//ОбластьШапка.Параметры.ПокупательАдрес = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), ",,ЮридическийАдрес,,,,,");
	//ОбластьШапка.Параметры.ПокупательИНН = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата, , ), ",ИНН,,,,,,");
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	БанковскиеСчета.Ссылка КАК Счет,
	//|	БанковскиеСчета.НомерСчета КАК НомерСчета,
	//|	БанковскиеСчета.Банк,
	//|	БанковскиеСчета.Банк.Код
	//|ИЗ
	//|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчета
	//|ГДЕ
	//|	БанковскиеСчета.Владелец = &Владелец";
	//
	//Запрос.УстановитьПараметр("Владелец",Объект.Контрагент);
	//Выборка = Запрос.Выполнить().Выгрузить();
	//
	//Если Выборка.Количество()>0 Тогда
	//	Если ЗначениеЗаполнено(Выборка[0]) Тогда
	//		ОбластьШапка.Параметры.НомерСчетаПокупатель = Выборка[0].НомерСчета;
	//		ОбластьШапка.Параметры.БанкПокупатель = Выборка[0].Банк;
	//		ОбластьШапка.Параметры.БанкКодПокупатель = Выборка[0].БанкКод;	
	//	КонецЕсли;
	//КонецЕсли;

	
	Если ЗначениеЗаполнено(Объект.НомерПоДаннымКлиента) Тогда
		ОбластьШапка.Параметры.НомерПоДаннымКлиента = Объект.НомерПоДаннымКлиента;
		ОбластьШапка.Параметры.ДатаПоДаннымКлиента = Формат(Объект.ДатаПоДаннымКлиента,"ДЛФ=D");
		
	Иначе
		ОбластьШапка.Параметры.НомерПоДаннымКлиента = "";
	КонецЕсли; 
	
	
	
	ТабДок.Вывести(ОбластьШапка);
	
	//ОбластьШапка2  = Макет.ПолучитьОбласть("Шапка2");
	//ТабДок.Вывести(ОбластьШапка2);
	
	
	ОбластьСтрока  = Макет.ПолучитьОбласть("Строка");
	ИтогВес = 0;
	Ном = 0;
	Для каждого Строка Из Объект.Товары Цикл
		
		Если Строка.Отменено Тогда
			Продолжить;
		КонецЕсли; 
		
		
		Ном = Ном+1;
		
		ОбластьСтрока.Параметры.Номенклатура = 
		СокрЛП(Строка.Номенклатура.НаименованиеПолное);
		//+ " "+Строка.Номенклатура.УпаковкаГрузомест+" "+?(Строка.Номенклатура.УпаковкаГрузомест.КоэффициентМССО<>0,""+Строка.Номенклатура.УпаковкаГрузомест.КоэффициентМССО,"")
		//+ ""+Строка.Номенклатура.УпаковкаГрузомест.БазоваяЕдиницаМССО;
		//+ ", "+Строка.Номенклатура.СтранаПроисхождения;
		
		//ОбластьСтрока.Параметры.Примечание = ""+?(ЗначениеЗаполнено(Строка.Серия.СтранаПроисхождения),Строка.Серия.СтранаПроисхождения,Строка.Номенклатура.СтранаПроисхождения);
		
		
		//ПолученныйШтрихКод = Неопределено; 

		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	ШтрихкодыНоменклатуры.Номенклатура,
		//	|	ШтрихкодыНоменклатуры.Штрихкод
		//	|ИЗ
		//	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		//	|ГДЕ
		//	|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура";
		//
		//Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
		//
		//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		//
		//
		//Для каждого СтрокаРез Из РезультатЗапроса Цикл
		//	ОбластьСтрока.Параметры.ПолученныйШтрихКод  =   СтрокаРез.Штрихкод;
		//КонецЦикла; 
		
		
		
			ШК = "";
			Штрихкод = "";
			
            Если ЗначениеЗаполнено(Строка.Номенклатура.Ссылка.ШтрихКодДляОмы) Тогда
                ШК = СокрЛП(Строка.Номенклатура.Ссылка.ШтрихКодДляОмы);
            Иначе	
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
				|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
				|ИЗ
				|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
				|ГДЕ
				|	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
				|	И ШтрихкодыНоменклатуры.ОсновнойШК = ИСТИНА";
				
				Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Штрихкод = ВыборкаДетальныеЗаписи.Штрихкод;
				КонецЦикла;
				
				
				Если ЗначениеЗаполнено(Штрихкод) Тогда
					ШК = Штрихкод;
				КонецЕсли; 
				
			КонецЕсли; 
		
		   ОбластьСтрока.Параметры.ПолученныйШтрихКод  =  ШК;
		   
		   
		ОбластьСтрока.Параметры.КодТовараВERP = СокрЛП(Строка.Номенклатура.КодДляОмы);
		
		ОбластьСтрока.Параметры.Ном		   = Ном;			 
		//ОбластьСтрока.Параметры.ПартияМССО = Строка.Серия.Партия_МССО;			 
		//ОбластьСтрока.Параметры.Единица    = Строка.Номенклатура.УпаковкаГрузомест;
		ОбластьСтрока.Параметры.Единица    = Строка.Упаковка;
		
		Если НЕ ЗначениеЗаполнено(Строка.Упаковка) Тогда
		  ОбластьСтрока.Параметры.Единица    = Строка.Номенклатура.УпаковкаГрузомест;
		КонецЕсли; 
		
		ОбластьСтрока.Параметры.Количество = Строка.КоличествоУпаковок;
		ОбластьСтрока.Параметры.Цена       = Строка.Цена; 
		
		ПроцентСкидки = "";
		
		Если Строка.ПроцентАвтоматическойСкидки <> 0 Тогда
			ПроцентСкидки = Строка.ПроцентАвтоматическойСкидки;
		ИначеЕсли Строка.ПроцентРучнойСкидки <> 0 Тогда 
			ПроцентСкидки = Строка.ПроцентРучнойСкидки;
		Иначе	
			ПроцентСкидки = 0;
		КонецЕсли; 
		
		//Если ПроцентСкидки = 0 Тогда
		//	ОбластьСтрока.Параметры.ПроцентСкидки = "";
		//Иначе
		//	ОбластьСтрока.Параметры.ПроцентСкидки = ""+ПроцентСкидки+"%"; 
		//КонецЕсли; 
		
		
		
		ОбластьСтрока.Параметры.Сумма        = Строка.Сумма;
		
		Попытка
			ОбластьСтрока.Параметры.ЦенаСоСкидкой = Окр(Строка.Сумма/Строка.КоличествоУпаковок,2);
		Исключение
		КонецПопытки; 
		
		
		
		ОбластьСтрока.Параметры.СтавкаНДС    = Строка.СтавкаНДС;
		ОбластьСтрока.Параметры.СуммаНДС     = Строка.СуммаНДС;
		ОбластьСтрока.Параметры.ВсегоРуб     = Строка.СуммаСНДС;
		
		
		ВесСтроки = 0;	
		ВесСтроки = Строка.Упаковка.Вес*Строка.Количество;
		
		Если ВесСтроки = 0  Тогда
			ВесСтроки = Строка.Номенклатура.ЕдиницаИзмерения.Вес*Строка.Количество;
		КонецЕсли; 
		
		Если ВесСтроки = 0  Тогда
			ВесСтроки = Строка.Номенклатура.ВесЧислитель*Строка.Количество;
		КонецЕсли; 	
		
		
		ИтогВес = ИтогВес + ВесСтроки;
		ОбластьСтрока.Параметры.ВесСтроки    = ВесСтроки;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	
	ОбластьИтого  = Макет.ПолучитьОбласть("Итого");
	
	
	ОбластьИтого.Параметры.ИтогСумма     = Объект.Товары.Итог("Сумма");
	ОбластьИтого.Параметры.ИтогСуммаНДС  = Объект.Товары.Итог("СуммаНДС");
	ОбластьИтого.Параметры.ИтогСуммаСНДС = Объект.Товары.Итог("СуммаСНДС");
	ОбластьИтого.Параметры.ИтогВес = ИтогВес;
	
	ТабДок.Вывести(ОбластьИтого);
	
		
	
	ОбластьПодвал  = Макет.ПолучитьОбласть("Подвал");
	

	//ФормСтрока = "Л = ru_RU; ДП = Ложь";
	//ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копееек,м,2";
	//
	//СуммаНДСПрописью = ЧислоПрописью(Объект.Товары.Итог("СуммаНДС"), ФормСтрока, ПарПредмета);
	//ОбластьПодвал.Параметры.ИтогСуммаНДС_П =  СуммаНДСПрописью;

	//ОбластьПодвал.Параметры.ИтогВсего_П =  ЧислоПрописью(Объект.Товары.Итог("СуммаСНДС"), ФормСтрока, ПарПредмета);;
	//
	
	ТабДок.Вывести(ОбластьПодвал);
	
	//ПодготовитьДанныедляОтправкиПоЭлПочте(ТабДок);

	
	//ОбластьПодвал2  = Макет.ПолучитьОбласть("Подвал2");
	
	
	//Если Объект.Склад.КонтактнаяИнформация.Количество()> 0 Тогда 		
	//	АдресСклада = Объект.Склад.КонтактнаяИнформация[0].Представление;
	//КонецЕсли; 
	//
	//
	//
	//ОбластьПодвал2.Параметры.ТекстПодвал2 =  "Срок действия протокола (счет-фактуры) 5 дней с "+Формат(Объект.Дата,"ДЛФ=D")+" по "+Формат(Объект.Дата+432000,"ДЛФ=D")
	// 									  + ". Получение товара со " +Объект.Склад+ " по адресу "+АдресСклада  +", при наличии : доверенности, паспорта, копии платежного поручения, этого протокола, договора с оригинальными подписями и печатями." ;
		
	
	
	//ТабДок.Вывести(ОбластьПодвал2);
	
	//j
		//ПодготовитьДанныедляОтправкиПоЭлПочте(ТабДок,"СчетМССОСетиОма");


КонецПроцедуры



&НаСервере
Процедура ПодготовитьДанныедляОтправкиПоЭлПочте(ТабДок, ВидСчета)  Экспорт
	Объект = ЭтотОбъект.Ссылка;
	Если Объект.Контрагент.Партнер.СогласиеКлиентаНаПолучениеРассылкиЭлДок = ИСТИНА Тогда
		
		ПутьКФайлуЭД     = "";
		ИмяФайла	   = "";
		ПолноеИмяФайла = "";
		
		ПутьКФайлу = "\\192.168.0.111\DATA_EXCHANGE_1C83\E_DOC\";
		ИмяФайла = ""+ВидСчета +" "+Объект.Номер+".xls";
		ПутьКФайлуЭД = ПутьКФайлу+ИмяФайла;
		
		ТабДок.Записать(ПутьКФайлуЭД, ТипФайлаТабличногоДокумента.XLS);
		
		МенеджерЗаписи = РегистрыСведений.РассылкаЭлектронныхДокументовКлиентам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Контрагент = Объект.Контрагент;
		МенеджерЗаписи.Документ = Объект.Ссылка;
		МенеджерЗаписи.ПутьКФайлуЭД = ПутьКФайлуЭД; 
		
		Если ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
		     Если ТИПЗНЧ(Объект.АдресДоставки) <> ТИП("Строка") Тогда
			      Если ЗначениеЗаполнено(Объект.АдресДоставки.ЭлектроннаяПочта) Тогда
				  
				  	  АдресЭлПочты = Объект.АдресДоставки.ЭлектроннаяПочта;
				  
				  КонецЕсли;
			 КонецЕсли;

		КонецЕсли;
		
		//ЗапросЭП = Новый Запрос;
		//ЗапросЭП.Текст = 
		//	"ВЫБРАТЬ
		//	|	ПунктыРазгрузкиПогрузкиКлиентов.ЭлектроннаяПочта КАК ЭлектроннаяПочта
		//	|ИЗ
		//	|	Справочник.ПунктыРазгрузкиПогрузкиКлиентов КАК ПунктыРазгрузкиПогрузкиКлиентов
		//	|ГДЕ
		//	|	ПунктыРазгрузкиПогрузкиКлиентов.ПометкаУдаления = ЛОЖЬ
		//	|	И ПунктыРазгрузкиПогрузкиКлиентов.Владелец = &Владелец
		//	|	И ПунктыРазгрузкиПогрузкиКлиентов.Наименование = &Наименование";
		//
		//ЗапросЭП.УстановитьПараметр("Владелец", Объект.Контрагент.Партнер);
		//ЗапросЭП.УстановитьПараметр("Наименование", Объект.АдресДоставки);
		//
		//РезультатЗапросаЭП = ЗапросЭП.Выполнить();
		//
		//ВыборкаДетальныеЗаписиЭП = РезультатЗапросаЭП.Выбрать();
		//
		//АдресЭлПочты = "";
		//Пока ВыборкаДетальныеЗаписиЭП.Следующий() Цикл
		//	АдресЭлПочты = ВыборкаДетальныеЗаписиЭП.ЭлектроннаяПочта;
		//КонецЦикла;
			
		Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
			МенеджерЗаписи.АдресЭлПочты = СокрЛП(АдресЭлПочты);
		Иначе
			Ном = 0;
			Для каждого Строка Из Объект.Контрагент.Партнер.КонтактнаяИнформация Цикл
				Если Строка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					МенеджерЗаписи.АдресЭлПочты = Строка.Представление;
				КонецЕсли; 
			КонецЦикла;
			
		КонецЕсли; 
		
	    МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;   
   
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСерииПо_FIFO_МССОНаСервере_NEW2022() Экспорт

	ТЧ_Товары = ЭтотОбъект.Товары.Выгрузить();
	ТЧ_Товары.Очистить();
	
//jadmin Заполнение склада в товара
	Ошибка = Ложь;
	Для каждого Товар Из ЭтотОбъект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(Товар.Склад) Тогда
		    Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Ссылка КАК Ссылка,
				|	Номенклатура.Родитель КАК Родитель,
				|	Номенклатура.Родитель.Склад КАК РодительСклад
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Товар.Номенклатура);
			
			РезЗпр = Запрос.Выполнить().Выбрать();
			
			Пока РезЗпр.Следующий() Цикл
				Товар.Склад = РезЗпр.РодительСклад;
			КонецЦикла;
		КонецЕсли;  
		
		Если Товар.Склад = Справочники.Склады.ПустаяСсылка() Тогда
			Сообщить("Для номенклатуры " + Товар.Номенклатура + " не указан Склад");
			Ошибка = Истина;			
		
		КонецЕсли; 
		
	КонецЦикла; 

	Если Ошибка = Истина Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	  /////
	
		
	
	   //Объект.ОтсутвующиеПозиции = "";
	   
	   ТЗ = ЭтотОбъект.Товары.Выгрузить();
	   
	   ТЗ.Свернуть("Номенклатура,Упаковка,ВидЦены,Цена,СтавкаНДС,Склад,СрокПоставки,ВариантОбеспечения,СтатусУказанияСерий,ДатаОтгрузки,Характеристика,ХарактеристикаНабора","КоличествоУпаковок, Количество");
       
       
       СтаршийИндекс = ТЗ.Количество() - 1; 
       
       Индекс = ТЗ.Количество() - 1;          
	   
	   Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
		   
		   Пока Индекс >= 0 Цикл 
			   Если ТЗ[Индекс].Номенклатура.НедоступноДляОпта = Истина Тогда
				   НС_ОтсуствТов = ЭтотОбъект.ОтсутствующиеПозицииНоменклатуры.Добавить();
				   НС_ОтсуствТов.Номенклатура = ТЗ[Индекс].Номенклатура;
				   НС_ОтсуствТов.Упаковка = ТЗ[Индекс].Упаковка;
				   НС_ОтсуствТов.КоличествоПервоначальное = ТЗ[Индекс].КоличествоУпаковок;
				   НС_ОтсуствТов.Причина = "Установлен признак ""Недоступно для ОПТА""";
				   ТЗ.Удалить(Индекс); 
			   КонецЕсли; 
			   Индекс = Индекс - 1; 
		   КонецЦикла;
		   
	   ИначеЕсли ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		   
		   Пока Индекс >= 0 Цикл 
			   Если ТЗ[Индекс].Номенклатура.НедоступноДляРозницы = Истина Тогда
				   НС_ОтсуствТов = ЭтотОбъект.ОтсутствующиеПозицииНоменклатуры.Добавить();
				   НС_ОтсуствТов.Номенклатура = ТЗ[Индекс].Номенклатура;
				   НС_ОтсуствТов.Упаковка = ТЗ[Индекс].Упаковка;
				   НС_ОтсуствТов.КоличествоПервоначальное = ТЗ[Индекс].КоличествоУпаковок;
				   НС_ОтсуствТов.Причина = "Установлен признак ""Недоступно для РОЗНИЦЫ""";
				   ТЗ.Удалить(Индекс); 
			   КонецЕсли; 
			   Индекс = Индекс - 1; 
		   КонецЦикла;
 
	   КонецЕсли;
         
	   
	   ЭтотОбъект.Товары.Очистить();
	   Для каждого СтрокаТЗ Из ТЗ Цикл
	   		
		
	Если (ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(СтрокаТЗ.Номенклатура,ЭтотОбъект.Дата)) И (ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад) Тогда
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРегистров.Серия КАК Серия,
		|	СУММА(ДанныеРегистров.СвободныйОстаток) КАК СвободныйОстаток
		|ПОМЕСТИТЬ ДанныеРегистровДляЗапроса
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыНаСкладахОстатки.Серия КАК Серия,
		//|		ТоварыНаСкладахОстатки.ВНаличииОстаток КАК СвободныйОстаток  
		|		ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.ВРезервеОстаток КАК СвободныйОстаток 
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				Номенклатура = &Номенклатура
		|					И Характеристика = &Характеристика
		|					И (Назначение = &Назначение
		|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыКОтгрузкеОстатки.Серия,
		|		-ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.ВРезервеОстаток
		|	ИЗ
		|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|				,
		|				Номенклатура = &Номенклатура
		|					И Склад = &Склад
		|					И Характеристика = &Характеристика
		|					И (Назначение = &Назначение
		|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|					И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ТоварыКОтгрузкеОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыНаСкладах.Серия,
		|		ВЫБОР
		|			КОГДА ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ТоварыНаСкладах.ВНаличии + ТоварыНаСкладах.КОтгрузке
		|			ИНАЧЕ ТоварыНаСкладах.ВНаличии - ТоварыНаСкладах.КОтгрузке
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|	ГДЕ
		|		ТоварыНаСкладах.Номенклатура = &Номенклатура
		|		И ТоварыНаСкладах.Характеристика = &Характеристика
		|		И (ТоварыНаСкладах.Назначение = &Назначение
		|				ИЛИ ТоварыНаСкладах.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|		И ТоварыНаСкладах.Склад = &Склад
		|		И ТоварыНаСкладах.Регистратор = &Регистратор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РезервыСерий.Серия,
		|		ВЫБОР
		|			КОГДА РезервыСерий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РезервыСерий.КОтгрузке + РезервыСерий.ВРезерве
		|			ИНАЧЕ -РезервыСерий.КОтгрузке - РезервыСерий.ВРезерве
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ТоварыКОтгрузке КАК РезервыСерий
		|	ГДЕ
		|		РезервыСерий.Номенклатура = &Номенклатура
		|		И РезервыСерий.Характеристика = &Характеристика
		|		И (РезервыСерий.Назначение = &Назначение
		|				ИЛИ РезервыСерий.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|		И РезервыСерий.Склад = &Склад
		|		И РезервыСерий.Регистратор = &Регистратор
		|		И РезервыСерий.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ДанныеРегистров
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРегистров.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДвиженияСерийТоваров.Серия КАК Серия
		|ПОМЕСТИТЬ ВсеСерии
		|ИЗ
		|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
		|ГДЕ
		|	ДвиженияСерийТоваров.Номенклатура = &Номенклатура
		|	И ДвиженияСерийТоваров.Характеристика = &Характеристика
		|	И &ВсеСерии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Серия КАК Серия,
		|	СУММА(ВложенныйЗапрос.СвободныйОстаток) КАК СвободныйОстаток
		|ПОМЕСТИТЬ ДанныеРегистров
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДвиженияСерийТоваров.Серия КАК Серия,
		|		0 КАК СвободныйОстаток
		|	ИЗ
		|		ВсеСерии КАК ДвиженияСерийТоваров
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДанныеРегистровДляЗапроса.Серия,
		|		ДанныеРегистровДляЗапроса.СвободныйОстаток
		|	ИЗ
		|		ДанныеРегистровДляЗапроса КАК ДанныеРегистровДляЗапроса) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРегистров.Серия.Номенклатура КАК Номенклатура,
		|	ДанныеРегистров.Серия КАК Серия,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Номер КАК Номер,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ГоденДо КАК ГоденДо,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).НомерКиЗГИСМ КАК НомерКиЗГИСМ,
		|	ДанныеРегистров.СвободныйОстаток КАК Свободно,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Организация <> &Организация КАК Интеркампани,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ДатаПоставки КАК ДатаПоставки, 
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).СрокГодности КАК СрокГодности, 
		|	ДанныеРегистров.Серия.ГоденДо КАК СерияГоденДо,
		|	ДанныеРегистров.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияГоденДо1,
		|	ВЫБОР
		|		КОГДА ДанныеРегистров.Серия.ДатаИзготовления = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДанныеРегистров.Серия.Партия_МССО.ДатаПриемногоАкта
		|		ИНАЧЕ ДанныеРегистров.Серия.ДатаИзготовления
		|	КОНЕЦ КАК ДатаИзготовления,
		|	ЕСТЬNULL(ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	ДанныеРегистров КАК ДанныеРегистров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&ДатаЦен, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
		|		ПО ДанныеРегистров.Серия.Номенклатура = ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура
		|			И ДанныеРегистров.Серия = ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия
		|ГДЕ
		|	(ДанныеРегистров.СвободныйОстаток > 0
		|			ИЛИ &ВсеСерии)
		|	И ДанныеРегистров.Серия.Номенклатура = &Номенклатура
		|	И ДанныеРегистров.Серия.Организация = &Организация
		|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена > 0
		|	И ДанныеРегистров.Серия.НедоступноДляОпта = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Интеркампани,
		|	СрокГодности,
		|	ДатаПоставки,
		|	ГоденДо,
		|	Номер,
		|	НомерКиЗГИСМ";
		
	ИначеЕсли (ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(СтрокаТЗ.Номенклатура,ЭтотОбъект.Дата) = Ложь И ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеРегистров.Серия КАК Серия,
		|	СУММА(ДанныеРегистров.СвободныйОстаток) КАК СвободныйОстаток
		|ПОМЕСТИТЬ ДанныеРегистровДляЗапроса
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыНаСкладахОстатки.Серия КАК Серия,
		//|		ТоварыНаСкладахОстатки.ВНаличииОстаток КАК СвободныйОстаток 
		|		ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.ВРезервеОстаток КАК СвободныйОстаток 
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				Номенклатура = &Номенклатура
		|					И Характеристика = &Характеристика
		|					И (Назначение = &Назначение
		|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыКОтгрузкеОстатки.Серия,
		|		-ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.ВРезервеОстаток
		|	ИЗ
		|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
		|				,
		|				Номенклатура = &Номенклатура
		|					И Склад = &Склад
		|					И Характеристика = &Характеристика
		|					И (Назначение = &Назначение
		|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|					И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ТоварыКОтгрузкеОстатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыНаСкладах.Серия,
		|		ВЫБОР
		|			КОГДА ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ТоварыНаСкладах.ВНаличии + ТоварыНаСкладах.КОтгрузке
		|			ИНАЧЕ ТоварыНаСкладах.ВНаличии - ТоварыНаСкладах.КОтгрузке
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|	ГДЕ
		|		ТоварыНаСкладах.Номенклатура = &Номенклатура
		|		И ТоварыНаСкладах.Характеристика = &Характеристика
		|		И (ТоварыНаСкладах.Назначение = &Назначение
		|				ИЛИ ТоварыНаСкладах.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|		И ТоварыНаСкладах.Склад = &Склад
		|		И ТоварыНаСкладах.Регистратор = &Регистратор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РезервыСерий.Серия,
		|		ВЫБОР
		|			КОГДА РезервыСерий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РезервыСерий.КОтгрузке + РезервыСерий.ВРезерве
		|			ИНАЧЕ -РезервыСерий.КОтгрузке - РезервыСерий.ВРезерве
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ТоварыКОтгрузке КАК РезервыСерий
		|	ГДЕ
		|		РезервыСерий.Номенклатура = &Номенклатура
		|		И РезервыСерий.Характеристика = &Характеристика
		|		И (РезервыСерий.Назначение = &Назначение
		|				ИЛИ РезервыСерий.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
		|		И РезервыСерий.Склад = &Склад
		|		И РезервыСерий.Регистратор = &Регистратор
		|		И РезервыСерий.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ДанныеРегистров
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеРегистров.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДвиженияСерийТоваров.Серия КАК Серия
		|ПОМЕСТИТЬ ВсеСерии
		|ИЗ
		|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
		|ГДЕ
		|	ДвиженияСерийТоваров.Номенклатура = &Номенклатура
		|	И ДвиженияСерийТоваров.Характеристика = &Характеристика
		|	И &ВсеСерии
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Серия КАК Серия,
		|	СУММА(ВложенныйЗапрос.СвободныйОстаток) КАК СвободныйОстаток
		|ПОМЕСТИТЬ ДанныеРегистров
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДвиженияСерийТоваров.Серия КАК Серия,
		|		0 КАК СвободныйОстаток
		|	ИЗ
		|		ВсеСерии КАК ДвиженияСерийТоваров
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДанныеРегистровДляЗапроса.Серия,
		|		ДанныеРегистровДляЗапроса.СвободныйОстаток
		|	ИЗ
		|		ДанныеРегистровДляЗапроса КАК ДанныеРегистровДляЗапроса) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеРегистров.Серия КАК Серия,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Номер КАК Номер,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ГоденДо КАК ГоденДо,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).НомерКиЗГИСМ КАК НомерКиЗГИСМ,
		|	ДанныеРегистров.СвободныйОстаток КАК Свободно,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Организация <> &Организация КАК Интеркампани,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ДатаПоставки КАК ДатаПоставки,
		|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).СрокГодности КАК СрокГодности,
		|	ДанныеРегистров.Серия.ГоденДо КАК СерияГоденДо,
		|	ДанныеРегистров.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияГоденДо1,
		|	ВЫБОР
		|		КОГДА ДанныеРегистров.Серия.ДатаИзготовления = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ДанныеРегистров.Серия.Партия_МССО.ДатаПриемногоАкта
		|		ИНАЧЕ ДанныеРегистров.Серия.ДатаИзготовления
		|	КОНЕЦ КАК ДатаИзготовления,
		|	ДанныеРегистров.Серия.Номенклатура КАК Номенклатура
		|ИЗ
		|	ДанныеРегистров КАК ДанныеРегистров
		|ГДЕ
		|	(ДанныеРегистров.СвободныйОстаток > 0
		|			ИЛИ &ВсеСерии)
		|	И ДанныеРегистров.Серия.Номенклатура = &Номенклатура
		|	И ДанныеРегистров.Серия.Организация = &Организация
		|	И ДанныеРегистров.Серия.НедоступноДляОпта = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Интеркампани,
		|	СрокГодности,
		|	ДатаПоставки,
		|	ГоденДо,
		|	Номер,
		|	НомерКиЗГИСМ";
		
	КонецЕсли; 
	
	
	
	////jadmin 10-01-2023  вернул фифо как было если условие не выполняется
	Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		Если (ЭтотОбъект.Дата >= Дата("20221027") И ЭтотОбъект.Дата < Дата("20230111")) 
			ИЛИ ЭтотОбъект.Дата >= Дата("20230403") Тогда
			
			Если (ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Розничных(СтрокаТЗ.Номенклатура,ЭтотОбъект.Дата) = Истина) И (ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин) Тогда
				
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДанныеРегистров.Серия КАК Серия,
				|	СУММА(ДанныеРегистров.СвободныйОстаток) КАК СвободныйОстаток
				|ПОМЕСТИТЬ ДанныеРегистровДляЗапроса
				|ИЗ
				|	(ВЫБРАТЬ
				|		ТоварыНаСкладахОстатки.Серия КАК Серия,
				//|		ТоварыНаСкладахОстатки.ВНаличииОстаток КАК СвободныйОстаток   
				|		ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.ВРезервеОстаток КАК СвободныйОстаток 
				|	ИЗ
				|		РегистрНакопления.ТоварыНаСкладах.Остатки(
				|				,
				|				Номенклатура = &Номенклатура
				|					И Характеристика = &Характеристика
				|					И (Назначение = &Назначение
				|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
				|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ТоварыКОтгрузкеОстатки.Серия,
				|		-ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.ВРезервеОстаток
				|	ИЗ
				|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
				|				,
				|				Номенклатура = &Номенклатура
				|					И Склад = &Склад
				|					И Характеристика = &Характеристика
				|					И (Назначение = &Назначение
				|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
				|					И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ТоварыКОтгрузкеОстатки
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ТоварыНаСкладах.Серия,
				|		ВЫБОР
				|			КОГДА ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
				|				ТОГДА -ТоварыНаСкладах.ВНаличии + ТоварыНаСкладах.КОтгрузке
				|			ИНАЧЕ ТоварыНаСкладах.ВНаличии - ТоварыНаСкладах.КОтгрузке
				|		КОНЕЦ
				|	ИЗ
				|		РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
				|	ГДЕ
				|		ТоварыНаСкладах.Номенклатура = &Номенклатура
				|		И ТоварыНаСкладах.Характеристика = &Характеристика
				|		И (ТоварыНаСкладах.Назначение = &Назначение
				|				ИЛИ ТоварыНаСкладах.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
				|		И ТоварыНаСкладах.Склад = &Склад
				|		И ТоварыНаСкладах.Регистратор = &Регистратор
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		РезервыСерий.Серия,
				|		ВЫБОР
				|			КОГДА РезервыСерий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
				|				ТОГДА РезервыСерий.КОтгрузке + РезервыСерий.ВРезерве
				|			ИНАЧЕ -РезервыСерий.КОтгрузке - РезервыСерий.ВРезерве
				|		КОНЕЦ
				|	ИЗ
				|		РегистрНакопления.ТоварыКОтгрузке КАК РезервыСерий
				|	ГДЕ
				|		РезервыСерий.Номенклатура = &Номенклатура
				|		И РезервыСерий.Характеристика = &Характеристика
				|		И (РезервыСерий.Назначение = &Назначение
				|				ИЛИ РезервыСерий.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
				|		И РезервыСерий.Склад = &Склад
				|		И РезервыСерий.Регистратор = &Регистратор
				|		И РезервыСерий.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ДанныеРегистров
				|
				|СГРУППИРОВАТЬ ПО
				|	ДанныеРегистров.Серия
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ДвиженияСерийТоваров.Серия КАК Серия
				|ПОМЕСТИТЬ ВсеСерии
				|ИЗ
				|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
				|ГДЕ
				|	ДвиженияСерийТоваров.Номенклатура = &Номенклатура
				|	И ДвиженияСерийТоваров.Характеристика = &Характеристика
				|	И &ВсеСерии
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.Серия КАК Серия,
				|	СУММА(ВложенныйЗапрос.СвободныйОстаток) КАК СвободныйОстаток
				|ПОМЕСТИТЬ ДанныеРегистров
				|ИЗ
				|	(ВЫБРАТЬ
				|		ДвиженияСерийТоваров.Серия КАК Серия,
				|		0 КАК СвободныйОстаток
				|	ИЗ
				|		ВсеСерии КАК ДвиженияСерийТоваров
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ДанныеРегистровДляЗапроса.Серия,
				|		ДанныеРегистровДляЗапроса.СвободныйОстаток
				|	ИЗ
				|		ДанныеРегистровДляЗапроса КАК ДанныеРегистровДляЗапроса) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.Серия
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДанныеРегистров.Серия.Номенклатура КАК Номенклатура,
				|	ДанныеРегистров.Серия КАК Серия,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Номер КАК Номер,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ГоденДо КАК ГоденДо,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).НомерКиЗГИСМ КАК НомерКиЗГИСМ,
				|	ДанныеРегистров.СвободныйОстаток КАК Свободно,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Организация <> &Организация КАК Интеркампани,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ДатаПоставки КАК ДатаПоставки,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).СрокГодности КАК СрокГодности,
				|	ДанныеРегистров.Серия.ГоденДо КАК СерияГоденДо,
				|	ДанныеРегистров.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияГоденДо1,
				|	ВЫБОР
				|		КОГДА ДанныеРегистров.Серия.ДатаИзготовления = ДАТАВРЕМЯ(1, 1, 1)
				|			ТОГДА ДанныеРегистров.Серия.Партия_МССО.ДатаПриемногоАкта
				|		ИНАЧЕ ДанныеРегистров.Серия.ДатаИзготовления
				|	КОНЕЦ КАК ДатаИзготовления,
				|	ЕСТЬNULL(ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена, 0) КАК Цена
				|ИЗ
				|	ДанныеРегистров КАК ДанныеРегистров
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&ДатаЦен, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
				|		ПО ДанныеРегистров.Серия.Номенклатура = ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура
				|			И ДанныеРегистров.Серия = ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия
				|ГДЕ
				|	(ДанныеРегистров.СвободныйОстаток > 0
				|			ИЛИ &ВсеСерии)
				|	И ДанныеРегистров.Серия.Номенклатура = &Номенклатура
				|	И ДанныеРегистров.Серия.Организация = &Организация
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена > 0
				|
				|УПОРЯДОЧИТЬ ПО
				|	Цена УБЫВ,
				|	Интеркампани,
				|	СрокГодности,
				|	ДатаПоставки,
				|	ГоденДо,
				|	Номер,
				|	НомерКиЗГИСМ";
				
			ИначеЕсли  (ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Розничных(СтрокаТЗ.Номенклатура,ЭтотОбъект.Дата) = Ложь) И (ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ДанныеРегистров.Серия КАК Серия,
				|	СУММА(ДанныеРегистров.СвободныйОстаток) КАК СвободныйОстаток
				|ПОМЕСТИТЬ ДанныеРегистровДляЗапроса
				|ИЗ
				|	(ВЫБРАТЬ
				|		ТоварыНаСкладахОстатки.Серия КАК Серия,
				//|		ТоварыНаСкладахОстатки.ВНаличииОстаток КАК СвободныйОстаток  
				|		ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.ВРезервеОстаток КАК СвободныйОстаток 
				|	ИЗ
				|		РегистрНакопления.ТоварыНаСкладах.Остатки(
				|				,
				|				Номенклатура = &Номенклатура
				|					И Характеристика = &Характеристика
				|					И (Назначение = &Назначение
				|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
				|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ТоварыКОтгрузкеОстатки.Серия,
				|		-ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.ВРезервеОстаток
				|	ИЗ
				|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
				|				,
				|				Номенклатура = &Номенклатура
				|					И Склад = &Склад
				|					И Характеристика = &Характеристика
				|					И (Назначение = &Назначение
				|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
				|					И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ТоварыКОтгрузкеОстатки
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ТоварыНаСкладах.Серия,
				|		ВЫБОР
				|			КОГДА ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
				|				ТОГДА -ТоварыНаСкладах.ВНаличии + ТоварыНаСкладах.КОтгрузке
				|			ИНАЧЕ ТоварыНаСкладах.ВНаличии - ТоварыНаСкладах.КОтгрузке
				|		КОНЕЦ
				|	ИЗ
				|		РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
				|	ГДЕ
				|		ТоварыНаСкладах.Номенклатура = &Номенклатура
				|		И ТоварыНаСкладах.Характеристика = &Характеристика
				|		И (ТоварыНаСкладах.Назначение = &Назначение
				|				ИЛИ ТоварыНаСкладах.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
				|		И ТоварыНаСкладах.Склад = &Склад
				|		И ТоварыНаСкладах.Регистратор = &Регистратор
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		РезервыСерий.Серия,
				|		ВЫБОР
				|			КОГДА РезервыСерий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
				|				ТОГДА РезервыСерий.КОтгрузке + РезервыСерий.ВРезерве
				|			ИНАЧЕ -РезервыСерий.КОтгрузке - РезервыСерий.ВРезерве
				|		КОНЕЦ
				|	ИЗ
				|		РегистрНакопления.ТоварыКОтгрузке КАК РезервыСерий
				|	ГДЕ
				|		РезервыСерий.Номенклатура = &Номенклатура
				|		И РезервыСерий.Характеристика = &Характеристика
				|		И (РезервыСерий.Назначение = &Назначение
				|				ИЛИ РезервыСерий.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
				|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
				|		И РезервыСерий.Склад = &Склад
				|		И РезервыСерий.Регистратор = &Регистратор
				|		И РезервыСерий.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ДанныеРегистров
				|
				|СГРУППИРОВАТЬ ПО
				|	ДанныеРегистров.Серия
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ДвиженияСерийТоваров.Серия КАК Серия
				|ПОМЕСТИТЬ ВсеСерии
				|ИЗ
				|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
				|ГДЕ
				|	ДвиженияСерийТоваров.Номенклатура = &Номенклатура
				|	И ДвиженияСерийТоваров.Характеристика = &Характеристика
				|	И &ВсеСерии
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.Серия КАК Серия,
				|	СУММА(ВложенныйЗапрос.СвободныйОстаток) КАК СвободныйОстаток
				|ПОМЕСТИТЬ ДанныеРегистров
				|ИЗ
				|	(ВЫБРАТЬ
				|		ДвиженияСерийТоваров.Серия КАК Серия,
				|		0 КАК СвободныйОстаток
				|	ИЗ
				|		ВсеСерии КАК ДвиженияСерийТоваров
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		ДанныеРегистровДляЗапроса.Серия,
				|		ДанныеРегистровДляЗапроса.СвободныйОстаток
				|	ИЗ
				|		ДанныеРегистровДляЗапроса КАК ДанныеРегистровДляЗапроса) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.Серия
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ДанныеРегистров.Серия КАК Серия,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Номер КАК Номер,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ГоденДо КАК ГоденДо,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).НомерКиЗГИСМ КАК НомерКиЗГИСМ,
				|	ДанныеРегистров.СвободныйОстаток КАК Свободно,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Организация <> &Организация КАК Интеркампани,
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ДатаПоставки КАК ДатаПоставки, 
				|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).СрокГодности КАК СрокГодности, 
				|	ДанныеРегистров.Серия.ГоденДо КАК СерияГоденДо,
				|	ДанныеРегистров.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияГоденДо1,
				|	ВЫБОР
				|		КОГДА ДанныеРегистров.Серия.ДатаИзготовления = ДАТАВРЕМЯ(1, 1, 1)
				|			ТОГДА ДанныеРегистров.Серия.Партия_МССО.ДатаПриемногоАкта
				|		ИНАЧЕ ДанныеРегистров.Серия.ДатаИзготовления
				|	КОНЕЦ КАК ДатаИзготовления,
				|	ДанныеРегистров.Серия.Номенклатура КАК Номенклатура
				|ИЗ
				|	ДанныеРегистров КАК ДанныеРегистров
				|ГДЕ
				|	(ДанныеРегистров.СвободныйОстаток > 0
				|			ИЛИ &ВсеСерии)
				|	И ДанныеРегистров.Серия.Номенклатура = &Номенклатура
				|	И ДанныеРегистров.Серия.Организация = &Организация
				|
				|УПОРЯДОЧИТЬ ПО
				|	Интеркампани, 
				|	СрокГодности,
				|	ДатаПоставки,
				|	ГоденДо,
				|	Номер,
				|	НомерКиЗГИСМ";
				
			КонецЕсли; 
			
			
			
			
		Иначе
			/////////////////////////////////////// БЫЛО  ДО  11-11-2022  \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеРегистров.Серия КАК Серия,
			|	СУММА(ДанныеРегистров.СвободныйОстаток) КАК СвободныйОстаток
			|ПОМЕСТИТЬ ДанныеРегистровДляЗапроса
			|ИЗ
			|	(ВЫБРАТЬ
			|		ТоварыНаСкладахОстатки.Серия КАК Серия,
			//|		ТоварыНаСкладахОстатки.ВНаличииОстаток КАК СвободныйОстаток
			|		ТоварыНаСкладахОстатки.ВНаличииОстаток - ТоварыНаСкладахОстатки.ВРезервеОстаток КАК СвободныйОстаток 
			|	ИЗ
			|		РегистрНакопления.ТоварыНаСкладах.Остатки(
			|				,
			|				Номенклатура = &Номенклатура
			|					И Характеристика = &Характеристика
			|					И (Назначение = &Назначение
			|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
			|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТоварыКОтгрузкеОстатки.Серия,
			|		-ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток - ТоварыКОтгрузкеОстатки.ВРезервеОстаток
			|	ИЗ
			|		РегистрНакопления.ТоварыКОтгрузке.Остатки(
			|				,
			|				Номенклатура = &Номенклатура
			|					И Склад = &Склад
			|					И Характеристика = &Характеристика
			|					И (Назначение = &Назначение
			|						ИЛИ Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|							И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
			|					И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ТоварыКОтгрузкеОстатки
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ТоварыНаСкладах.Серия,
			|		ВЫБОР
			|			КОГДА ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				ТОГДА -ТоварыНаСкладах.ВНаличии + ТоварыНаСкладах.КОтгрузке
			|			ИНАЧЕ ТоварыНаСкладах.ВНаличии - ТоварыНаСкладах.КОтгрузке
			|		КОНЕЦ
			|	ИЗ
			|		РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
			|	ГДЕ
			|		ТоварыНаСкладах.Номенклатура = &Номенклатура
			|		И ТоварыНаСкладах.Характеристика = &Характеристика
			|		И (ТоварыНаСкладах.Назначение = &Назначение
			|				ИЛИ ТоварыНаСкладах.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
			|		И ТоварыНаСкладах.Склад = &Склад
			|		И ТоварыНаСкладах.Регистратор = &Регистратор
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		РезервыСерий.Серия,
			|		ВЫБОР
			|			КОГДА РезервыСерий.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				ТОГДА РезервыСерий.КОтгрузке + РезервыСерий.ВРезерве
			|			ИНАЧЕ -РезервыСерий.КОтгрузке - РезервыСерий.ВРезерве
			|		КОНЕЦ
			|	ИЗ
			|		РегистрНакопления.ТоварыКОтгрузке КАК РезервыСерий
			|	ГДЕ
			|		РезервыСерий.Номенклатура = &Номенклатура
			|		И РезервыСерий.Характеристика = &Характеристика
			|		И (РезервыСерий.Назначение = &Назначение
			|				ИЛИ РезервыСерий.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
			|					И НЕ ВЫРАЗИТЬ(&Назначение КАК Справочник.Назначения).ДвиженияПоСкладскимРегистрам)
			|		И РезервыСерий.Склад = &Склад
			|		И РезервыСерий.Регистратор = &Регистратор
			|		И РезервыСерий.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК ДанныеРегистров
			|
			|СГРУППИРОВАТЬ ПО
			|	ДанныеРегистров.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ДвиженияСерийТоваров.Серия КАК Серия
			|ПОМЕСТИТЬ ВсеСерии
			|ИЗ
			|	РегистрНакопления.ДвиженияСерийТоваров КАК ДвиженияСерийТоваров
			|ГДЕ
			|	ДвиженияСерийТоваров.Номенклатура = &Номенклатура
			|	И ДвиженияСерийТоваров.Характеристика = &Характеристика
			|	И &ВсеСерии
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВложенныйЗапрос.Серия КАК Серия,
			|	СУММА(ВложенныйЗапрос.СвободныйОстаток) КАК СвободныйОстаток
			|ПОМЕСТИТЬ ДанныеРегистров
			|ИЗ
			|	(ВЫБРАТЬ
			|		ДвиженияСерийТоваров.Серия КАК Серия,
			|		0 КАК СвободныйОстаток
			|	ИЗ
			|		ВсеСерии КАК ДвиженияСерийТоваров
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ДанныеРегистровДляЗапроса.Серия,
			|		ДанныеРегистровДляЗапроса.СвободныйОстаток
			|	ИЗ
			|		ДанныеРегистровДляЗапроса КАК ДанныеРегистровДляЗапроса) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Серия
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДанныеРегистров.Серия КАК Серия,
			|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Номер КАК Номер,
			|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ГоденДо КАК ГоденДо,
			|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).НомерКиЗГИСМ КАК НомерКиЗГИСМ,
			|	ДанныеРегистров.СвободныйОстаток КАК Свободно,
			|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).Организация <> &Организация КАК Интеркампани,
			|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).ДатаПоставки КАК ДатаПоставки, 
			|	ВЫРАЗИТЬ(ДанныеРегистров.Серия КАК Справочник.СерииНоменклатуры).СрокГодности КАК СрокГодности, 
			|	ДанныеРегистров.Серия.ГоденДо КАК СерияГоденДо,
			|	ДанныеРегистров.Серия.Партия_МССО.СрокДействияАнализаТекущий КАК СерияГоденДо1,
			|	ВЫБОР
			|		КОГДА ДанныеРегистров.Серия.ДатаИзготовления = ДАТАВРЕМЯ(1, 1, 1)
			|			ТОГДА ДанныеРегистров.Серия.Партия_МССО.ДатаПриемногоАкта
			|		ИНАЧЕ ДанныеРегистров.Серия.ДатаИзготовления
			|	КОНЕЦ КАК ДатаИзготовления,
			|	ДанныеРегистров.Серия.Номенклатура КАК Номенклатура
			|ИЗ
			|	ДанныеРегистров КАК ДанныеРегистров
			|ГДЕ
			|	(ДанныеРегистров.СвободныйОстаток > 0
			|			ИЛИ &ВсеСерии)
			|	И ДанныеРегистров.Серия.Номенклатура = &Номенклатура
			|	И ДанныеРегистров.Серия.Организация = &Организация
			|	И ДанныеРегистров.Серия.НедоступноДляРозницы = ЛОЖЬ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Интеркампани,
			|	СрокГодности,
			|	ДатаПоставки,
			|	ГоденДо,
			|	Номер,
			|	НомерКиЗГИСМ";
			
			
			/////////////////////////////////////// БЫЛО   11-11-2022 (КОНЕЦ) \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
			
			
		КонецЕсли;
		
		
	КонецЕсли; 
	
	
		
	
	Запрос.УстановитьПараметр("ВсеСерии", ЛОЖЬ);
	Запрос.УстановитьПараметр("Назначение", Справочники.Назначения.ПустаяСсылка());
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТЗ.Номенклатура);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация); 
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Склад", СтрокаТЗ.Склад);
	Запрос.УстановитьПараметр("Характеристика", СтрокаТЗ.Характеристика);
	Запрос.УстановитьПараметр("ДатаЦен", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("ВидЦены",СтрокаТЗ.ВидЦены);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
		//
		//Запрос.УстановитьПараметр("Период", КонецДня(Объект.Дата));
		//Запрос.УстановитьПараметр("ДатаДок", КонецДня(Объект.Дата));
		//Запрос.УстановитьПараметр("Склад", СтрокаТЗ.Склад);
		//Запрос.УстановитьПараметр("Номенклатура", СтрокаТЗ.Номенклатура);
		////Запрос.УстановитьПараметр("Серия", Серия);
		//
		
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		
		
		
		Если РезультатЗапроса.Количество() = 0 Тогда
			Сообщить("Нет в наличии: "+ СтрокаТЗ.Номенклатура+" в кол-ве "+СтрокаТЗ.КоличествоУпаковок+" "+СтрокаТЗ.Упаковка);
			ОтсуствТов = ЭтотОбъект.ОтсутствующиеПозицииНоменклатуры.Добавить();
			ОтсуствТов.Номенклатура = СтрокаТЗ.Номенклатура;
			ОтсуствТов.Упаковка = СтрокаТЗ.Упаковка;
			ОтсуствТов.КоличествоПервоначальное = СтрокаТЗ.КоличествоУпаковок;
			ОтсуствТов.Причина = "Нет в наличии";
			//Сообщение = "";
			//Сообщение = "Нет в наличии: "+ СтрокаТЗ.Номенклатура+" в кол-ве "+СтрокаТЗ.КоличествоУпаковок+" "+СтрокаТЗ.Упаковка;
			//Объект.ОтсутвующиеПозиции = Объект.ОтсутвующиеПозиции+Символы.ПС+Сообщение+Символы.ПС;	
		КонецЕсли; 
		
		Для каждого Строка из РезультатЗапроса Цикл
			//Если (Строка.ВРезервеОстаток+Строка.КОтгрузкеОстаток+Строка.КОформлениюОстаток+Строка.КСборкеОстаток+Строка.СобираетсяОстаток+Строка.СобраноОстаток) = 0 Тогда
			
			Если (Строка.ДатаИзготовления = Null) или (Строка.ДатаИзготовления = Дата(1,1,1)) Тогда
				 Строка.ДатаИзготовления = Строка.Серия.ДатаИзготовления;
			КонецЕсли; 
			 
			Если (Строка.ДатаИзготовления = Null) или (Строка.ДатаИзготовления = Дата(1,1,1)) Тогда
				 Строка.ДатаИзготовления = Строка.Серия.Партия_МССО.ДатаПриемногоАкта;
			 КонецЕсли; 
			 

		КонецЦикла;	
		
		//РезультатЗапроса.Сортировать("СерияГоденДо1 Возр");
		//РезультатЗапроса.Сортировать("ДатаИзготовления Возр, СерияГоденДо1 Возр");
		
		Если ЭтотОбъект.Склад = Справочники.Склады.Склад3 Тогда	
			РезультатЗапроса.Сортировать("ДатаИзготовления Возр, СерияГоденДо1 Возр");
		Иначе  
			//РезультатЗапроса.Сортировать("ДатаПоставки Возр");	
			РезультатЗапроса.Сортировать("СрокГодности Возр, ДатаПоставки Возр");
		КонецЕсли;
		
		
////jadmin Округление до упак и наборов
		КолВоВНаборе = ПолучитьКоличествоВНаборе(СтрокаТЗ.Номенклатура);
		Если РезультатЗапроса.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтотОбъект.Склад = Справочники.Склады.Склад5  Тогда
			Если ЭтотОбъект.Соглашение = Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Оптовые",ИСТИНА) Тогда
			
      

				Если РезультатЗапроса.Итог("Свободно") < КолВоВНаборе Тогда        
					
					ОтсуствТов = ЭтотОбъект.ОтсутствующиеПозицииНоменклатуры.Добавить();
                     ОтсуствТов.Номенклатура = СтрокаТЗ.Номенклатура;
				     ОтсуствТов.Упаковка = СтрокаТЗ.Упаковка;
				     ОтсуствТов.КоличествоПервоначальное = СтрокаТЗ.КоличествоУпаковок;
				     ОтсуствТов.Причина = "Остаток меньше набора";
					 СтрокаТЗ.КоличествоУпаковок = РезультатЗапроса.Итог("Свободно");
					//Продолжить;
				//ИначеЕсли РезультатЗапроса.Итог("Свободно") > КолВоВНаборе И РезультатЗапроса.Итог("Свободно") < СтрокаТЗ.КоличествоУпаковок  Тогда
				//	СтрокаТЗ.КоличествоУпаковок  = ЦЕЛ(РезультатЗапроса.Итог("Свободно") / КолВоВНаборе) * КолВоВНаборе;
			Иначе
				//Если РезультатЗапроса.Итог("Свободно") > КолВоВНаборе И СтрокаТЗ.КоличествоУпаковок <> КолВоВНаборе  Тогда
				
					//СтрокаТЗ.КоличествоУпаковок  = ЦЕЛ(Окр(СтрокаТЗ.КоличествоУпаковок / КолВоВНаборе)) * КолВоВНаборе;
					//
					//Если ДробнаяЧасть(СтрокаТЗ.КоличествоУпаковок / КолВоВНаборе)>0 Тогда
					//	СтрокаТЗ.КоличествоУпаковок  = ЦЕЛ((Окр(СтрокаТЗ.КоличествоУпаковок / КолВоВНаборе))+1) * КолВоВНаборе;	
					//КонецЕсли; 
					КолВоИзФайла = 0;
					КолВоИзФайла = СтрокаТЗ.КоличествоУпаковок;
					
					Если СтрокаТЗ.КоличествоУпаковок / КолВоВНаборе < 1 Тогда
					
						СтрокаТЗ.КоличествоУпаковок = КолВоВНаборе;
					Иначе
						СтрокаТЗ.КоличествоУпаковок  = (ЦЕЛ(СтрокаТЗ.КоличествоУпаковок / КолВоВНаборе) + ?(ДробнаяЧасть(СтрокаТЗ.КоличествоУпаковок / КолВоВНаборе)>0,1,0)) * КолВоВНаборе;					
					КонецЕсли;
					

					               
					
					Если КолВоИзФайла <> СтрокаТЗ.КоличествоУпаковок Тогда
					    Если СтрокаТЗ.КоличествоУпаковок = 0 Тогда
						   	ОтсуствТов = ЭтотОбъект.ОтсутствующиеПозицииНоменклатуры.Добавить();
		                     ОтсуствТов.Номенклатура = СтрокаТЗ.Номенклатура;
						     ОтсуствТов.Упаковка = СтрокаТЗ.Упаковка;
						     ОтсуствТов.КоличествоПервоначальное = КолВоИзФайла;
						     ОтсуствТов.Причина = "Заказано меньше набора";

						Иначе	
						   	ОтсуствТов = ЭтотОбъект.ОтсутствующиеПозицииНоменклатуры.Добавить();
		                     ОтсуствТов.Номенклатура = СтрокаТЗ.Номенклатура;
						     ОтсуствТов.Упаковка = СтрокаТЗ.Упаковка;
						     ОтсуствТов.КоличествоПервоначальное = КолВоИзФайла;
						     ОтсуствТов.Причина = "Изменилось количество при округлении";

						КонецЕсли;
	
					
					КонецЕсли;

		
					
				//ИначеЕсли РезультатЗапроса.Итог("Свободно") = КолВоВНаборе Тогда
				//	СтрокаТЗ.КоличествоУпаковок  = КолВоВНаборе;	
			КонецЕсли; 
			
		КонецЕсли;	
	
			
	КонецЕсли;	
/////j

		
		
		КоличествоОсталосьСписать = 0;
		КоличествоОсталосьСписать =  СтрокаТЗ.КоличествоУпаковок;
		
		
		
		
		Для каждого Строка из РезультатЗапроса Цикл
			
			НадоПроверятьСрокАнализа = РегистрыСведений.НоменклатураБезПроверкиСрокаАнализа.ПроверятьСрокАнализа(Строка.Номенклатура);
			Если НадоПроверятьСрокАнализа = ИСТИНА
				
				//((Строка.Номенклатура.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.Семена) И (СтрНайти(Строка.Номенклатура,"Картофель") = 0)) 
				//И НЕ (Строка.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000013")     //Луковичные
				//		ИЛИ Строка.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000013"))
				//		
				//И НЕ (Строка.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000006")     //Розы
				//		ИЛИ Строка.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000006"))
 
				Тогда
				//Если Строка.Номенклатура.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.Семена Тогда
				СекундДоСрока = Константы.СрокКонтроляДействияАнализа.Получить() *60 * 60 * 24;
				ПодошелСрокДатыАнализа = НачалоДня(ЭтотОбъект.Дата+СекундДоСрока);
				
				

				
				
                Попытка
                    Если Строка.СерияГоденДо1 < ПодошелСрокДатыАнализа Тогда
    					Продолжить;
    				КонецЕсли; 
                Исключение
                    //ОписаниеОшибки()
                КонецПопытки; 
				
			КонецЕсли;			
			
			Если Строка.Свободно <= 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			
			Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад 
				И Строка.Номенклатура.ВесКонтроль = ИСТИНА Тогда  //////////лук
				
				ЗапросЛук = Новый Запрос;
				ЗапросЛук.Текст = 
				"ВЫБРАТЬ
				|	ВзвешенныеТоварыОстатки.Склад КАК Склад,
				|	ВзвешенныеТоварыОстатки.Номенклатура КАК Номенклатура,
				|	ВзвешенныеТоварыОстатки.Серия КАК Серия,
				|	ЕСТЬNULL(ВзвешенныеТоварыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
				|	ЕСТЬNULL(ВзвешенныеТоварыОстатки.ВесБруттоОстаток, 0) КАК ВесБруттоОстаток,
				|	ЕСТЬNULL(ВзвешенныеТоварыОстатки.ВРезервеОстаток, 0) КАК ВРезервеОстаток,
				|	ЕСТЬNULL(ВзвешенныеТоварыКоличествоВУпаковкеСрезПоследних.КолВо, 0) КАК КолВоВУпак
				|ИЗ
				|	РегистрНакопления.ВзвешенныеТовары.Остатки КАК ВзвешенныеТоварыОстатки
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВзвешенныеТоварыКоличествоВУпаковке.СрезПоследних(&ОстаткиНаДату, ) КАК ВзвешенныеТоварыКоличествоВУпаковкеСрезПоследних
				|		ПО ВзвешенныеТоварыОстатки.Номенклатура = ВзвешенныеТоварыКоличествоВУпаковкеСрезПоследних.Номенклатура
				|ГДЕ
				|	ВзвешенныеТоварыОстатки.Номенклатура = &Номенклатура
				|	И ВзвешенныеТоварыОстатки.Серия = &Серия
				|	И ЕСТЬNULL(ВзвешенныеТоварыОстатки.КоличествоОстаток, 0) > 0
				|	И ЕСТЬNULL(ВзвешенныеТоварыОстатки.ВесБруттоОстаток, 0) > 0
				|	И ВзвешенныеТоварыОстатки.Склад = &Склад";
				
				ЗапросЛук.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
				ЗапросЛук.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
				ЗапросЛук.УстановитьПараметр("ОстаткиНаДату", ТекущаяДата());
				ЗапросЛук.УстановитьПараметр("Серия", Строка.Серия);
				
				РезультатЗапросаЛук = ЗапросЛук.Выполнить();
				
				ВыборкаДетальныеЗаписиЛук = РезультатЗапросаЛук.Выбрать();
				ТребуетсяВУпак = 0;
				Если ВыборкаДетальныеЗаписиЛук.Количество()>0 Тогда
					Пока ВыборкаДетальныеЗаписиЛук.Следующий() Цикл
						КоличествоОсталосьСписать = Окр(КоличествоОсталосьСписать / ВыборкаДетальныеЗаписиЛук.КолВоВУпак,0) * ВыборкаДетальныеЗаписиЛук.КолВоВУпак;
						ТребуетсяВУпак = Окр(КоличествоОсталосьСписать / ВыборкаДетальныеЗаписиЛук.КолВоВУпак,0);
						
						Если ТребуетсяВУпак > 0 Тогда
							Строка.Свободно = ((ВыборкаДетальныеЗаписиЛук.КоличествоОстаток - ВыборкаДетальныеЗаписиЛук.ВРезервеОстаток) * ВыборкаДетальныеЗаписиЛук.КолВоВУпак);
						Иначе
							Строка.Свободно = 0;
						КонецЕсли; 
						
						
					КонецЦикла; 
				Иначе
					Строка.Свободно = 0;
				КонецЕсли;
				
				Если ТребуетсяВУпак = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Если Строка.Свободно <= 0 Тогда
					Сообщить("Не хватает сеток товара: требуется "+ ТребуетсяВУпак + ", свободно - "+Строка.Свободно+" (Остаток:"+ВыборкаДетальныеЗаписиЛук.КоличествоОстаток+", в резерве:"+ВыборкаДетальныеЗаписиЛук.ВРезервеОстаток+")");			
					
					ОтсуствТов = ЭтотОбъект.ОтсутствующиеПозицииНоменклатуры.Добавить();
					ОтсуствТов.Номенклатура = Строка.Номенклатура;
					Попытка
						ОтсуствТов.Упаковка = Строка.Упаковка;
					Исключение
						//ОписаниеОшибки()
					КонецПопытки;
					ОтсуствТов.КоличествоПервоначальное = КоличествоОсталосьСписать;
					ОтсуствТов.Причина = "Не хватает сеток";
					
					Продолжить; //jadmin 2026-02-15
					
					
				КонецЕсли;
				
				
			КонецЕсли; 
			
			Если Строка.Свободно = 0 Тогда	//jadmin 2026-02-15		
				Продолжить;				
			КонецЕсли;
			
			
			Если КоличествоОсталосьСписать = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			
			//СтрокаТабличнойЧасти = Объект.Товары.Добавить();
			СтрокаТабличнойЧасти = ТЧ_Товары.Добавить();
			//СтрокаТабличнойЧасти = Объект.Товары.Получить(Индекс);
			//СтрокаТабличнойЧасти.СтатусУказанияСерий = 14;
			
			//ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Строка);
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Строка);
						
			СтрокаТабличнойЧасти.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
			
			Списываем = 0;
			
			Если КоличествоОсталосьСписать >= Строка.Свободно Тогда
				Списываем = Строка.Свободно;
			Иначе
				Списываем = КоличествоОсталосьСписать;
			КонецЕсли; 
			
			
			
			Коэффициент = 1;
			Попытка
				//Коэффициент = ПолучитьУпаковкуНаСервере(СтрокаТЗ.Номенклатура,СтрокаТЗ.Номенклатура.ЕдиницаИзмерения);
				Коэффициент = ПолучитьУпаковкуНаСервере(СтрокаТЗ.Номенклатура,СтрокаТЗ.Упаковка);
			Исключение
			    //ОписаниеОшибки()
			КонецПопытки; 
			
			
			
			СтрокаТабличнойЧасти.КратностьУпаковки = КолВоВНаборе;
			
			СтрокаТабличнойЧасти.КоличествоУпаковок = Списываем;
			СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.КоличествоУпаковок*Коэффициент;
			
			СтрокаТабличнойЧасти.Номенклатура = СтрокаТЗ.Номенклатура;
			СтрокаТабличнойЧасти.Серия = Строка.Серия;
			СтрокаТабличнойЧасти.СтатусУказанияСерий = 14;
			
			
			СтрокаТабличнойЧасти.ВидЦены  = СтрокаТЗ.ВидЦены;
			СтрокаТабличнойЧасти.Цена  = СтрокаТЗ.Цена;
			СтрокаТабличнойЧасти.СтавкаНДС  = СтрокаТЗ.СтавкаНДС;
			СтрокаТабличнойЧасти.Склад  = СтрокаТЗ.Склад;
			СтрокаТабличнойЧасти.ДатаОтгрузки  = СтрокаТЗ.ДатаОтгрузки;
			СтрокаТабличнойЧасти.ВариантОбеспечения  = СтрокаТЗ.ВариантОбеспечения;
			СтрокаТабличнойЧасти.Характеристика  = СтрокаТЗ.Характеристика;
			//СтрокаТабличнойЧасти.ВариантОформленияПродажи  = СтрокаТЗ.ВариантОформленияПродажи;
			
			
			
			  ///jadmin регулирование цен опт
			  
			  Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад 
				  И ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(СтрокаТабличнойЧасти.Номенклатура,ЭтотОбъект.Дата) = Истина Тогда
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Период КАК Период,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Регистратор КАК Регистратор,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура КАК Номенклатура,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия КАК Серия,
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена КАК Цена
				|ИЗ
				|	РегистрСведений.ЦеныНоменклатурыПоСериям_МССО.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыПоСериям_МССОСрезПоследних
				|ГДЕ
				|	ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Номенклатура = &Номенклатура
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Серия = &Серия
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.Цена <> 0
				|	И ЦеныНоменклатурыПоСериям_МССОСрезПоследних.ВидЦены = &ВидЦены";
				
				Запрос.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
				Запрос.УстановитьПараметр("Серия", СтрокаТабличнойЧасти.Серия);
				Запрос.УстановитьПараметр("ВидЦены", СтрокаТабличнойЧасти.ВидЦены);
				Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если РезультатЗапроса.Пустой() Тогда
					СтрокаТабличнойЧасти.Цена = 0;
				КонецЕсли; 
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					СтрокаТабличнойЧасти.Цена = ВыборкаДетальныеЗаписи.Цена;
				КонецЦикла;
			КонецЕсли; 
						
				
			
			
			//НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);

			
			//СтрокаТабличнойЧасти.Упаковка = ПолучитьУпаковкуНаСервере1(СтрокаТЗ.Номенклатура,СтрокаТЗ.Упаковка);
			
			
			КоличествоОсталосьСписать = КоличествоОсталосьСписать - Списываем;
			
		КонецЦикла;
		
		Если КоличествоОсталосьСписать > 0 Тогда
			Сообщить("Недостаточно: "+ СтрокаТЗ.Номенклатура+" в кол-ве "+КоличествоОсталосьСписать+" "+СтрокаТЗ.Номенклатура.ЕдиницаИзмерения+" от первоначального кол-ва в  "+СтрокаТЗ.КоличествоУпаковок+" "+СтрокаТЗ.Номенклатура.ЕдиницаИзмерения);
			
			Сообщение = "";
			Сообщение = "Недостаточно: "+ СтрокаТЗ.Номенклатура+" в кол-ве "+КоличествоОсталосьСписать+" "+СтрокаТЗ.Номенклатура.ЕдиницаИзмерения+" от первоначального кол-ва в  "+СтрокаТЗ.КоличествоУпаковок+" "+СтрокаТЗ.Номенклатура.ЕдиницаИзмерения;
			//Объект.ОтсутвующиеПозиции = ЭтотОбъект.ОтсутвующиеПозиции+Символы.ПС+Сообщение+Символы.ПС;	
			ЭтотОбъект.ОтсутвующиеПозиции = ЭтотОбъект.ОтсутвующиеПозиции+Символы.ПС+Сообщение+" ";	
			СтрокаОП = ЭтотОбъект.ОтсутствующиеПозицииНоменклатуры.Добавить();
			СтрокаОП.Номенклатура = СтрокаТЗ.Номенклатура;
			СтрокаОП.Упаковка = СтрокаТЗ.Номенклатура.ЕдиницаИзмерения;
			СтрокаОП.КоличествоПервоначальное = СтрокаТЗ.КоличествоУпаковок;
			
			СтрокаОП.КоличествоВНаличии = СтрокаТЗ.КоличествоУпаковок - КоличествоОсталосьСписать;
			
			Если СтрокаТЗ.КоличествоУпаковок - КоличествоОсталосьСписать = 0 Тогда
				СтрокаОП.Причина = "Отсутствует на складе";
			Иначе
				СтрокаОП.Причина = "Недостаточно на складе";
			КонецЕсли; 
			
		КонецЕсли; 
		
		
	КонецЦикла;
	
	ТаблицаТовары = ТЧ_Товары.Скопировать();
	
	ТЧ_Товары = Неопределено;
	ОбщийМодуль77w.ПроверитьЗаказКлиента(ЭтотОбъект.Ссылка,ТаблицаТовары,ЛОЖЬ,"Пересчет", ТЧ_Товары);  
		
	Если ТЧ_Товары <> Неопределено Тогда	
		ЭтотОбъект.Товары.Загрузить(ТЧ_Товары);
	КонецЕсли;
	
КонецПроцедуры
 



Функция ПолучитьКоличествоВНаборе(Номенклатура) Экспорт
	КолВоВНаборе = 1;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
		|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
		|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения
		|	И УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("Н-р для опта",ИСТИНА));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолВоВНаборе = ВыборкаДетальныеЗаписи.Числитель;
	КонецЦикла;   
	
	Если РезультатЗапроса.Пустой() Тогда
	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
			|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	УпаковкиЕдиницыИзмерения.Числитель КАК Числитель
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
			|ГДЕ
			|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
			|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения = &ЕдиницаИзмерения
			|	И УпаковкиЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Владелец", Номенклатура);
		Запрос.УстановитьПараметр("ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("упак",ИСТИНА));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КолВоВНаборе = ВыборкаДетальныеЗаписи.Числитель;
		КонецЦикла; 
   		
	КонецЕсли;

	
	Возврат КолВоВНаборе;
КонецФункции



Функция ПолучитьУпаковкуНаСервере(Номенклатура,Упаковка)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПРЕДСТАВЛЕНИЕ(СпрНоменклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмеренияПредставление,
	|	ЕСТЬNULL(СпрУпаковки.Ссылка, НЕОПРЕДЕЛЕНО) КАК Упаковка,
	|	ПРЕДСТАВЛЕНИЕ(СпрУпаковки.Ссылка) КАК УпаковкаПредставление,
	|	ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО) КАК ЕдиницаИзмеренияУпаковки,
	|	ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения.Представление, """") КАК ЕдиницаИзмеренияУпаковкиПредставление
	//|	ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 0) КАК Коэффициент
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК СпрУпаковки
	|		ПО (СпрУпаковки.Владелец = ВЫБОР
	|				КОГДА СпрНоменклатура.НаборУпаковок = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ИндивидуальныйДляНоменклатуры)
	|					ТОГДА СпрНоменклатура.Ссылка
	|				КОГДА СпрНоменклатура.НаборУпаковок <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.ПустаяСсылка)
	|					ТОГДА СпрНоменклатура.НаборУпаковок
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|			И (НЕ СпрУпаковки.ПометкаУдаления)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	| И СпрУпаковки.Ссылка = &Упаковка
	//|	И ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 0) = 1
	//|	И ЕСТЬNULL(СпрУпаковки.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО) = СпрНоменклатура.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	//|	Коэффициент,
	|	ЕдиницаИзмеренияУпаковкиПредставление";
	
	//Запрос.Текст = СтрЗаменить(Запрос.Текст,
	//	"&ТекстЗапросаКоэффициентУпаковки",
	//	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	//	"СпрУпаковки", Неопределено));
		
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Упаковка", Упаковка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Коэффициент = 1;
	Если Выборка.Следующий() Тогда
		Коэффициент = Выборка.Упаковка.Числитель;
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции



