#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает статус для объекта документа
//
// Параметры:
//	НовыйСтатус - Строка - Имя статуса, который будет установлен у заказов
//	ДополнительныеПараметры - Структура - Структура дополнительных параметров установки статуса
//
// Возвращаемое значение:
//	Булево - Истина, в случае успешной установки нового статуса
//
Функция УстановитьСтатус(НовыйСтатус, ДополнительныеПараметры) Экспорт
	
	ДатаПерехода = Дата('00010101');
	Если ДополнительныеПараметры <> Неопределено Тогда
		ДополнительныеПараметры.Свойство("НоваяДата", ДатаПерехода);
	КонецЕсли;
	
	ТекущийСтатус = Статус;
	
	Статус = Перечисления.СтатусыРеализацийТоваровУслуг[НовыйСтатус];
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РеализацияТоваровУслуг);
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	Отказ = Ложь;
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,ПараметрыУказанияСерий,Отказ,,Ложь);
	
	Если Отказ Тогда
		ТекстСообщения = НСтр("ru = 'Статус ""%Статус%"" не установлен - есть товары, по которым нужно указать серии.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%Статус%",Статус); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
		Статус = ТекущийСтатус;
	Иначе
		// Установка даты перехода права собственности
		Если ЗначениеЗаполнено(ДатаПерехода) Тогда
			
			Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда
				ДатаПереходаПраваСобственности = ДатаПерехода;
			КонецЕсли;
			
			Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
				
				РеквизитыСоглашения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Соглашение,
					"СрокВозвратаМногооборотнойТары, РассчитыватьДатуВозвратаТарыПоКалендарю, КалендарьВозвратаТары");
					
				ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
					ЭтотОбъект,
					РеквизитыСоглашения.СрокВозвратаМногооборотнойТары,
					РеквизитыСоглашения.РассчитыватьДатуВозвратаТарыПоКалендарю,
					РеквизитыСоглашения.КалендарьВозвратаТары);
					
				УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина, Истина);
			Иначе
				УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(
					Партнер,
					Новый Структура("ИсключитьГруппыСкладовДоступныеВЗаказах, ВыбранноеСоглашение, ХозяйственнаяОперация", 
						Истина, 
						Соглашение, 
						ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту")));
			КонецЕсли;
			
			ДатаПлатежаКредит = ?(ЗначениеЗаполнено(ДатаПлатежа), ДатаПлатежа, ТекущаяДатаСеанса());
			РазницаДат = ДатаПереходаПраваСобственности - ДатаПлатежаКредит;
			
			ДатаПлатежа = ПродажиСервер.ПолучитьПоследнююДатуПоГрафику(
				ДатаПереходаПраваСобственности, УсловияПродаж.ГрафикОплаты, УсловияПродаж.Соглашение);
				
			Если НЕ ЗначениеЗаполнено(ДатаПлатежа) Тогда
				ДатаПлатежа = ДатаПлатежаКредит + РазницаДат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РеализацияТоваровУслуг);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);
	
	Возврат Не Отказ;
	
КонецФункции

// Функция формирует временные данных документа
//
// Возвращаемое значение:
//	МенеджерВременныхТаблиц - менеджер временных таблиц
//
Функция ВременныеТаблицыДанныхДокумента() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	&Дата КАК Дата,
	|	&Организация КАК Организация,
	|	Неопределено КАК Партнер,
	|	Неопределено КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка) КАК Соглашение,
	|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК Договор,
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК Валюта,
	|	&НалогообложениеНДС КАК НалогообложениеНДС,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Ложь КАК ЕстьСделкиВТабличнойЧасти,
	|
	|	ВЫБОР КОГДА СтруктураПредприятия.ВариантОбособленногоУчетаТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоПодразделению)
	|		И &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|	ТОГДА
	|		&Подразделение
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|
	|	ВЫБОР КОГДА СтруктураПредприятия.ВариантОбособленногоУчетаТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоМенеджерамПодразделения)
	|		И &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|	ТОГДА
	|		&Менеджер
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	КОНЕЦ КАК Менеджер,
	|
	|	ВЫБОР КОГДА СделкиСКлиентами.ОбособленныйУчетТоваровПоСделке
	|		И &ФормироватьВидыЗапасовПоСделкам
	|	ТОГДА
	|		&Сделка
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|	КОНЕЦ КАК Сделка
	|	
	|ПОМЕСТИТЬ ТаблицаДанныхДокумента
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.СтруктураПредприятия КАК СтруктураПредприятия
	|	ПО
	|		СтруктураПредприятия.Ссылка = &Подразделение
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.СделкиСКлиентами КАК СделкиСКлиентами
	|	ПО
	|		СделкиСКлиентами.Ссылка = &Сделка
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Назначение КАК Назначение,
	|	
	|	ВЫБОР
	|		КОГДА ТаблицаТоваров.СтатусУказанияСерий = 14
	|			ТОГДА ТаблицаТоваров.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.Склад КАК Склад,
	|	ТаблицаТоваров.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ТаблицаТоваров.Цена КАК Цена,
	|	ТаблицаТоваров.Сумма + (ТаблицаТоваров.СуммаНДС * &ЦенаВключаетНДС) КАК СуммаСНДС,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаТоваров.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТаблицаТоваров.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	0 КАК СуммаВознаграждения,
	|	0 КАК СуммаНДСВознаграждения,
	|	&Сделка КАК Сделка,
	|	ТаблицаТоваров.ЗаказКлиента КАК Заказ,
	|	ТаблицаТоваров.КодСтроки КАК КодСтроки
	|	
	|ПОМЕСТИТЬ ВтТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТоварыЗаказа.Ссылка.Назначение КАК Назначение
	|	
	|ПОМЕСТИТЬ ВтТоварыПодЗаказ
	|ИЗ
	|	ВтТаблицаТоваров КАК ТаблицаТоваров
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаказКлиента.Товары КАК ТоварыЗаказа
	|	ПО
	|		ТаблицаТоваров.Заказ = ТоварыЗаказа.Ссылка
	|		И ТаблицаТоваров.КодСтроки = ТоварыЗаказа.КодСтроки
	|		И ТаблицаТоваров.Номенклатура = ТоварыЗаказа.Номенклатура
	|		И ТаблицаТоваров.Характеристика = ТоварыЗаказа.Характеристика
	|ГДЕ
	|	&РеализацияПоЗаказам
	|	И ТаблицаТоваров.Заказ <> Неопределено
	|	И ТоварыЗаказа.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТоварыЗаказа.Ссылка.Назначение КАК Назначение
	|ИЗ
	|	ВтТаблицаТоваров КАК ТаблицаТоваров
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЗаменяющиеТовары КАК ТоварыЗаказа
	|	ПО
	|		ТаблицаТоваров.Заказ = ТоварыЗаказа.Ссылка
	|		И ТаблицаТоваров.КодСтроки = ТоварыЗаказа.КодСтроки
	|		И ТаблицаТоваров.Номенклатура = ТоварыЗаказа.Номенклатура
	|		И ТаблицаТоваров.Характеристика = ТоварыЗаказа.Характеристика
	|ГДЕ
	|	&РеализацияПоЗаказам
	|	И ТаблицаТоваров.Заказ <> Неопределено
	|	И ТоварыЗаказа.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НомерСтроки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.Серия КАК Серия,
	|	ЕСТЬNULL(Аналитика.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)) КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	ТаблицаТоваров.Склад КАК Склад,
	|	ТаблицаТоваров.Заказ КАК ЗаказКлиента,
	|	ТаблицаТоваров.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.Упаковка КАК Упаковка,
	|	ТаблицаТоваров.Цена КАК Цена,
	|	ТаблицаТоваров.СуммаСНДС КАК СуммаСНДС,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаТоваров.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТаблицаТоваров.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	0 КАК СуммаВознаграждения,
	|	0 КАК СуммаНДСВознаграждения,
	|	&Сделка КАК Сделка,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	ИСТИНА КАК ПодбиратьВидыЗапасов
	|	
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	ВтТаблицаТоваров КАК ТаблицаТоваров
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтТоварыПодЗаказ КАК ТоварыПодЗаказ
	|	ПО
	|		ТаблицаТоваров.НомерСтроки = ТоварыПодЗаказ.НомерСтроки
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.Номенклатура КАК СправочникНоменклатура
	|	ПО
	|		ТаблицаТоваров.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Аналитика.Номенклатура = ТаблицаТоваров.Номенклатура
	|		И Аналитика.Характеристика = ТаблицаТоваров.Характеристика
	|		И Аналитика.Назначение = ТаблицаТоваров.Назначение
	|		И Аналитика.Серия = ТаблицаТоваров.Серия
	|		И Аналитика.Склад = ТаблицаТоваров.Склад
	|ГДЕ
	|	СправочникНоменклатура.ТипНоменклатуры В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВидыЗапасов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ТаблицаВидыЗапасов.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ТаблицаВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТаблицаВидыЗапасов.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаВидыЗапасов.Упаковка КАК Упаковка,
	|	ТаблицаВидыЗапасов.Цена КАК Цена,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладОтгрузки,
	|	ТаблицаВидыЗапасов.ЗаказКлиента КАК ЗаказКлиента,
	|	ТаблицаВидыЗапасов.Количество КАК Количество,
	|	ТаблицаВидыЗапасов.СуммаСНДС КАК СуммаСНДС,
	|	ТаблицаВидыЗапасов.СуммаНДС КАК СуммаНДС,
	|	ТаблицаВидыЗапасов.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаВидыЗапасов.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТаблицаВидыЗапасов.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки
	|
	|ПОМЕСТИТЬ ВТВидыЗапасов
	|ИЗ
	|	&ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаВидыЗапасов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	ТаблицаВидыЗапасов.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ТаблицаВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТаблицаВидыЗапасов.КодТНВЭД КАК КодТНВЭД,
	|	ТаблицаВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаВидыЗапасов.Упаковка КАК Упаковка,
	|	ТаблицаВидыЗапасов.Цена КАК Цена,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладОтгрузки,
	|	Аналитика.Склад КАК Склад,
	|	ТаблицаВидыЗапасов.ЗаказКлиента КАК ЗаказКлиента,
	|	&Сделка КАК Сделка,
	|	ТаблицаВидыЗапасов.Количество КАК Количество,
	|	ТаблицаВидыЗапасов.СуммаСНДС КАК СуммаСНДС,
	|	ТаблицаВидыЗапасов.СуммаНДС КАК СуммаНДС,
	|	ТаблицаВидыЗапасов.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаВидыЗапасов.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|	ТаблицаВидыЗапасов.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки,
	|	&ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную
	|	
	|ПОМЕСТИТЬ ТаблицаВидыЗапасов
	|ИЗ
	|	ВТВидыЗапасов КАК ТаблицаВидыЗапасов
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|	ПО
	|		ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Склад
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТВидыЗапасов
	|");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Менеджер", Менеджер);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("НалогообложениеНДС", НалогообложениеНДС);
	Запрос.УстановитьПараметр("ЦенаВключаетНДС", ?(ЦенаВключаетНДС, 0, 1));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("РеализацияПоЗаказам", РеализацияПоЗаказам);
	Запрос.УстановитьПараметр("ВидыЗапасовУказаныВручную", ВидыЗапасовУказаныВручную);
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоПодразделениямМенеджерам", ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоПодразделениямМенеджерам"));
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоСделкам", ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоСделкам"));
	Запрос.УстановитьПараметр("РеализацияПоНесколькимЗаказам", РеализацияПоЗаказам И Не ЗначениеЗаполнено(ЗаказКлиента));
	Запрос.УстановитьПараметр("ТаблицаТоваров", ЗапасыСервер.ТаблицаДополненнаяОбязательнымиКолонками(Товары.Выгрузить()));
	Запрос.УстановитьПараметр("ТаблицаВидыЗапасов", ЗапасыСервер.ТаблицаДополненнаяОбязательнымиКолонками(ВидыЗапасов.Выгрузить()));
	
	Запрос.Выполнить();
	
	Если ВидыЗапасовУказаныВручную Тогда
		ДополнительныеСвойства.Вставить("ИгнорироватьОперативныеОстатки", Истина);
	КонецЕсли;
	
	Возврат МенеджерВременныхТаблиц;
	
КонецФункции

// Заполняет условия продаж в реализации товаров и услуг
//
// Параметры:
//	УсловияПродаж - Структура - Структура для заполнения
//
Процедура ЗаполнитьУсловияПродаж(Знач УсловияПродаж) Экспорт
	
	Если УсловияПродаж = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Валюта = УсловияПродаж.Валюта;
	ВалютаВзаиморасчетов = УсловияПродаж.ВалютаВзаиморасчетов;
	
	ХозяйственнаяОперация = УсловияПродаж.ХозяйственнаяОперация;
	ЦенаВключаетНДС       = УсловияПродаж.ЦенаВключаетНДС;
	НалогообложениеНДС    = УсловияПродаж.НалогообложениеНДС;
	
	ИзмененаОрганизация = ЗначениеЗаполнено(УсловияПродаж.Организация) И УсловияПродаж.Организация <> Организация;
	ИзмененаФормаОплаты = ЗначениеЗаполнено(УсловияПродаж.ФормаОплаты) И УсловияПродаж.ФормаОплаты <> ФормаОплаты;
	
	ФормаОплаты = УсловияПродаж.ФормаОплаты;
	
	НаправлениеДеятельности = УсловияПродаж.НаправлениеДеятельности;
	
	Если ИзмененаОрганизация Тогда
		Организация = УсловияПродаж.Организация;
	КонецЕсли;
	
	Если ИзмененаОрганизация Или ИзмененаФормаОплаты Тогда
		
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация    			= Организация;
		СтруктураПараметров.НаправлениеДеятельности	= НаправлениеДеятельности;
		БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);  
		
		СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
		СтруктураПараметров.Организация    			= Организация;
		СтруктураПараметров.НаправлениеДеятельности	= НаправлениеДеятельности;
		СтруктураПараметров.ФормаОплаты				= ФормаОплаты;
		Касса = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);

	КонецЕсли;
	
	Если Не УсловияПродаж.Типовое Тогда
		Если ЗначениеЗаполнено(УсловияПродаж.Контрагент) И УсловияПродаж.Контрагент<>Контрагент Тогда
			Контрагент = УсловияПродаж.Контрагент;
		КонецЕсли;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
	
	Если Не УсловияПродаж.Типовое Тогда
		Если ЗначениеЗаполнено(УсловияПродаж.КонтактноеЛицо) 
			И НЕ ЗначениеЗаполнено(КонтактноеЛицо) Тогда
			КонтактноеЛицо = УсловияПродаж.КонтактноеЛицо;
		КонецЕсли;
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Партнер, КонтактноеЛицо);
	
	Если УсловияПродаж.ИспользуютсяДоговорыКонтрагентов <> Неопределено И УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда
		
		Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(
			ЭтотОбъект,
			?(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет,
				Перечисления.ХозяйственныеОперации.РеализацияКлиенту,
				ХозяйственнаяОперация
			),
			ВалютаВзаиморасчетов);
		ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчетОрганизации, БанковскийСчетКонтрагента);
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности") Тогда
			НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(НаправлениеДеятельности, Соглашение, Договор);
		КонецЕсли;

	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(УсловияПродаж.ИспользуютсяДоговорыКонтрагентов) 
		ИЛИ НЕ УсловияПродаж.ИспользуютсяДоговорыКонтрагентов Тогда
		ПорядокОплаты = УсловияПродаж.ПорядокОплаты;
	Иначе
		ПорядокОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ПорядокОплаты");
	КонецЕсли;
	
	ЭтапыОплатыСервер.ЗаполнитьДатуПлатежаПоУмолчанию(ЭтотОбъект, УсловияПродаж.ГрафикОплаты, Истина);
	
	ВернутьМногооборотнуюТару = УсловияПродаж.ВозвращатьМногооборотнуюТару;
	ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
		ЭтотОбъект,
		УсловияПродаж.СрокВозвратаМногооборотнойТары,
		УсловияПродаж.РассчитыватьДатуВозвратаТарыПоКалендарю,
		УсловияПродаж.КалендарьВозвратаТары);
	ТребуетсяЗалогЗаТару = УсловияПродаж.ТребуетсяЗалогЗаТару;
	
	Если ЗначениеЗаполнено(УсловияПродаж.Склад) Тогда
		Склад = УсловияПродаж.Склад;
		СтруктураОтветственного = ПродажиСервер.ПолучитьОтветственногоПоСкладу(Склад, Менеджер);
		Если СтруктураОтветственного <> Неопределено Тогда
			Отпустил = СтруктураОтветственного.Ответственный;
			ОтпустилДолжность = СтруктураОтветственного.ОтветственныйДолжность;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловияПродаж.ГруппаФинансовогоУчета) Тогда
		ГруппаФинансовогоУчета = УсловияПродаж.ГруппаФинансовогоУчета;
	КонецЕсли;
	
	СкидкиНаценки.Очистить();
	
	РаботаСКурсамиВалютУТ.ЗаполнитьКурсКратностьПоУмолчанию(Курс, Кратность, Валюта, ВалютаВзаиморасчетов);
	
КонецПроцедуры

// Заполняет условия продаж по умолчанию в заказе клиента
//
Процедура ЗаполнитьУсловияПродажПоУмолчанию() Экспорт
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
	Если ЗначениеЗаполнено(Партнер) Или Не ИспользоватьСоглашенияСКлиентами Тогда
		
		УсловияПродажПоУмолчанию = ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(
			Партнер,
			Новый Структура(
				"ИсключитьГруппыСкладовДоступныеВЗаказах, ВыбранноеСоглашение, ПустаяСсылкаДокумента",
				Истина,
				Соглашение,
				Документы.РеализацияТоваровУслуг.ПустаяСсылка()));
		
		Если УсловияПродажПоУмолчанию <> Неопределено Тогда
			
			Если НЕ ИспользоватьСоглашенияСКлиентами ИЛИ 
				(Соглашение <> УсловияПродажПоУмолчанию.Соглашение И ЗначениеЗаполнено(УсловияПродажПоУмолчанию.Соглашение)) Тогда
				
				Соглашение = УсловияПродажПоУмолчанию.Соглашение;
				ЗаполнитьУсловияПродаж(УсловияПродажПоУмолчанию);
				
				Если ИспользоватьСоглашенияСКлиентами Тогда
					ПересчитатьСуммуСУчетомРучнойСкидки = Новый Структура("Очищать", Ложь);
					СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
					
					СтруктураДействий = Новый Структура;
					СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
					СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
					СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки", "КоличествоУпаковок");
					СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
					СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов", Неопределено);
					СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", ПересчитатьСуммуСУчетомРучнойСкидки);
					
					ПараметрыЗаполнения = Новый Структура();
					ПараметрыЗаполнения.Вставить("Дата", Дата);
					ПараметрыЗаполнения.Вставить("Валюта", Валюта);
					ПараметрыЗаполнения.Вставить("Соглашение", Соглашение);
					ПараметрыЗаполнения.Вставить("РасчитыватьНаборы", Истина);
					ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, СтавкаНДС, ВидЦены, СрокПоставки");
					
					ПродажиСервер.ЗаполнитьЦены(
						Товары, // Табличная часть
						, // Массив строк или структура отбора
						ПараметрыЗаполнения,
						СтруктураДействий);
				КонецЕсли;
			Иначе
				Соглашение = УсловияПродажПоУмолчанию.Соглашение;
			КонецЕсли;
		Иначе
			ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Партнер, Контрагент);
			Соглашение = Неопределено;
		КонецЕсли;
		
		БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
		
	КонецЕсли;
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтактноеЛицоПартнераПоУмолчанию(Партнер, КонтактноеЛицо);
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		АдресДоставки = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(Партнер);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НалогообложениеНДС) И Не ИспользоватьСоглашенияСКлиентами Тогда
		НалогообложениеНДС = ЗначениеНастроекПовтИсп.ПолучитьНалогообложениеНДС(Организация, Склад, Дата);
	КонецЕсли;
		
КонецПроцедуры

// Заполняет условия продаж по соглашению в реализации товаров и услуг
//
Процедура ЗаполнитьУсловияПродажПоСоглашению() Экспорт
	
	УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина, Истина);
	ЗаполнитьУсловияПродаж(УсловияПродаж);
	
	ПерезаполнятьЦены = Истина;
	
	Если ПерезаполнятьЦены Тогда
		ПересчитатьСуммуСУчетомРучнойСкидки = Новый Структура("Очищать", Ложь);
		СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);
		
		СтруктураДействий = Новый Структура;
		СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
		СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки", "КоличествоУпаковок");
		СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку", Неопределено);
		СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов", Неопределено);
		СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", ПересчитатьСуммуСУчетомРучнойСкидки);
		
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("Дата", Дата);
		ПараметрыЗаполнения.Вставить("Валюта", Валюта);
		ПараметрыЗаполнения.Вставить("Соглашение", Соглашение);
		ПараметрыЗаполнения.Вставить("РасчитыватьНаборы", Истина);
		ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, СтавкаНДС, ВидЦены, СрокПоставки");
		
		ПродажиСервер.ЗаполнитьЦены(
			Товары, // Табличная часть
			, // Массив строк или структура отбора
			ПараметрыЗаполнения,
			СтруктураДействий);
	КонецЕсли;
	
	БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    		= Организация;
	СтруктураПараметров.БанковскийСчет		= БанковскийСчетОрганизации;
	БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеДоставкой") Тогда
		АдресДоставки = ФормированиеПечатныхФорм.ПолучитьАдресИзКонтактнойИнформации(Партнер);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НалогообложениеНДС) Тогда
		НалогообложениеНДС = ЗначениеНастроекПовтИсп.ПолучитьНалогообложениеНДС(Организация, Склад, Дата);
	КонецЕсли;
	
КонецПроцедуры

// Заполняет дату платежа по документу основанию и условиям продажи
//
Процедура ЗаполнитьДатуПлатежаПоОснованию() Экспорт
	
	Если РеализацияПоЗаказам И ЗначениеЗаполнено(ЗаказКлиента) Тогда
		
		Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЗаказКлиентаЭтапыГрафикаОплаты.ДатаПлатежа) КАК ДатаПлатежа
			|ИЗ
			|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
			|ГДЕ
			|	ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка = &ЗаказКлиента
			|	И ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	МАКСИМУМ(ЗаявкаНаВозвратЭтапыГрафикаОплаты.ДатаПлатежа)
			|ИЗ
			|	Документ.ЗаявкаНаВозвратТоваровОтКлиента.ЭтапыГрафикаОплаты КАК ЗаявкаНаВозвратЭтапыГрафикаОплаты
			|ГДЕ
			|	ЗаявкаНаВозвратЭтапыГрафикаОплаты.Ссылка = &ЗаказКлиента
			|	И ЗаявкаНаВозвратЭтапыГрафикаОплаты.ВариантОплаты = ЗНАЧЕНИЕ(Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки)
			|");
			
		Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ДатаПлатежа = Выборка.ДатаПлатежа;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭтапыОплатыСервер.ЗаполнитьДатуПлатежаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти




#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();   ///////77w qaws		
		Если РольДоступна("АдминистраторСистемы")
			или Найти(Строка(ТекущийПользователь), "Ковалевская Юлия") = 1
			или ТекущийПользователь = ЭтотОбъект.Автор	
			
			Тогда
			
		Иначе
			Сообщить("Сообщить нельзя делать непроведенным документ, созданный другим пользователем");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись 
		И ЭтотОбъект.ПометкаУдаления = ИСТИНА Тогда
		
		ТЗ_Заказы = ПолучитьЗаказыПоРеализации(ЭтотОбъект.Ссылка);	
		
		Для каждого стр Из ТЗ_Заказы Цикл
		
			
		
		КонецЦикла; 
	КонецЕсли;
	////jadmin Запрет на картофель и весовые семена
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
	//	И ЭтотОбъект.ЭтоИнтернетЗаказ = ЛОЖЬ Тогда
	//	Для каждого СтрокаТовара Из ЭтотОбъект.Товары Цикл	
	//		Если СтрокаТовара.Номенклатура.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
	//			ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
	//			ИЛИ СтрокаТовара.Номенклатура.Родитель.Родитель.Родитель = Справочники.Номенклатура.НайтиПоКоду("00-00000020")     //Картофель
	//			
	//			ИЛИ ЭтотОбъект.Склад = Справочники.Склады.НайтиПоНаименованию("склад N 1 Центральный") Тогда
	//			
	//			Сообщить("Отгрузка картофеля и весовых семян запрещена");
	//				Если РольДоступна("АдминистраторСистемы") Тогда
	//
	//	            Иначе
	//					ОТКАЗ = ИСТИНА;
	//				КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла; 
	//КонецЕсли; 
	

	
	Если ЭтотОбъект.ЭтоИнтернетЗаказ = Истина Тогда
		Для каждого Строка Из ЭтотОбъект.Товары Цикл
			Если Строка.СуммаСНДС = 0 Тогда
			 	Строка.СуммаСНДС = Строка.Сумма;
			КонецЕсли; 
		КонецЦикла;
	Иначе
		Для каждого Строка Из ЭтотОбъект.Товары Цикл
			 	Строка.СуммаВзаиморасчетов = Строка.СуммаСНДС;
		КонецЦикла;
	КонецЕсли; 
	
	Если ЭтотОбъект.Партнер.ОтгрузкаНеОсуществляется Тогда
		Если НачалоДня(ЭтотОбъект.Партнер.ДатаОтгрузкаНеОсуществляется) <> Дата(1,1,1) Тогда
			
			Если НачалоДня(ЭтотОбъект.Дата)>= НачалоДня(ЭтотОбъект.Партнер.ДатаОтгрузкаНеОсуществляется) Тогда
				//Отказ = Истина;
				Сообщить("У контрагента "+ЭтотОбъект.Контрагент+ " установлен признак ""Отгрузка не осуществляется""!!!");
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли; 
		
	
	Если ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда  

		ВсегоСуммаСтрокПоРознЦене = 0;	

		Для каждого Строка Из ЭтотОбъект.Товары Цикл

			ЦенаРозн = 0;
			ЦенаРозн = ОбщийМодуль77w.ПолучитьЦенуНаСервере_Розница(Строка.Номенклатура,Строка.Серия,ЭтотОбъект.Дата);
			
			ВсегоСуммаСтрокПоРознЦене = ВсегоСуммаСтрокПоРознЦене+(Строка.КоличествоУпаковок*ЦенаРозн);	
		КонецЦикла; 
		
			ЭтотОбъект.ВсегоСуммаСтрокПоРознЦене = ВсегоСуммаСтрокПоРознЦене;
	КонецЕсли;
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;


	////////////////////////////// Проверка созданных документов другим пользователем
	
	Если РольДоступна("АдминистраторСистемы") Тогда
		
	Иначе
		
		
		Если (РежимЗаписи = РежимЗаписиДокумента.Запись И ПометкаУдаления = ЛОЖЬ)
			ИЛИ РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ТЗ_ЗАказы_Клиентов = ЭтотОбъект.Товары.Выгрузить();
			ТЗ_ЗАказы_Клиентов.Свернуть("ЗаказКлиента","");
			
			Для каждого Строка_ТЗ_ЗАказы_Клиентов Из ТЗ_ЗАказы_Клиентов Цикл
				
				//Запрос = Новый Запрос;
				//Запрос.Текст = 
				//"ВЫБРАТЬ
				//| СвязанныеДокументы.Ссылка КАК Ссылка
				//|ИЗ
				//| КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
				//|ГДЕ
				//| СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ";
				
				//Запрос.УстановитьПараметр("Док", Строка_ТЗ_ЗАказы_Клиентов.ЗаказКлиента);
				
				
				//jadmin Проверка созданных документов другим пользователем2
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
				|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|ГДЕ
				|	РеализацияТоваровУслугТовары.ЗаказКлиента = &ЗаказКлиента
				|	И РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
				|
				|СГРУППИРОВАТЬ ПО
				|	РеализацияТоваровУслугТовары.Ссылка,
				|	РеализацияТоваровУслугТовары.ЗаказКлиента";
				
				Запрос.УстановитьПараметр("ЗаказКлиента", Строка_ТЗ_ЗАказы_Клиентов.ЗаказКлиента);
				
				
				
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				НашлиНакладную = Неопределено;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")	Тогда 
						//Если ((ВыборкаДетальныеЗаписи.Ссылка.Проведен) И 
						Если (ВыборкаДетальныеЗаписи.Ссылка <> ЭтотОбъект.Ссылка) Тогда
							НашлиНакладную = ВыборкаДетальныеЗаписи.Ссылка;
							Сообщить("По "+Строка_ТЗ_ЗАказы_Клиентов.ЗаказКлиента+" уже создана "+ВыборкаДетальныеЗаписи.Ссылка);
							Если РольДоступна("АдминистраторСистемы") Тогда
								
							Иначе	
								Отказ = Истина;		
							КонецЕсли; 
							
						КонецЕсли; 
					КонецЕсли;
				КонецЦикла;
			КонецЦикла; 
		КонецЕсли;
	КонецЕсли;
  
    /////////////////////////////
    
    
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьКорректировки(Отказ);
	КонецЕсли;
    
    
		Если ЭтотОбъект.ПометкаУдаления = Истина Тогда
			
			Если ЭтотОбъект.РеализацияПоЗаказам Тогда
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента) Тогда
					ЗаказОбъект = ЭтотОбъект.ЗаказКлиента.Ссылка.ПолучитьОбъект();
					Попытка
						ЗаказОбъект.ВыписанаНакладная = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
						ЗаказОбъект.Записать();
					Исключение
						//ОписаниеОшибки()
					КонецПопытки; 
					
				Иначе
					ТЗ_Заказов = ЭтотОбъект.Товары.Выгрузить();
					ТЗ_Заказов.Свернуть("ЗаказКлиента","");
					
					Для каждого СтрокаТЗ Из ТЗ_Заказов Цикл
						Попытка

							ЗаказОбъект = СтрокаТЗ.ЗаказКлиента.Ссылка.ПолучитьОбъект();
							ЗаказОбъект.ВыписанаНакладная =Документы.РеализацияТоваровУслуг.ПустаяСсылка();
							ЗаказОбъект.Записать();
						Исключение
							//ОписаниеОшибки()
						КонецПопытки; 
					КонецЦикла; 
					
				КонецЕсли; 	
			КонецЕсли; 
			
		КонецЕсли;
		
	ЗаказыСервер.ПроверитьДатуРаспоряжения(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи);
	
	СформироватьСписокЗависимыхЗаказов();
	
	// Очистим реквизиты документа не используемые для хозяйственной операции.
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	Документы.РеализацияТоваровУслуг.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		ХозяйственнаяОперация,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	ДенежныеСредстваСервер.ОчиститьНеиспользуемыеРеквизиты(
		ЭтотОбъект,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	
	Если (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		Или Не ВернутьМногооборотнуюТару)
		И ТребуетсяЗалогЗаТару Тогда
		ТребуетсяЗалогЗаТару = Ложь;
	КонецЕсли;
	
	СуммаДокумента = ПолучитьСуммуДокумента();  
	
	Если ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда  
		СуммаДокумента = ЭтотОбъект.ВсегоСуммаСтрокПоРознЦене;
	КонецЕсли;

	
	СтруктураКурса = РаботаСКурсамиВалютУТ.СтруктураКурсаВалюты(Курс, Кратность);
	ЗаполнитьСуммуВзаиморасчетов(СтруктураКурса);
	Ценообразование.РассчитатьСуммыВзаиморасчетовВТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураКурса);
	
	СуммаВзаиморасчетов = СуммаДокумента; //jadmin
	
	
	НоменклатураСервер.ОчиститьНеиспользуемыеСерии(ЭтотОбъект,
															НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект,
																										Документы.РеализацияТоваровУслуг));
	
	Документы.СчетФактураВыданный.ПроверитьРеквизитыСчетФактурыПередЗаписьюОснования(ЭтотОбъект);
	
	ОбщегоНазначенияУТ.ИзменитьПризнакСогласованностиДокумента(
		ЭтотОбъект,
		РежимЗаписи);
	
	Если РеализацияПоЗаказам И ЗначениеЗаполнено(ЗаказКлиента) Тогда
		
		Для Каждого ТекСтрока Из Товары Цикл
			
			Если Не ЗначениеЗаполнено(ТекСтрока.ЗаказКлиента) Тогда
				ТекСтрока.ЗаказКлиента = ЗаказКлиента;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
    Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
        //перенес на форму
		//Если ЭтотОбъект.ЭтоИнтернетЗаказ = Ложь Тогда
		//    Попытка
		//        Если (ЭтотОбъект.ВидДокументаЭСЧФ.Код = "603") ИЛИ (ЭтотОбъект.ВидДокументаЭСЧФ.Код = "602") Тогда
		//			//ЕстьБСО = ЗагрузкаКлассификаторовСервер.ПолучитьДанныеПоБСО(ЭтотОбъект.КодБланка,ЭтотОбъект.СерияБСО,ЭтотОбъект.НомерБСО);
		//			ЕстьБСО = ОбщийМодуль77w.ПроверитьБСОНаПортале(ЭтотОбъект.КодБланка,ЭтотОбъект.СерияБСО,ЭтотОбъект.НомерБСО);

		//			
		//            //Если НЕ ЗначениеЗаполнено(ЕстьБСО.УНПОрганизации) Тогда
		//            Если СокрЛП(ЕстьБСО.УНПОрганизации) <> СокрЛП(ЭтотОбъект.Организация.ИНН) Тогда
		//                Сообщить("Отсутствуют сведения о бланке накладной в базе данных на ""https://blank.bisc.by/"".  Проверьте код, серию и номер бланка");
		//                Отказ = Истина;
		//            КонецЕсли; 
		//        КонецЕсли; 
		//    Исключение
		//        //ОписаниеОшибки()
		//    КонецПопытки; 
		//КонецЕсли;  
        
		
		//Если КонецДня(ЭтотОбъект.Дата) < КонецДня(Константы.ОплатаДо_по_Сезонной_Скидке.Получить()) Тогда   //////77w qaws
		//	ЭтотОбъект.ДатаПлатежа = Константы.ОплатаДо_по_Сезонной_Скидке.Получить();
		//Иначе
		//	ЭтотОбъект.ДатаПлатежа = КонецДня(ЭтотОбъект.Дата)+((ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору*86400));
		//КонецЕсли; 

			
		Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет Тогда
			
			
			
			ВзаиморасчетыСервер.ЗаполнитьСуммуРасшифровкиПлатежаПоСуммеДокумента(
				СуммаДокумента,
				РасшифровкаПлатежа);
			ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетовВТабличнойЧасти(
				Валюта,
				Дата,
				РасшифровкаПлатежа);
		Иначе
			Если РасшифровкаПлатежа.Количество() <> 0 Тогда
				РасшифровкаПлатежа.Очистить();
			КонецЕсли;
		КонецЕсли;
		
		МестаУчета = РегистрыСведений.АналитикаУчетаНоменклатуры.МестаУчета(ХозяйственнаяОперация, Склад, Подразделение, Партнер);
		ИменаПолей = РегистрыСведений.АналитикаУчетаНоменклатуры.ИменаПолейКоллекцииПоУмолчанию();
		// Если Склад - группа, то для аналитики учета номенклатуры склад берем из ТЧ
		ГруппаСкладов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ЭтоГруппа");
		РазрешенВыборГруппы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ВыборГруппы");
		Если ЗначениеЗаполнено(ГруппаСкладов) Тогда
			Если ГруппаСкладов И РазрешенВыборГруппы = Перечисления.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных Тогда
				ИменаПолей.Вставить("Произвольный", "Склад");
			КонецЕсли;
		КонецЕсли;
		РегистрыСведений.АналитикаУчетаНоменклатуры.ЗаполнитьВКоллекции(Товары, МестаУчета, ИменаПолей);
		РегистрыСведений.АналитикаУчетаНаборов.ЗаполнитьВКоллекции(Товары);
		ЗаполнитьВидыЗапасов(Отказ);
		
		ВзаиморасчетыСервер.ЗаполнитьИдентификаторыСтрокВТабличнойЧасти(Товары);
		ВзаиморасчетыСервер.ЗаполнитьИдентификаторыСтрокВТабличнойЧасти(ВидыЗапасов);
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Не ВидыЗапасовУказаныВручную Тогда
			ВидыЗапасов.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	ПорядокРасчетов = ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЭтотОбъект);
	
	Если СуммаПредоплаты >= СуммаВзаиморасчетов Тогда
		ДатаПлатежа = Дата('00010101');
	КонецЕсли;
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда
		ДатаПереходаПраваСобственности = Дата('00010101');
	Иначе
		Если Статус = Перечисления.СтатусыРеализацийТоваровУслуг.КПредоплате Тогда
		
			ДатаПереходаПраваСобственности = Дата('00010101');
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаполняемыйВариантОформленияПродажи") Тогда
		ВариантОформленияПродажи = ЭтотОбъект.ДополнительныеСвойства.ЗаполняемыйВариантОформленияПродажи;
	КонецЕсли; 
	
	Если ЭтоНовый() И НЕ ЗначениеЗаполнено(Номер) Тогда
		УстановитьНовыйНомер();
	КонецЕсли;

	ИдентификаторПлатежа = ОбщегоНазначенияУТ.ПолучитьУникальныйИдентификаторПлатежа(ЭтотОбъект);
	
	// ИнтеграцияГИСМ
	ЕстьМаркируемаяПродукцияГИСМ = ИнтеграцияГИСМ_УТ.ЕстьМаркируемаяПродукцияГИСМ(Товары);
	// Конец ИнтеграцияГИСМ
	
	// ИнтеграцияЕГАИС
	ИнтеграцияЕГАИСУТ.ЗаполнитьПризнакиЕстьАлкогольнаяПродукция(ЭтотОбъект);
	// Конец ИнтеграцияЕГАИС
	
	
	
	
	//////77w qaws
	Если ЭтотОбъект.РучнаяКорректировкаДатыПлатежа = Ложь Тогда
		Если ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору < 9999 Тогда
			
			Если (КонецДня(ЭтотОбъект.Дата) < КонецДня(Константы.СезоннаяСкидкеДействуетДо.Получить())) 
				и (НачалоДня(ЭтотОбъект.Дата) >= Константы.ДатаНачалаНовогоСезона.Получить())
				Тогда   //////77w qaws
					ЭтотОбъект.ДатаПлатежа = Константы.ОплатаДо_по_Сезонной_Скидке.Получить();
                Иначе
                    
                    Если ЭтотОбъект.КоличествоДнейОтсрочки = 0 Тогда
                        
                        
                        Запрос = Новый Запрос;
                        Запрос.Текст = 
                        "ВЫБРАТЬ
                        |   ОтсрочкаОплатыПоДоговорамСрезПоследних.Контрагент КАК Контрагент,
                        |   ОтсрочкаОплатыПоДоговорамСрезПоследних.Договор КАК Договор,
                        |   ОтсрочкаОплатыПоДоговорамСрезПоследних.ОтсрочкаОплатыПоДоговору КАК ОтсрочкаОплатыПоДоговору
                        |ИЗ
                        |   РегистрСведений.ОтсрочкаОплатыПоДоговорам.СрезПоследних(&Период, ) КАК ОтсрочкаОплатыПоДоговорамСрезПоследних
                        |ГДЕ
                        |   ОтсрочкаОплатыПоДоговорамСрезПоследних.Контрагент = &Контрагент
                        |   И ОтсрочкаОплатыПоДоговорамСрезПоследних.Договор = &Договор";
                        
                        Запрос.УстановитьПараметр("Период", НачалоДня(ЭтотОбъект.Дата));
                        Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
                        Запрос.УстановитьПараметр("Договор", ЭтотОбъект.Договор);
                        
                        РезультатЗапроса = Запрос.Выполнить();
                        
                        Если НЕ РезультатЗапроса.Пустой() Тогда
                            ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
                            
                            Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
                                ЭтотОбъект.ДатаПлатежа = КонецДня(ЭтотОбъект.Дата)+((ВыборкаДетальныеЗаписи.ОтсрочкаОплатыПоДоговору*86400));
                            КонецЦикла;
                        Иначе
                            ЭтотОбъект.ДатаПлатежа = КонецДня(ЭтотОбъект.Дата)+((ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору*86400));
                        КонецЕсли; 
                        
                    Иначе
                        
						//ЭтотОбъект.ДатаПлатежа = КонецДня(ЭтотОбъект.Дата)+((ЭтотОбъект.КоличествоДнейОтсрочки*86400));
                         ЭтотОбъект.ДатаПлатежа = КонецДня(ЭтотОбъект.Дата)+((ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору*86400));

                    КонецЕсли;     
                КонецЕсли; 
			
		ИначеЕсли ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору = 9999 Тогда
				ЭтотОбъект.ДатаПлатежа = КонецДня(ЭтотОбъект.Дата)+(((ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору)*86400));
                
        КонецЕсли;
	Иначе
		 ЭтотОбъект.ДатаПлатежа = ЭтотОбъект.ДатаПлатежа;
	КонецЕсли;	
	//////77w qaws
	
	

		Если Константы.ВыпискаБудущейДатой_Реализация_МССО.Получить() = ИСТИНА Тогда
			
			ДатаДокумента = Формат(ЭтотОбъект.Дата,"ДЛФ=D");
			ТекущаяДата = Формат(ТекущаяДата(),"ДЛФ=D");
			ВремяДокумента = Формат(ЭтотОбъект.Дата,"ДЛФ=T");
			ВремяДокумента = Лев(ВремяДокумента,2);
			
			ВремяДокумента = Число(СтрЗаменить(ВремяДокумента,":",""));
			
			
			ДеньНеделиДатыДокумента = ДеньНедели(ЭтотОбъект.Дата);
			КоэффДней = 1;
			Если ДеньНеделиДатыДокумента = 5 Тогда
				КоэффДней = 3;
			КонецЕсли; 
			
			ДатаДляСравнения = Формат((ТекущаяДата()+(86400*КоэффДней)),"ДЛФ=D");
			ВремяДляСравненияСистемное = Формат((ТекущаяДата()),"ДЛФ=T");
			ВремяДляСравненияСистемное = Лев(ВремяДляСравненияСистемное,2);
			
			ВремяДляСравненияСистемное = Число(СтрЗаменить(ВремяДляСравненияСистемное,":",""));
			
			
			Если НачалоДня(ТекущаяДата()) > НачалоДня(ЭтотОбъект.Дата) Тогда
				ОбменДанными.Загрузка = Истина;
			КонецЕсли;	
				
				Для I = 1 По 1 Цикл
					
				Если ОбменДанными.Загрузка Тогда
					ОбменДанными.Загрузка = Ложь;
					Продолжить;
				КонецЕсли;
					
				Если (ДатаДокумента > ТекущаяДата) Тогда
					Если (ДатаДокумента = ДатаДляСравнения) Тогда
						
						Если (ВремяДокумента >= 9) Тогда
							Сообщить("Выписка будущей датой, c временем документа больше 09:00 запрещена");
							Отказ = Истина;
						КонецЕсли; 
						
						Если (ВремяДляСравненияСистемное < 14) Тогда
							Сообщить("Выписка будущей датой, раньше 14:00 (по текущему времени) запрещена");
							Отказ = Истина;
						КонецЕсли; 
						
					
					Иначе
						Сообщить("Выписка запрещена более чем на 1 рабочий день вперед");
						Отказ = Истина;
					КонецЕсли; 	
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли; 
		

		
		Если НЕ Отказ Тогда		
			ЭтотОбъект.ДокументГотов = Истина;    //jadmin  автоматическое проставление галочки документ готов		
		КонецЕсли; 
		
            //Если ЭтотОбъект.ЭтоИнтернетЗаказ = Ложь Тогда
            //	Если НЕ Отказ Тогда
            //		Если ЭтотОбъект.ПометкаУдаления = Истина Тогда
            //			Если ЭтотОбъект.ЭСЧФ <> Документы.ЭСЧФИсходящий.ПустаяСсылка() Тогда
            //				ЭСЧФ_Объект = ЭтотОбъект.ЭСЧФ.ПолучитьОбъект();
            //				
            //				Если ЭСЧФ_Объект.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен_Подписан Тогда
            //					
            //					//ЭСЧФ_Объект.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен_Аннулирование;
            //					ЭСЧФ_Объект.ДатаАннулированияЭСЧФ = ТекущаяДата();
            //					ЭСЧФ_Объект.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исправленный;
            //					
            //				ИначеЕсли ЭСЧФ_Объект.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен Тогда
            //					
            //					//ЭСЧФ_Объект.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Аннулирован;
            //					ЭСЧФ_Объект.ДатаАннулированияЭСЧФ = ТекущаяДата();
            //					ЭСЧФ_Объект.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исправленный;
            //					
            //				Иначе
            //					
            //				КонецЕсли; 
            //				
            //				ЭСЧФ_Объект.Записать(РежимЗаписиДокумента.Проведение);
            //				
            //				АннулироватьЭСЧФ(ЭСЧФ_Объект.Ссылка);
            //				
            //			КонецЕсли; 
            //		КонецЕсли; 
            //		
            //	КонецЕсли; 
            //КонецЕсли; 
			
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Перем СкладОтгрузки;
	Перем РеквизитыШапки;
	Перем ВариантОформления;
	Перем ПараметрыОформления;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	ЗаполненНаОснованииДокумента = Ложь;
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		// Заполнение из формы списка распоряжений.
		Если ДанныеЗаполнения.Свойство("ДокументОснование")
			И (ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") 
			Или ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента")
			Или ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("Массив")) Тогда
			
			// Если передан склад - необходимо заполнять товары только по указанном складу.
			ДанныеЗаполнения.Свойство("СкладОтгрузки", СкладОтгрузки);
			ДанныеЗаполнения.Свойство("РеквизитыШапки", РеквизитыШапки);
			ДанныеЗаполнения.Свойство("ВариантОформленияПродажи", ВариантОформления);
			ДанныеЗаполнения.Свойство("ПараметрыОформления", ПараметрыОформления);
			
			ЗаполнитьДокументНаОснованииЗаказаКлиента(ДанныеЗаполнения.ДокументОснование,
				СкладОтгрузки, ВариантОформления, РеквизитыШапки, ПараметрыОформления);
			
			ЗаполненНаОснованииДокумента = Ложь;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("АктОРасхождениях") 
			И ДанныеЗаполнения.Свойство("ОснованиеАкта") Тогда
			
			Если ТипЗнч(ДанныеЗаполнения.ОснованиеАкта) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				ЗаполнитьДокументНаОснованииАктаОРасхожденияхПослеОтгрузки(ДанныеЗаполнения);
				ЗаполненНаОснованииДокумента = Истина;
			ИначеЕсли ТипЗнч(ДанныеЗаполнения.ОснованиеАкта) = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
				ЗаполнитьДокументНаОснованииАктаОРасхожденияхПослеПриемки(ДанныеЗаполнения);
				ЗаполненНаОснованииДокумента = Истина;
			КонецЕсли;

		ИначеЕсли (ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ИнтернетЗаказРозничный")) Тогда	
			ЗаполнитьДокументНаОснованииИнтернетЗаказРозничный(ДанныеЗаполнения);
			ЗаполненНаОснованииДокумента = Истина;
			
		Иначе

			ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);

		КонецЕсли;

	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СделкиСКлиентами") Тогда

		ЗаполнитьДокументНаОснованииСделкиПоПродаже(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказКлиента") Или
		ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		Дата = ЗаказыСервер.ПолучитьМинимальнуюДатуОтгрузкиЗаказа(ДанныеЗаполнения);
		ЗаполнитьДокументНаОснованииЗаказаКлиента(ДанныеЗаполнения, СкладОтгрузки, ВариантОформления);
		ЗаполненНаОснованииДокумента = Истина;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда

		ЗаполнитьДокументНаОснованииИндивидуальногоСоглашенияСКлиентом(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда

		ЗаполнитьДокументНаОснованииВозвратаТоваровОтКлиента(ДанныеЗаполнения);
		ЗаполненНаОснованииДокумента = Истина;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда

		ЗаполнитьДокументНаОснованииПоступленияТоваровУслуг(ДанныеЗаполнения);
		ЗаполненНаОснованииДокумента = Истина;
		
	КонецЕсли;
	
	Если Не ЗаполненНаОснованииДокумента Тогда
		ИнициализироватьУсловияПродаж();
	КонецЕсли;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);

	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	Если Не ЗначениеЗаполнено(ПорядокОплаты) Тогда
		ВалютаОплаты  = ДенежныеСредстваСервер.ПолучитьВалютуОплаты(ФормаОплаты, БанковскийСчетОрганизации, Касса);
		ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.ПолучитьПорядокОплатыПоУмолчанию(ВалютаВзаиморасчетов,НалогообложениеНДС,ВалютаОплаты);
	КонецЕсли;
	
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовПродажи(Склад);
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(Склад, СкладГруппа, Товары, Ложь);
	
	Если Не ЗначениеЗаполнено(НалогообложениеНДС) Или Не ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
		НалогообложениеНДС = ЗначениеНастроекПовтИсп.ПолучитьНалогообложениеНДС(Организация, Склад, Дата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ);
	
	НоменклатураСервер.ПроверитьЗаполнениеХарактеристик(ЭтотОбъект,МассивНепроверяемыхРеквизитов,Отказ);
	НоменклатураСервер.ПроверитьЗаполнениеСерий(ЭтотОбъект,
												НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РеализацияТоваровУслуг),
												Отказ,
												МассивНепроверяемыхРеквизитов);
	
	МассивВсехРеквизитов = Новый Массив;
	МассивРеквизитовОперации = Новый Массив;
	
	Документы.РеализацияТоваровУслуг.ЗаполнитьИменаРеквизитовПоХозяйственнойОперации(
		ХозяйственнаяОперация,
		МассивВсехРеквизитов,
		МассивРеквизитовОперации);
	
	Для Каждого ЭлементМассива Из МассивВсехРеквизитов Цикл
		
		// Если реквизит не используется для хозяйственной операции, исключаем данный реквизит из проверки.
		Если МассивРеквизитовОперации.Найти(ЭлементМассива) = Неопределено Тогда
			МассивНепроверяемыхРеквизитов.Добавить(ЭлементМассива);
		КонецЕсли;
		
	КонецЦикла;
	
	
	//jadmin отключить проверку заполнения БСО при интернет заказах
	Если ЭтотОбъект.ЭтоИнтернетЗаказ = ИСТИНА Тогда
	
		МассивНепроверяемыхРеквизитов.Добавить("СерияБСО");
		МассивНепроверяемыхРеквизитов.Добавить("НомерБСО");
        МассивНепроверяемыхРеквизитов.Добавить("Товары");
        
	КонецЕсли;
	///
	
	
	Если Товары.НайтиСтроки(Новый Структура("СуммаВзаиморасчетов", 0)).Количество()=0 Тогда
		//ДополнительныеСвойства.Вставить("СуммаВВалютеВзаиморасчетов", ПолучитьСуммуВзаиморасчетовПоТЧ());
		ДополнительныеСвойства.Вставить("СуммаВВалютеВзаиморасчетов",ПолучитьСуммуДокумента());     //jadmin
		ДополнительныеСвойства.Вставить("СуммаЗалогаВВалютеВзаиморасчетов", ПолучитьСуммуВзаиморасчетовПоТаре());
	Иначе
		СтруктураПараметров = Новый Структура("Дата, Валюта, ВалютаВзаиморасчетов, СуммаВзаиморасчетов");
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, ЭтотОбъект);
        СтруктураПараметров.Вставить("СуммаДокумента", ЭтотОбъект.Товары.Итог("СуммаСНДС"));
		ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетов(СтруктураПараметров);
		ДополнительныеСвойства.Вставить("СуммаВВалютеВзаиморасчетов", Окр(СтруктураПараметров.СуммаВзаиморасчетов, 2));
		СтруктураПараметров.Вставить("СуммаДокумента", ПолучитьСуммуДокументаПоТаре());
		ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетов(СтруктураПараметров);
		ДополнительныеСвойства.Вставить("СуммаЗалогаВВалютеВзаиморасчетов", Окр(СтруктураПараметров.СуммаВзаиморасчетов, 2));
	КонецЕсли;
	
	Для ТекИндекс = 0 По Товары.Количество()-1 Цикл
    		Если РеализацияПоЗаказам И
    			Не ЗначениеЗаполнено(ЗаказКлиента) И
    			Не ЗначениеЗаполнено(Товары[ТекИндекс].ЗаказКлиента) Тогда
                
                
                
                
                
    			ТекстОшибки = НСтр("ru='Не заполнено поле ""Заказ клиента"" в строке %НомерСтроки% списка ""Товары""'");
    			ТекстОшибки =  СтрЗаменить(ТекстОшибки, "%НомерСтроки%", Товары[ТекИндекс].НомерСтроки);
                
                
                
    			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
    				ТекстОшибки,
    				ЭтотОбъект,
    				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Товары[ТекИндекс].НомерСтроки, "ЗаказКлиента"),
    				,
    				Отказ);
    			
    		КонецЕсли;
	КонецЦикла;
	
	ПроверитьСуммуПредоплаты(ДополнительныеСвойства.СуммаВВалютеВзаиморасчетов, Отказ);
	
	ЕстьСтрокиСверхЗаказа = ПраваПользователяПовтИсп.РеализацияСверхЗаказа()
	 И (Товары.НайтиСтроки(Новый Структура("КодСтроки", 0)).Количество() > 0);
	
	Если МассивНепроверяемыхРеквизитов.Найти("ДатаПлатежа") = Неопределено Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПлатежа");
		
		ПорядокРасчетовПоДокументу = ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЭтотОбъект);
		Если ((ПорядокРасчетовПоДокументу = Перечисления.ПорядокРасчетов.ПоНакладным И Не РеализацияПоЗаказам) 
				Или ЕстьСтрокиСверхЗаказа)
			И СуммаПредоплаты < ДополнительныеСвойства.СуммаВВалютеВзаиморасчетов Тогда
			
			ЭтапыОплатыСервер.ПроверитьЗаполнениеКорректностьДатыПлатежа(ДатаПлатежа, Дата, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	// Код строки должен быть заполнен, если реализация по заказу
	Если Не РеализацияПоЗаказам ИЛИ (РеализацияПоЗаказам И ЕстьСтрокиСверхЗаказа) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Товары.КодСтроки");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Соглашение) ИЛИ НЕ ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Соглашение, "ИспользуютсяДоговорыКонтрагентов") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Договор");
	КонецЕсли;
	
	ДоставкаТоваров.ПроверитьЗаполнениеРеквизитовДоставки(ЭтотОбъект, МассивНепроверяемыхРеквизитов, Отказ, РеализацияПоЗаказам);
	
	Если Не ВернутьМногооборотнуюТару Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВозвратаМногооборотнойТары");
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоПодразделениямМенеджерам") Тогда
		ПроверяемыеРеквизиты.Добавить("Подразделение");
	КонецЕсли;
	
	Если ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ДатаПереходаПраваСобственности");
	Иначе
		Если Статус <> Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ДатаПереходаПраваСобственности");
		КонецЕсли;
	КонецЕсли;
	
	ПроверитьВариантОформленияПродажи(МассивНепроверяемыхРеквизитов);
	
	Если ЗначениеЗаполнено(НаправлениеДеятельности) 
		ИЛИ НЕ НаправленияДеятельностиСервер.УказаниеНаправленияДеятельностиОбязательно(ХозяйственнаяОперация) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("НаправлениеДеятельности");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
	ПроверитьИзменениеХозяйственнойОперации(Отказ);
    
    Если ЭтотОбъект.ЭтоИнтернетЗаказ = Ложь Тогда
    	Если Не Отказ И ОбщегоНазначенияУТ.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, ПроверяемыеРеквизиты) Тогда
    		Отказ = Истина;
    	КонецЕсли;
    КонецЕсли; 
    
    
	ПродажиСервер.ПроверитьКорректностьЗаполненияДокументаПродажи(ЭтотОбъект,Отказ);
	ОбщегоНазначенияУТ.ПроверитьПравильностьУказанияХозяйственнойОперации(ЭтотОбъект, Отказ);
	
	Если Не РеализацияПоЗаказам И Не ПраваПользователяПовтИсп.СозданиеРеализацииТоваровУслугБезЗаказа() Тогда
		
		ТекстОшибки = НСтр("ru='Нет прав на создание реализации товаров и услуг без заказа'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			Ссылка,
			,
			,
			Отказ);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено("ДатаВозвратаМногооборотнойТары") И ВернутьМногооборотнуюТару И ДатаВозвратаМногооборотнойТары < НачалоДня(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Дата возврата многооборотной тары не должна быть меньше даты документа.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			"Объект.ДатаВозвратаМногооборотнойТары",
			,
			Отказ);
		
	КонецЕсли;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности 
		И ДатаПереходаПраваСобственности <> Дата('00010101') 
		И ДатаПереходаПраваСобственности < НачалоДня(Дата) Тогда
		 
		ТекстОшибки = НСтр("ru='Дата перехода права собственности должна быть больше даты документа.'");
		 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			"Объект.ДатаПереходаПраваСобственности",
			,
			Отказ);
			
		КонецЕсли;
	
	Если Статус <> Перечисления.СтатусыРеализацийТоваровУслуг.КПредоплате Тогда
		ПродажиСервер.ПроверитьЗапретОтгрузки(Партнер, Отказ);
	КонецЕсли;
																							
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	//jadmin ПроверкаЗапретаОтгрузки
	ОбщийМодуль77w.ПроверкаЗапретаОтгрузки(ЭтотОбъект.Ссылка,Отказ);
	///
	
	
	//// 77w ////////////ПРОВЕРКА РЕГУЛИРУЕМЫХ ЦЕН ///////////////////
	Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда		
		//ОбщийМодуль77w.ПроверкаРегулируемыхЦен_Розница(ЭтотОбъект.Ссылка,Отказ);		 //jadmin 10-01-2023 откл
	Иначе
		ОбщийМодуль77w.ПроверкаРегулируемыхЦен(ЭтотОбъект.Ссылка,Отказ);         //ОПТ
	КонецЕсли; 
	
	
	Если ЭтотОбъект.Соглашение.Наименование = "Благотворительность" Тогда
		
	Иначе
		
		Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда 
			
			
			Для каждого Строка Из ЭтотОбъект.Товары Цикл
				Если ОбщийМодуль77w.ПроверитьРегулированиеЦенГосударством_Оптовых(Строка.Номенклатура,ЭтотОбъект.Дата) = ИСТИНА Тогда
					Если Строка.Серия.ЦенаПоставщика = 0 Тогда
						Если Строка.Номенклатура.ПравилаРегулированияЦен = Справочники.ПравилаРегулированиеЦен.НайтиПоКоду("000000001") Тогда
						
						Иначе	
						
							Сообщить("Строка "+Строка.НомерСтроки+"   "+Строка.Номенклатура+"  по номенклатуре регулируются цены Постановлением Совета Министров N713. Цена изготовителя/поставщика на серию не установлена ");
							Отказ = Истина;
						
						КонецЕсли;

					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли;
	
	Если (ЭтотОбъект.ЭтоИнтернетЗаказ = ИСТИНА 
		И ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин)
		ИЛИ ЭтотОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию Тогда

		
		НеХватаетТовара = Ложь;
		
		ТЗ_Товары = ЭтотОбъект.Товары.Выгрузить();
		ТЗ_Товары.Свернуть("Номенклатура,Серия","Количество,КоличествоУпаковок");
		Для каждого Строка Из ТЗ_Товары Цикл
			
			ОстатокРозничный = 0;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
			|	ТоварыНаСкладахОстатки.Склад КАК Склад,
			|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК ВНаличииОстаток,
			|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВРезервеОстаток,0) КАК ВРезервеОстаток
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
			|ГДЕ
			|	ТоварыНаСкладахОстатки.Номенклатура = &Номенклатура
			|	И ТоварыНаСкладахОстатки.Склад = &Склад
			|	И ТоварыНаСкладахОстатки.Серия = &Серия";
			
			Запрос.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
			Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
			Запрос.УстановитьПараметр("Серия", Строка.Серия);
			Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОстатокРозничный = ВыборкаДетальныеЗаписи.ВНаличииОстаток;
			КонецЦикла;
			
			Если Строка.Количество > ОстатокРозничный  Тогда
				Сообщить("Нет на остатках "+Строка.Номенклатура+" серия "+Строка.Серия+" в Заказе:" + Строка.Количество+ ", на складе Остаток= "+ОстатокРозничный);
				НеХватаетТовара = Истина;
			КонецЕсли; 
			
			
		КонецЦикла; 
		
		Если НеХватаетТовара = Истина Тогда
			Сообщить("Документ не проводится.");
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		
		
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
		
		Документы.РеализацияТоваровУслуг.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		ИнициализироватьДополнительныеСвойстваНабораЗаписейВыручкаИСебестоимостьПродаж();
		ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		//ЗаказыСервер.ОтразитьЗаказыКлиентов(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
		//ЗаказыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьТоварыОрганизаций(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьТоварыОрганизацийКПередаче(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьТоварыПереданныеНаКомиссию(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьУслугиКОформлениюОтчетовПринципалу(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьДатыПередачиТоваровНаКомиссию(ДополнительныеСвойства, Отказ);
		ЗапасыСервер.ОтразитьТоварыКОформлениюОтчетовКомитента(ДополнительныеСвойства, Движения, Отказ);
		ДоходыИРасходыСервер.ОтразитьСебестоимостьТоваров(ДополнительныеСвойства, Движения, Отказ);
		ДоходыИРасходыСервер.ОтразитьВыручкуИСебестоимостьПродаж(ДополнительныеСвойства, Движения, Отказ);
		//ВзаиморасчетыСервер.ОтразитьРасчетыСКлиентами(ДополнительныеСвойства, Движения, Отказ);
		МногооборотнаяТараСервер.ОтразитьПереданнуюВозвратнуюТару(ДополнительныеСвойства, Движения, Отказ);	
		
		СкладыСервер.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
		
		ВзаиморасчетыСервер.ОтразитьСуммыДокументаВВалютеРегл(ДополнительныеСвойства, Движения, Отказ);
		
		ЗатратыСервер.ОтразитьМатериалыИРаботыВПроизводстве(ДополнительныеСвойства, Движения, Отказ);
		
		//Сложный учет НДС
		ДоходыИРасходыСервер.ОтразитьНДССостояниеРеализации0(ДополнительныеСвойства, Движения, Отказ);
		ДоходыИРасходыСервер.ОтразитьНДСЗаписиКнигиПродаж(ДополнительныеСвойства, Движения, Отказ);
		
		// Движения по оборотным регистрам управленческого учета
		УправленческийУчетПроведениеСервер.ОтразитьДвиженияНоменклатураНоменклатура(ДополнительныеСвойства, Движения, Отказ);
		РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
		
		СформироватьСписокРегистровДляКонтроля();
		
		ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
		РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
		ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
		ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
		ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
		Документы.СчетФактураВыданный.АктуализироватьСчетФактуру(ЭтотОбъект, Истина, ТребуетсяСчетФактура());
		РегистрыСведений.ТребуетсяОформлениеСчетаФактуры.ОтразитьНеобходимостьОформленияСчетаФактуры(ДополнительныеСвойства, Отказ);
		
		//Закрытие интернет заказов 77w
		Если Не Отказ Тогда
			Если ЭтотОбъект.ДокументОснование <> Документы.ИнтернетЗаказРозничный.ПустаяСсылка() 
				И ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
				ИнтернетЗаказРозничныйОбъект = ЭтотОбъект.ДокументОснование.Ссылка.ПолучитьОбъект();
				
				Если ИнтернетЗаказРозничныйОбъект.Статус <> Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
					ИнтернетЗаказРозничныйОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
				КонецЕсли;
				
				ИнтернетЗаказРозничныйОбъект.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли; 
		КонецЕсли; 
		
		
	ИНАЧЕ     
		// Опт обычная реализация 
		
		Если НачалоДня(ЭтотОбъект.Дата) >= Дата("20250407") Тогда
			Если ЭтотОбъект.РеализацияПоЗаказам Тогда
				СуммаЗаказов = 0;
				ТЗ_Заказов = ЭтотОбъект.Товары.Выгрузить();
				ТЗ_Заказов.Свернуть("ЗаказКлиента","");
				
				Для каждого СтрокаТЗ Из ТЗ_Заказов Цикл
					СуммаЗаказов = СуммаЗаказов + СтрокаТЗ.ЗаказКлиента.СуммаДокумента;	
				КонецЦикла;  
				
				Если СуммаЗаказов <> СуммаДокумента Тогда
					Отказ = Истина;
					Сообщить("Сумма по заказам не равна сумме реализации.  Документ не проводится.");
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		
		Если ЭтотОбъект.Партнер.ОтгрузкаТолькоПоПредоплате = ИСТИНА И ЭтотОбъект.Проведен = ЛОЖЬ Тогда
			Если Константы.НеКонтролироватьПредоплатуПриОтгрузке.Получить() <> ИСТИНА Тогда
				СуммаПредоплатыЕсть = 0;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Партнер КАК АналитикаУчетаПоПартнерамПартнер,
				|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Контрагент КАК АналитикаУчетаПоПартнерамКонтрагент,
				|	РасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток,
				|	РасчетыСКлиентамиОстатки.КОплатеОстаток КАК КОплатеОстаток,
				|	РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток КАК ОплачиваетсяОстаток,
				|	РасчетыСКлиентамиОстатки.КОтгрузкеОстаток КАК КОтгрузкеОстаток,
				|	РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток КАК ОтгружаетсяОстаток
				|ИЗ
				|	РегистрНакопления.РасчетыСКлиентами.Остатки(&Период, ) КАК РасчетыСКлиентамиОстатки
				|ГДЕ
				|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Партнер = &Партнер
				|	И РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам.Контрагент = &Контрагент";
				
				Запрос.УстановитьПараметр("Контрагент", ЭтотОбъект.Контрагент);
				Запрос.УстановитьПараметр("Партнер", ЭтотОбъект.Партнер);
				Запрос.УстановитьПараметр("Период", КонецДня(ЭтотОбъект.Дата));
				
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					СуммаПредоплатыЕсть = ВыборкаДетальныеЗаписи.СуммаОстаток;
					Если СуммаПредоплатыЕсть < 0 Тогда
						СуммаПредоплатыЕсть = СуммаПредоплатыЕсть*(-1);
					КонецЕсли; 
				КонецЦикла;
				
				
				Если СуммаПредоплатыЕсть < ЭтотОбъект.СуммаДокумента Тогда
					Сообщить("У контрагента "+ЭтотОбъект.Контрагент+" установлен признак ""отгрузка по предоплате""");
					Сообщить("Не достаточно суммы предоплаты ("+ СуммаПредоплатыЕсть+")  до суммы отгрузки по накладной "+ЭтотОбъект.СуммаДокумента+"");
					Сообщить("Документ не проводится.");
					Отказ = Истина;
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли;
		
		
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
		
		Документы.РеализацияТоваровУслуг.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		ИнициализироватьДополнительныеСвойстваНабораЗаписейВыручкаИСебестоимостьПродаж();
		ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		ЗаказыСервер.ОтразитьЗаказыКлиентов(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьСвободныеОстатки(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьОбеспечениеЗаказов(ДополнительныеСвойства, Движения, Отказ);
		ЗаказыСервер.ОтразитьТоварыКОтгрузке(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьТоварыНаСкладах(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьТоварыОрганизаций(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьТоварыОрганизацийКПередаче(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьТоварыПереданныеНаКомиссию(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьУслугиКОформлениюОтчетовПринципалу(ДополнительныеСвойства, Движения, Отказ);
		ЗапасыСервер.ОтразитьДатыПередачиТоваровНаКомиссию(ДополнительныеСвойства, Отказ);
		ЗапасыСервер.ОтразитьТоварыКОформлениюОтчетовКомитента(ДополнительныеСвойства, Движения, Отказ);
		ДоходыИРасходыСервер.ОтразитьСебестоимостьТоваров(ДополнительныеСвойства, Движения, Отказ);
		ДоходыИРасходыСервер.ОтразитьВыручкуИСебестоимостьПродаж(ДополнительныеСвойства, Движения, Отказ);
		ВзаиморасчетыСервер.ОтразитьРасчетыСКлиентами(ДополнительныеСвойства, Движения, Отказ);
		МногооборотнаяТараСервер.ОтразитьПереданнуюВозвратнуюТару(ДополнительныеСвойства, Движения, Отказ);	
		
		СкладыСервер.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
		
		ВзаиморасчетыСервер.ОтразитьСуммыДокументаВВалютеРегл(ДополнительныеСвойства, Движения, Отказ);
		
		ЗатратыСервер.ОтразитьМатериалыИРаботыВПроизводстве(ДополнительныеСвойства, Движения, Отказ);
		
		//Сложный учет НДС
		ДоходыИРасходыСервер.ОтразитьНДССостояниеРеализации0(ДополнительныеСвойства, Движения, Отказ);
		ДоходыИРасходыСервер.ОтразитьНДСЗаписиКнигиПродаж(ДополнительныеСвойства, Движения, Отказ);
		
		// Движения по оборотным регистрам управленческого учета
		УправленческийУчетПроведениеСервер.ОтразитьДвиженияНоменклатураНоменклатура(ДополнительныеСвойства, Движения, Отказ);
		РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
		
		СформироватьСписокРегистровДляКонтроля();
		
		ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
		РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
		ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
		ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
		ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
		Документы.СчетФактураВыданный.АктуализироватьСчетФактуру(ЭтотОбъект, Истина, ТребуетсяСчетФактура());
		РегистрыСведений.ТребуетсяОформлениеСчетаФактуры.ОтразитьНеобходимостьОформленияСчетаФактуры(ДополнительныеСвойства, Отказ);
		
		
		/////////77w qaws
		Движения.ОборотыКлиентовМССО.Записывать = Истина;
		Движение = Движения.ОборотыКлиентовМССО.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ЭтотОбъект.Контрагент;
		Движение.Оборот = ЭтотОбъект.СуммаДокумента;
		
		
		/////////77w qaws     //Запись в регистр ЭСЧФДляВыставления
		
    Если НЕ Отказ  Тогда
      Если ЭтотОбъект.Соглашение.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
        НаборЗаписей = РегистрыНакопления.ЭСЧФДляВыставления.СоздатьНаборЗаписей();
        НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
        
        Запись = НаборЗаписей.ДобавитьПриход();
        Запись.Регистратор = ЭтотОбъект.Ссылка;
        Запись.Период = Дата;
        Запись.Контрагент   = ЭтотОбъект.Контрагент;
        Запись.ДокументОснование = ЭтотОбъект.Ссылка;
        Запись.Состояние   = 1;
        
        НаборЗаписей.Записать();
      КонецЕсли; 
    КонецЕсли; 
		
		
		Если НЕ Отказ Тогда
			// регистр ЖурналРегистрацииВыданныхСвидетельств
			Движения.ЖурналРегистрацииВыданныхСвидетельств.Записывать = Истина;
			
			ТЗ = ЭтотОбъект.Товары.Выгрузить();
			ТЗ.Свернуть("Номенклатура, Серия","Количество");
			
			Для каждого стр Из ТЗ Цикл	
				
				Если Стр.Серия.Партия_МССО = Справочники.ПартионныеКарточки.ПустаяСсылка() Тогда
					Продолжить;
				КонецЕсли; 
				
				Движение = Движения.ЖурналРегистрацииВыданныхСвидетельств.Добавить();
				
				Движение.Регистратор = ЭтотОбъект.Ссылка;
				Движение.Период = ЭтотОбъект.Дата;
				Движение.ДокументОснование = ЭтотОбъект.Ссылка;
				Движение.Номенклатура = стр.Номенклатура;
				Движение.Серия = стр.Серия;
				
				Если ЭтотОбъект.Контрагент = Справочники.Контрагенты.РозничныйПокупатель Тогда
					Движение.Приобретатель = ЭтотОбъект.НаименованиеКонтрагента;
					Движение.НомерБСО = ЭтотОбъект.НомерБСО;
				Иначе
					Движение.Приобретатель = ЭтотОбъект.Контрагент;
					Движение.НомерБСО = ЭтотОбъект.Номер;
				КонецЕсли; 
				
				Движение.Количество = стр.Количество;	
			КонецЦикла; 
			////		
						
		КонецЕсли;	
		
		/////////////////////  ЗАПИСЬ В РЕГИСТР СУММЫ ПО СТРОКАМ \\\\\\\\\\\\\\\\\\\\\\\\\\\\\
		
		Если ((ЭтотОбъект.Благотворительность) или (СтрНайти(Строка(ЭтотОбъект.Соглашение),"Благотворительность") > 0)) и ЭтотОбъект.Проведен = ИСТИНА Тогда
			
			НаборЗаписей = РегистрыНакопления.СебестоимостьТоваров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Прочитать();
			
			Для каждого СтрокаДок Из ЭтотОбъект.Товары Цикл
				
				Для каждого СтрокаНабора Из НаборЗаписей Цикл
					Если СтрокаДок.АналитикаУчетаНоменклатуры = СтрокаНабора.АналитикаУчетаНоменклатуры Тогда
						Если СтрокаНабора.СтоимостьРегл <> СтрокаДок.Сумма Тогда
							Если СтрокаНабора.Количество = СтрокаДок.Количество Тогда
								СтрокаНабора.СтоимостьРегл = СтрокаДок.Сумма;	
								Прервать;
							КонецЕсли;
						КонецЕсли
					КонецЕсли; 
				КонецЦикла; 
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		КонецЕсли; 
		
		
		/////140521
		/////150521
		///////////////////////  ЗАПИСЬ ИЗ РЕГИСТРА С/С СУММЫ С/С В СТРОКУ ДОКУМЕНТА \\\\\\\\\\\\\\\\\\\\\\\\\\\\\
		Если ((ЭтотОбъект.Благотворительность) или (СтрНайти(Строка(ЭтотОбъект.Соглашение),"Благотворительность") > 0)) и ЭтотОбъект.Проведен = ЛОЖЬ Тогда
			ТЗ = ЭтотОбъект.Товары.Выгрузить();
			
			ТаблицаДвиженийСебестоимость = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСебестоимостьТоваров;
			ТаблицаДвиженийСебестоимость.Свернуть("АналитикаУчетаНоменклатуры", "Количество, СтоимостьРегл");  
			
			Для каждого стрТаблицаДвижений Из ТаблицаДвиженийСебестоимость Цикл
				
				СтруктураОтбора = Новый Структура;
				
				СтруктураОтбора.Вставить("АналитикаУчетаНоменклатуры", стрТаблицаДвижений.АналитикаУчетаНоменклатуры);
				
				НайденныйМассивСтрок = ТЗ.НайтиСтроки(СтруктураОтбора);
				
				КолВо=0;
				СуммаРегистр = 0;
				СуммаВрем = 0;
				
				СуммаРегистр = СуммаРегистр + стрТаблицаДвижений.СтоимостьРегл;
				
				Для каждого НайденнаяСтрока Из НайденныйМассивСтрок Цикл
					
					Индекс = НайденнаяСтрока.НомерСтроки - 1;
					
					Если стрТаблицаДвижений.Количество - КолВо = 0 Тогда  
						Прервать;  
					КонецЕсли; 
					
					Если НайденнаяСтрока.Количество = стрТаблицаДвижений.Количество Тогда
						ТЗ[Индекс].Сумма = стрТаблицаДвижений.СтоимостьРегл;
					Иначе  
						ТЗ[Индекс].Сумма = Окр(стрТаблицаДвижений.СтоимостьРегл / стрТаблицаДвижений.Количество * НайденнаяСтрока.Количество,2);              
					КонецЕсли;
					
					///
					КолВо = КолВо + НайденнаяСтрока.Количество;
					
					Если стрТаблицаДвижений.Количество - КолВо = 0 И (СуммаРегистр - НайденнаяСтрока.Сумма - СуммаВрем <> 0) Тогда  
						ТЗ[Индекс].Сумма = Окр(СуммаРегистр - СуммаВрем);
					КонецЕсли;
					
					СуммаВрем = СуммаВрем + НайденнаяСтрока.Сумма;
					///
					
					СтавкаНДС = НайденнаяСтрока.Номенклатура.СтавкаНДС;
					
					ТЗ[Индекс].СуммаНДС   = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(НайденнаяСтрока.Сумма,
					ЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтавкаНДС),Ложь,
					НайденнаяСтрока);  
					
					ТЗ[Индекс].СуммаСНДС = ТЗ[Индекс].Сумма + НайденнаяСтрока.СуммаНДС;
					
					Если Окр(ТЗ[Индекс].Сумма/НайденнаяСтрока.Количество,2) < (1/100)  Тогда
						ТЗ[Индекс].Цена          = 0.01;
						ТЗ[Индекс].ЦенаСоСкидкой = 0.01;
					Иначе  
						ТЗ[Индекс].Цена          = Окр(ТЗ[Индекс].Сумма/НайденнаяСтрока.Количество,2);
						ТЗ[Индекс].ЦенаСоСкидкой = Окр(ТЗ[Индекс].Сумма/НайденнаяСтрока.Количество,2);
					КонецЕсли; 
					
				КонецЦикла; 
			КонецЦикла; 
			
			//Заполняем ТабличнуюЧасть  
			Для каждого СтрокаДок Из ЭтотОбъект.Товары Цикл
				
				Индекс = СтрокаДок.НомерСтроки-1;
				
				СтрокаДок.Сумма = ТЗ[Индекс].Сумма; 
				СтрокаДок.СуммаНДС = ТЗ[Индекс].СуммаНДС;
				СтрокаДок.СуммаСНДС = ТЗ[Индекс].СуммаСНДС;
				СтрокаДок.Цена = ТЗ[Индекс].Цена;
				СтрокаДок.ЦенаСоСкидкой = ТЗ[Индекс].ЦенаСоСкидкой;
			КонецЦикла; 
			
			ЭтотОбъект.Записать();
		КонецЕсли; 
		
		/////////////////////    \\\\\\\\\\\\\\\\\\\\\\\\\\\\\
		
		
		Если ЭтотОбъект.РеализацияПоЗаказам Тогда
			
			ТЗ_Заказов = ЭтотОбъект.Товары.Выгрузить();
			ТЗ_Заказов.Свернуть("ЗаказКлиента","");
			
			Для каждого СтрокаТЗ Из ТЗ_Заказов Цикл
				ЗаказОбъект = СтрокаТЗ.ЗаказКлиента.Ссылка.ПолучитьОбъект();
				
				
				//записать данные о реализации для ЗаказаКлиента
				МенеджерЗаписи = РегистрыСведений.ЗаказыВыписанаНакладная.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ЗаказСсылка = СтрокаТЗ.ЗаказКлиента.Ссылка;
				МенеджерЗаписи.РеализацияСсылка = ЭтотОбъект.Ссылка;
				
				МенеджерЗаписи.Регистратор = ЭтотОбъект.Ссылка;
				МенеджерЗаписи.Период = ЭтотОбъект.Дата;
				
				МенеджерЗаписи.Записать(Истина);
				///
				
				Попытка
					Если НЕ ЗаказОбъект.ВыписанаНакладная = ЭтотОбъект.Ссылка Тогда				
						ЗаказОбъект.ВыписанаНакладная = ЭтотОбъект.Ссылка;
						ЗаказОбъект.ОбменДанными.Загрузка = Истина;
						ЗаказОбъект.Записать();
					КонецЕсли;
					
					
					
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	 РасходныйОрдерНаТоварыОснования.Ссылка КАК Ссылка
					|ИЗ
					|	 Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
					|ГДЕ
					|	 РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ
					|	 И РасходныйОрдерНаТоварыОснования.Ссылка.Проведен = ИСТИНА
					|    И РасходныйОрдерНаТоварыОснования.Ссылка.Статус = &Статус
					|
					|СГРУППИРОВАТЬ ПО
					|	 РасходныйОрдерНаТоварыОснования.Ссылка";
					
					Запрос.УстановитьПараметр("ВыбЗаказ", СтрокаТЗ.ЗаказКлиента.Ссылка);
					Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыРасходныхОрдеров.КОтгрузке);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						НашлиОрдер = ВыборкаДетальныеЗаписи.Ссылка;
						
						НашлиОрдерОбъект = НашлиОрдер.ПолучитьОбъект();
						
						Попытка
							
							Если НачалоДня(ЭтотОбъект.Дата) >= '20210205000000' Тогда
								НашлиОрдерОбъект.ДатаОтгрузки = ЭтотОбъект.Дата;
								НашлиОрдерОбъект.Дата         = ЭтотОбъект.Дата;
							КонецЕсли;   
							
							Если НЕ НашлиОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен Тогда
								
								НашлиОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.Отгружен;
								НашлиОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);	 	 	 	 	 	 	 	 	 
								
							КонецЕсли; 
						Исключение
							ВызватьИсключение;	  
						КонецПопытки; 
						
					КонецЦикла;	  
					
				Исключение
					ВызватьИсключение;	  
				КонецПопытки; 
			КонецЦикла;			
			
			//jadmin смена статуса интернет заказа 
			Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента) Тогда 
				Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента.ДокументОснование) Тогда 
					ИнтернетЗаказОбъект = ЭтотОбъект.ЗаказКлиента.ДокументОснование.ПолучитьОбъект();
					//Если ЗначениеЗаполнено(ИнтернетЗаказОбъект) Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 10
					|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
					|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
					|	СостоянияЗаказовКлиентов.Заказ.Ссылка КАК ЗаказСсылка,
					|	СостоянияЗаказовКлиентов.Заказ.Статус КАК ЗаказСтатус,
					|	СостоянияЗаказовКлиентов.Заказ.ДокументОснование КАК ЗаказДокументОснование
					|ИЗ
					|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
					|ГДЕ
					|	СостоянияЗаказовКлиентов.Заказ.ДокументОснование = &ДокументОснование
					| 	И ТИПЗНАЧЕНИЯ(СостоянияЗаказовКлиентов.Заказ.ДокументОснование) = ТИП(Документ.ИнтернетЗаказКлиента)";
					
					Запрос.УстановитьПараметр("ДокументОснование", ИнтернетЗаказОбъект.Ссылка);
					
					РезЗпр = Запрос.Выполнить().Выбрать();
					
					ЗаказЗакрыт = 0;
					Пока РезЗпр.Следующий() Цикл
						//Статус = РезЗпр.Состояние;
						
						Если РезЗпр.Состояние = Перечисления.СостоянияЗаказовКлиентов.Закрыт Тогда
							ЗаказЗакрыт = ЗаказЗакрыт + 0;
						Иначе
							ЗаказЗакрыт = ЗаказЗакрыт + 1;
							Прервать;
						КонецЕсли; 
					КонецЦикла;
					
					Если ЗаказЗакрыт = 0 Тогда
						Попытка
							ИнтернетЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт;
							ИнтернетЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
							
							ИнтернетЗаказОбъект.Записать();
						Исключение
							ВызватьИсключение;
						КонецПопытки;
					КонецЕсли; 
				КонецЕсли; 
			КонецЕсли; 
			
			
			
			//jadmin убираем резерв с заказа 
			Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента) Тогда 
				Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
					// ТоварыНаСкладах
					Движения.ТоварыНаСкладах.Записывать = Истина;
					
					Для каждого стр Из ЭтотОбъект.ЗаказКлиента.Товары Цикл
						
						//Резерв для заказовКлиента, кроме интернет магазина
						//Для интернет магазина (резерв снимается интернетзаказом)
						Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента.ДокументОснование) Тогда
							
							Движение = Движения.ТоварыНаСкладах.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
							Движение.Период = Дата;
							Движение.Номенклатура = стр.Номенклатура;
							Движение.Серия = стр.Серия;
							Движение.Склад = Склад;
							
							Движение.ВРезерве = стр.КоличествоУпаковок;
							
						КонецЕсли; 
						
						
						//свободные остатки
						Движение = Движения.СвободныеОстатки.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
						Движение.Период = Дата;
						Движение.Номенклатура = стр.Номенклатура;
						Движение.Склад = Склад;
						
						Движение.ВНаличии = стр.КоличествоУпаковок;
						
					КонецЦикла; 
					
				КонецЕсли;
				
				
				
			КонецЕсли;
		КонецЕсли;
		
		//jadmin добавить запись в регистр ПретензииПоРеализациям		
		Если НЕ Отказ Тогда
			
			НовыйНаборЗаписей = РегистрыСведений.ПретензииПоРеализации.СоздатьНаборЗаписей();
			
			НовыйНаборЗаписей.Отбор.Реализация.Установить(ЭтотОбъект.Ссылка); 
			
			СписокЗаказов = Новый СписокЗначений;
			СписокЗаказов.Очистить();
			Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка.ЗаказКлиента) Тогда
				СписокЗаказов.Добавить(ЭтотОбъект.Ссылка.ЗаказКлиента);
			КонецЕсли;	
			Для каждого стр из ЭтотОбъект.Ссылка.Товары Цикл
				Если ЗначениеЗаполнено(стр.ЗаказКлиента) Тогда
					Найден = СписокЗаказов.НайтиПоЗначению(стр.ЗаказКлиента);
					Если Найден = Неопределено Тогда
						СписокЗаказов.Добавить(стр.ЗаказКлиента);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			
			Инд = 0;
			Для Каждого Элемент Из СписокЗаказов Цикл
				Инд = Инд +1;
				НоваяЗаписьНабора = НовыйНаборЗаписей.Добавить();
				НоваяЗаписьНабора.Реализация = ЭтотОбъект.Ссылка;
				НоваяЗаписьНабора.Контрагент = ЭтотОбъект.Контрагент;
				НоваяЗаписьНабора.Договор    = ЭтотОбъект.Договор;
				НоваяЗаписьНабора.СуммаРеализации    = ЭтотОбъект.СуммаДокумента;
				НоваяЗаписьНабора.Заказ   			 = Элемент.Значение.Ссылка;
				НоваяЗаписьНабора.МенеджерЗаказа     = Элемент.Значение.Менеджер;
				Если  СписокЗаказов.Количество() = 1 И Элемент.Значение.СуммаДокумента <> ЭтотОбъект.СуммаДокумента Тогда         //jadmin
					НоваяЗаписьНабора.СуммаЗаказа        = ЭтотОбъект.СуммаДокумента;
				Иначе
					НоваяЗаписьНабора.СуммаЗаказа        = Элемент.Значение.СуммаДокумента;
				КонецЕсли
			КонецЦикла;
			
			НовыйНаборЗаписей.Записать();
			
			
			//jadmin Заполнение Обмен реализация для обмена с Бух
			Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
				
				ЗаполнитьДанныеДляОбменаСБухгалтерией();
				
			КонецЕсли;
			///
		КонецЕсли; 
		
	КонецЕсли;	
	
	
	
	//Розница суммовые остатки jadmin	
	Если ЭтотОбъект.Склад.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		МССО_ДвиженияРегистров.ОтразитьДвиженияРозницаСуммовыеОстатки(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	//Если НЕ Отказ Тогда
	//
	//	МССО_ДвиженияРегистров.ЗаполнитьРСКонтрольЗаданийНаПеревозку(ЭтотОбъект.Ссылка);
	//
	//КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	
	
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();
	
	МенеджерВременныхТаблиц = ВременныеТаблицыДанныхДокумента();
	ЗапасыСервер.УстановитьБлокировкуОстатковТоваровОрганизаций(МенеджерВременныхТаблиц);	

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	РегистрыСведений.СостоянияЗаказовКлиентов.ОтразитьСостояниеЗаказа(ЭтотОбъект, Отказ);
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ, Истина);
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
	Документы.СчетФактураВыданный.АктуализироватьСчетФактуру(ЭтотОбъект, Ложь, ТребуетсяСчетФактура());
	РегистрыСведений.ТребуетсяОформлениеСчетаФактуры.ОтразитьНеобходимостьОформленияСчетаФактуры(ДополнительныеСвойства, Отказ);
	
	Если НЕ Отказ Тогда
		Если ЭтотОбъект.РеализацияПоЗаказам Тогда
			Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента) Тогда
				 ЗаказОбъект = ЭтотОбъект.ЗаказКлиента.Ссылка.ПолучитьОбъект();
				 Попытка
				 	ЗаказОбъект.ВыписанаНакладная = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
					ЗаказОбъект.ВзятКВыписке = Справочники.Пользователи.ПустаяСсылка();
					ЗаказОбъект.ОбменДанными.Загрузка = Истина;
					ЗаказОбъект.Записать();
				 Исключение
				     //ОписаниеОшибки()
				 КонецПопытки; 
				 
				 Иначе
					 ТЗ_Заказов = ЭтотОбъект.Товары.Выгрузить();
					 ТЗ_Заказов.Свернуть("ЗаказКлиента","");
					 
					 Для каждого СтрокаТЗ Из ТЗ_Заказов Цикл
						 ЗаказОбъект = СтрокаТЗ.ЗаказКлиента.Ссылка.ПолучитьОбъект();
						 Попытка
						 	ЗаказОбъект.ВыписанаНакладная =Документы.РеализацияТоваровУслуг.ПустаяСсылка();
							ЗаказОбъект.ОбменДанными.Загрузка = Истина;
							ЗаказОбъект.Записать();
						 Исключение
						     //ОписаниеОшибки()
						 КонецПопытки; 
					 КонецЦикла; 
					 
			КонецЕсли; 	
		КонецЕсли; 
		
		
		Если ЭтотОбъект.РеализацияПоЗаказам Тогда

				ТЗ_Заказов = ЭтотОбъект.Товары.Выгрузить();
				ТЗ_Заказов.Свернуть("ЗаказКлиента","");
				
				Для каждого СтрокаТЗ Из ТЗ_Заказов Цикл
					ЗаказОбъект = СтрокаТЗ.ЗаказКлиента.Ссылка.ПолучитьОбъект();
					Попытка
						//ЗаказОбъект.ВыписанаНакладная = ЭтотОбъект.Ссылка;
						//ЗаказОбъект.Записать();
						//
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	РасходныйОрдерНаТоварыОснования.Ссылка КАК Ссылка
						|ИЗ
						|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
						|ГДЕ
						|	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ
						|	И РасходныйОрдерНаТоварыОснования.Ссылка.Проведен = ИСТИНА
						|	И РасходныйОрдерНаТоварыОснования.Ссылка.Статус = &Статус
						|
						|СГРУППИРОВАТЬ ПО
						|	РасходныйОрдерНаТоварыОснования.Ссылка";

						
						Запрос.УстановитьПараметр("ВыбЗаказ", СтрокаТЗ.ЗаказКлиента.Ссылка);			
      					Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыРасходныхОрдеров.Отгружен);

						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							НашлиОрдер = ВыборкаДетальныеЗаписи.Ссылка;
							
							НашлиОрдерОбъект = НашлиОрдер.ПолучитьОбъект();
							
							Попытка
								
								Если НачалоДня(ЭтотОбъект.Дата) >= '20210205000000' Тогда
									НашлиОрдерОбъект.ДатаОтгрузки = ЭтотОбъект.Дата;
									НашлиОрдерОбъект.Дата         = ЭтотОбъект.Дата;
								КонецЕсли;   
								
								НашлиОрдерОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.КОтгрузке;
								НашлиОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
								
								//НашлиОрдерОбъект.Записать();
							Исключение
								ВызватьИсключение;	 
							КонецПопытки; 
							
						КонецЦикла;	 
						
						
						
					Исключение
						ВызватьИсключение;	 
					КонецПопытки; 
				КонецЦикла; 
			КонецЕсли; 		
		КонецЕсли; 		
	 
		
				//jadmin смена статуса интернет заказа  розничного
			Если ЭтотОбъект.Склад = Справочники.Склады.НайтиПоНаименованию("Интернет магазин",ИСТИНА) Тогда		
					Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента) Тогда 
					Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента.ДокументОснование) Тогда 
						ИнтернетЗаказОбъект = ЭтотОбъект.ЗаказКлиента.ДокументОснование.ПолучитьОбъект();
						Попытка
							ИнтернетЗаказОбъект.Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке;
							ИнтернетЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
							
							ИнтернетЗаказОбъект.Записать();
						Исключение
							ВызватьИсключение;
						КонецПопытки;
					КонецЕсли; 
				КонецЕсли; 
	        				
			КонецЕсли;

	
		
		
	//jadmin Заполняем Обмен_Реализация для выгрузки в бух
		Если Не Отказ Тогда
			НаборЗаписей = РегистрыСведений.Обмен_Реализация.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.РеализацияСсылка.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Прочитать();
			//Если НаборЗаписей.Количество() > 0 Тогда
			  	Для каждого стр Из НаборЗаписей Цикл		
					стр.ПометкаУдаления = 1;
					стр.ПризнакОбработано = 0;
				КонецЦикла;	
				НаборЗаписей.Записать(ИСТИНА);
		КонецЕсли;
	///
	
	
	///jadmin Удаление Реализации при пометке на удаление для ЗаказаКлиента
	Если Не Отказ Тогда
	    ТЗ_Заказов = ЭтотОбъект.Товары.Выгрузить();
		ТЗ_Заказов.Свернуть("ЗаказКлиента","");
			
		Для каждого СтрокаТЗ Из ТЗ_Заказов Цикл
			Если СтрокаТЗ.ЗаказКлиента <> Неопределено Тогда
				НаборЗаписей = РегистрыСведений.ЗаказыВыписанаНакладная.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ЗаказСсылка.Установить(СтрокаТЗ.ЗаказКлиента.Ссылка);
				НаборЗаписей.Прочитать();
				
				Для каждого стрНабор Из НаборЗаписей Цикл
					Если стрНабор.РеализацияСсылка = ЭтотОбъект.Ссылка Тогда
					    стрНабор.РеализацияСсылка = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
						Прервать;
					КонецЕсли; 			
				КонецЦикла; 
				
				НаборЗаписей.Записать(ИСТИНА);
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;
	///
		
		
	Если НЕ Отказ Тогда
		Набор = РегистрыСведений.ПретензииПоРеализации.СоздатьНаборЗаписей();
		Набор.Отбор.Реализация.Установить(ЭтотОбъект.Ссылка); 
		Набор.Прочитать();
		
		Для Индекс = 1 - Набор.Количество() По 0 Цикл
			Запись = Набор[- Индекс];
			Если Запись.Реализация = ЭтотОбъект.Ссылка Тогда
				Набор.Удалить(- Индекс);
			КонецЕсли;
		КонецЦикла;
		Набор.Записать();
		
	КонецЕсли; 
	
	
	Если НЕ Отказ Тогда
		НаборЗаписей = РегистрыСведений.БланкиБСО_Проверенные.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДокументРеализации.Установить(ЭтотОбъект.Ссылка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	КонецЕсли; 
	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Согласован          = Ложь;
	ЗаказКлиента        = Неопределено;
	ИдентификаторПлатежа= Неопределено;
	Статус              = Метаданные.Документы.РеализацияТоваровУслуг.Реквизиты.Статус.ЗначениеЗаполнения;
	СкидкиРассчитаны    = Ложь;
	РеализацияПоЗаказам = Ложь;
	СостояниеЗаполненияМногооборотнойТары = Перечисления.СостоянияЗаполненияМногооборотнойТары.ПустаяСсылка();
	ДатаПереходаПраваСобственности = Дата(1,1,1);
	ЕстьМаркируемаяПродукцияГИСМ = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектКопирования.ДатаПлатежа) Тогда
		ДатаПлатежа = ТекущаяДатаСеанса() + (НачалоДня(ОбъектКопирования.ДатаПлатежа) - НачалоДня(ОбъектКопирования.Дата));
	Иначе
		ЭтапыОплатыСервер.ЗаполнитьДатуПлатежаПоУмолчанию(ЭтотОбъект);
	КонецЕсли;
	
	СоглашениеЗаполнено = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И ЗначениеЗаполнено(Соглашение);
	Если СоглашениеЗаполнено Тогда
		УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение, Истина, Истина);
		Если УсловияПродаж.СтатусСоглашения <> Перечисления.СтатусыСоглашенийСКлиентами.Закрыто Тогда
			ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
				ЭтотОбъект,
				УсловияПродаж.СрокВозвратаМногооборотнойТары,
				УсловияПродаж.РассчитыватьДатуВозвратаТарыПоКалендарю,
				УсловияПродаж.КалендарьВозвратаТары); 
		Иначе
			Соглашение = Неопределено;
			ДатаВозвратаМногооборотнойТары = Дата(1,1,1);
		КонецЕсли;
	Иначе
		ДатаВозвратаМногооборотнойТары = Дата(1,1,1);
	КонецЕсли;
	
	Для Каждого ТекСтрока Из Товары Цикл
		
		ТекСтрока.ЗаказКлиента = Неопределено;
		ТекСтрока.КодСтроки = 0;
		ТекСтрока.ИдентификаторСтроки = "";
		
	КонецЦикла;
	НазначениеПоУмолчанию = НаправленияДеятельностиСервер.ТолкающееНазначение(НаправлениеДеятельности);
	НакладныеСервер.ЗаполнитьНазначенияВТабличнойЧасти(Товары, НазначениеПоУмолчанию);
	
	Серии.Очистить();
	ВидыЗапасов.Очистить();
	РасшифровкаПлатежа.Очистить();
	
	СкидкиНаценкиСервер.ОтменитьСкидки(ЭтотОбъект, "Товары", Истина, Истина);
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ
		И Не ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		РегистрыСведений.РеестрДокументов.ИнициализироватьИЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ТранспортнаяНакладная.АктуализироватьТранспортныеНакладные(Ссылка, Проведен, ПометкаУдаления);
	
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = ОбщегоНазначенияУТПовтИсп.ДополнительныйПрефиксНумератораДокументыРеализацииТоваров();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ЗаполнитьДокументНаОснованииИнтернетЗаказРозничный(ДанныеЗаполнения)   ///////////77w qaws
КонецПроцедуры


Процедура ЗаполнитьДокументНаОснованииЗаказаКлиента(Знач ДокументОснование,
	                                                Знач СкладОтгрузки,
	                                                ВариантОформления,
	                                                РеквизитыЗаказа = Неопределено,
	                                                ПараметрыОформления = Неопределено)
	ТипОснования = ТипЗнч(ДокументОснование);
	ЗаполнятьПоОстаткам = Ложь;
	
	Отказ =  Ложь;
	ЕстьЗаказыБезРазрешения = Ложь;
	УжеСозданаРеализация = Ложь;
	
    
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Если ДокументОснование.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
			//jadmin Отгрузку разрешил 19-03-2024
			ЕстьРазрешениеНаУстановкуПризнака = ПроверитьКонтрагентаНаПризнакОтгрузкуРазрешил(ДокументОснование.Контрагент);
			
			Если (ДокументОснование.Контрагент.Партнер.ВидПартнераКонтрагента.Ссылка.Код = "000000007")  
				ИЛИ ЕстьРазрешениеНаУстановкуПризнака = ИСТИНА 
				
				//ИЛИ (ДокументОснование.Соглашение.Наименование = "Благотворительность") 
				Тогда  
				Если ДокументОснование.ОтгрузкуРазрешил = Ложь Тогда
					Сообщить(""+ДокументОснование+" не проставлен признак ""Отгрузку разрешил"".  Отгрузка не возможна.");
					ЭтотОбъект.Комментарий = "ОТГРУЗКА НЕ ВОЗМОЖНА.";
					ЕстьЗаказыБезРазрешения = Истина;
				КонецЕсли;
			КонецЕсли;
			
			
			ЕстьОбещанныйПлатеж = ОбщийМодуль77w.ПроверкаОбещанногоПлатежа(ДокументОснование);
      Если ЕстьОбещанныйПлатеж = ЛОЖЬ Тогда  
        ТЗ_Оплаты = ДокументОснование.Ссылка.ЭтапыГрафикаОплаты.Выгрузить();
				Если ОбщийМодуль77w.ПроверитьПредоплатуМССО(ДокументОснование.Ссылка,ТЗ_Оплаты) = Ложь Тогда
					Сообщить("По заказу "+ДокументОснование+" нет предоплаты. Отгрузка не возможна.");
					ЭтотОбъект.Комментарий = "ОТГРУЗКА НЕ ВОЗМОЖНА.";
					ЕстьЗаказыБезРазрешения = Истина;
				КонецЕсли;
			КонецЕсли;
			
			
			ЗаданиеНаДоставкуФормируется = ПроверитьЗаданиеНаДоставку(ДокументОснование);
			Если ЗаданиеНаДоставкуФормируется = ИСТИНА Тогда
				Сообщить("По заказу "+ДокументОснование+" задание на перевозку находится в статусе ""Формируется"".");
				ЭтотОбъект.Комментарий = "ОТГРУЗКА НЕ ВОЗМОЖНА.";
				ЕстьЗаказыБезРазрешения = Истина;
			КонецЕсли;
			
		КонецЕсли;	
		
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		| СвязанныеДокументы.Ссылка КАК Ссылка
		|ИЗ
		| КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
		|ГДЕ
		| СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Док", ДокументОснование);
		
		
		
		//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		НашлиНакладную = Неопределено;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")	Тогда 
				Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
					НашлиНакладную = ВыборкаДетальныеЗаписи.Ссылка;
					УжеСозданаРеализация = Истина;
					ЭтотОбъект.Комментарий = "УжеСозданаРеализация.";
					Сообщить("По "+ДокументОснование+" уже создана "+ВыборкаДетальныеЗаписи.Ссылка+ "пользователем " + ЭтотОбъект.Менеджер);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		
		
		
	Иначе
		
		ЕстьРазноеКоличествоДнейОтсрочки = Ложь;
		
		ТЗ_Заказы = Новый ТаблицаЗначений;
		ТЗ_Заказы.Колонки.Добавить("КоличествоДнейОтсрочки");
		
		Для Каждого Строка ИЗ ДокументОснование Цикл
			Если Строка.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
				
				
				Строка_ТЗ_Заказы = ТЗ_Заказы.Добавить();
				Строка_ТЗ_Заказы.КоличествоДнейОтсрочки = Строка.КоличествоДнейОтсрочки;
				
				//jadmin Отгрузку разрешил 19-03-2024
				ЕстьРазрешениеНаУстановкуПризнака = ПроверитьКонтрагентаНаПризнакОтгрузкуРазрешил(Строка.Контрагент);
			
				Если (Строка.Контрагент.Партнер.ВидПартнераКонтрагента.Ссылка.Код = "000000007")  
					ИЛИ ЕстьРазрешениеНаУстановкуПризнака = ИСТИНА  Тогда
					Если Строка.Ссылка.ОтгрузкуРазрешил = Ложь Тогда
						Сообщить(""+Строка.Ссылка+" не проставлен признак ""Отгрузку разрешил"".  Отгрузка не возможна.");
						ЭтотОбъект.Комментарий = "ОТГРУЗКА НЕ ВОЗМОЖНА.";
						ЕстьЗаказыБезРазрешения = Истина;
					КонецЕсли;
				КонецЕсли;
				
				ЕстьОбещанныйПлатеж = ОбщийМодуль77w.ПроверкаОбещанногоПлатежа(Строка.Ссылка);
        Если ЕстьОбещанныйПлатеж = ЛОЖЬ Тогда    
          ТЗ_Оплаты = Строка.Ссылка.ЭтапыГрафикаОплаты.Выгрузить();
					Если ОбщийМодуль77w.ПроверитьПредоплатуМССО(Строка.Ссылка,ТЗ_Оплаты) = Ложь Тогда
						Сообщить("По заказу "+Строка.Ссылка+" нет предоплаты. Отгрузка не возможна.");
						ЭтотОбъект.Комментарий = "ОТГРУЗКА НЕ ВОЗМОЖНА.";
						ЕстьЗаказыБезРазрешения = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла;
		
		Если Строка.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
			
			УжеСозданаРеализация = Ложь;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента,
			|	РеализацияТоваровУслугТовары.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
			|ГДЕ
			|	РеализацияТоваровУслугТовары.ЗаказКлиента В(&ЗаказКлиента)
			|	И РеализацияТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваровУслугТовары.ЗаказКлиента,
			|	РеализацияТоваровУслугТовары.Ссылка";
			
			Запрос.УстановитьПараметр("ЗаказКлиента", ДокументОснование);
			
			РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			Если РезультатЗапроса.Количество()>0 Тогда
				УжеСозданаРеализация = Истина;   
				Для каждого стрЗап Из РезультатЗапроса Цикл
					Сообщить("По "+стрЗап.ЗаказКлиента+" уже создана "+стрЗап.Ссылка);	
				КонецЦикла;
				ЭтотОбъект.Комментарий = "УжеСозданаРеализация.";
				
				
			КонецЕсли;	
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			
			
			//Запрос = Новый Запрос;
			//Запрос.Текст = 
			//"ВЫБРАТЬ
			//| СвязанныеДокументы.Ссылка КАК Ссылка
			//|ИЗ
			//| КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
			//|ГДЕ
			//| СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ";
			//
			//Запрос.УстановитьПараметр("Док", Строка.Ссылка);
			
			
			
			//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
			
			//        РезультатЗапроса = Запрос.Выполнить();
			//        
			//        ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			//        НашлиНакладную = Неопределено;
			//        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			//            Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")	Тогда 
			//                Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
			//                    НашлиНакладную = ВыборкаДетальныеЗаписи.Ссылка;
			//                    УжеСозданаРеализация = Истина;
			//                    ЭтотОбъект.Комментарий = "УжеСозданаРеализация.";
			//                    Сообщить("По "+Строка.Ссылка+" уже создана "+ВыборкаДетальныеЗаписи.Ссылка);
			//                КонецЕсли; 
			//            КонецЕсли;
			//        КонецЦикла;
			//        
			//        
			//    КонецЕсли;
			//    
			//    
			//    
			//КонецЦикла;
			
			
			ТЗ_Заказы.Свернуть("КоличествоДнейОтсрочки","");
			
			Если ТЗ_Заказы.Количество() > 1 Тогда
				ЕстьРазноеКоличествоДнейОтсрочки = Истина;
			КонецЕсли; 
			
			Если ЕстьРазноеКоличествоДнейОтсрочки = Истина Тогда
				ЭтотОбъект.Комментарий = "РАЗЛИЧНЫЕ ДНИ ОТСРОЧКИ.";
				Сообщить(""+" У выбранных заказов отличаются кол-во дней отсрочки платежа.  Отгрузка не возможна.");
			КонецЕсли; 
			
			
		КонецЕсли; 
	КонецЕсли; 
    
    
    
    
	//Если ЕстьЗаказыБезРазрешения = Истина Тогда 
	//	ТекстСообщения = "ЕСТЬ ЗАКАЗЫ У КОТОРЫХ НЕ ПРОСТАВЛЕН ПРИЗНАК ""Отгрузку разрешил"".  ОТГРУЗКА НЕ ВОЗМОЖНА.";
	//
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru=''")),
	//		,
	//		,
	//		,
	//		Отказ);
	//	Возврат;
	//КонецЕсли;	
		
    
  ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
  
  
  	ЕстьЗаказыБезГотовности = Ложь;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда 
        Если ДокументОснование.Склад.ТипСклада = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
        	
    		Если ДокументОснование.Готовность = Ложь Тогда
    			Сообщить(""+ДокументОснование+" не проставлен признак ""Заказ готов (собран)"".  Отгрузка не возможна.");
    			ЭтотОбъект.Комментарий = "ЗАКАЗЫ НЕ СОБРАНЫ.";
    			ЕстьЗаказыБезРазрешения = Истина;
            КонецЕсли;
       КонецЕсли; 
	Иначе
		
        //Для Каждого Строка ИЗ ДокументОснование Цикл
        //	Если Строка.Ссылка.Готовность = Ложь Тогда
        //		Сообщить(""+Строка.Ссылка+" не проставлен признак ""Заказ готов (собран)"".  Отгрузка не возможна.");
        //		ЭтотОбъект.Комментарий = "ЗАКАЗЫ НЕ СОБРАНЫ.";
        //		ЕстьЗаказыБезРазрешения = Истина;
        //	КонецЕсли;	
        //КонецЦикла;	
		
	КонецЕсли; 
	
	
	//Если ЕстьЗаказыБезРазрешения = Истина Тогда 
	//	ТекстСообщения = "ЕСТЬ ЗАКАЗЫ У КОТОРЫХ НЕ ПРОСТАВЛЕН ПРИЗНАК ""Заказ готов (собран)"".  ОТГРУЗКА НЕ ВОЗМОЖНА.";
	//
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		СтрЗаменить(ТекстСообщения, "%ПредставлениеПоля%", НСтр("ru=''")),
	//		,
	//		,
	//		,
	//		Отказ);
	//	Возврат;
	//КонецЕсли;	

    
    
	
	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаказКлиента") Тогда
	
		Запрос = Новый Запрос("ВЫБРАТЬ
                              | ЗаказКлиента.Ссылка КАК ЗаказКлиента,
                              | ЗаказКлиента.Партнер КАК Партнер,
                              | ЗаказКлиента.Контрагент КАК Контрагент,
                              | ЗаказКлиента.КонтактноеЛицо КАК КонтактноеЛицо,
                              | ЗаказКлиента.Договор КАК Договор,
                              | ЗаказКлиента.Организация КАК Организация,
                              | ЗаказКлиента.ФормаОплаты КАК ФормаОплаты,
                              | ЗаказКлиента.Соглашение КАК Соглашение,
                              | ЗаказКлиента.КартаЛояльности КАК КартаЛояльности,
                              | ЗаказКлиента.Сделка КАК Сделка,
                              | ЗаказКлиента.Валюта КАК Валюта,
                              | ЗаказКлиента.Валюта КАК ВалютаВзаиморасчетов,
                              | ЗаказКлиента.ГрафикОплаты КАК ГрафикОплаты,
                              | ЗаказКлиента.Подразделение КАК Подразделение,
                              | ЗаказКлиента.ДатаОтгрузки КАК ДатаОтгрузки,
                              | ВЫБОР
                              |     КОГДА ЗаказКлиента.Склад.ЭтоГруппа
                              |             И ЗаказКлиента.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
                              |         ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
                              |     ИНАЧЕ ЗаказКлиента.Склад
                              | КОНЕЦ КАК Склад,
                              | ВЫБОР
                              |     КОГДА ЗаказКлиента.Склад.ЭтоГруппа
                              |             И ЗаказКлиента.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
                              |         ТОГДА ИСТИНА
                              |     ИНАЧЕ ЛОЖЬ
                              | КОНЕЦ КАК ЗапрещеноВыбиратьГруппуСкладов,
                              | ЗаказКлиента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
                              | ЗаказКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
                              | ЗаказКлиента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
                              | ЗаказКлиента.НеОтгружатьЧастями КАК НеОтгружатьЧастями,
                              | ЗаказКлиента.АдресДоставки КАК АдресДоставки,
                              | ЗаказКлиента.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке КАК ОрдернаяСхемаПриОтгрузке,
                              | ЗаказКлиента.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
                              | ЗаказКлиента.Статус КАК СтатусДокумента,
                              | НЕ ЗаказКлиента.Проведен КАК ЕстьОшибкиПроведен,
                              | ИСТИНА КАК ЕстьОшибкиСтатус,
                              | ЗаказКлиента.БанковскийСчет КАК БанковскийСчетОрганизации,
                              | ЗаказКлиента.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
                              | ЗаказКлиента.Грузоотправитель КАК Грузоотправитель,
                              | ЗаказКлиента.Грузополучатель КАК Грузополучатель,
                              | ЗаказКлиента.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
                              | ЗаказКлиента.БанковскийСчетГрузополучателя КАК БанковскийСчетГрузополучателя,
                              | ЗаказКлиента.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
                              | ЗаказКлиента.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
                              | ЗаказКлиента.ТребуетсяЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
                              | ВЫБОР
                              |     КОГДА &ИспользоватьСоглашенияСКлиентами
                              |         ТОГДА ЗаказКлиента.Соглашение.КалендарьВозвратаТары
                              |     ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПроизводственныеКалендари.ПустаяСсылка)
                              | КОНЕЦ КАК КалендарьВозвратаТары,
                              | ВЫБОР
                              |     КОГДА &ИспользоватьСоглашенияСКлиентами
                              |         ТОГДА ЗаказКлиента.Соглашение.РассчитыватьДатуВозвратаТарыПоКалендарю
                              |     ИНАЧЕ ЛОЖЬ
                              | КОНЕЦ КАК РассчитыватьДатуВозвратаТарыПоКалендарю,
                              | ЗаказКлиента.СкидкиНаценки.(
                              |     КлючСвязи КАК КлючСвязи,
                              |     СкидкаНаценка КАК СкидкаНаценка,
                              |     Сумма КАК Сумма
                              | ) КАК СкидкиНаценки,
                              | ЗаказКлиента.АдресДоставкиЗначенияПолей КАК АдресДоставкиЗначенияПолей,
                              | ВЫБОР
                              |     КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
                              |             И ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
                              |         ТОГДА ЗаказКлиента.СпособДоставки
                              | КОНЕЦ КАК СпособДоставки,
                              | ВЫБОР
                              |     КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
                              |             И ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
                              |         ТОГДА ЗаказКлиента.ПеревозчикПартнер
                              | КОНЕЦ КАК ПеревозчикПартнер,
                              | ВЫБОР
                              |     КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
                              |             И ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика)
                              |         ТОГДА ЗаказКлиента.ДополнительнаяИнформацияПоДоставке
                              | КОНЕЦ КАК ДополнительнаяИнформацияПоДоставке,
                              | ЗаказКлиента.ПорядокРасчетов КАК ПорядокРасчетов,
                              | ЗаказКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
                              | ЗаказКлиента.ПорядокОплаты КАК ПорядокОплаты,
                              | ЗаказКлиента.КоличествоДнейОтсрочки КАК КоличествоДнейОтсрочки
                              |ИЗ
                              | Документ.ЗаказКлиента КАК ЗаказКлиента
                              |ГДЕ
                              | ЗаказКлиента.Ссылка = &ЗаказКлиента
                              |;
                              |
                              |////////////////////////////////////////////////////////////////////////////////
                              |ВЫБРАТЬ РАЗЛИЧНЫЕ
                              | ЗаказыОстатки.Склад КАК Склад
                              |ИЗ
                              | РегистрНакопления.ЗаказыКлиентов.Остатки(, ЗаказКлиента = &ЗаказКлиента) КАК ЗаказыОстатки");
	
		Запрос.УстановитьПараметр("ЗаказКлиента", ДокументОснование);
		Запрос.УстановитьПараметр("ИспользоватьСоглашенияСКлиентами", ИспользоватьСоглашенияСКлиентами);
		Запрос.УстановитьПараметр("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками",
			ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		РеквизитыЗаказа = РезультатЗапроса[0].Выбрать();
		РеквизитыЗаказа.Следующий();

		Документы.ЗаказКлиента.ПроверитьВозможностьВводаНаОсновании(
			РеквизитыЗаказа.ЗаказКлиента,
			РеквизитыЗаказа.СтатусДокумента,
			РеквизитыЗаказа.ЕстьОшибкиПроведен);
			
			
			
		// Заполнение шапки
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаказа);
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				Дата = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
		ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
			ЭтотОбъект,
			РеквизитыЗаказа.СрокВозвратаМногооборотнойТары,
			РеквизитыЗаказа.РассчитыватьДатуВозвратаТарыПоКалендарю,
			РеквизитыЗаказа.КалендарьВозвратаТары);
		
		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			МассивСкладов = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Склад");
		КонецЕсли;
		
		//ЭтотОбъект.Отпустил = ДокументОснование.ЗаказСобрал;
		
		//Если КонецДня(ДатаВозвратаМногооборотнойТары) < КонецДня(Константы.СезоннаяСкидкеДействуетДо.Получить()) Тогда   //////77w qaws
		//	ЭтотОбъект.ДатаПлатежа = Константы.ОплатаДо_по_Сезонной_Скидке.Получить();
		//Иначе
		//	ЭтотОбъект.ДатаПлатежа = КонецДня(ДатаВозвратаМногооборотнойТары)+((ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору*86400));
		//КонецЕсли; 
		
		
		
        ////////77w qaws
        //	Если ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору < 9999 Тогда
        //		Если КонецДня(ДатаВозвратаМногооборотнойТары) < КонецДня(Константы.СезоннаяСкидкеДействуетДо.Получить()) Тогда   //////77w qaws
        //			ЭтотОбъект.ДатаПлатежа = Константы.ОплатаДо_по_Сезонной_Скидке.Получить();
        //		Иначе
        //			ЭтотОбъект.ДатаПлатежа = КонецДня(ДатаВозвратаМногооборотнойТары)+((ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору*86400));
        //		КонецЕсли; 
        //	ИначеЕсли ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору = 9999 Тогда
        //			ЭтотОбъект.ДатаПлатежа = КонецДня(ДатаВозвратаМногооборотнойТары)+(((ЭтотОбъект.Договор.ОтсрочкаОплатыПоДоговору)*86400));
        //	Иначе		
        //	КонецЕсли;
        ////////77w qaws
		
        
        
        
        

	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаНаВозврат.Ссылка                КАК ЗаказКлиента,
		|	ЗаявкаНаВозврат.Партнер               КАК Партнер,
		|	ЗаявкаНаВозврат.Контрагент            КАК Контрагент,
		|	ЗаявкаНаВозврат.Договор               КАК Договор,
		|	ЗаявкаНаВозврат.Организация           КАК Организация,
		|	ЗаявкаНаВозврат.ФормаОплаты           КАК ФормаОплаты,
		|	ЗаявкаНаВозврат.Соглашение            КАК Соглашение,
		|	ЗаявкаНаВозврат.Сделка                КАК Сделка,
		|	ЗаявкаНаВозврат.Валюта                КАК Валюта,
		|	ЗаявкаНаВозврат.Валюта                КАК ВалютаВзаиморасчетов,
		|	ЗаявкаНаВозврат.ГрафикОплаты          КАК ГрафикОплаты,
		|	ЗаявкаНаВозврат.ДатаОтгрузки          КАК ДатаОтгрузки,
		|	ВЫБОР КОГДА ЗаявкаНаВозврат.Склад.ЭтоГруппа 
		|		И ЗаявкаНаВозврат.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|		ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|		ИНАЧЕ ЗаявкаНаВозврат.Склад
		|	КОНЕЦ КАК Склад,
		|	ВЫБОР КОГДА ЗаявкаНаВозврат.Склад.ЭтоГруппа
		|		И ЗаявкаНаВозврат.Склад.ВыборГруппы = ЗНАЧЕНИЕ(Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах)
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЗапрещеноВыбиратьГруппуСкладов,
		|	ЗаявкаНаВозврат.ЦенаВключаетНДС       КАК ЦенаВключаетНДС,
		|	ЗаявкаНаВозврат.НалогообложениеНДС    КАК НалогообложениеНДС,
		|	ВЫБОР
		|		КОГДА
		|			ЗаявкаНаВозврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента)
		|			ИЛИ ЗаявкаНаВозврат.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
		|		ТОГДА
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
		|	КОНЕЦ КАК ХозяйственнаяОперация,
		|	ЗаявкаНаВозврат.НеОтгружатьЧастями    КАК НеОтгружатьЧастями,
		|	ЗаявкаНаВозврат.АдресДоставки         КАК АдресДоставки,
		|	ЗаявкаНаВозврат.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке КАК ОрдернаяСхемаПриОтгрузке,
		|	ЗаявкаНаВозврат.ВернутьМногооборотнуюТару      КАК ВернутьМногооборотнуюТару,
		|	ЗаявкаНаВозврат.СрокВозвратаМногооборотнойТары КАК СрокВозвратаМногооборотнойТары,
		|	ЗаявкаНаВозврат.ТребуетсяЗалогЗаТару           КАК ТребуетсяЗалогЗаТару,
		|	ВЫБОР
		|		КОГДА &ИспользоватьСоглашенияСКлиентами 
		|			ТОГДА ЗаявкаНаВозврат.Соглашение.КалендарьВозвратаТары
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПроизводственныеКалендари.ПустаяСсылка)
		|	КОНЕЦ КАК КалендарьВозвратаТары,
		|	ВЫБОР
		|		КОГДА &ИспользоватьСоглашенияСКлиентами 
		|			ТОГДА ЗаявкаНаВозврат.Соглашение.РассчитыватьДатуВозвратаТарыПоКалендарю
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РассчитыватьДатуВозвратаТарыПоКалендарю,
		|	ЗаявкаНаВозврат.Статус               КАК СтатусДокумента,
		|	НЕ ЗаявкаНаВозврат.Проведен          КАК ЕстьОшибкиПроведен,
		|
		|	ЗаявкаНаВозврат.БанковскийСчет                 КАК БанковскийСчетОрганизации,
		|	ЗаявкаНаВозврат.БанковскийСчетКонтрагента      КАК БанковскийСчетКонтрагента,
		|	ЗаявкаНаВозврат.Грузоотправитель               КАК Грузоотправитель,
		|	ЗаявкаНаВозврат.Грузополучатель                КАК Грузополучатель,
		|	ЗаявкаНаВозврат.БанковскийСчетГрузоотправителя КАК БанковскийСчетГрузоотправителя,
		|	ЗаявкаНаВозврат.БанковскийСчетГрузополучателя  КАК БанковскийСчетГрузополучателя,
		|
		|	ЗаявкаНаВозврат.СкидкиНаценки.(
		|		КлючСвязи,
		|		СкидкаНаценка,
		|		Сумма
		|	) КАК СкидкиНаценки,
		|	ЗаявкаНаВозврат.АдресДоставкиЗначенияПолей     КАК АдресДоставкиЗначенияПолей,
		|	ВЫБОР КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
		|		И ЗаявкаНаВозврат.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика) ТОГДА
		|		ЗаявкаНаВозврат.СпособДоставки
		|	КОНЕЦ                                          КАК СпособДоставки,
		|
		|	ВЫБОР КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
		|		И ЗаявкаНаВозврат.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика) ТОГДА
		|		ЗаявкаНаВозврат.ПеревозчикПартнер
		|	КОНЕЦ                                          КАК ПеревозчикПартнер,
		|
		|	ВЫБОР КОГДА НЕ &ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками
		|		И ЗаявкаНаВозврат.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчика) ТОГДА
		|		ЗаявкаНаВозврат.ДополнительнаяИнформацияПоДоставке
		|	КОНЕЦ                                          КАК ДополнительнаяИнформацияПоДоставке,
		|
		|	ЗаявкаНаВозврат.ПорядокРасчетов                КАК ПорядокРасчетов,
		|	ЗаявкаНаВозврат.НаправлениеДеятельности        КАК НаправлениеДеятельности
		|
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозврат
		|ГДЕ
		|	ЗаявкаНаВозврат.Ссылка = &ДокументОснование
		|";
		
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запрос.УстановитьПараметр("ИспользоватьСоглашенияСКлиентами", ИспользоватьСоглашенияСКлиентами);
		Запрос.УстановитьПараметр("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками",
			ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками"));
		
		РеквизитыЗаказа = Запрос.Выполнить().Выбрать();
		РеквизитыЗаказа.Следующий();
		
		Документы.ЗаявкаНаВозвратТоваровОтКлиента.ПроверитьВозможностьВводаНаОсновании(
			РеквизитыЗаказа.ЗаказКлиента,
			РеквизитыЗаказа.СтатусДокумента,
			РеквизитыЗаказа.ЕстьОшибкиПроведен);
		
		// Заполнение шапки.
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаказа);
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
			Если НЕ ЗначениеЗаполнено(Дата) Тогда
				Дата = ТекущаяДатаСеанса();
			КонецЕсли;
		КонецЕсли;
		ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
			ЭтотОбъект,
			РеквизитыЗаказа.СрокВозвратаМногооборотнойТары,
			РеквизитыЗаказа.РассчитыватьДатуВозвратаТарыПоКалендарю,
			РеквизитыЗаказа.КалендарьВозвратаТары);
		
		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			МассивСкладов = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Склад");
		КонецЕсли;
		
	ИначеЕсли ТипОснования = Тип("Массив") Тогда
		
		// Заполнение шапки.
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаказа);
		Валюта = ВалютаВзаиморасчетов;
		БанковскийСчетОрганизации = РеквизитыЗаказа.БанковскийСчет;
		ДатаВозвратаМногооборотнойТары = МногооборотнаяТараСервер.РассчитатьДатуВозвратаМногооборотнойТары(
			ЭтотОбъект,
			РеквизитыЗаказа.СрокВозвратаМногооборотнойТары,
			РеквизитыЗаказа.РассчитыватьДатуВозвратаТарыПоКалендарю,
			РеквизитыЗаказа.КалендарьВозвратаТары);
		
		ПродажиСервер.ЗаполнитьБанковскиеСчетаПоДоговору(Договор, БанковскийСчетОрганизации, БанковскийСчетКонтрагента);
		Если Не ЗначениеЗаполнено(БанковскийСчетОрганизации) Тогда
			СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
			СтруктураПараметров.Организация    		= Организация;
			СтруктураПараметров.БанковскийСчет		= БанковскийСчетОрганизации;
			БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(БанковскийСчетКонтрагента) Тогда
			БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
		КонецЕсли;
		
		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("МассивДокументов", ДокументОснование);
			Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаказыОстатки.Склад КАК Склад
			|ИЗ
			|	РегистрНакопления.ЗаказыКлиентов.Остатки(
			|		,
			|		ЗаказКлиента В (&МассивДокументов)
			|) КАК ЗаказыОстатки
			|";
			
			РезультатЗапросаПоСкладам = Запрос.Выполнить();
			МассивСкладов = РезультатЗапросаПоСкладам.Выгрузить().ВыгрузитьКолонку("Склад");
			Склад = РеквизитыЗаказа.СкладОтгрузки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РеализацияПоЗаказам = Истина;
	
	Если ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
		Если ИспользоватьСоглашенияСКлиентами И ЗначениеЗаполнено(Соглашение) Тогда
			УсловияПродаж = ПродажиСервер.ПолучитьУсловияПродаж(Соглашение);
			ФормаОплаты   = УсловияПродаж.ФормаОплаты;
			
			СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
			СтруктураПараметров.Организация    			= Организация;
			СтруктураПараметров.НаправлениеДеятельности	= НаправлениеДеятельности;
			СтруктураПараметров.ФормаОплаты				= ФормаОплаты;

			Касса = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
			ЭтапыОплатыСервер.ЗаполнитьДатуПлатежаПоУмолчанию(ЭтотОбъект, УсловияПродаж.ГрафикОплаты);
		КонецЕсли;
	Иначе
		ЗаполнитьДатуПлатежаПоОснованию();
	КонецЕсли;
	
	// Заполнение т.ч. товары.
	Если Не ЗначениеЗаполнено(СкладОтгрузки) Тогда
		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			// Только услуги
			Если МассивСкладов.Количество() = 0 Тогда
				ЗаполнятьПоОстаткам = Истина;
			// Услуги или товары
			ИначеЕсли МассивСкладов.Количество() = 1 Тогда
				СкладОтгрузки = МассивСкладов[0];
				Склад = СкладОтгрузки;
				ЗаполнятьПоОстаткам = Истина;
			// Услуги и товары
			ИначеЕсли МассивСкладов.Количество() = 2 Тогда
				Если Не ЗначениеЗаполнено(МассивСкладов[0]) Или
					Не ЗначениеЗаполнено(МассивСкладов[1]) Тогда
					СкладОтгрузки = ?(ЗначениеЗаполнено(МассивСкладов[0]), МассивСкладов[0], МассивСкладов[1]);
					Склад = СкладОтгрузки;
					ЗаполнятьПоОстаткам = Истина;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ЗаполнятьПоОстаткам = Истина;
			СкладОтгрузки = Склад;
		КонецЕсли;
	Иначе
		Если РеквизитыЗаказа.ЗапрещеноВыбиратьГруппуСкладов Тогда
			Склад = СкладОтгрузки;
		КонецЕсли;
		ЗаполнятьПоОстаткам = Истина;
	КонецЕсли;
	
	Если ЗаполнятьПоОстаткам Тогда
		
		Если ТипОснования = Тип("Массив") Тогда
			МассивЗаказов = ДокументОснование;
		Иначе
			МассивЗаказов = Новый Массив();
			МассивЗаказов.Добавить(ЗаказКлиента);
		КонецЕсли;
		
		ПараметрыЗаполнения = Новый Структура;
		ПараметрыЗаполнения.Вставить("ВариантОформления", ВариантОформления);
		ПараметрыЗаполнения.Вставить("ПараметрыОформления", ПараметрыОформления);
		
		Документы.РеализацияТоваровУслуг.ЗаполнитьПоОстаткамЗаказов(
			ЭтотОбъект,
			Товары,
			СкидкиНаценки,
			?(СкладОтгрузки=Неопределено, Справочники.Склады.ПустаяСсылка(), СкладОтгрузки),
			МассивЗаказов,
			ПараметрыЗаполнения);
		ЭтотОбъект.ВариантОформленияПродажи = ?(ЗначениеЗаполнено(ВариантОформления), 
			ВариантОформления,
			Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг);
		ЗаказыСервер.ЗаполнитьЗаказВШапкеПоЗаказамВТабличнойЧасти(ЗаказКлиента, Товары, "ЗаказКлиента");
		
		ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РеализацияТоваровУслуг);
		НоменклатураСервер.ЗаполнитьСерииПоFEFO(ЭтотОбъект,ПараметрыУказанияСерий, Ложь);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	КонецЕсли;
	
	СтруктураОснование = Документы.РеализацияТоваровУслуг.СтруктураОснованияДляПечати(ЭтотОбъект);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураОснование);
	
	
	Если ТипОснования = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Договор = ЭтотОбъект.Договор;
		ДопустимыйКредит = ЭтотОбъект.Договор.ДопустимаяСуммаЗадолженности;


		Запрос = Новый Запрос("
			|ВЫБРАТЬ
			//jadmin
			|	РасчетыСКлиентамиОстатки.СуммаОстаток КАК СуммаОстаток,
			
			|	РасчетыСКлиентамиОстатки.СуммаОстаток + РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток КАК ОстатокДолга
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами.Остатки(
			|		,
			|		АналитикаУчетаПоПартнерам В (
			|			ВЫБРАТЬ
			|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
			|			ИЗ
			|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
			|			ГДЕ
			|				АналитикаПоПартнерам.Договор = &Договор
			|			)
			|	) КАК РасчетыСКлиентамиОстатки
			|");
			Запрос.УстановитьПараметр("Договор", Договор);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				//ОстатокДопустимогоКредита = ДопустимыйКредит - Выборка.ОстатокДолга;
				ОстатокДопустимогоКредита = ДопустимыйКредит - Выборка.СуммаОстаток; //jadmin Допустимый кредит 
			Иначе
				ОстатокДопустимогоКредита = ДопустимыйКредит;
			КонецЕсли;
			
			
			Если ОстатокДопустимогоКредита <> 0 Тогда
				//Если Объект.СуммаДокумента > ОстатокДопустимогоКредита Тогда
				Если ЭтотОбъект.Товары.Итог("СуммаСНДС") > ОстатокДопустимогоКредита Тогда
					//Режим = РежимДиалогаВопрос.ДаНет;
					//Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма,Параметры);
					//ПоказатьВопрос(Оповещение, НСтр("ru = 'Сумма по накладной превышает остаток допустимого кредита.  Продолжать заполнение?'"), Режим, 0);			
					Сообщить("Сумма по накладной превышает остаток допустимого кредита");			

				Иначе
					
				КонецЕсли;
			КонецЕсли; 	
			
			
		////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
		
		Если ЭтотОбъект.РеализацияПоЗаказам Тогда
			
			ЕстьОрдераНеВСтатусеКОтгрузке = Ложь;
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ЗаказКлиента) Тогда
				ЗаказОбъект = ЭтотОбъект.ЗаказКлиента.Ссылка.ПолучитьОбъект();
				Попытка
					ЗаказОбъект.ВыписанаНакладная = ЭтотОбъект.Ссылка;
					ЗаказОбъект.Записать();
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	РасходныйОрдерНаТоварыОснования.Ссылка КАК Ссылка
					|ИЗ
					|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
					|ГДЕ
					|	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ
					|	И РасходныйОрдерНаТоварыОснования.Ссылка.Проведен = ИСТИНА";
					
					Запрос.УстановитьПараметр("ВыбЗаказ", ЭтотОбъект.ЗаказКлиента.Ссылка);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Если ВыборкаДетальныеЗаписи.Ссылка.Статус <> Перечисления.СтатусыРасходныхОрдеров.Котгрузке Тогда
							ЕстьОрдераНеВСтатусеКОтгрузке = Истина;
						КонецЕсли; 
					КонецЦикла;	 
					
				Исключение
					//ВызватьИсключение;	 
				КонецПопытки; 
				
	
				
			Иначе
				ТЗ_Заказов = ЭтотОбъект.Товары.Выгрузить();
				ТЗ_Заказов.Свернуть("ЗаказКлиента","");
				
				Для каждого СтрокаТЗ Из ТЗ_Заказов Цикл
					ЗаказОбъект = СтрокаТЗ.ЗаказКлиента.Ссылка.ПолучитьОбъект();
					Попытка
						ЗаказОбъект.ВыписанаНакладная = ЭтотОбъект.Ссылка;
						ЗаказОбъект.Записать();
						
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	РасходныйОрдерНаТоварыОснования.Ссылка КАК Ссылка
						|ИЗ
						|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыОснования
						|ГДЕ
						|	РасходныйОрдерНаТоварыОснования.Распоряжение = &ВыбЗаказ
						|	И РасходныйОрдерНаТоварыОснования.Ссылка.Проведен = ИСТИНА";
						
						Запрос.УстановитьПараметр("ВыбЗаказ", СтрокаТЗ.ЗаказКлиента.Ссылка);
						
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							Если ВыборкаДетальныеЗаписи.Ссылка.Статус <> Перечисления.СтатусыРасходныхОрдеров.Котгрузке Тогда
								ЕстьОрдераНеВСтатусеКОтгрузке = Истина;
							КонецЕсли; 
						КонецЦикла;	 
						
						
					Исключение
						ВызватьИсключение;	 
					КонецПопытки; 
				КонецЦикла; 
				
			КонецЕсли; 
			
			Если ЕстьОрдераНеВСтатусеКОтгрузке = Истина Тогда
				Сообщить("Существуют ордера без статуса ""К отгрузке""");
				Возврат;
			КонецЕсли; 
			
		КонецЕсли;	
		
	   КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииСделкиПоПродаже(Знач ДокументОснование)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СделкиСКлиентами.Ссылка КАК Сделка,
		|	СделкиСКлиентами.Партнер КАК Партнер,
		|	СделкиСКлиентами.СоглашениеСКлиентом КАК Соглашение,
		|	СделкиСКлиентамиПартнерыИКонтактныеЛица.КонтактноеЛицо КАК КонтактноеЛицо
		|ИЗ
		|	Справочник.СделкиСКлиентами КАК СделкиСКлиентами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СделкиСКлиентами.ПартнерыИКонтактныеЛица КАК СделкиСКлиентамиПартнерыИКонтактныеЛица
		|		ПО (СделкиСКлиентамиПартнерыИКонтактныеЛица.Ссылка = СделкиСКлиентами.Ссылка)
		|			И (СделкиСКлиентамиПартнерыИКонтактныеЛица.Партнер = СделкиСКлиентами.Партнер)
		|			И (СделкиСКлиентамиПартнерыИКонтактныеЛица.КонтактноеЛицо <> ЗНАЧЕНИЕ(Справочник.КонтактныеЛицаПартнеров.ПустаяСсылка))
		|ГДЕ
		|	СделкиСКлиентами.Ссылка = &ДокументОснование");
		
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСделкиПоПродаже(Выборка.Партнер);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
		Если ЗначениеЗаполнено(Соглашение) Тогда
			ЗаполнитьУсловияПродажПоСоглашению();
		Иначе
			ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииИндивидуальногоСоглашенияСКлиентом(Знач ДокументОснование)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СоглашениеСКлиентом.Ссылка                КАК Соглашение,
		|	СоглашениеСКлиентом.Партнер               КАК Партнер,
		|	СоглашениеСКлиентом.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	СоглашениеСКлиентом.КонтактноеЛицо        КАК КонтактноеЛицо,
		|
		|	СоглашениеСКлиентом.Статус                КАК СтатусДокумента,
		|	ВЫБОР
		|		КОГДА
		|			СоглашениеСКлиентом.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|		ТОГДА
		|			ЛОЖЬ
		|		ИНАЧЕ
		|			ИСТИНА
		|	КОНЕЦ КАК ЕстьОшибкиСтатус,
		|	СоглашениеСКлиентом.Типовое КАК ЕстьОшибкиТиповое
		|
		|ИЗ
		|	Справочник.СоглашенияСКлиентами  КАК СоглашениеСКлиентом
		|ГДЕ
		|	СоглашениеСКлиентом.Ссылка = &ДокументОснование
		|");
		
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	
	МассивДопустимыхСтатусов = Новый Массив();
	МассивДопустимыхСтатусов.Добавить(Перечисления.СтатусыСоглашенийСКлиентами.Действует);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОснованииСоглашения(Выборка.ЕстьОшибкиТиповое);
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Выборка.Соглашение,
		Выборка.СтатусДокумента,
		,
		Выборка.ЕстьОшибкиСтатус,
		МассивДопустимыхСтатусов);
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	ЗаполнитьУсловияПродажПоСоглашению();
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииВозвратаТоваровОтКлиента(Знач ДокументОснование)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВозвратТоваровОтКлиента.Ссылка               КАК Ссылка,
	|	ВозвратТоваровОтКлиента.Организация          КАК Организация,
	|	ВозвратТоваровОтКлиента.Партнер              КАК Партнер,
	|	ВозвратТоваровОтКлиента.Контрагент           КАК Контрагент,
	|	ВозвратТоваровОтКлиента.Сделка               КАК Сделка,
	|	ВозвратТоваровОтКлиента.Соглашение           КАК Соглашение,
	|	ВозвратТоваровОтКлиента.Валюта               КАК Валюта,
	|	ВозвратТоваровОтКлиента.Валюта               КАК ВалютаВзаиморасчетов,
	|	ВозвратТоваровОтКлиента.СуммаДокумента       КАК СуммаДокумента,
	|	ВозвратТоваровОтКлиента.СуммаДокумента       КАК СуммаВзаиморасчетов,
	|	ВозвратТоваровОтКлиента.Склад                КАК Склад,
	|	ВозвратТоваровОтКлиента.ЦенаВключаетНДС      КАК ЦенаВключаетНДС,
	|	ВозвратТоваровОтКлиента.НалогообложениеНДС   КАК НалогообложениеНДС,
	|	ВозвратТоваровОтКлиента.Договор              КАК Договор,
	|	ВозвратТоваровОтКлиента.ВозвратПереданнойМногооборотнойТары КАК ВернутьМногооборотнуюТару,
	|	ВозвратТоваровОтКлиента.ПредусмотренЗалогЗаТару КАК ТребуетсяЗалогЗаТару,
	|	ВозвратТоваровОтКлиента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВозвратТоваровОтКлиента.ПорядокОплаты КАК ПорядокОплаты,
	|
	|	ВЫБОР КОГДА ВозвратТоваровОтКлиента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера) ТОГДА
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|	НЕ ВозвратТоваровОтКлиента.Проведен КАК ЕстьОшибкиПроведен,
	|
	|	ВозвратТоваровОтКлиента.Товары.(
	|		Номенклатура             КАК Номенклатура,
	|		Характеристика           КАК Характеристика,
	|		Упаковка                 КАК Упаковка,
	|		КоличествоУпаковок       КАК КоличествоУпаковок,
	|		Количество               КАК Количество,
	|		Цена                     КАК Цена,
	|		Сумма                    КАК Сумма,
	|		СтавкаНДС                КАК СтавкаНДС,
	|		СуммаНДС                 КАК СуммаНДС,
	|		СуммаСНДС                КАК СуммаСНДС,
	|		Ссылка.Склад             КАК Склад
	|	) КАК Товары,
	|
	|	ВозвратТоваровОтКлиента.Серии.(
	|		Номенклатура             КАК Номенклатура,
	|		Характеристика           КАК Характеристика,
	|		Серия                    КАК Серия,
	|		Количество               КАК Количество
	|	) КАК Серии
	|
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	|ГДЕ
	|	ВозвратТоваровОтКлиента.Ссылка = &ДокументОснование";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Выборка.Ссылка,
		,
		Выборка.ЕстьОшибкиПроведен,);

	// Заполнение шапки и табличных частей
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	Товары.Загрузить(Выборка.Товары.Выгрузить());
	Серии.Загрузить(Выборка.Серии.Выгрузить());

КонецПроцедуры

Процедура ЗаполнитьДокументПоОтбору(Знач ДанныеЗаполнения)

	Если ДанныеЗаполнения.Свойство("Партнер") Тогда
		
		Партнер = ДанныеЗаполнения.Партнер;
		
		Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
			ЗаполнитьУсловияПродажПоУмолчанию();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ВариантОформленияПродажи") Тогда
		ВариантОформленияПродажи = ДанныеЗаполнения.ВариантОформленияПродажи;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииПоступленияТоваровУслуг(ПоступлениеТоваровУслуг)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование",ПоступлениеТоваровУслуг);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПоступлениеТоваровУслуг.Организация КАК Организация,
	|	ПоступлениеТоваровУслуг.Сделка КАК Сделка,
	// HS неправильный синоним
	//|	ПоступлениеТоваровУслуг.Склад КАК СкладОтправитель,
	|	ПоступлениеТоваровУслуг.Склад КАК Склад,
	|	ПоступлениеТоваровУслуг.Подразделение КАК Подразделение,
	|	ВЫБОР 
	|		КОГДА ПоступлениеТоваровУслуг.НаправлениеДеятельности.УчетДоходов 
	|			ТОГДА ПоступлениеТоваровУслуг.НаправлениеДеятельности
	|		ИНАЧЕ Значение(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ  КАК НаправлениеДеятельности,
	|
	|	НЕ ПоступлениеТоваровУслуг.Проведен КАК ЕстьОшибкиПроведен
	|
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Ссылка = &ДокументОснование
	|
	|////////////////////////////////////////////////
	|;
	|ВЫБРАТЬ
	|	Товары.Номенклатура        КАК Номенклатура,
	|	Товары.Характеристика      КАК Характеристика,
	|	Товары.Назначение          КАК Назначение,
	|	Товары.Склад               КАК Склад,
	|	Товары.Серия               КАК Серия,
	|	Товары.СтатусУказанияСерий КАК СтатусУказанияСерий,
	|	Товары.Количество          КАК Количество,
	|	Товары.КоличествоУпаковок  КАК КоличествоУпаковок,
	|	Товары.Упаковка            КАК Упаковка,
	|	Товары.СтавкаНДС           КАК СтавкаНДС
	|
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Серии.Номенклатура          КАК Номенклатура,
	|	Серии.Характеристика        КАК Характеристика,
	|	Серии.Назначение            КАК Назначение,
	|	Серии.Склад                 КАК Склад,
	|	Серии.Серия                 КАК Серия,
	|	Серии.Количество            КАК Количество
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Серии КАК Серии
	|ГДЕ
	|	Серии.Ссылка = &ДокументОснование";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	Шапка = ПакетРезультатов[0].Выбрать();
	
	Если Не Шапка.Следующий() Тогда

		ТекстОшибки = НСтр("ru='Документ %Документ% не содержит товаров. Ввод на основании документа запрещен.'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Документ%", ПоступлениеТоваровУслуг);
	
		ВызватьИсключение ТекстОшибки;
		
	КонецЕсли;
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		Шапка.Ссылка,
		,
		Шапка.ЕстьОшибкиПроведен,);
	
	// Заполнение шапки.
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Шапка);
	ДокументОснование = ПоступлениеТоваровУслуг;
	
	// Разбиение строк, заполнение серий со статусом 10.
	ТоварыОснования = ПакетРезультатов[1].Выгрузить();
	ИндексыСтрок = Новый Массив();
	Для Каждого СтрокаТовары Из ТоварыОснования Цикл
		
		Если СтрокаТовары.СтатусУказанияСерий = 10 Тогда
			ИндексыСтрок.Вставить(0, ТоварыОснования.Индекс(СтрокаТовары));
		КонецЕсли;
		
	КонецЦикла;
	
	СерииОснования = ПакетРезультатов[2].Выгрузить();
	
	Если ИндексыСтрок.Количество() > 0 Тогда
		
		КлючСерии = "Номенклатура, Характеристика, Склад, Назначение";
		ОбеспечениеСервер.ПеренестиСерииИзТаблицыВСтроки(ТоварыОснования, ИндексыСтрок, СерииОснования, КлючСерии);
		
	КонецЕсли;
	
	// Заполнение табличной части товары.
	Товары.Загрузить(ТоварыОснования);
	
	Для Каждого СтрокаСерии Из СерииОснования Цикл
		Если СтрокаСерии.Количество > 0 Тогда
			НоваяСтрока = Серии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСерии);
		КонецЕсли;
	КонецЦикла;
	
	ИспользованиеСкладов = Новый Структура("ИспользуютсяСкладыЗакупки, ИспользуютсяСкладыПродажи",
						ПолучитьФункциональнуюОпцию("ИспользоватьСкладыВТабличнойЧастиДокументовЗакупки"),
						ПолучитьФункциональнуюОпцию("ИспользоватьСкладыВТабличнойЧастиДокументовПродажи"));

	Если ИспользованиеСкладов.ИспользуютсяСкладыЗакупки И Не ИспользованиеСкладов.ИспользуютсяСкладыПродажи Тогда

		МассивСкладов = ОбщегоНазначенияУТ.УдалитьПовторяющиесяЭлементыМассива(Товары.ВыгрузитьКолонку("Склад"));
		
		Если МассивСкладов.Количество() = 1 Тогда
			Склад = МассивСкладов[0];
		Иначе
			Склад = Справочники.Склады.ПустаяСсылка();
		КонецЕсли;

	КонецЕсли;
	
	// Заполнение статусов указания серий
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РеализацияТоваровУслуг);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ЭтотОбъект, ПараметрыУказанияСерий);

КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииАктаОРасхожденияхПослеОтгрузки(Знач ДанныеЗаполнения)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реализация.АдресДоставки,
	|	Реализация.БанковскийСчетОрганизации,
	|	Реализация.БанковскийСчетКонтрагента,
	|	Реализация.БанковскийСчетГрузоотправителя,
	|	Реализация.БанковскийСчетГрузополучателя,
	|	Реализация.Валюта,
	|	Реализация.ВалютаВзаиморасчетов,
	|	Реализация.Грузоотправитель,
	|	Реализация.Грузополучатель,
	|	Реализация.ДатаРаспоряжения,
	|	Реализация.ДоверенностьВыдана,
	|	Реализация.ДоверенностьДата,
	|	Реализация.ДоверенностьЛицо,
	|	Реализация.ДоверенностьНомер,
	|	Реализация.ЗаказКлиента,
	|	Реализация.Организация,
	|	Реализация.Контрагент,
	|	Реализация.НалогообложениеНДС,
	|	Реализация.Партнер,
	|	Реализация.Подразделение,
	|	Реализация.Сделка,
	|	Реализация.СкидкиРассчитаны,
	|	Реализация.Склад,
	|	Реализация.Соглашение,
	|	Реализация.СуммаВзаиморасчетов,
	|	Реализация.ФормаОплаты,
	|	Реализация.ХозяйственнаяОперация,
	|	Реализация.ЦенаВключаетНДС,
	|	Реализация.Касса,
	|	Реализация.Отпустил,
	|	Реализация.ОтпустилДолжность,
	|	Реализация.РеализацияПоЗаказам,
	|	Реализация.ГруппаФинансовогоУчета,
	|	Реализация.КартаЛояльности,
	|	Реализация.Договор,
	|	Реализация.Основание,
	|	Реализация.СпособДоставки,
	|	Реализация.ЗонаДоставки,
	|	Реализация.АдресДоставкиЗначенияПолей,
	|	Реализация.ПеревозчикПартнер,
	|	Реализация.ВремяДоставкиС,
	|	Реализация.ВремяДоставкиПо,
	|	Реализация.АдресДоставкиПеревозчика,
	|	Реализация.АдресДоставкиПеревозчикаЗначенияПолей,
	|	Реализация.ДополнительнаяИнформацияПоДоставке,
	|	Реализация.КонтактноеЛицо,
	|	Реализация.Руководитель,
	|	Реализация.ГлавныйБухгалтер,
	|	Реализация.ПорядокРасчетов,
	|	Реализация.ВернутьМногооборотнуюТару,
	|	Реализация.ДатаВозвратаМногооборотнойТары,
	|	Реализация.СостояниеЗаполненияМногооборотнойТары,
	|	Реализация.ТребуетсяЗалогЗаТару,
	|	Реализация.ОснованиеДата,
	|	Реализация.ОснованиеНомер,
	|	Реализация.НаправлениеДеятельности КАК НаправлениеДеятельности
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Реализация
	|ГДЕ
	|	Реализация.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеОтгрузкиТовары.Номенклатура КАК Номенклатура,
	|	АктОРасхожденияхПослеОтгрузкиТовары.Характеристика КАК Характеристика,
	|	АктОРасхожденияхПослеОтгрузкиТовары.Назначение КАК Назначение,
	|	АктОРасхожденияхПослеОтгрузкиТовары.Серия КАК Серия,
	|	АктОРасхожденияхПослеОтгрузкиТовары.Упаковка КАК Упаковка,
	|	АктОРасхожденияхПослеОтгрузкиТовары.Цена КАК Цена,
	|	АктОРасхожденияхПослеОтгрузкиТовары.СтавкаНДС КАК СтавкаНДС,
	|	АктОРасхожденияхПослеОтгрузкиТовары.Склад КАК Склад,
	|	АктОРасхожденияхПослеОтгрузкиТовары.КоличествоПоДокументу - АктОРасхожденияхПослеОтгрузкиТовары.Количество КАК Количество,
	|	АктОРасхожденияхПослеОтгрузкиТовары.КоличествоУпаковокПоДокументу - АктОРасхожденияхПослеОтгрузкиТовары.КоличествоУпаковок КАК КоличествоУпаковок,
	|	АктОРасхожденияхПослеОтгрузкиТовары.СуммаПоДокументу - АктОРасхожденияхПослеОтгрузкиТовары.Сумма КАК Сумма,
	|	АктОРасхожденияхПослеОтгрузкиТовары.СуммаНДСПоДокументу - АктОРасхожденияхПослеОтгрузкиТовары.СуммаНДС КАК СуммаНДС,
	|	АктОРасхожденияхПослеОтгрузкиТовары.СуммаСНДСПоДокументу - АктОРасхожденияхПослеОтгрузкиТовары.СуммаСНДС КАК СуммаСНДС,
	|	АктОРасхожденияхПослеОтгрузкиТовары.ЗаказКлиента,
	|	АктОРасхожденияхПослеОтгрузкиТовары.КодСтроки
	|ПОМЕСТИТЬ ТоварыРеализации
	|ИЗ
	|	Документ.АктОРасхожденияхПослеОтгрузки.Товары КАК АктОРасхожденияхПослеОтгрузкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеОтгрузкиТовары.Ссылка = &АктОРасхождениях
	|	И АктОРасхожденияхПослеОтгрузкиТовары.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ТребуетсяДопоставка)
	|	И АктОРасхожденияхПослеОтгрузкиТовары.Реализация = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыРеализации.Номенклатура,
	|	ТоварыРеализации.Характеристика,
	|	ТоварыРеализации.Назначение,
	|	ТоварыРеализации.Серия,
	|	ТоварыРеализации.Упаковка,
	|	ТоварыРеализации.Цена,
	|	ТоварыРеализации.СтавкаНДС,
	|	ТоварыРеализации.Склад,
	|	ТоварыРеализации.Количество,
	|	ТоварыРеализации.КоличествоУпаковок,
	|	ТоварыРеализации.Сумма,
	|	ТоварыРеализации.СуммаНДС,
	|	ТоварыРеализации.СуммаСНДС,
	|	ТоварыРеализации.ЗаказКлиента,
	|	ТоварыРеализации.КодСтроки
	|ИЗ
	|	ТоварыРеализации КАК ТоварыРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыРеализации.ЗаказКлиента
	|ИЗ
	|	ТоварыРеализации КАК ТоварыРеализации
	|ГДЕ
	|	ТоварыРеализации.ЗаказКлиента <> НЕОПРЕДЕЛЕНО";
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения.ОснованиеАкта);
	Запрос.УстановитьПараметр("АктОРасхождениях", ДанныеЗаполнения.АктОРасхождениях);
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаШапка = ПакетЗапросов[0].Выбрать();
	ВыборкаШапка.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	ДопоставкаПоРеализации = ДанныеЗаполнения.ОснованиеАкта;
	
	Товары.Загрузить(ПакетЗапросов[2].Выгрузить());
	
	ВыборкаЗаказы = ПакетЗапросов[3].Выбрать();
	ЭлементовВВыборкеЗаказы = ВыборкаЗаказы.Количество();
	Если ЭлементовВВыборкеЗаказы > 0 Тогда
		РеализацияПоЗаказам = Истина;
		Если ЭлементовВВыборкеЗаказы = 1 Тогда
			ВыборкаЗаказы.Следующий();
			ЗаказКлиента = ВыборкаЗаказы.ЗаказКлиента;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументНаОснованииАктаОРасхожденияхПослеПриемки(Знач ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемки.Ссылка        КАК АктОРасхождениях,
	|	ВозвратТоваровОтКлиента.Ссылка             КАК ДопоставкаПоРеализации,
	|	ВозвратТоваровОтКлиента.Валюта             КАК Валюта,
	|	ВозвратТоваровОтКлиента.Организация        КАК Организация,
	|	ВозвратТоваровОтКлиента.Контрагент         КАК Контрагент,
	|	ВозвратТоваровОтКлиента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВозвратТоваровОтКлиента.Подразделение      КАК Подразделение,
	|	ВозвратТоваровОтКлиента.Склад              КАК Склад,
	|	ВозвратТоваровОтКлиента.Партнер            КАК Партнер,
	|	ВозвратТоваровОтКлиента.Соглашение         КАК Соглашение,
	|
	|	ВЫБОР
	|		КОГДА
	|			ВозвратТоваровОтКлиента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента)
	|			ИЛИ ВозвратТоваровОтКлиента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|		ТОГДА
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|	ВозвратТоваровОтКлиента.ЦенаВключаетНДС                     КАК ЦенаВключаетНДС,
	|	ВозвратТоваровОтКлиента.Договор                             КАК Договор,
	|	ВозвратТоваровОтКлиента.КонтактноеЛицо                      КАК КонтактноеЛицо,
	|	ВозвратТоваровОтКлиента.Руководитель                        КАК Руководитель,
	|	ВозвратТоваровОтКлиента.ВозвратПереданнойМногооборотнойТары КАК ВернутьМногооборотнуюТару,
	|	ВозвратТоваровОтКлиента.ПредусмотренЗалогЗаТару             КАК ТребуетсяЗалогЗаТару,
	|	НЕ АктОРасхожденияхПослеПриемки.Проведен                    КАК ЕстьОшибкиПроведенАктОРасхождениях,
	|	АктОРасхожденияхПослеПриемки.Статус                         КАК СтатусАктаОРасхождениях,
	|	НЕ АктОРасхожденияхПослеПриемки.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.КВыполнению), ЗНАЧЕНИЕ(Перечисление.СтатусыАктаОРасхождениях.Отработано)) КАК ЕстьОшибкиСтатусАкт,
	|	НЕ ВозвратТоваровОтКлиента.Проведен                         КАК ЕстьОшибкиПроведенДокументВозврата
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВозвратТоваровОтКлиента.Ссылка = &ДокументОснование
	|	И АктОРасхожденияхПослеПриемки.Ссылка = &АктОРасхождениях
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемки.Номенклатура           КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемки.Характеристика         КАК Характеристика,
	|	АктОРасхожденияхПослеПриемки.Серия                  КАК Серия,
	|	АктОРасхожденияхПослеПриемки.СтатусУказанияСерий    КАК СтатусУказанияСерий,
	|	АктОРасхожденияхПослеПриемки.Упаковка               КАК Упаковка,
	|	АктОРасхожденияхПослеПриемки.Цена                   КАК Цена,
	|	АктОРасхожденияхПослеПриемки.СтавкаНДС              КАК СтавкаНДС,
	|	АктОРасхожденияхПослеПриемки.КодСтроки              КАК КодСтроки,
	|
	|	СУММА(АктОРасхожденияхПослеПриемки.Количество - АктОРасхожденияхПослеПриемки.КоличествоПоДокументу)                 КАК Количество,
	|	СУММА(АктОРасхожденияхПослеПриемки.КоличествоУпаковок - АктОРасхожденияхПослеПриемки.КоличествоУпаковокПоДокументу) КАК КоличествоУпаковок,
	|	СУММА(АктОРасхожденияхПослеПриемки.Сумма - АктОРасхожденияхПослеПриемки.СуммаПоДокументу)                           КАК Сумма,
	|	СУММА(АктОРасхожденияхПослеПриемки.СуммаНДС - АктОРасхожденияхПослеПриемки.СуммаНДСПоДокументу)                     КАК СуммаНДС,
	|	СУММА(АктОРасхожденияхПослеПриемки.СуммаСНДС - АктОРасхожденияхПослеПриемки.СуммаСНДСПоДокументу)                   КАК СуммаСНДС
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемки
	|ГДЕ
	|	АктОРасхожденияхПослеПриемки.Ссылка = &АктОРасхождениях
	|	И АктОРасхожденияхПослеПриемки.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть)
	|	И АктОРасхожденияхПослеПриемки.ДокументОснование = &ДокументОснование
	|	И АктОРасхожденияхПослеПриемки.КоличествоУпаковок - АктОРасхожденияхПослеПриемки.КоличествоУпаковокПоДокументу > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	СтатусУказанияСерий,
	|	Упаковка,
	|	Цена,
	|	СтавкаНДС,
	|	КодСтроки
	|	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиСерии.Номенклатура                                                                 КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиСерии.Характеристика                                                               КАК Характеристика,
	|	АктОРасхожденияхПослеПриемкиСерии.Серия                                                                        КАК Серия,
	|	СУММА(АктОРасхожденияхПослеПриемкиСерии.Количество - АктОРасхожденияхПослеПриемкиСерии.КоличествоПоДокументу)  КАК Количество
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Серии КАК АктОРасхожденияхПослеПриемкиСерии
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиСерии.Ссылка = &АктОРасхождениях
	|	И АктОРасхожденияхПослеПриемкиСерии.Действие = ЗНАЧЕНИЕ(Перечисление.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ОформитьПерепоставленноеИВернуть)
	|	И АктОРасхожденияхПослеПриемкиСерии.ДокументОснование = &ДокументОснование
	|	И АктОРасхожденияхПослеПриемкиСерии.Количество - АктОРасхожденияхПослеПриемкиСерии.КоличествоПоДокументу > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОРасхожденияхПослеПриемкиСерии.Номенклатура,
	|	АктОРасхожденияхПослеПриемкиСерии.Характеристика,
	|	АктОРасхожденияхПослеПриемкиСерии.Серия
	|
	|";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения.ОснованиеАкта);
	Запрос.УстановитьПараметр("АктОРасхождениях",  ДанныеЗаполнения.АктОРасхождениях);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаШапка = ПакетЗапросов[0].Выбрать();
	
	ВыборкаШапка.Следующий();
	
	// По документу возврата
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		ВыборкаШапка.ДопоставкаПоРеализации,
		,
		ВыборкаШапка.ЕстьОшибкиПроведенДокументВозврата,
		,
		);
		
	// По акту о расхождениях
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(
		ВыборкаШапка.АктОРасхождениях,
		ВыборкаШапка.СтатусАктаОРасхождениях,
		ВыборкаШапка.ЕстьОшибкиПроведенАктОРасхождениях,
		ВыборкаШапка.ЕстьОшибкиСтатусАкт,
		РасхожденияСервер.МассивДопустимыхСтатусовАктовОРасхожденияхПриСозданииНаОсновании());
		
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапка);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРасширенныеВозможностиЗаказаКлиента") Тогда
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			Дата = ТекущаяДатаСеанса();
		КонецЕсли;
	КонецЕсли;
	
	Товары.Загрузить(ПакетЗапросов[1].Выгрузить());
	Серии.Загрузить(ПакетЗапросов[2].Выгрузить());
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Менеджер                  = Пользователи.ТекущийПользователь();
	Валюта                    = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(Валюта);
	ВалютаВзаиморасчетов      = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ВалютаВзаиморасчетов);
	Организация               = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    		= Организация;
	СтруктураПараметров.БанковскийСчет		= БанковскийСчетОрганизации;
	БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
	
	БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Контрагент, , БанковскийСчетКонтрагента);
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияКассыОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация = Организация;
	СтруктураПараметров.Касса		= Касса;

	Касса                     = ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(СтруктураПараметров);
	
	Склад                     = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад, ПолучитьФункциональнуюОпцию("ИспользоватьСкладыВТабличнойЧастиДокументовПродажи"), Истина);
	ПорядокРасчетов           = ВзаиморасчетыСервер.ПорядокРасчетовПоДокументу(ЭтотОбъект);
	ДатаРаспоряжения          = ТекущаяДатаСеанса();
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьАктыНаПередачуПрав") Тогда
		ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаПлатежа) Тогда
		ДатаПлатежа = ТекущаяДатаСеанса();
	КонецЕсли;
	
	СтруктураОтветственного = ПродажиСервер.ПолучитьОтветственногоПоСкладу(Склад, Менеджер);
	Если СтруктураОтветственного <> Неопределено Тогда
		Отпустил = СтруктураОтветственного.Ответственный;
		ОтпустилДолжность = СтруктураОтветственного.ОтветственныйДолжность;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыРеализацийТоваровУслуг") Тогда
		Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
	КонецЕсли;
	
	РаботаСКурсамиВалютУТ.ЗаполнитьКурсКратностьПоУмолчанию(Курс, Кратность, Валюта, ВалютаВзаиморасчетов);
	
	// ИнтеграцияЕГАИС
	ИнтеграцияЕГАИСУТ.ОчиститьПризнакиЕстьАлкогольнаяПродукция(ЭтотОбъект);
	// Конец ИнтеграцияЕГАИС
	
КонецПроцедуры

Процедура ИнициализироватьУсловияПродаж()
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") И Не ЗначениеЗаполнено(ЗаказКлиента) Тогда
		ЗаполнитьУсловияПродажПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьДополнительныеСвойстваНабораЗаписейВыручкаИСебестоимостьПродаж()
	Перем ОтслеживатьИзменения, ДатаДокументаИзменена;
	
	Если ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности 
		И Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено Тогда
		
		ДополнительныеСвойства.Вставить("СтруктураОтраженияРеглПроводок", Новый Структура("ОтслеживатьИзменения", Истина));
	
		Если ДополнительныеСвойства.Свойство("ДатаДокументаИзменена", ДатаДокументаИзменена) Тогда
			Движения.ВыручкаИСебестоимостьПродаж.ДополнительныеСвойства.Вставить("ДатаДокументаИзменена", ДатаДокументаИзменена);
		КонецЕсли;
		
		Движения.ВыручкаИСебестоимостьПродаж.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
		Движения.ВыручкаИСебестоимостьПродаж.ДополнительныеСвойства.Вставить("СтруктураОтраженияРеглПроводок", 
			ДополнительныеСвойства.СтруктураОтраженияРеглПроводок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВидыЗапасов

Процедура ПроверитьИзменениеХозяйственнойОперации(Отказ)
	
	РеализацияНеОплачивается = (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию);
	
	Если Не ЭтоНовый() И РеализацияНеОплачивается Тогда
	
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РасчетыСКлиентами.СуммаРасход КАК СуммаОплаты
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Обороты(,,Период,
		|		ЗаказКлиента = &ЗаказКлиента
		|	) КАК РасчетыСКлиентами
		|
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|		Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
		|	ПО
		|		ДанныеДокумента.Ссылка = &Ссылка
		|		И ДанныеДокумента.ХозяйственнаяОперация <> &ХозяйственнаяОперация
		|ГДЕ
		|	РасчетыСКлиентами.СуммаРасход > 0
		|");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ЗаказКлиента", ?(ЗначениеЗаполнено(ЗаказКлиента), ЗаказКлиента, Ссылка));
		Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Реализация оплачена. Нельзя устанавливать операцию %1'"),
				ХозяйственнаяОперация);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ЭтотОбъект,
				"ХозяйственнаяОперация",
				,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИзменилисьРеквизитыШапкиВлияющиеНаВидыЗапасов(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Дата,
	|	ДанныеДокумента.НалогообложениеНДС,
	|	ВЫБОР КОГДА ДанныеДокумента.Подразделение.ВариантОбособленногоУчетаТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоПодразделению)
	|		И &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|	ТОГДА
	|		ДанныеДокумента.Подразделение
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|
	|	ВЫБОР КОГДА ДанныеДокумента.Подразделение.ВариантОбособленногоУчетаТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыОбособленногоУчетаТоваров.ПоМенеджерамПодразделения)
	|		И &ФормироватьВидыЗапасовПоПодразделениямМенеджерам
	|	ТОГДА
	|		ДанныеДокумента.Менеджер
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	КОНЕЦ КАК Менеджер,
	|
	|	ВЫБОР КОГДА ДанныеДокумента.Сделка.ОбособленныйУчетТоваровПоСделке
	|		И &ФормироватьВидыЗапасовПоСделкам
	|	ТОГДА
	|		ДанныеДокумента.Сделка
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
	|	КОНЕЦ КАК Сделка
	|
	|ПОМЕСТИТЬ СохраненныеДанныеДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА ДанныеДокумента.Организация <> СохраненныеДанные.Организация ТОГДА
	|		Истина
	|	КОГДА ДанныеДокумента.Дата <> СохраненныеДанные.Дата ТОГДА
	|		Истина
	|	КОГДА ДанныеДокумента.Подразделение <> СохраненныеДанные.Подразделение ТОГДА
	|		Истина
	|	КОГДА ДанныеДокумента.Менеджер <> СохраненныеДанные.Менеджер ТОГДА
	|		Истина
	|	КОГДА ДанныеДокумента.Сделка <> СохраненныеДанные.Сделка ТОГДА
	|		Истина
	|	КОГДА ДанныеДокумента.НалогообложениеНДС <> СохраненныеДанные.НалогообложениеНДС ТОГДА
	|		Истина
	|	ИНАЧЕ
	|		Ложь
	|	КОНЕЦ КАК РеквизитыИзменены
	|ИЗ
	|	ТаблицаДанныхДокумента КАК ДанныеДокумента
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СохраненныеДанныеДокумента КАК СохраненныеДанные
	|	ПО
	|		Истина
	|");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоПодразделениямМенеджерам", ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоПодразделениямМенеджерам"));
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоСделкам", ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоСделкам"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитыИзменены = Выборка.РеквизитыИзменены;
	Иначе
		РеквизитыИзменены = Ложь;
	КонецЕсли;
	
	Возврат РеквизитыИзменены;
	
КонецФункции

Функция ИзмениласьТЧТоварыОтносительноТЧВидыЗапасов(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
	|ИЗ (
	|	ВЫБРАТЬ
	|		ТаблицаТоваров.ЗаказКлиента КАК ЗаказКлиента,
	|		ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|		ТаблицаТоваров.Упаковка КАК Упаковка,
	|		ТаблицаТоваров.Цена КАК Цена,
	|		ТаблицаТоваров.Количество КАК Количество,
	|		ТаблицаТоваров.СуммаСНДС КАК СуммаСНДС,
	|		ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|		ТаблицаТоваров.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		ТаблицаТоваров.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|		ТаблицаТоваров.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки
	|	ИЗ
	|		ТаблицаТоваров КАК ТаблицаТоваров
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаВидыЗапасов.ЗаказКлиента КАК ЗаказКлиента,
	|		ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		ТаблицаВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
	|		ТаблицаВидыЗапасов.Упаковка КАК Упаковка,
	|		ТаблицаВидыЗапасов.Цена КАК Цена,
	|		-ТаблицаВидыЗапасов.Количество КАК Количество,
	|		-ТаблицаВидыЗапасов.СуммаСНДС КАК СуммаСНДС,
	|		-ТаблицаВидыЗапасов.СуммаНДС КАК СуммаНДС,
	|		-ТаблицаВидыЗапасов.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|		-ТаблицаВидыЗапасов.СуммаРучнойСкидки КАК СуммаРучнойСкидки,
	|		-ТаблицаВидыЗапасов.СуммаАвтоматическойСкидки КАК СуммаАвтоматическойСкидки
	|	ИЗ
	|		ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|	) КАК ТаблицаТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.ЗаказКлиента,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.СтавкаНДС,
	|	ТаблицаТоваров.Упаковка,
	|	ТаблицаТоваров.Цена
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаТоваров.Количество) <> 0
	|	ИЛИ СУММА(ТаблицаТоваров.СуммаСНДС) <> 0
	|	ИЛИ СУММА(ТаблицаТоваров.СуммаНДС) <> 0
	|	ИЛИ СУММА(ТаблицаТоваров.СуммаВзаиморасчетов) <> 0
	|	ИЛИ СУММА(ТаблицаТоваров.СуммаРучнойСкидки) <> 0
	|	ИЛИ СУММА(ТаблицаТоваров.СуммаАвтоматическойСкидки) <> 0
	|");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	РезультатЗапрос = Запрос.Выполнить();
	
	Возврат (Не РезультатЗапрос.Пустой());
	
КонецФункции

Процедура СообщитьОбОшибкахЗаполненияВидовЗапасов(ТаблицаОшибок, МенеджерВременныхТаблиц)
	
	Если ТаблицаОшибок.Количество() > 0 Тогда
		
		СтруктураАналитики = ЗапасыСервер.АналитикаОбособленноУчетаДокумента(МенеджерВременныхТаблиц);
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Реализация превышает остаток товара организации %1 %2 %3'"),
			Организация,
			СтруктураАналитики.СтрокаАналитики,
			СтруктураАналитики.Аналитика);
		Если НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт
		 И НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД Тогда
			ТекстСообщения = ТекстСообщения + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '
				|по налогообложению %1'"),
				НалогообложениеНДС);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект);
	
		Для Каждого СтрокаТаблицы Из ТаблицаОшибок Цикл
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Номенклатура: %1, на складе %2 недостаточно %3 %4'"),
				НоменклатураКлиентСервер.ПредставлениеНоменклатуры(СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Характеристика,,СтрокаТаблицы.Серия),
				СтрокаТаблицы.Склад,
				СтрокаТаблицы.Количество,
				СтрокаТаблицы.ЕдиницаИзмерения);
			Если СтрокаТаблицы.НеУказанНомерГТД Тогда
				ТекстСообщения = ТекстСообщения + НСтр("ru = ' с указанными номерами ГТД'");
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект);
			
		КонецЦикла;
		
		НалогообложениеНДСОрганизации = Справочники.Организации.НалогообложениеНДС(Организация, Неопределено, Дата);
		Если НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.ПродажаНаЭкспорт
		 И НалогообложениеНДС <> Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД
		 И НалогообложениеНДСОрганизации <> НалогообложениеНДС Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Налогообложение документа отличается от налогообложения организации %1'"),
				НалогообложениеНДСОрганизации);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"НалогообложениеНДС");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуВидовЗапасов(СтрокаТоваров, СтруктураПоиска, Параметры)
	
	Для Каждого СтрокаЗапасов Из ВидыЗапасов.НайтиСтроки(СтруктураПоиска) Цикл
			
		Если СтрокаЗапасов.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоПоСтроке = Мин(Параметры.Количество, СтрокаЗапасов.Количество);
		
		НоваяСтрока = ВидыЗапасов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗапасов);
		
		НоваяСтрока.Упаковка = СтрокаТоваров.Упаковка;
		НоваяСтрока.КодТНВЭД = СтрокаТоваров.КодТНВЭД;
		НоваяСтрока.ЗаказКлиента = ?(ЗначениеЗаполнено(СтрокаТоваров.ЗаказКлиента), СтрокаТоваров.ЗаказКлиента, Неопределено);
		НоваяСтрока.АналитикаУчетаНаборов = СтрокаТоваров.АналитикаУчетаНаборов;
		НоваяСтрока.СтавкаНДС = СтрокаТоваров.СтавкаНДС;
		НоваяСтрока.Цена = СтрокаТоваров.Цена;
		
		НоваяСтрока.Количество = КоличествоПоСтроке;
		Если Параметры.Количество <> 0 Тогда
			НоваяСтрока.КоличествоУпаковок = КоличествоПоСтроке * Параметры.КоличествоУпаковок / Параметры.Количество;
			НоваяСтрока.СуммаВзаиморасчетов = КоличествоПоСтроке * Параметры.СуммаВзаиморасчетов / Параметры.Количество;
			НоваяСтрока.СуммаРучнойСкидки = КоличествоПоСтроке * Параметры.СуммаРучнойСкидки / Параметры.Количество;
			НоваяСтрока.СуммаАвтоматическойСкидки = КоличествоПоСтроке * Параметры.СуммаАвтоматическойСкидки / Параметры.Количество;
		КонецЕсли;
		Если СтрокаЗапасов.Количество <> 0 Тогда
			НоваяСтрока.СуммаСНДС = КоличествоПоСтроке * Параметры.СуммаСНДС / Параметры.Количество;
			НоваяСтрока.СуммаНДС = КоличествоПоСтроке * Параметры.СуммаНДС / Параметры.Количество;
		КонецЕсли;
		
		СтрокаЗапасов.Количество = СтрокаЗапасов.Количество - НоваяСтрока.Количество;
		СтрокаЗапасов.СуммаСНДС = СтрокаЗапасов.СуммаСНДС - НоваяСтрока.СуммаСНДС;
		СтрокаЗапасов.СуммаНДС = СтрокаЗапасов.СуммаНДС - НоваяСтрока.СуммаНДС;
		
		Параметры.Количество = Параметры.Количество - НоваяСтрока.Количество;
		Параметры.КоличествоУпаковок = Параметры.КоличествоУпаковок - НоваяСтрока.КоличествоУпаковок;
		Параметры.СуммаВзаиморасчетов = Параметры.СуммаВзаиморасчетов - НоваяСтрока.СуммаВзаиморасчетов;
		Параметры.СуммаРучнойСкидки = Параметры.СуммаРучнойСкидки - НоваяСтрока.СуммаРучнойСкидки;
		Параметры.СуммаАвтоматическойСкидки = Параметры.СуммаАвтоматическойСкидки - НоваяСтрока.СуммаАвтоматическойСкидки;
		Параметры.СуммаСНДС = Параметры.СуммаСНДС - НоваяСтрока.СуммаСНДС;
		Параметры.СуммаНДС = Параметры.СуммаНДС - НоваяСтрока.СуммаНДС;
		
		Если Параметры.Количество = 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДопКолонкиВидовЗапасов() Экспорт
	
	ТаблицаТовары = Товары.Выгрузить(, "АналитикаУчетаНоменклатуры, НоменклатураНабора, ХарактеристикаНабора, АналитикаУчетаНаборов, Упаковка, ЗаказКлиента, КодТНВЭД, 
		|Количество, КоличествоУпаковок, СтавкаНДС, Цена, СуммаВзаиморасчетов, СуммаРучнойСкидки, СуммаАвтоматическойСкидки, СуммаСНДС, СуммаНДС");
	ТаблицаТовары.Свернуть("АналитикаУчетаНоменклатуры, АналитикаУчетаНаборов, НоменклатураНабора, ХарактеристикаНабора, Упаковка, ЗаказКлиента, КодТНВЭД, СтавкаНДС, Цена",
		"Количество, КоличествоУпаковок, СуммаВзаиморасчетов, СуммаРучнойСкидки, СуммаАвтоматическойСкидки, СуммаСНДС, СуммаНДС");
		
	Параметры = Новый Структура;
	
	СтруктураПоиска = Новый Структура("АналитикаУчетаНоменклатуры, ЗаказКлиента, КоличествоУпаковок");
	Для Каждого СтрокаТоваров Из ТаблицаТовары Цикл
		
		Параметры.Вставить("Количество", СтрокаТоваров.Количество);
		Параметры.Вставить("КоличествоУпаковок", СтрокаТоваров.КоличествоУпаковок);
		Параметры.Вставить("СуммаВзаиморасчетов", СтрокаТоваров.СуммаВзаиморасчетов);
		Параметры.Вставить("СуммаРучнойСкидки", СтрокаТоваров.СуммаРучнойСкидки);
		Параметры.Вставить("СуммаАвтоматическойСкидки", СтрокаТоваров.СуммаАвтоматическойСкидки);
		Параметры.Вставить("СуммаСНДС", СтрокаТоваров.СуммаСНДС);
		Параметры.Вставить("СуммаНДС", СтрокаТоваров.СуммаНДС);
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаТоваров);
		СтруктураПоиска.КоличествоУпаковок = 0;
		ЗаполнитьСтрокуВидовЗапасов(СтрокаТоваров, СтруктураПоиска, Параметры);
		
		Если ЗначениеЗаполнено(СтрокаТоваров.ЗаказКлиента)
		 И Параметры.Количество <> 0 Тогда
			СтруктураПоиска.ЗаказКлиента = Неопределено;
			ЗаполнитьСтрокуВидовЗапасов(СтрокаТоваров, СтруктураПоиска, Параметры);
		КонецЕсли;
		
	КонецЦикла;
	
	МассивУдаляемыхСтрок = ВидыЗапасов.НайтиСтроки(Новый Структура("Количество", 0));
	Для Каждого СтрокаТаблицы Из МассивУдаляемыхСтрок Цикл
		ВидыЗапасов.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьВидыЗапасов(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = ВременныеТаблицыДанныхДокумента();
	ПерезаполнитьВидыЗапасов = ДополнительныеСвойства.Свойство("ПерезаполнитьВидыЗапасов");
	Если Не Проведен
	 Или ПерезаполнитьВидыЗапасов
	 Или ИзменилисьРеквизитыШапкиВлияющиеНаВидыЗапасов(МенеджерВременныхТаблиц)
	 Или ИзмениласьТЧТоварыОтносительноТЧВидыЗапасов(МенеджерВременныхТаблиц) Тогда
	 
		СформироватьДоступныеВидыЗапасов(МенеджерВременныхТаблиц);
		
		ЗапасыСервер.УстановитьБлокировкуОстатковТоваровОрганизаций(МенеджерВременныхТаблиц);
		ЗапасыСервер.ТаблицаОстатковТоваровОрганизаций(Ссылка, Организация, Дата, ДополнительныеСвойства, МенеджерВременныхТаблиц);
		ТаблицаОшибок = ЗапасыСервер.ТаблицаОшибокЗаполненияВидовЗапасов();
		
		ЗапасыСервер.ЗаполнитьВидыЗапасовДокумента(
			МенеджерВременныхТаблиц,
			ДополнительныеСвойства,
			ВидыЗапасов,
			ТаблицаОшибок,
			Отказ);

		ВидыЗапасов.Свернуть("АналитикаУчетаНоменклатуры, АналитикаУчетаНаборов, ВидЗапасов, НомерГТД, СтавкаНДС, ЗаказКлиента, КодТНВЭД", "Количество, СуммаСНДС, СуммаНДС");
		ЗаполнитьДопКолонкиВидовЗапасов();
		СообщитьОбОшибкахЗаполненияВидовЗапасов(ТаблицаОшибок, МенеджерВременныхТаблиц);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	
	Если Не ДополнительныеСвойства.Свойство("ПерезаполнитьВидыЗапасов") Тогда
		
		// Контроль выполняется при проведении\отмене проведения не нового документа.
		Если Не ДополнительныеСвойства.ЭтоНовый Тогда
			Массив.Добавить(Движения.ПереданнаяВозвратнаяТара);
			// Приходы в регистр (сторно расхода из регистра) контролируем при перепроведении и отмене проведения
			Массив.Добавить(Движения.ТоварыОрганизаций);
		КонецЕсли;
		
		Если РеализацияПоЗаказам Или Не ДополнительныеСвойства.ЭтоНовый Тогда
			Массив.Добавить(Движения.ТоварыКОтгрузке);
		КонецЕсли;

		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

			//Массив.Добавить(Движения.СвободныеОстатки);
			//Массив.Добавить(Движения.ОбеспечениеЗаказов);
			//Массив.Добавить(Движения.ЗаказыКлиентов);

			Если ЭтотОбъект.ЭтоИнтернетЗаказ = ЛОЖЬ Тогда
				Если НоменклатураСервер.ПараметрыУказанияСерий(ЭтотОбъект, Документы.РеализацияТоваровУслуг).ИспользоватьСерииНоменклатуры Тогда
					Массив.Добавить(Движения.ТоварыНаСкладах);
					Массив.Добавить(Движения.СвободныеОстатки);
					Массив.Добавить(Движения.ОбеспечениеЗаказов);
					Массив.Добавить(Движения.ЗаказыКлиентов);
					Массив.Добавить(Движения.РасчетыСКлиентами);

				КонецЕсли;
			КонецЕсли; 

			//Массив.Добавить(Движения.РасчетыСКлиентами);

		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

Процедура ЗаполнитьСуммуВзаиморасчетов(СтруктураКурса)
	
	Если Товары.НайтиСтроки(Новый Структура("СуммаВзаиморасчетов", 0)).Количество()=0 Тогда
		
		СуммаВзаиморасчетов = ПолучитьСуммуВзаиморасчетовПоТЧ();
		
	Иначе
		
		ВзаиморасчетыСервер.ЗаполнитьСуммуВзаиморасчетов(ЭтотОбъект, "Товары" , СтруктураКурса);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура формирует временную таблицу товаров с аналитикой обособленного учета.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								который будет содержать созданную таблицу
//
Процедура СформироватьВременнуюТаблицуТоваровИАналитики(МенеджерВременныхТаблиц) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика,
	|	ТаблицаТоваров.Серия,
	|	ТаблицаТоваров.Склад,
	|
	|	ТаблицаДанныхДокумента.Подразделение,
	|	ТаблицаДанныхДокумента.Менеджер,
	|	ТаблицаДанныхДокумента.Сделка КАК Сделка,
	|	ТаблицаТоваров.Назначение КАК Назначение,
	|
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка) КАК Партнер,
	|	ЗНАЧЕНИЕ(Справочник.СоглашенияСПоставщиками.ПустаяСсылка) КАК Соглашение,
	|	&НалогообложениеНДС КАК НалогообложениеНДС,
	|
	|	ТаблицаТоваров.Количество КАК Количество
	|	
	|ПОМЕСТИТЬ ТаблицаТоваровИАналитики
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|	ПО
	|		Истина
	|ГДЕ
	|	ТаблицаТоваров.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|;
	|");
	Запрос.УстановитьПараметр("НалогообложениеНДС", НалогообложениеНДС);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

// Процедура формирует временную таблицу доступных видов запасов
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//								который будет содержать созданную таблицу
//
Процедура СформироватьДоступныеВидыЗапасов(МенеджерВременныхТаблиц) Экспорт
	
	МассивСделок = Новый Массив;
	МассивСделок.Добавить(Сделка);
	
	ОтборЗапапасов = Новый Структура();
	ОтборЗапапасов.Вставить("НалогообложениеНДС", НалогообложениеНДС);
	ОтборЗапапасов.Вставить("КонтролироватьНалогообложение", Истина);
	ОтборЗапапасов.Вставить("Дата", Дата);
	ОтборЗапапасов.Вставить("МассивСделок", МассивСделок);
	ОтборЗапапасов.Вставить("Менеджер", Менеджер);
	ОтборЗапапасов.Вставить("Подразделение", Подразделение);

	ЗапасыСервер.ВидыЗапасовПоНалогообложению(Организация, ОтборЗапапасов, МенеджерВременныхТаблиц);
	
КонецПроцедуры

Процедура ПроверитьСуммуПредоплаты(СуммаВзаиморасчетовПоДокументу, Отказ)
	
	Если СуммаПредоплаты > СуммаВзаиморасчетовПоДокументу Тогда
		
		ТекстОшибки = НСтр("ru='Сумма предоплаты превышает сумму взаиморасчетов по документу на %СуммаПревышения% %ВалютаВзаиморасчетов%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%СуммаПревышения%", Формат(СуммаПредоплаты - СуммаВзаиморасчетовПоДокументу, "ЧДЦ=2"));
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВалютаВзаиморасчетов%", ВалютаВзаиморасчетов);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			Ссылка,
			"СуммаПредоплаты",
			,
			Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуДокумента() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	ИЛИ НЕ &ВернутьМногооборотнуюТару
	|	ИЛИ &ТребуетсяЗалогЗаТару
	|");
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаСНДС"));
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаИтого = Выгрузка[0].СуммаСНДС;
	Возврат СуммаИтого;
	
КонецФункции

Функция ПолучитьСуммуДокументаПоТаре() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаСНДС КАК СуммаСНДС
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаСНДС),0) КАК СуммаСНДС
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	И &ТребуетсяЗалогЗаТару
	|");
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаСНДС"));
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаИтого = Выгрузка[0].СуммаСНДС;
	Возврат СуммаИтого;
	
КонецФункции

Функция ПолучитьСуммуВзаиморасчетовПоТЧ() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаВзаиморасчетов),0) КАК СуммаВзаиморасчетов
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	ИЛИ НЕ &ВернутьМногооборотнуюТару
	|	ИЛИ &ТребуетсяЗалогЗаТару
	|");
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаВзаиморасчетов"));
	Запрос.УстановитьПараметр("ВернутьМногооборотнуюТару", ВернутьМногооборотнуюТару);
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаИтого = Выгрузка[0].СуммаВзаиморасчетов;
	Возврат СуммаИтого;
	
КонецФункции

Функция ПолучитьСуммуВзаиморасчетовПоТаре() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ
	|	Товары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(Товары.СуммаВзаиморасчетов),0) КАК СуммаВзаиморасчетов
	|ИЗ
	|	Товары КАК Товары
	|ГДЕ
	|	Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|	И &ТребуетсяЗалогЗаТару
	|");
	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура,СуммаВзаиморасчетов"));
	Запрос.УстановитьПараметр("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	СуммаИтого = Выгрузка[0].СуммаВзаиморасчетов;
	Возврат СуммаИтого;
	
КонецФункции

Процедура СформироватьСписокЗависимыхЗаказов()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивЗаказов)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК ЗаказКлиента
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивЗаказов)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК ЗаказКлиента
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В (ВЫБРАТЬ
	|			ТоварыДокумента.ЗаказКлиента
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК ТоварыДокумента
	|		ГДЕ
	|			ТоварыДокумента.Ссылка = &Ссылка)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК ЗаказКлиента
	|ИЗ
	|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В (ВЫБРАТЬ
	|			ТоварыДокумента.ЗаказКлиента
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг.Товары КАК ТоварыДокумента
	|		ГДЕ
	|			ТоварыДокумента.Ссылка = &Ссылка)
	|	
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Заказ КАК ЗаказКлиента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|ГДЕ
	|	РасшифровкаПлатежа.Ссылка = &Ссылка
	|	И РасшифровкаПлатежа.Заказ ССЫЛКА Документ.ЗаказКлиента
	|";
	
	Запрос.УстановитьПараметр("МассивЗаказов", ЭтотОбъект.Товары.ВыгрузитьКолонку("ЗаказКлиента"));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	Если HS_ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстантыИзКэша("ОтключитьОптимизациюЗапросов") Тогда
	МассивЗависимыхЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗаказКлиента");
	Иначе
	МассивЗависимыхЗаказов = HS_ЗапросыИОтчеты.ОптимизироватьЗапрос_СформироватьСписокЗависимыхЗаказовКлиентов(ЭтотОбъект, Запрос);
	КонецЕсли;
	ЭтотОбъект.ДополнительныеСвойства.Вставить("МассивЗависимыхЗаказовКлиентов", Новый ФиксированныйМассив(МассивЗависимыхЗаказов));
	
КонецПроцедуры

Функция ТребуетсяСчетФактура()
	
	Возврат
		(ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту)
		ИЛИ (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
		ИЛИ (ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиентуРеглУчет)
		
КонецФункции

Процедура ПроверитьВариантОформленияПродажи(МассивНепроверяемыхРеквизитов)
	
	Если НЕ ЗначениеЗаполнено(ВариантОформленияПродажи) Тогда
		Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьАктыНаПередачуПрав") Тогда
			ЗаполняемыйВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
		Иначе
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ
			|	ВтТовары
			|ИЗ
			|	&Товары КАК Товары
			|;
			|ВЫБРАТЬ
			|	Товары.Номенклатура.Ссылка
			|ИЗ
			|	ВтТовары КАК Товары
			|ГДЕ
			|	Товары.Номенклатура.ВариантОформленияПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.АктНаПередачуПрав)");
			
			Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"Номенклатура"));
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				ЗаполняемыйВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
			КонецЕсли;
			
			Если РезультатЗапроса.Выгрузить().Количество() = Товары.Количество() Тогда
				ЗаполняемыйВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.АктНаПередачуПрав;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаполняемыйВариантОформленияПродажи) Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ЗаполняемыйВариантОформленияПродажи", ЗаполняемыйВариантОформленияПродажи);
			МассивНепроверяемыхРеквизитов.Добавить("ВариантОформленияПродажи");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПроверитьКорректировки(Отказ)
	
	ЕстьКорректировки = Ложь;
	
	ПродажиСервер.ПроверитьНаличиеКорректировок(Ссылка, Ссылка, ЕстьКорректировки);
	
	Если ЕстьКорректировки Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'На основании документа %1 введена корректировка реализации. Отмена проведения невозможна.'"),Ссылка);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры



/////////////// Для аннулирования ЭСЧФ на портале ////////////////



Процедура АннулироватьЭСЧФ(ЭСЧФ)
	
	КаталогРазмещенияФайлов = "\\192.168.0.111\eInvVat";
	
	СтрокаЭСЧФ = ЭСЧФ;			
	СчетФактура = СтрокаЭСЧФ.Ссылка;
	Текст = Новый ТекстовыйДокумент;
	Текст.ДобавитьСтроку("<issuance xmlns=""http://www.w3schools.com"" "+
	" sender="""+СокрЛП(СчетФактура.Организация.ИНН)+""">");
	//общие
	Текст.ДобавитьСтроку("  <general>");
	Если СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исходный Тогда
		ТипЭСФ ="ORIGINAL";
	ИначеЕсли СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.ДополнительныйБезЭСЧФ Тогда
		ТипЭСФ ="ADD_NO_REFERENCE";
	ИначеЕсли СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исправленный Тогда
		ТипЭСФ ="FIXED";
	ИначеЕсли СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Дополнительный Тогда
		ТипЭСФ ="ADDITIONAL";
	КонецЕсли; 
	
	//Если СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Дополнительный Тогда
	//	//Текст.ДобавитьСтроку("    <description>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ДополнительныеСведения)+"</description>");
	//	
	//	Текст.ДобавитьСтроку("    </contract>");
	//	Текст.ДобавитьСтроку("    <description>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ДополнительныеСведения)+"</description>");
	//	Текст.ДобавитьСтроку("  </deliveryCondition>");
	//	
	//КонецЕсли;    ////////77w qaws  для возвратов  нужно куда то в другое место.
	
	
	Текст.ДобавитьСтроку("    <number>"+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+"</number>");
	//Текст.ДобавитьСтроку("    <dateIssuance>"+Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd")+"</dateIssuance>");
	Текст.ДобавитьСтроку("    <dateTransaction>"+Формат(СчетФактура.ДатаОперации,"ДФ=yyyy-MM-dd")+"</dateTransaction>");
	Текст.ДобавитьСтроку("    <documentType>"+ТипЭСФ+"</documentType>");
	Если СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Исправленный Тогда
		Текст.ДобавитьСтроку("    <invoice>"+СокрЛП(СчетФактура.НомерИсходногоЭСЧФ)+"</invoice>");
		Текст.ДобавитьСтроку("    <dateCancelled>"+Формат(СчетФактура.ДатаАннулированияЭСЧФ,"ДФ=yyyy-MM-dd")+"</dateCancelled>");		
	ИначеЕсли СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.Дополнительный Тогда
		Текст.ДобавитьСтроку("    <invoice>"+СокрЛП(СчетФактура.НомерИсходногоЭСЧФ)+"</invoice>");
		Текст.ДобавитьСтроку("    <sendToRecipient>true</sendToRecipient>");		
	КонецЕсли;                      
	
	Текст.ДобавитьСтроку("  </general>");
	
	
	Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ или СтрокаЭСЧФ.Ссылка.ФлагВозвратаПоАктуНедостачи Тогда  ///////77w 07-05-2020
		
		Если СтрокаЭСЧФ.ТипЭСЧФ <> Перечисления.ТипыЭСЧФ.ДополнительныйБезЭСЧФ Тогда   ///////77w 07-05-2020
			
			//Условия поставки
			Текст.ДобавитьСтроку("  <deliveryCondition>");
			Текст.ДобавитьСтроку("    <contract>");
			Если Не обПустоеЗначение(СчетФактура.НомерДоговора) Тогда
				Если НРег(СокрЛП(СчетФактура.НомерДоговора)) = "оферта" Тогда
					Текст.ДобавитьСтроку("      <number>public_offer</number>");
				ИначеЕсли НРег(СокрЛП(СчетФактура.НомерДоговора)) = "без договора" Тогда
					Текст.ДобавитьСтроку("      <number>no_contract</number>");
				Иначе	
					Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерДоговора)+"</number>");
				КонецЕсли;	
				Если Не обПустоеЗначение(СчетФактура.ДатаДоговора) Тогда
					Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаДоговора,"ДФ=yyyy-MM-dd")+"</date>");
				КонецЕсли;	
			Иначе
				Текст.ДобавитьСтроку("      <number>no_contract</number>");
			КонецЕсли;	
			Если обПустоеЗначение(СчетФактура.ВидДокументаПоставки) И
				НЕ обПустоеЗначение(СчетФактура.УНППоставщика) И
				СчетФактура.СтатусПоставщика <> Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация И
				НЕ СчетФактура.ФлагНеВыставлятьПолучателю Тогда
				// С 15.01.2018 г. добавлен контроль при выставлении ЭСЧФ обязательности заполнения данных первичного документа,
				// если поле 17. "УНП поставщика" непустое и не равно УНП составителя ЭСЧФ.
				// Если поле "Вид документа поставки" пустое, то поставляем код документа 600, что соответствует виду документа "Без документа"
				Текст.ДобавитьСтроку("      <documents>");
				Текст.ДобавитьСтроку("        <document>");
				Текст.ДобавитьСтроку("          <docType>");			
				Текст.ДобавитьСтроку("            <code>"+"600"+"</code>");
				Текст.ДобавитьСтроку("          </docType>");
				Текст.ДобавитьСтроку("	        <blankCode></blankCode>");
				Текст.ДобавитьСтроку("	        <seria></seria>");
				Текст.ДобавитьСтроку("	        <number></number>");
				Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ тогда
					Текст.ДобавитьСтроку("	        <refund>true</refund>");
				Иначе
					Текст.ДобавитьСтроку("	        <refund>false</refund>");
				Конецесли;	
				Текст.ДобавитьСтроку("        </document>");
				Текст.ДобавитьСтроку("      </documents>");
			Иначе	
				Если Не обПустоеЗначение(СчетФактура.ВидДокументаПоставки) ИЛИ
					Не обПустоеЗначение(СчетФактура.ДатаДокументаПоставки) ИЛИ
					Не обПустоеЗначение(СчетФактура.НомерДокументаПоставки) Тогда		
					
					Текст.ДобавитьСтроку("      <documents>");
					Текст.ДобавитьСтроку("        <document>");
					Текст.ДобавитьСтроку("          <docType>");
					Если Не обПустоеЗначение(СчетФактура.ВидДокументаПоставки) Тогда
						Текст.ДобавитьСтроку("            <code>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ВидДокументаПоставки.Код)+"</code>");
					КонецЕсли;
					Если Не обПустоеЗначение(СчетФактура.НазваниеДокументаПоставки) и СокрЛП(СчетФактура.ВидДокументаПоставки.Код="601")Тогда
						Текст.ДобавитьСтроку("            <value>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НазваниеДокументаПоставки)+"</value>");
					КонецЕсли;
					Текст.ДобавитьСтроку("          </docType>");
					Если  Не обПустоеЗначение(СчетФактура.ДатаДокументаПоставки) Тогда
						Текст.ДобавитьСтроку("          <date>"+Формат(СчетФактура.ДатаДокументаПоставки,"ДФ=yyyy-MM-dd")+"</date>");
					КонецЕсли;
					Текст.ДобавитьСтроку("          <blankCode>"+СокрЛП(СчетФактура.КодТипаБланка)+"</blankCode>");
					Текст.ДобавитьСтроку("          <seria>"+СокрЛП(СчетФактура.СерияДокументаПоставки)+"</seria>");
					Текст.ДобавитьСтроку("          <number>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НомерДокументаПоставки)+"</number>");
					//Текст.ДобавитьСтроку("	        <refund>true</refund>");
					Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ тогда
						Текст.ДобавитьСтроку("	        <refund>true</refund>");
					Иначе
						Текст.ДобавитьСтроку("	        <refund>false</refund>");
					Конецесли;	
					Текст.ДобавитьСтроку("        </document>");
					Текст.ДобавитьСтроку("      </documents>");
				КонецЕсли;
			КонецЕсли;	
			Текст.ДобавитьСтроку("    </contract>");
			Текст.ДобавитьСтроку("    <description>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ДополнительныеСведения)+"</description>");
			Текст.ДобавитьСтроку("  </deliveryCondition>");
			
		КонецЕсли; 
		
	КонецЕсли;  ///////77w 07-05-2020
	
	Если СтрокаЭСЧФ.ТипЭСЧФ <> Перечисления.ТипыЭСЧФ.Дополнительный Тогда
		
		
		//поставщик
		
		Текст.ДобавитьСтроку("  <provider>");
		Текст.ДобавитьСтроку("    <providerStatus>"+ПолучитьСтатусПоставщика(СчетФактура.СтатусПоставщика)+"</providerStatus>");
		Текст.ДобавитьСтроку("    <dependentPerson>"+?(СчетФактура.ФлагВзаимозависимоеЛицоПоставщик,"true","false")+"</dependentPerson>");
		Текст.ДобавитьСтроку("    <residentsOfOffshore>"+?(СчетФактура.ФлагРезидентОффшорныйЗоныПоставщик,"true","false")+"</residentsOfOffshore>");
		Текст.ДобавитьСтроку("    <specialDealGoods>"+?(СчетФактура.ФлагСделкаСТоварамиПоПеречнюПравительствРБПолучатель,"true","false")+"</specialDealGoods>");
		Текст.ДобавитьСтроку("    <bigCompany>"+?(СчетФактура.ФлагКрупныйПлательщикПоставщик,"true","false")+"</bigCompany>");
		Если Не обПустоеЗначение(СчетФактура.КодСтраныПоставщика) Тогда
			Текст.ДобавитьСтроку("    <countryCode>"+СокрЛП(СчетФактура.КодСтраныПоставщика)+"</countryCode>");
		КонецЕсли;
		
		Текст.ДобавитьСтроку("    <unp>"+СокрЛП(СчетФактура.УНППоставщика)+"</unp>");
		
		Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ = Ложь Тогда  ///////77w 07-05-2020
			Текст.ДобавитьСтроку("    <branchCode>"+Формат(СчетФактура.КодФилиалаПоставщика,"ЧГ=0")+"</branchCode>");
		КонецЕсли;
		
		Текст.ДобавитьСтроку("    <name>"+ ЗаменитьНедопустимыеСимволы(СчетФактура.НаименованиеПоставщика)+"</name>");
		Текст.ДобавитьСтроку("    <address>"+ЗаменитьНедопустимыеСимволы(СчетФактура.АдресПоставщика)+"</address>");
		
		Если Не обПустоеЗначение(СчетФактура.НомерЭСЧФКомитента) ИЛИ
			Не обПустоеЗначение(СчетФактура.ДатаЭСЧФКомитента) Тогда
			Текст.ДобавитьСтроку("    <principal>");
			Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерЭСЧФКомитента)+"</number>");
			Если Не обПустоеЗначение(СчетФактура.ДатаЭСЧФКомитента) Тогда	
				Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаЭСЧФКомитента,"ДФ=yyyy-MM-dd")+"</date>");
			КонецЕсли;	
			Текст.ДобавитьСтроку("    </principal>");
		КонецЕсли;
		Если Не обПустоеЗначение(СчетФактура.НомерЭСЧФПродавца) ИЛИ
			Не обПустоеЗначение(СчетФактура.ДатаЭСЧФПродавца) Тогда
			Текст.ДобавитьСтроку("    <vendor>");
			Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерЭСЧФПродавца)+"</number>");
			Если Не обПустоеЗначение(СчетФактура.ДатаЭСЧФПродавца) Тогда	
				Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаЭСЧФПродавца,"ДФ=yyyy-MM-dd")+"</date>");
			КонецЕсли;
			Текст.ДобавитьСтроку("    </vendor>");
		КонецЕсли;
		
		Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ = Ложь Тогда  ///////77w 07-05-2020
			Текст.ДобавитьСтроку("    <declaration>"+СокрЛП(СчетФактура.НомерГТД)+"</declaration>");
		КонецЕсли;
		
		
		Если Не обПустоеЗначение(СчетФактура.ДатаВыпускаТоваров) Тогда	
			Текст.ДобавитьСтроку("    <dateRelease>"+Формат(СчетФактура.ДатаВыпускаТоваров,"ДФ=yyyy-MM-dd")+"</dateRelease>");
		КонецЕсли;
		Если  Не обПустоеЗначение(СчетФактура.ДатаРазрешенияНаУбытиеТоваров) Тогда		
			Текст.ДобавитьСтроку("    <dateActualExport>"+Формат(СчетФактура.ДатаРазрешенияНаУбытиеТоваров,"ДФ=yyyy-MM-dd")+"</dateActualExport>");
		КонецЕсли;
		
		Если Не обПустоеЗначение(СчетФактура.НомерЗаявленияОВвозеТоваров) ИЛИ
			Не обПустоеЗначение(СчетФактура.ДатаЗаявленияОВвозеТоваров) Тогда	
			Текст.ДобавитьСтроку("    <taxes>");
			Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерЗаявленияОВвозеТоваров)+"</number>");
			Если  Не обПустоеЗначение(СчетФактура.ДатаЗаявленияОВвозеТоваров) Тогда			
				Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаЗаявленияОВвозеТоваров,"ДФ=yyyy-MM-dd")+"</date>");
			КонецЕсли;	
			Текст.ДобавитьСтроку("    </taxes>");
		КонецЕсли; 
		Текст.ДобавитьСтроку("  </provider>");	
		
		//Получатель
		Текст.ДобавитьСтроку("  <recipient>");
		Текст.ДобавитьСтроку("    <recipientStatus>"+ПолучитьСтатусПолучателя(СчетФактура.СтатусПолучателя)+"</recipientStatus>");
		Текст.ДобавитьСтроку("    <dependentPerson>"+?(СчетФактура.ФлагВзаимозависимоеЛицоПолучатель,"true","false")+"</dependentPerson>");
		Текст.ДобавитьСтроку("    <residentsOfOffshore>"+?(СчетФактура.ФлагРезидентОффшорныйЗоныПолучатель,"true","false")+"</residentsOfOffshore>");
		Текст.ДобавитьСтроку("    <specialDealGoods>"+?(СчетФактура.ФлагСделкаСТоварамиПоПеречнюПравительствРБПолучатель,"true","false")+"</specialDealGoods>");
		Текст.ДобавитьСтроку("    <bigCompany>"+?(СчетФактура.ФлагКрупныйПлательщикПолучатель,"true","false")+"</bigCompany>");
		// Для статуса поставщика "Иностранная организация" или ЭСЧФ выставляется получателю выгружаем код страны, УНП и код филиала
		Если СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация ИЛИ
			НЕ СчетФактура.ФлагНеВыставлятьПолучателю Тогда
			Если Не обПустоеЗначение(СчетФактура.КодСтраныПолучателя) Тогда
				Текст.ДобавитьСтроку("    <countryCode>"+СокрЛП(СчетФактура.КодСтраныПолучателя)+"</countryCode>");
			КонецЕсли;	
			Текст.ДобавитьСтроку("    <unp>"+СокрЛП(СчетФактура.УНППолучателя)+"</unp>");
			Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ = Ложь Тогда  ///////77w 07-05-2020
				Текст.ДобавитьСтроку("    <branchCode>"+СчетФактура.КодФилиалаПолучателя+"</branchCode>");
			КонецЕсли;	
		Иначе	
			// Правило 59. Если заполнен реквизит 6.1 Взаимозависимое лицо и реквизит 16. Код страны получателя - РБ, то реквизит 17. УНП получателя обязательно для заполнения,
			// поэтому при установленном флажке "ФлагНеВыставлятьПолучателю" код страны получателя не выгружаем
			Если Не обПустоеЗначение(СчетФактура.КодСтраныПолучателя) И
				(СчетФактура.КодСтраныПолучателя<>"112" ИЛИ
				(СчетФактура.КодСтраныПолучателя="112" И
				НЕ СчетФактура.ФлагВзаимозависимоеЛицоПоставщик)) Тогда	
				Текст.ДобавитьСтроку("    <countryCode>"+СокрЛП(СчетФактура.КодСтраныПолучателя)+"</countryCode>");
			КонецЕсли;
		КонецЕсли;	
		Текст.ДобавитьСтроку("    <name>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НаименованиеПолучателя)+"</name>");
		Текст.ДобавитьСтроку("    <address>"+ЗаменитьНедопустимыеСимволы(СчетФактура.АдресПолучателя)+"</address>");
		
		Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ = Ложь Тогда  ///////77w 07-05-2020
			Текст.ДобавитьСтроку("    <declaration>"+СокрЛП(СчетФактура.НомерГТДПриВвозе)+"</declaration>");
		КонецЕсли;
		
		Если Не обПустоеЗначение(СчетФактура.НомерЗаявленияОВвозеТоваровПриВвозе) ИЛИ
			Не обПустоеЗначение(СчетФактура.ДатаЗаявленияОВвозеТоваровПриВвозе) Тогда	
			Текст.ДобавитьСтроку("    <taxes>");
			Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерЗаявленияОВвозеТоваровПриВвозе)+"</number>");
			Если Не обПустоеЗначение(СчетФактура.ДатаЗаявленияОВвозеТоваровПриВвозе) Тогда	
				Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаЗаявленияОВвозеТоваровПриВвозе,"ДФ=yyyy-MM-dd")+"</date>");
			КонецЕсли;	
			Текст.ДобавитьСтроку("    </taxes>");
		КонецЕсли;
		Если Не обПустоеЗначение(СчетФактура.ДатаВвозаТоваров) Тогда				
			Текст.ДобавитьСтроку("    <dateImport>"+Формат(СчетФактура.ДатаВвозаТоваров,"ДФ=yyyy-MM-dd")+"</dateImport>");
		КонецЕсли; 	
		Текст.ДобавитьСтроку("  </recipient>");
		
		//Реквизиты грузопоотправителя и грузополучателя
		Текст.ДобавитьСтроку("  <senderReceiver>");
		//грузоотправители
		Текст.ДобавитьСтроку("    <consignors>");
		Если (СчетФактура.ВидДокументаПоставки = Справочники.ВидыДокументовЭСЧФ.ТТН1) ИЛИ
			(Не обПустоеЗначение(СчетФактура.КодСтраныГрузоотправителя) И
			Не обПустоеЗначение(СчетФактура.НаименованиеГрузоотправителя) И
			Не обПустоеЗначение(СчетФактура.АдресОтправки) И
			(СчетФактура.ВидДокументаПоставки = Справочники.ВидыДокументовЭСЧФ.ТН2 ИЛИ
			СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация)) Тогда
			Текст.ДобавитьСтроку("      <consignor>");
			Если Не обПустоеЗначение(СчетФактура.КодСтраныГрузоотправителя) Тогда
				Текст.ДобавитьСтроку("        <countryCode>"+СокрЛП(СчетФактура.КодСтраныГрузоотправителя)+"</countryCode>");
			КонецЕсли;
			Текст.ДобавитьСтроку("        <unp>"+СокрЛП(СчетФактура.УНПГрузоотправителя)+"</unp>");
			Текст.ДобавитьСтроку("        <name>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НаименованиеГрузоотправителя)+"</name>");
			Текст.ДобавитьСтроку("        <address>"+ЗаменитьНедопустимыеСимволы(СчетФактура.АдресОтправки)+"</address>");
			Текст.ДобавитьСтроку("      </consignor>");
		КонецЕсли;
		Текст.ДобавитьСтроку("    </consignors>");
		//грузополучатели
		Текст.ДобавитьСтроку("    <consignees>");
		Если (СчетФактура.ВидДокументаПоставки = Справочники.ВидыДокументовЭСЧФ.ТТН1) ИЛИ
			(Не обПустоеЗначение(СчетФактура.КодСтраныГрузополучателя) И
			Не обПустоеЗначение(СчетФактура.НаименованиеГрузополучателя) И
			Не обПустоеЗначение(СчетФактура.АдресДоставки) И
			(СчетФактура.ВидДокументаПоставки = Справочники.ВидыДокументовЭСЧФ.ТН2 ИЛИ
			СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация)) Тогда
			Текст.ДобавитьСтроку("      <consignee>");
			Если Не обПустоеЗначение(СчетФактура.КодСтраныГрузополучателя) Тогда
				Текст.ДобавитьСтроку("        <countryCode>"+СокрЛП(СчетФактура.КодСтраныГрузополучателя)+"</countryCode>");
			КонецЕсли;
			Текст.ДобавитьСтроку("        <unp>"+СокрЛП(СчетФактура.УНПГрузополучателя)+"</unp>");
			Текст.ДобавитьСтроку("        <name>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НаименованиеГрузополучателя)+"</name>");
			Текст.ДобавитьСтроку("        <address>"+ЗаменитьНедопустимыеСимволы(СчетФактура.АдресДоставки)+"</address>");
			Текст.ДобавитьСтроку("      </consignee>");
		КонецЕсли;
		Текст.ДобавитьСтроку("    </consignees>");
		Текст.ДобавитьСтроку("  </senderReceiver>");
		
		//Условия поставки
		Текст.ДобавитьСтроку("  <deliveryCondition>");
		Текст.ДобавитьСтроку("    <contract>");
		Если Не обПустоеЗначение(СчетФактура.НомерДоговора) Тогда
			Если НРег(СокрЛП(СчетФактура.НомерДоговора)) = "оферта" Тогда
				Текст.ДобавитьСтроку("      <number>public_offer</number>");
			ИначеЕсли НРег(СокрЛП(СчетФактура.НомерДоговора)) = "без договора" Тогда
				Текст.ДобавитьСтроку("      <number>no_contract</number>");
			Иначе	
				Текст.ДобавитьСтроку("      <number>"+СокрЛП(СчетФактура.НомерДоговора)+"</number>");
			КонецЕсли;	
			Если Не обПустоеЗначение(СчетФактура.ДатаДоговора) Тогда
				Текст.ДобавитьСтроку("      <date>"+Формат(СчетФактура.ДатаДоговора,"ДФ=yyyy-MM-dd")+"</date>");
			КонецЕсли;	
		Иначе
			//Текст.ДобавитьСтроку("      <number>no_contract</number>");
			Текст.ДобавитьСтроку("      <number></number>");
			
		КонецЕсли;	
		Если обПустоеЗначение(СчетФактура.ВидДокументаПоставки) И
			НЕ обПустоеЗначение(СчетФактура.УНППоставщика) И
			СчетФактура.СтатусПоставщика <> Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация И
			НЕ СчетФактура.ФлагНеВыставлятьПолучателю Тогда
			// С 15.01.2018 г. добавлен контроль при выставлении ЭСЧФ обязательности заполнения данных первичного документа,
			// если поле 17. "УНП поставщика" непустое и не равно УНП составителя ЭСЧФ.
			// Если поле "Вид документа поставки" пустое, то поставляем код документа 600, что соответствует виду документа "Без документа"
			
			Если ЗначениеЗаполнено(СчетФактура.ДокументОснование) Тогда
				Если ТипЗнч(СчетФактура.ДокументОснование) <> Тип("ДокументСсылка.СборкаТоваров") Тогда 	
					
					Текст.ДобавитьСтроку("      <documents>");
					Текст.ДобавитьСтроку("        <document>");
					Текст.ДобавитьСтроку("          <docType>");			
					Текст.ДобавитьСтроку("            <code>"+"600"+"</code>");
					Текст.ДобавитьСтроку("          </docType>");
					Текст.ДобавитьСтроку("	        <blankCode></blankCode>");
					Текст.ДобавитьСтроку("	        <seria></seria>");
					Текст.ДобавитьСтроку("	        <number></number>");			
					Текст.ДобавитьСтроку("        </document>");
					Текст.ДобавитьСтроку("      </documents>");
				КонецЕсли; 
			КонецЕсли; 
			
		Иначе	
			Если Не обПустоеЗначение(СчетФактура.ВидДокументаПоставки) ИЛИ
				Не обПустоеЗначение(СчетФактура.ДатаДокументаПоставки) ИЛИ
				Не обПустоеЗначение(СчетФактура.НомерДокументаПоставки) Тогда		
				
				Текст.ДобавитьСтроку("      <documents>");
				Текст.ДобавитьСтроку("        <document>");
				Текст.ДобавитьСтроку("          <docType>");
				Если Не обПустоеЗначение(СчетФактура.ВидДокументаПоставки) Тогда
					Текст.ДобавитьСтроку("            <code>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ВидДокументаПоставки.Код)+"</code>");
				КонецЕсли;
				Если Не обПустоеЗначение(СчетФактура.НазваниеДокументаПоставки) и СокрЛП(СчетФактура.ВидДокументаПоставки.Код="601")Тогда
					Текст.ДобавитьСтроку("            <value>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НазваниеДокументаПоставки)+"</value>");
				КонецЕсли;
				Текст.ДобавитьСтроку("          </docType>");
				Если  Не обПустоеЗначение(СчетФактура.ДатаДокументаПоставки) Тогда
					Текст.ДобавитьСтроку("          <date>"+Формат(СчетФактура.ДатаДокументаПоставки,"ДФ=yyyy-MM-dd")+"</date>");
				КонецЕсли;
				Текст.ДобавитьСтроку("          <blankCode>"+СокрЛП(СчетФактура.КодТипаБланка)+"</blankCode>");
				Текст.ДобавитьСтроку("          <seria>"+СокрЛП(СчетФактура.СерияДокументаПоставки)+"</seria>");
				Текст.ДобавитьСтроку("          <number>"+ЗаменитьНедопустимыеСимволы(СчетФактура.НомерДокументаПоставки)+"</number>");
				
				Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ или СтрокаЭСЧФ.Ссылка.ФлагВозвратаПоАктуНедостачи Тогда  ///////77w 07-05-2020
					Если СтрокаЭСЧФ.ТипЭСЧФ = Перечисления.ТипыЭСЧФ.ДополнительныйБезЭСЧФ Тогда   ///////77w 07-05-2020
						Если СтрокаЭСЧФ.Ссылка.ФлагВозвратТовараЭСЧФ тогда
							Текст.ДобавитьСтроку("	        <refund>true</refund>");
						Иначе
							Текст.ДобавитьСтроку("	        <refund>false</refund>");
						Конецесли;	
						//Текст.ДобавитьСтроку("          <refund>true</refund>");       ///////77w 29-06-2020
						//Текст.ДобавитьСтроку("	        <refund>true</refund>");
					КонецЕсли;	
				КонецЕсли;
				
				Текст.ДобавитьСтроку("        </document>");
				Текст.ДобавитьСтроку("      </documents>");
			КонецЕсли;
		КонецЕсли;	
		Текст.ДобавитьСтроку("    </contract>");
		Текст.ДобавитьСтроку("    <description>"+ЗаменитьНедопустимыеСимволы(СчетФактура.ДополнительныеСведения)+"</description>");
		Текст.ДобавитьСтроку("  </deliveryCondition>");
	КонецЕсли;
	
	//Товары
	СуммаСНДС = ФорматДляВыгрузки(СчетФактура.Номенклатура.Итог("СуммаСНДС"));
	СуммаАкциза = ФорматДляВыгрузки(СчетФактура.Номенклатура.Итог("СуммаАкциза"));
	СуммаНДС = ФорматДляВыгрузки(СчетФактура.Номенклатура.Итог("СуммаНДС"));
	СуммаБезНДС = ФорматДляВыгрузки(СчетФактура.Номенклатура.Итог("СуммаБезНДС"));
	
	
	
	
	
	
	
	
	
	
	
	Текст.ДобавитьСтроку("  <roster totalCostVat="""+СуммаСНДС+""" totalExcise="""+СуммаАкциза+""" totalVat="""+СуммаНДС+
	""" totalCost="""+СуммаБезНДС+""">");
	Для каждого СтрокаТМЦ Из СчетФактура.Номенклатура Цикл
		
		Попытка
			СтрТМЦ = СокрЛП(?(Не ПустаяСтрока(СтрокаТМЦ.ТМЦ.ПолноеНаименование), СокрЛП(СтрокаТМЦ.ТМЦ.ПолноеНаименование), СокрЛП(СтрокаТМЦ.ТМЦ.Наименование)));	
			Страна = "";
			Страна = ?(ЗначениеЗаполнено(СтрокаТМЦ.ТМЦ.СтранаПроисхождения), СтрокаТМЦ.ТМЦ.СтранаПроисхождения, СтрокаТМЦ.ТМЦ.СтранаВвоза);
			СтрТМЦ = СтрТМЦ + ", " +СокрЛП(Страна);       //////////77w qaws
		Исключение
			СтрТМЦ = СокрЛП(СтрокаТМЦ.ТМЦ);			
		КонецПопытки;
		Если СчетФактура.ФлагВыводитьХарактеристикиТМЦ = Истина И
			НЕ обПустоеЗначение(СтрокаТМЦ.ХарактеристикаТМЦ) Тогда
			СтрТМЦ = СтрТМЦ + " " + СокрЛП(СтрокаТМЦ.ХарактеристикаТМЦ.Наименование);	
		КонецЕсли;	
		
		
		ТНВЭД="";
		ФлагВыводитьТНВЭД = Истина;
		// При выгрузке ЭСЧФ на Портал не выгружается код ТНВЭД в следующих случаях:
		// - Если в строке табличной части «Данные по ТМЦ» установлена ставка 20 (25) % или расчетная и статус поставщика «Иностранная организация» и
		//	не заполнены реквизиты ЭСЧФ «20. Регистрационный номер выпуска товаров», «21. Реквизиты заявления о ввозе товаров» или статус поставщика отличен от «Иностранная организация»
		// - Если вид операции выставления ЭСЧФ «Реализация физическим лицам».
		
		//Если ((СтрокаТМЦ.СтавкаНДС > 10 ИЛИ
		//	СтрокаТМЦ.СтавкаНДС.РасчетнаяСтавка) И
		//	НЕ СчетФактура.ФлагВзаимозависимоеЛицоПоставщик И
		//	НЕ СчетФактура.ФлагВзаимозависимоеЛицоПолучатель И
		//	((СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация И
		//	ПустаяСтрока(СчетФактура.НомерГТДПриВвозе) И
		//	ПустаяСтрока(СчетФактура.НомерЗаявленияОВвозеТоваровПриВвозе)) ИЛИ
		//	СчетФактура.СтатусПоставщика <> Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация)) ИЛИ
		//	СчетФактура.ВидОперацииВыставленияЭСЧФ = Перечисления.ВидыОперацийВыставленияЭСЧФ.ФизическиеЛица Тогда
		//	ФлагВыводитьТНВЭД = Ложь;
		//КонецЕсли;  
		
		
		Если СтрокаТМЦ.СтавкаНДС > 10 Тогда
			//СтрокаТМЦ.СтавкаНДС.РасчетнаяСтавка) И
			//НЕ СчетФактура.ФлагВзаимозависимоеЛицоПоставщик И
			//НЕ СчетФактура.ФлагВзаимозависимоеЛицоПолучатель И
			//((СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация И
			//ПустаяСтрока(СчетФактура.НомерГТДПриВвозе) И
			//ПустаяСтрока(СчетФактура.НомерЗаявленияОВвозеТоваровПриВвозе)) ИЛИ
			//СчетФактура.СтатусПоставщика <> Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация)) ИЛИ
			//СчетФактура.ВидОперацииВыставленияЭСЧФ = Перечисления.ВидыОперацийВыставленияЭСЧФ.ФизическиеЛица Тогда
			ФлагВыводитьТНВЭД = Истина;
		КонецЕсли;  
		
		
		
		Если ФлагВыводитьТНВЭД И
			Не обПустоеЗначение(СтрокаТМЦ.ТНВЭД) Тогда
			Попытка
				ТНВЭД = СокрЛП(СтрокаТМЦ.ТНВЭД);
			Исключение
				ТНВЭД = СокрЛП(СтрокаТМЦ.ТНВЭД);			
			КонецПопытки;
		КонецЕсли;
		ОКЭД="";
		Если Не обПустоеЗначение(СтрокаТМЦ.ОКЭД) Тогда
			Попытка
				ОКЭД = СокрЛП(СтрокаТМЦ.ОКЭД.Код);
			Исключение
				ОКЭД = СокрЛП(СтрокаТМЦ.ОКЭД);			
			КонецПопытки;
		КонецЕсли;
		
		СтавкаНДС = "";
		СтавкаНДС = СтрокаТМЦ.СтавкаНДС;
		
		Если СтрокаТМЦ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.НДС0 Тогда				
			ТипСтавки ="ZERO"; 
		ИначеЕсли СтрокаТМЦ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.БезНДС Тогда				
			ТипСтавки ="NO_VAT"; 
			СтавкаНДС = "0";      /////// тут ставка Без НДС
		ИначеЕсли СтрокаТМЦ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.Расчетная Тогда				
			ТипСтавки ="CALCULATED";
			Если СтрокаТМЦ.РасчетнаяСтавкаНДС > 0 Тогда
				СтавкаНДС = СтрокаТМЦ.РасчетнаяСтавкаНДС;
			КонецЕсли;	
		Иначе
			ТипСтавки ="DECIMAL";
		КонецЕсли;
		ДопДаные="";
		
		Если СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ВвознойНДС Тогда
			ДопДаные  = "IMPORT_VAT"; 
		ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ВычетВПолномОбъеме Тогда
			ДопДаные  = "DEDUCTION_IN_FULL";
		ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ОсвобождениеОтНДС Тогда
			ДопДаные  = "VAT_EXEMPTION";
		ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.РеализацияЗаПределамиРБ Тогда
			ДопДаные  = "OUTSIDE_RB";
		ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ПродукцияРастениеводстваПчеловодства Тогда
			ДопДаные  = "FARMING_PRODUCTS"; 
		ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ПродовольственныеТоварыИТоварыДляДетей Тогда
			ДопДаные  = "KID_GOODS"; 
		ИначеЕсли СтрокаТМЦ.ДополнительныеДанные = Перечисления.ДополнительныеДанныеЭСЧФ.ЛекарственныеСредстваИМедицинскиеИзделия Тогда
			ДопДаные  = "MEDICINE_DRUG"; 
		КонецЕсли;	
	
		
		Текст.ДобавитьСтроку("    <rosterItem>");
		Текст.ДобавитьСтроку("      <number>"+ФорматДляВыгрузки(СтрокаТМЦ.НомерСтроки)+"</number>");
		Текст.ДобавитьСтроку("      <name>"+ЗаменитьНедопустимыеСимволы(СтрТМЦ)+"</name>");			
		Текст.ДобавитьСтроку("      <code>"+ТНВЭД+"</code>");			
		Если Не обПустоеЗначение(ОКЭД) Тогда                                
			Текст.ДобавитьСтроку("      <code_oced>"+ОКЭД+"</code_oced>");
		КонецЕсли;
		
		
		
		КодЕдИзм = "";           ////////77w qaws
		
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
		|	УпаковкиЕдиницыИзмерения.Код КАК Код,
		|	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
		|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
		|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияЕдиницаИзмеренияКод
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец = &ВладелецНоменклатура
		|	И УпаковкиЕдиницыИзмерения.Наименование = &НаименованиеЕдИзм";
		
		//|	И УпаковкиЕдиницыИзмерения.Владелец = &ВладелецНаборУпаковак";
		
		Запрос1.УстановитьПараметр("ВладелецНаборУпаковак", Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры);
		Запрос1.УстановитьПараметр("ВладелецНоменклатура", СтрокаТМЦ.ТМЦ);
		Запрос1.УстановитьПараметр("НаименованиеЕдИзм", СтрокаТМЦ.ЕдиницаИзмерения);
		
		РезультатЗапроса1 = Запрос1.Выполнить();
		
		ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
			КодЕдИзм =  ВыборкаДетальныеЗаписи1.Ссылка.ЕдиницаИзмерения.ЕдиницаИзмерения.Код;
		КонецЦикла;
		
		
		
		Если Не обПустоеЗначение(КодЕдИзм) Тогда
			Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
		Иначе
			
			Если СтрНайти(СтрокаТМЦ.ЕдиницаИзмерения,"тыс") > 0 Тогда
				КодЕдИзм = "798";
				Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
			КонецЕсли; 
			
			Если обПустоеЗначение(КодЕдИзм) Тогда
				Если СтрНайти(СтрокаТМЦ.ЕдиницаИзмерения,"шт") > 0 Тогда
					КодЕдИзм = "796";
					Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
				КонецЕсли; 
			КонецЕсли; 
			
			Если СтрНайти(СтрокаТМЦ.ЕдиницаИзмерения,"кг") > 0 Тогда
				КодЕдИзм = "166";
				Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
			КонецЕсли; 
			
			Если СтрНайти(СтрокаТМЦ.ЕдиницаИзмерения,"пак") > 0 Тогда
				КодЕдИзм = "796";
				Текст.ДобавитьСтроку("      <units>"+СокрЛП(КодЕдИзм)+"</units>");  
			КонецЕсли; 
			
			
		КонецЕсли;
		
		Текст.ДобавитьСтроку("      <count>"+ФорматДляВыгрузки(СтрокаТМЦ.Количество)+"</count>");
		Текст.ДобавитьСтроку("      <price>"+ФорматДляВыгрузки(СтрокаТМЦ.Цена)+"</price>");
		Если СтрокаТМЦ.СтавкаНДСОбъект = Перечисления.СтавкиНДС.Расчетная Тогда
			// Для расчетной ставки сумма без НДС = сумме с НДС
			Текст.ДобавитьСтроку("      <cost>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаСНДС)+"</cost>");
		Иначе
			Текст.ДобавитьСтроку("      <cost>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаБезНДС)+"</cost>");
		КонецЕсли;	
		
		Текст.ДобавитьСтроку("      <summaExcise>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаАкциза)+"</summaExcise>");
		Текст.ДобавитьСтроку("      <vat>");
		Текст.ДобавитьСтроку("        <rate>"+ФорматДляВыгрузки(СтавкаНДС)+"</rate>");
		Текст.ДобавитьСтроку("        <rateType>"+ТипСтавки+"</rateType>");
		Текст.ДобавитьСтроку("        <summaVat>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаНДС)+"</summaVat>");
		Текст.ДобавитьСтроку("      </vat>");
		Текст.ДобавитьСтроку("      <costVat>"+ФорматДляВыгрузки(СтрокаТМЦ.СуммаСНДС)+"</costVat>");
		Если СчетФактура.СтатусПоставщика = Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация Тогда //////И        77w qaws
			//(СтрокаТМЦ.СтавкаНДС = Справочники.СтавкиНДС._0 ИЛИ
			//СтрокаТМЦ.СтавкаНДС = Справочники.СтавкиНДС.БезНДС) Тогда
			Текст.ДобавитьСтроку("      <descriptions>");
			Текст.ДобавитьСтроку("        <description>"+ДопДаные+"</description>");
			//Текст.ДобавитьСтроку("        <description>IMPORT_VAT</description>");
			//Текст.ДобавитьСтроку("        <description>VAT_EXEMPTION</description>");	
			Текст.ДобавитьСтроку("      </descriptions>");
		Иначе	
			Если Не обПустоеЗначение(ДопДаные) Тогда
				Текст.ДобавитьСтроку("      <descriptions>");
				Текст.ДобавитьСтроку("        <description>"+ДопДаные+"</description>");
				Текст.ДобавитьСтроку("      </descriptions>");
			КонецЕсли;
		КонецЕсли;
		Текст.ДобавитьСтроку("    </rosterItem>");
	КонецЦикла;
	Текст.ДобавитьСтроку("  </roster>");
	Текст.ДобавитьСтроку("</issuance>");
	
	ИмяФайла = "invoice_"+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ);
	//СтрокаЭСЧФ.ИмяФайла = ИмяФайла;
	лФайл = Новый Файл(КаталогРазмещенияФайлов+"\in\");	
	Если Не лФайл.Существует() Тогда
		СоздатьКаталог(КаталогРазмещенияФайлов+"\in\");
	КонецЕсли;
	
	Попытка
		Текст.Записать(КаталогРазмещенияФайлов+"\in\"+ИмяФайла+".xml","CESU-8");
		

		//////////ВОЗВРАТ;	
		
		//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		
		////ПодписатьОтправить(ИмяФайла,СтрокаЭСЧФ);
		
		
	КомандаОбновитьСОС= "C:\Program Files (x86)\Avest\AvPCM_nces\get_crl.bat";
	
	Shell = Новый COMОбъект("WScript.Shell");
	WshExec = Shell.Exec(КомандаОбновитьСОС);
	OutStream = WshExec.StdOut;  
	
	Str = "";
	Пока Не OutStream.AtEndOfStream Цикл
		Str = СокрЛП(OutStream.ReadLine());
	КонецЦикла;
	
	
	////КаталогРазмещенияФайлов = "\\192.168.0.111\eInvVat";
	
	Соединение = Неопределено;
	Отказ = ложь;
	ТекстОшибки = "";
	СтрокаСоединения = "";
	
	//СтрокаСоедиенения = "PUB_KEY_ID=" + СокрЛП(СтрЗаменить(НастройкиПодключенияОрг.Ключ, " ", "")) + ";PASSWORD_KEY=" + НастройкиПодключенияОрг.Пароль;
	СтрокаСоединения = "UNP=600052664" + ";PASSWORD_KEY=293358595";
	
	Попытка
		Соединение = ПолучитьСоединениеМНС(СтрокаСоединения, ТекстОшибки, Отказ);
	Исключение
   		Возврат;
	КонецПопытки; 
	//Соединение = ПолучитьСоединениеМНС(СтрокаСоединения, ТекстОшибки, Отказ);
	
	Если Соединение <> Неопределено Тогда
		
		ПараметрыПодключения = Новый Соответствие;
		ПараметрыПодключения.Вставить("Соединение",Соединение);
		
		EVatService = ПараметрыПодключения.Получить("Соединение");
	Иначе
		Возврат;
	КонецЕсли;	
		
		
		
		
		//Чтение файла
		InvVatXml = EVatService.CreateEDoc; 
		Если InvVatXml.Document.LoadFromFile(КаталогРазмещенияФайлов+"\in\"+ИмяФайла+".xml") <> 0 Тогда
			Сообщить("Ошибка чтения файла: " + EVatService.LastError);
			Возврат;
		КонецЕсли;
		
		////Проверка XML файла на соответствие  xsd -схеме
		//InvVatType = InvVatXml.Document.GetXmlNodeValue("issuance/general/documentType");
		//Если InvVatType = "ORIGINAL" ИЛИ 
		//	InvVatType = "ADD_NO_REFERENCE" Тогда
		//	xsd = "MNSATI_original.xsd";
		//ИначеЕсли  InvVatType =  "FIXED" Тогда
		//	xsd = "MNSATI_fixed.xsd";
		//ИначеЕсли InvVatType = "ADDITIONAL" Тогда
		//	xsd = "MNSATI_additional.xsd";
		//Иначе
		//	Сообщить("Файл " + ИмяФайла+".xml содержит неверный тип документа");	  
		//	//возврат;
		//	Продолжить;
		//КонецЕсли;
		
		//////// 77w qaws   07-07-2020
		
		//Проверка XML файла на соответствие  xsd -схеме
		InvVatType = InvVatXml.Document.GetXmlNodeValue("issuance/general/documentType");
		Если InvVatType = "ORIGINAL" Тогда 
			//ИЛИ InvVatType = "ADD_NO_REFERENCE" Тогда
			xsd = "MNSATI_original.xsd";
		ИначеЕсли  InvVatType =  "FIXED" Тогда
			xsd = "MNSATI_fixed.xsd";
		ИначеЕсли InvVatType = "ADDITIONAL" Тогда
			xsd = "MNSATI_additional.xsd";
		ИначеЕсли InvVatType = "ADD_NO_REFERENCE" Тогда
			xsd = "MNSATI_add_no_reference.xsd";
		Иначе
			Сообщить("Файл " + ИмяФайла+".xml содержит неверный тип документа");	  
			Возврат;
		КонецЕсли;
		
		
		лФайл = Новый Файл(КаталогРазмещенияФайлов+"\xsd\" + xsd); 
		
		
		
		Если Не лФайл.Существует() Тогда
			Сообщить( "Отсутствует файл " + КаталогРазмещенияФайлов+"\xsd\" + xsd+".Скачайте актуальные схемы на портале и положите их в папку "+КаталогРазмещенияФайлов+"\xsd\");
			Возврат;
		КонецЕсли;//
		
		res = InvVatXml.Document.ValidateXML(КаталогРазмещенияФайлов+"\xsd\" + xsd, 0);
		
		Если res <> 0 Тогда
			Сообщить( EVatService.LastError + " Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ) +" не соответствует требуемой схеме xsd");
			Заметка = Справочники.Заметки.СоздатьЭлемент();
			Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
			Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
			Заметка.ТекстСодержания =  EVatService.LastError + " Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ) +" не соответствует требуемой схеме xsd";
			
			//Заметка.Содержание = ОписаниеОшибки();
			//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
			Заметка.ТекстЗаметки =  EVatService.LastError + " Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ) +" не соответствует требуемой схеме xsd";
			Заметка.ДляРабочегоСтола = Истина;
			Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
			Заметка.Записать();
			Возврат;
		КонецЕсли;
		
		
		
		
		
		
		//Выработка подписи
		res = InvVatXml.Sign(0);
		Если res <> 0 Тогда
			Сообщить("Ошибка выработки подписи: " + EVatService.LastError);
			Возврат;
		КонецЕсли;
		
		//Сохранение подписанного файла с расширением ".edoc.xml"
		лФайл = Новый Файл(КаталогРазмещенияФайлов+"\out\");	
		Если Не лФайл.Существует() Тогда
			СоздатьКаталог(КаталогРазмещенияФайлов+"\out\");
		КонецЕсли;
		
		fn = КаталогРазмещенияФайлов+"\out\"+ИмяФайла+ ".edoc.xml";
		res = InvVatXml.SaveToFile(fn);
		Если res <> 0 Тогда
			Сообщить("Ошибка сохранения подписанного документа: " + EVatService.LastError);
			Возврат;
		КонецЕсли;
		
		//Отправка подписанного документа на портал ЭСФЧ               /////// 77w qaws    ТУТ ОТПРАВКА ПОЛНАЯ
		res = EVatService.SendEDoc(InvVatXml);
		Если res <> 0 Тогда
			Сообщить("Ошибка отправки: " + EVatService.LastError);
			Возврат;
		Иначе
			//Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" отправлен");
		КонецЕсли;
		
		//Ответ от портала ЭСФЧ будет сохранен в фале с расширением ".ticket.error.xml" в случае 
		// ошибки  и с   ".ticket.xml"  в случае успешного принятия файла сервисом
		
		InvVatTicket = EVatService.Ticket;
		Если InvVatTicket.Accepted <> 0 Тогда
			Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят: " + InvVatTicket.Message);
			
			Заметка = Справочники.Заметки.СоздатьЭлемент();
			Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
			Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
			Заметка.ТекстСодержания =  "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят: " + InvVatTicket.Message;
			
			//Заметка.Содержание = ОписаниеОшибки();
			//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
			Заметка.ТекстЗаметки =  "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят: " + InvVatTicket.Message;
			Заметка.ДляРабочегоСтола = Истина;
			Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
			Заметка.Записать();
			
			fn = КаталогРазмещенияФайлов+"\out\"+ИмяФайла+ ".ticket.error.xml";
		Иначе
			
			Попытка
				InvVatStatus = EVatService.GetStatus(СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ));
				Если InvVatStatus.Verify() = 0 Тогда 
					//Сообщить("Message: " + InvVatStatus.Message); 
					Статус = InvVatStatus.Status;
					//Сообщить("Status : " + Статус);
					Если Статус="COMPLETED" Тогда
						СтрокаЭСЧФ.СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен");	
						СтрокаЭСЧФ.НовыйСтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен");
						Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
						
					ИначеЕсли Статус="COMPLETED_SIGNED" Тогда  
						СтрокаЭСЧФ.СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.Выставлен_Подписан");
						Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
					ИначеЕсли Статус="ON_AGREEMENT" Тогда  
						СтрокаЭСЧФ.СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.НаСогласовании");
						Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" успешно принят сервисом. Статус: "+Статус);
					ИначеЕсли Статус="IN_PROGRESS" Тогда
						СтрокаЭСЧФ.СтатусЭСЧФ = ПредопределенноеЗначение("Перечисление.СтатусыЭСЧФ.ВРазработке");
					ИначеЕсли Статус="ERROR" Тогда
						//Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status);
						Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
						Заметка = Справочники.Заметки.СоздатьЭлемент();
						Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
						Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
						Заметка.ТекстСодержания = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
						
						//Заметка.Содержание = ОписаниеОшибки();
						//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
						Заметка.ТекстЗаметки = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
						Заметка.ДляРабочегоСтола = Истина;
						Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
						Заметка.Записать();
					Иначе
						//Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status);
						Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
						
						//Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status);
						Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
						Заметка = Справочники.Заметки.СоздатьЭлемент();
						Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
						Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
						Заметка.ТекстСодержания = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
						
						//Заметка.Содержание = ОписаниеОшибки();
						//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
						Заметка.ТекстЗаметки = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
						Заметка.ДляРабочегоСтола = Истина;
						Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
						Заметка.Записать();
						
						
						//	Возврат;
					КонецЕсли;
					
					
					//ЭСЧФ_Объект = СтрокаЭСЧФ.Ссылка.ПолучитьОбъект();
					//
					//Если ЭСЧФ_Объект <> Документы.ЭСЧФИсходящий.ПустаяСсылка()  Тогда
					//	Если ЭСЧФ_Объект.НовыйСтатусЭСЧФ <> Перечисления.СтатусыЭСЧФ.ПустаяСсылка()  Тогда
					//		Если ЭСЧФ_Объект.НовыйСтатусЭСЧФ <> ЭСЧФ_Объект.СтатусЭСЧФ Тогда
					//			ЭСЧФ_Объект.СтатусЭСЧФ = ЭСЧФ_Объект.НовыйСтатусЭСЧФ;
					//			ЭСЧФ_Объект.ДатаИзмененияСтатуса = ЭСЧФ_Объект.ДатаИзмененияСтатуса;
					//			ЭСЧФ_Объект.Записать();
					//		КонецЕсли; 
					//	КонецЕсли; 
					//КонецЕсли;
					//
					//
					//
					//Если ((СтрокаЭСЧФ.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен)
					//	или (СтрокаЭСЧФ.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен_Подписан)
					//	или (СтрокаЭСЧФ.Ссылка.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.НаСогласовании)
					//	) Тогда
					//	
					//		 ДокРеализ = СтрокаЭСЧФ.Ссылка.ДокументОснование.ПолучитьОбъект();		
					//		 ДокРеализ.ЭСЧФ = СтрокаЭСЧФ.Ссылка;
					//		 Попытка
					//		 ДокРеализ.Записать();	
					//		 Исключение
					//		     //ОписаниеОшибки()
					//		 КонецПопытки; 
					//КонецЕсли; 
					
					
				Иначе 
					Сообщить("Ошибка статуса: " + InvVatStatus.LastError+"   "+"Message: " + InvVatStatus.Message); 
					//Возврат; 
				КонецЕсли;
			Исключение
				Сообщить("Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message);
				Заметка = Справочники.Заметки.СоздатьЭлемент();
				Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Ладутько");
				Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
				Заметка.ТекстСодержания = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
				
				//Заметка.Содержание = ОписаниеОшибки();
				//Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
				Заметка.ТекстЗаметки = "Документ "+СокрЛП(СтрокаЭСЧФ.НомерЭСЧФ)+" не принят сервисом "+InvVatStatus.Status+"   "+"Message: " + InvVatStatus.Message;
				Заметка.ДляРабочегоСтола = Истина;
				Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
				Заметка.Записать();
				//Возврат;
			КонецПопытки;
			
			//Сообщить("Message: " + InvVatStatus.Message); 
			
			//Заметка = Справочники.Заметки.СоздатьЭлемент();
			//Заметка.Автор = Справочники.Пользователи.НайтиПоНаименованию("Труханович Марина");
			//Заметка.Наименование = "" + ТекущаяДата() + " Ошибка при отправке ЭСЧФ";
			//Заметка.ТекстСодержания = "Message: " + InvVatStatus.Message;
			//
			////Заметка.Содержание = ОписаниеОшибки();
			////Заметка.Содержание = Новый ХранилищеЗначения(ОписаниеОшибки());
			//Заметка.ТекстЗаметки = "" + "Message: " + InvVatStatus.Message;
			//Заметка.ДляРабочегоСтола = Истина;
			//Заметка.Пометка = Перечисления.ЦветаЗаметок.Красный;
			//Заметка.Записать();
			
			
			//ИЗМЕНИТЬ_СТАТУС_ЭСЧФ(СтрокаЭСЧФ.Ссылка,СтрокаЭСЧФ.СтатусЭСЧФ,СтрокаЭСЧФ.ДатаИзмененияСтатуса);
			//СВЯЗАТЬ_РЕАЛИЗАЦИЮ_ИЗМЕНИТЬ_СТАТУС_ЭСЧФ(СтрокаЭСЧФ.Ссылка,СтрокаЭСЧФ.СтатусЭСЧФ,СтрокаЭСЧФ.ДатаИзмененияСтатуса);
			
			
			
			
			
			
		КонецЕсли;  
		
		
		
		
		//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		
		
		
		//Если ИзменятьСтатусЭСЧФ  Тогда    ////////77w qaws
		//	СтрокаЭСЧФ.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен;
		//КонецЕсли;
		
	Исключение
		Сообщить("Ошибка записи файла!"+Символы.ПС+ОписаниеОшибки());
		СтрокаЭСЧФ.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.ВРазработке_Ошибка;
	КонецПопытки;
	
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	
	
	ЭСЧФ_Объект = ЭСЧФ.ПолучитьОбъект();
	
	Если ЭСЧФ_Объект.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен_Подписан Тогда
		
		ЭСЧФ_Объект.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен_Аннулирование;
		
	ИначеЕсли ЭСЧФ_Объект.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Выставлен Тогда
		
		ЭСЧФ_Объект.СтатусЭСЧФ = Перечисления.СтатусыЭСЧФ.Аннулирован;
		
	Иначе
		
	КонецЕсли; 
	
	Попытка
		ЭСЧФ_Объект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
	    //ОписаниеОшибки()
	КонецПопытки; 
	
	
	//	
	//Исключение
	//	//ОписаниеОшибки()
	//КонецПопытки; 
	//
	
	
	
	
КонецПроцедуры

Функция Статус(СтатусПортала)
	Если СтатусПортала="COMPLETED" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.Выставлен;                                     
	ИначеЕсли СтатусПортала="COMPLETED_SIGNED" Тогда  
		Возврат Перечисления.СтатусыЭСЧФ.Выставлен_Подписан;
	ИначеЕсли СтатусПортала="IN_PROGRESS" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.ВРазработке;
	ИначеЕсли СтатусПортала="IN_PROGRESS_ERROR" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.ВРазработке_Ошибка;
	ИначеЕсли СтатусПортала="ON_AGREEMENT" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.НаСогласовании;
	ИначеЕсли СтатусПортала="CANCELLED" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.Аннулирован;
	ИначеЕсли СтатусПортала="ON_AGREEMENT_CANCEL" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.Выставлен_Аннулирование;
	ИначеЕсли СтатусПортала="ERROR" Тогда
		Возврат Перечисления.СтатусыЭСЧФ.ВРазработке_Ошибка;
	КонецЕсли; 
КонецФункции // Статус

Функция ДатаСтатуса(_Дата)
	Год = Число(лев(_Дата,4));
	Месяц = Число(сред(_Дата,6,2)); 
	День = Число(сред(_Дата,9,2));
	Возврат Дата(Год,Месяц,День);
КонецФункции // ДатаСтатуса


функция ПроверитьСтатусЭСЧФ(НомерЭСЧФ)
	
	//Структура = Новый Структура;
	//
	////EVatService = ПараметрыПодключения.Получить("Соединение");
	//
	//InvVatStatus = EVatService.GetStatus(СокрЛП(НомерЭСЧФ));
	//Если InvVatStatus = Неопределено Тогда
	//	Сообщить("Ошибка при получении статуса ЭСЧФ " + СокрЛП(НомерЭСЧФ) + ":" + EVatService.LastError);
	//	Возврат Структура;
	//КонецЕсли;
	//
	//Если InvVatStatus.Verify() = 0 Тогда		
	//	Если InvVatStatus.Status = "NOT_FOUND" Тогда
	//		Сообщить("ЭСЧФ "+ СокрЛП(НомерЭСЧФ)+" не найден на портале!");
	//	ИначеЕсли InvVatStatus.Status = "ERROR" Тогда
	//		Сообщить("ЭСЧФ "+ СокрЛП(НомерЭСЧФ)+" сформирован с ошибкой! Ошибка: "+СокрЛП(InvVatStatus.Message), СтатусСообщения.ОченьВажное);
	//		Структура.Вставить("СтатусПортала",Статус(InvVatStatus.Status));
	//		Структура.Вставить("ДатаИзмененияСтатуса",ТекущаяДата());
	//	Иначе
	//		Структура.Вставить("СтатусПортала",Статус(InvVatStatus.Status));
	//		Структура.Вставить("ДатаИзмененияСтатуса",ДатаСтатуса(InvVatStatus.Since));
	//	КонецЕсли;
	//Иначе 
	//	Сообщить("Ошибка статуса: " + EVatService.LastError);	
	//КонецЕсли;	

	//Возврат Структура;
	
КонецФункции	


Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = " ") 
     
    Позиция = НайтиНедопустимыеСимволыXML(Текст); 
    Пока Позиция > 0 Цикл 
        ТекущийСимвол = Сред(Текст, Позиция, 1); 
        Если ТекущийСимвол = "&" Тогда    // уже заменяли 
            Позиция = НайтиНедопустимыеСимволыXML(Текст,Позиция+1); 
            Продолжить; 
        КонецЕсли; 
        Текст = СтрЗаменить(Текст, ТекущийСимвол, СимволЗамены); 
        Позиция = НайтиНедопустимыеСимволыXML(Текст,Позиция+1); 
    КонецЦикла; 
     
    Возврат Текст; 
     
КонецФункции 

Функция ЗаменитьНедопустимыеСимволы(_стр)
	стр = СокрЛП(_стр);
	стр = СтрЗаменить(стр,"&","&amp;");
	стр = СтрЗаменить(стр,"<","&lt;");
	стр = СтрЗаменить(стр,">","&gt;");
    стр = СтрЗаменить(стр,"""","&quot;");
	ЗаменитьНедопустимыеСимволыXML(стр);
	Возврат стр;
КонецФункции

Функция ФорматДляВыгрузки(стр)
	Возврат Формат(стр,"ЧРД=.; ЧН=; ЧГ=0");
КонецФункции

функция ПолучитьСтатусПолучателя(Статус)
	
	Если Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Покупатель Тогда
		СтатусПолучателя = "CUSTOMER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Потребитель Тогда
		СтатусПолучателя = "CONSUMER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Комитент Тогда
		СтатусПолучателя = "CONSIGNOR";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Комиссионер Тогда
		СтатусПолучателя = "COMMISSIONAIRE";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПлательщикПолучающийВычеты Тогда
		СтатусПолучателя = "TAX_DEDUCTION_RECIPIENT";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПокупательОбъектаУИностраннойОрганизации Тогда
		СтатусПолучателя = "FOREIGN_ORGANIZATION_BUYER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПлательщикПолучающийОборотыПоРеализации Тогда
		СтатусПолучателя = "TURNOVERS_ON_SALE_RECIPIENT";
	КонецЕсли;
	
	Возврат СтатусПолучателя;
	
КонецФункции

функция ПолучитьСтатусПоставщика(Статус)
	
	Если Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Продавец Тогда
		СтатусПоставщика = "SELLER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Комитент Тогда
		СтатусПоставщика = "CONSIGNOR";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Комиссионер Тогда
		СтатусПоставщика = "COMMISSIONAIRE";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ИностраннаяОрганизация Тогда
		СтатусПоставщика = "FOREIGN_ORGANIZATION";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Посредник Тогда
		СтатусПоставщика = "AGENT";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.Заказчик Тогда
		СтатусПоставщика = "DEVELOPER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ДоверительныйУправляющий Тогда
		СтатусПоставщика = "TRUSTEE";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПлательщикПередающийВычеты Тогда
		СтатусПоставщика = "TAX_DEDUCTION_PAYER";
	ИначеЕсли Статус=Перечисления.СтатусыКонтрагентаЭСЧФ.ПлательщикПередающийОборотыПоРеализации Тогда
		СтатусПоставщика = "TURNOVERS_ON_SALE_PAYER";
	КонецЕсли;
	Возврат СтатусПоставщика;
	
КонецФункции



Функция  КомпонентаУстановлена(ТекстОшибки, Отказ)
	
	EVatService = Неопределено;
	
	Попытка 
		#Если ВебКлиент Тогда
			ПодключитьВнешнююКомпоненту("ОбщийМакет.EInvVatService_Локализация");
			EVatService = Новый ComОбъект("EInvVatService.Connector");
		#Иначе 
			EVatService = Новый ComОбъект("EInvVatService.Connector");
		#КонецЕсли	
		
	Исключение
		ТекстОшибки = Описаниеошибки(); //Нстр("ru='Не установлена компонента для доступа к порталу ЭСЧФ'");
		Отказ = Истина;
	КонецПопытки;
	
	Возврат EVatService;
	
КонецФункции

Функция ПолучитьСоединениеМНС(СтрокаСоединения, ТекстОшибки, Отказ)
		
	EVatService = КомпонентаУстановлена(ТекстОшибки, Отказ);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	ПутьКВебСервису = "https://ws.vat.gov.by:443/InvoicesWS/services/InvoicesPort";   /////РЕАЛЬНЫЙ   ПОРТАЛ
	//ПутьКВебСервису = "https://185.32.226.170:4443/InvoicesWS/services/InvoicesPort"; //// тестовый веб-сервис 
	
	Если EVatService.Login(СтрокаСоединения, 0) = 0 Тогда
		                         
		Если  EVatService.Connect(ПутьКВебСервису) = 0 Тогда 
			Возврат EVatService;
		Иначе
			ТекстОшибки = Нстр("ru='Ошибка авторизации на портале ЭСЧФ: '") + EVatService.LastError;
			Сообщить(ТекстОшибки);
		КонецЕсли;
		
	Иначе
		ТекстОшибки = Нстр("ru='Ошибка авторизации на портале ЭСЧФ: '") + EVatService.LastError; 
		Сообщить(ТекстОшибки);
		
	КонецЕсли;
	
	Отказ = Истина;
	
	
	Возврат Неопределено;
	
КонецФункции


Функция обПустоеЗначение(Значение) 

	ТипЗначения = ТипЗнч(Значение);

	// Сначала примитивные типы
	Если Значение = Неопределено Тогда
		Возврат Истина;
	ИначеЕсли Значение = NULL Тогда
		Возврат Истина;
	ИначеЕсли Лев(Значение,18) = "<Объект не найден>" Тогда
		Возврат Истина;
	ИначеЕсли ТипЗначения = Тип("Тип") Тогда
		Возврат Истина;
	ИначеЕсли ТипЗначения = Тип("Строка") Тогда
		Возврат ПустаяСтрока(Значение);
	ИначеЕсли ТипЗначения = Тип("Число") Тогда
		Возврат ?(Значение = 0,Истина,Ложь);
	ИначеЕсли ТипЗначения = Тип("Дата") Тогда
		Возврат ?(Значение = Дата('00010101'),Истина,Ложь);
	ИначеЕсли ТипЗначения = Тип("Булево") Тогда
		Возврат Ложь; // Булево будем считать не пустым всегда
	ИначеЕсли ТипЗначения = Тип("Граница") Тогда
		Возврат обПустоеЗначение(Значение.Значение);
	ИначеЕсли ТипЗначения = Тип("Массив")
				ИЛИ ТипЗначения = Тип("СписокЗначений")
				ИЛИ ТипЗначения = Тип("ТаблицаЗначений")
				ИЛИ ТипЗначения = Тип("Структура") Тогда
		Возврат ?(Значение.Количество() = 0,Истина, Ложь);
    ИначеЕсли ТипЗначения = Тип("СтрокаТаблицыЗначений") Тогда
        Возврат Ложь;	
	ИначеЕсли ТипЗначения = Тип("ЭлементСпискаЗначений") Тогда
		Возврат Ложь;
	#Если Клиент Тогда	
		ИначеЕсли ТипЗначения = Тип("Форма") Тогда
			Возврат Ложь;
	#КонецЕсли				
	Иначе
		Возврат ?(Значение = Новый(ТипЗначения),Истина,Ложь);
	КонецЕсли; 

	Возврат Ложь;
	
КонецФункции // обПустоеЗначение()



#КонецОбласти

#КонецОбласти

#КонецЕсли

Процедура ЗаполнитьДанныеДляОбменаСБухгалтерией()
	
	
	
			////////////////////// Предварительный расчет
			ТЗ_Товары = Новый ТаблицаЗначений;
			ТЗ_Товары = ЭтотОбъект.Товары.Выгрузить();
			ТЗ_Товары.Свернуть("СтавкаНДС","Сумма,СуммаНДС,СуммаСНДС");
			
    		НДС_20_ПоДоку = 0;
    		НДС_10_ПоДоку = 0;
    		БЕЗ_НДС_ПоДоку = 0;
    		
    		Выручка_С_НДС_20_ПоДоку = 0;
    		Выручка_С_НДС_10_ПоДоку = 0;
    		Выручка_БЕЗ_НДС_ПоДоку = 0;
    		
    		Для каждого Строка Из ТЗ_Товары Цикл
    			
    			Если Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
    				НДС_20_ПоДоку = НДС_20_ПоДоку + Строка.СуммаНДС;
    				Выручка_С_НДС_20_ПоДоку = Выручка_С_НДС_20_ПоДоку + Строка.СуммаСНДС;
    			КонецЕсли; 
    			
    			Если Строка.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
    				НДС_10_ПоДоку = НДС_10_ПоДоку + Строка.СуммаНДС;
    				Выручка_С_НДС_10_ПоДоку = Выручка_С_НДС_10_ПоДоку + Строка.СуммаСНДС;
    			КонецЕсли; 
    			
    			Если Строка.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
    				БЕЗ_НДС_ПоДоку = БЕЗ_НДС_ПоДоку + Строка.СуммаНДС;
    				Выручка_БЕЗ_НДС_ПоДоку = Выручка_БЕЗ_НДС_ПоДоку + Строка.СуммаСНДС;
    			КонецЕсли; 
	
			КонецЦикла; 
			

			НДСВсего = 0;
			СебестоимостьВсего = 0;
			
			ТаблДвиженийВыручкаИСебестоимость = Новый ТаблицаЗначений;

			ТаблДвиженийВыручкаИСебестоимость = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаВыручкаИСебестоимостьПродаж;
   			ТаблДвиженийВыручкаИСебестоимость.Колонки.Добавить("ВидТМЦНаименование");
   			ТаблДвиженийВыручкаИСебестоимость.Колонки.Добавить("ВидТМЦСчет");
			
			СебестоимостьВсего = ТаблДвиженийВыручкаИСебестоимость.Итог("СуммаВыручкиРегл");
			НДСВсего = ТаблДвиженийВыручкаИСебестоимость.Итог("СуммаВыручкиСНДСРегл") - ТаблДвиженийВыручкаИСебестоимость.Итог("СуммаВыручкиРегл");
			
			Для каждого СтрокаДвижения Из ТаблДвиженийВыручкаИСебестоимость Цикл
				СтрокаДвижения.ВидТМЦНаименование = ""+СокрЛП(СтрокаДвижения.АналитикаУчетаНоменклатуры.Номенклатура.ВидТМЦ.Наименование);
				СтрокаДвижения.ВидТМЦСчет = ""+СокрЛП(СтрокаДвижения.АналитикаУчетаНоменклатуры.Номенклатура.ВидТМЦ.Счет); 
			КонецЦикла; 
			
			ТаблДвиженийВыручкаИСебестоимость.Свернуть("ВидТМЦСчет","СебестоимостьРегл");
			
			СебестоимостьФасованных4122 = 0;		
			СебестоимостьТары413 = 0;
			Себестоимость4111 = 0;
			
			Для каждого СтрокаТара Из ТаблДвиженийВыручкаИСебестоимость Цикл

				Если СокрЛП(СтрокаТара.ВидТМЦСчет) = "41.33" Тогда
					 СебестоимостьТары413 = СебестоимостьТары413 + СтрокаТара.СебестоимостьРегл;
				
				ИначеЕсли СокрЛП(СтрокаТара.ВидТМЦСчет) = "41.22" Тогда
					 СебестоимостьФасованных4122 = СебестоимостьФасованных4122 + СтрокаТара.СебестоимостьРегл;
						
					ИначеЕсли СокрЛП(СтрокаТара.ВидТМЦСчет) = "" Тогда
					 Себестоимость4111 = Себестоимость4111 + СтрокаТара.СебестоимостьРегл;
				КонецЕсли;
			КонецЦикла; 
			
			//////////////Конт информация

		
			ЮрАдрес = "";
			ФактАдрес = "";
			Телефон = "";
			Для каждого стрИнфо Из ЭтотОбъект.Контрагент.КонтактнаяИнформация Цикл
				Если стрИнфо.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
					ЮрАдрес	= стрИнфо.Представление;			
				ИначеЕсли стрИнфо.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
					ФактАдрес = стрИнфо.Представление;
				ИначеЕсли стрИнфо.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента Тогда
					Телефон = стрИнфо.Представление;
				КонецЕсли;
			КонецЦикла; 
			///
		БлаготворительностьОбмен = 0;
		Если ЭтотОбъект.Благотворительность = ИСТИНА Тогда
			БлаготворительностьОбмен = 1			
		КонецЕсли; 
		
		БезвозмезднаяПередача = 0;
		Если ЭтотОбъект.БезвозмезднаяПередача = ИСТИНА Тогда
			БезвозмезднаяПередача = 1;
		КонецЕсли;
					
		Если ЭтотОбъект.ПометкаУдаления = ЛОЖЬ Тогда
			ПометкаУдаления = 0;
		КонецЕсли;

	
	НаборЗаписейОбменРеализация = РегистрыСведений.Обмен_Реализация.СоздатьНаборЗаписей();
	НаборЗаписейОбменРеализация.Отбор.РеализацияСсылка.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписейОбменРеализация.Прочитать();
	
	Если НаборЗаписейОбменРеализация.Количество() > 0 Тогда
		
		ЕстьИзменения = ЛОЖЬ;	
		
		Для каждого стр Из НаборЗаписейОбменРеализация Цикл
			
			Если НачалоДня(стр.ДатаДок) <> НачалоДня(ЭтотОбъект.Дата) Тогда
				стр.ДатаДок = ЭтотОбъект.Дата;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.НомерДок <> ЭтотОбъект.НомерБСО Тогда			
				стр.НомерДок = ЭтотОбъект.НомерБСО;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли; 
			
			Если СокрЛП(стр.УНП) <> СокрЛП(ЭтотОбъект.Контрагент.ИНН) Тогда
				стр.УНП = СокрЛП(ЭтотОбъект.Контрагент.ИНН);
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.Клиент <> ЭтотОбъект.Контрагент.Наименование Тогда
				стр.Клиент = ЭтотОбъект.Контрагент.Наименование;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли; 
			
			Если стр.КлиентПолноеНаименование <> ЭтотОбъект.Контрагент.НаименованиеПолное Тогда
				стр.КлиентПолноеНаименование = ЭтотОбъект.Контрагент.НаименованиеПолное;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли; 
			
			Если стр.КодФилиалаКонтрагента <> ЭтотОбъект.Контрагент.КодФилиала Тогда
				стр.КодФилиалаКонтрагента = ЭтотОбъект.Контрагент.КодФилиала;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.СуммаДокумента <> ЭтотОбъект.СуммаДокумента Тогда
				стр.СуммаДокумента = ЭтотОбъект.СуммаДокумента;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.Договор <> ЭтотОбъект.Договор.Наименование Тогда			
				стр.Договор = ЭтотОбъект.Договор.Наименование;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.UID_DOG <> ЭтотОбъект.Договор.Ссылка.УникальныйИдентификатор() Тогда
				стр.UID_DOG = ЭтотОбъект.Договор.Ссылка.УникальныйИдентификатор();
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.РасчетныйСчет <> ЭтотОбъект.БанковскийСчетКонтрагента Тогда
				стр.РасчетныйСчет = ЭтотОбъект.БанковскийСчетКонтрагента;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.БИКБанка <> ЭтотОбъект.БанковскийСчетКонтрагента.БИКБанка Тогда		
				стр.БИКБанка = ЭтотОбъект.БанковскийСчетКонтрагента.БИКБанка;
				ЕстьИзменения = ИСТИНА;		
			КонецЕсли;
			
			Если стр.Склад <> ЭтотОбъект.Склад.Наименование Тогда
				стр.Склад = ЭтотОбъект.Склад.Наименование;
				ЕстьИзменения = ИСТИНА;					
			КонецЕсли;
			
			Если стр.ВидКонтрагента <> ЭтотОбъект.Партнер.ВидПартнераКонтрагента.Наименование Тогда
				стр.ВидКонтрагента = ЭтотОбъект.Партнер.ВидПартнераКонтрагента.Наименование;
				ЕстьИзменения = ИСТИНА;					
			КонецЕсли; 
			
			Если стр.ЮрАдрес <> ЮрАдрес Тогда
				стр.ЮрАдрес = ЮрАдрес;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли; 
			
			Если стр.ФактАдрес <> ФактАдрес Тогда
				стр.ФактАдрес = ФактАдрес;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли; 			
			
			Если стр.Телефон <> Телефон Тогда
				стр.Телефон = Телефон;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.СебестоимостьВсего <> СебестоимостьВсего  Тогда
			    стр.СебестоимостьВсего = СебестоимостьВсего;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			Если стр.Себестоимость4111 <> Себестоимость4111 Тогда
			    стр.Себестоимость4111 = Себестоимость4111;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.Себестоимость4122 <> СебестоимостьФасованных4122 Тогда
			    стр.Себестоимость4122 = СебестоимостьФасованных4122;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.Себестоимость413 <> СебестоимостьТары413 Тогда
			    стр.Себестоимость413 = СебестоимостьТары413;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			
			Если стр.НДСВсего <> НДСВсего Тогда
			    стр.НДСВсего = НДСВсего;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			
			Если стр.НДС20 <> НДС_20_ПоДоку Тогда
			    стр.НДС20 = НДС_20_ПоДоку;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			Если стр.НДС10 <> НДС_10_ПоДоку Тогда
			    стр.НДС10 = НДС_10_ПоДоку;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			Если стр.БезНДС <> БЕЗ_НДС_ПоДоку Тогда
			    стр.БезНДС = БЕЗ_НДС_ПоДоку;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			
			Если стр.ВыручкаСНДС20 <> Выручка_С_НДС_20_ПоДоку Тогда
			    стр.ВыручкаСНДС20 = Выручка_С_НДС_20_ПоДоку;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			Если стр.ВыручкаСНДС10 <> Выручка_С_НДС_10_ПоДоку Тогда
			    стр.ВыручкаСНДС10 = Выручка_С_НДС_10_ПоДоку;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			Если стр.ВыручкаБезНДС <> Выручка_БЕЗ_НДС_ПоДоку Тогда
			    стр.ВыручкаБезНДС = Выручка_БЕЗ_НДС_ПоДоку;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			
			Если стр.Благотворительность <> Благотворительность Тогда
			    стр.Благотворительность = Благотворительность;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.БезвозмезнаяПередача <> БезвозмезднаяПередача Тогда
			    стр.БезвозмезнаяПередача = БезвозмезднаяПередача;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если стр.ДатаПлатежа <> ЭтотОбъект.ДатаПлатежа Тогда
			    стр.ДатаПлатежа = ЭтотОбъект.ДатаПлатежа;
				ЕстьИзменения = ИСТИНА;			
			КонецЕсли;
			
            //Если стр.ПродажиНижеСебестоимости <> (ЭтотОбъект.ТоварыНижеСебестоимости.Итог("СуммаСебестоимости") - ЭтотОбъект.ТоварыНижеСебестоимости.Итог("Сумма")) Тогда
			    стр.ПродажиНижеСебестоимости = (ЭтотОбъект.ТоварыНижеСебестоимости.Итог("СуммаСебестоимости") - ЭтотОбъект.ТоварыНижеСебестоимости.Итог("Сумма"));
                
                ТЗНДС = ЭтотОбъект.ТоварыНижеСебестоимости.Выгрузить();
                ТЗНДС.Свернуть("СтавкаНДС","СуммаСебестоимости, Сумма");  
                Для Каждого СтрокаТЗНДС Из ТЗНДС Цикл
                    
                    Если СтрокаТЗНДС.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
                        стр.ПродажиНижеСебестоимости20 = СтрокаТЗНДС.СуммаСебестоимости - СтрокаТЗНДС.Сумма;
                    КонецЕсли; 
                     
                    Если СтрокаТЗНДС.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
                        стр.ПродажиНижеСебестоимости10 = СтрокаТЗНДС.СуммаСебестоимости - СтрокаТЗНДС.Сумма;
                    КонецЕсли;
                    
                    Если СтрокаТЗНДС.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
                        стр.ПродажиНижеСебестоимостиБЕЗНДС = СтрокаТЗНДС.СуммаСебестоимости - СтрокаТЗНДС.Сумма;
                    КонецЕсли;
                    
                КонецЦикла; 
                
                ЕстьИзменения = ИСТИНА;			
            //КонецЕсли;
			
			
			
			Если ЭтотОбъект.Валюта <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
				
			
				Если стр.Валюта <> ЭтотОбъект.Валюта Тогда
				    стр.Валюта = ЭтотОбъект.Валюта;
					ЕстьИзменения = ИСТИНА;			
				КонецЕсли;
				
				ОстатокСуммыПоНакладной = 0;
				ОстатокСуммыПоНакладной = ЭтотОбъект.Ссылка.СуммаДокумента;
				
				КурсПредоплаты = 0;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				| СвязанныеДокументы.Ссылка КАК Ссылка
				|ИЗ
				| КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
				|ГДЕ
				| СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ";
				
				Запрос.УстановитьПараметр("Док", ЭтотОбъект.Ссылка.ДокументОснование);
				
				
				
				//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств")	Тогда 
						Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
							Если ВыборкаДетальныеЗаписи.Ссылка.СуммаДокумента <= ЭтотОбъект.Ссылка.СуммаДокумента Тогда
								КурсПредоплаты = ПолучитьКурсыВалютПоПредоплате(ВыборкаДетальныеЗаписи.Ссылка.Валюта, ВыборкаДетальныеЗаписи.Ссылка.Дата);
								ОстатокСуммыПоНакладной = ОстатокСуммыПоНакладной - ВыборкаДетальныеЗаписи.Ссылка.СуммаДокумента;  
							КонецЕсли; 
						КонецЕсли; 
					КонецЕсли;
				КонецЦикла;
				
				
				Если КурсПредоплаты <> 0 Тогда
					Если стр.КурсПредоплаты <> КурсПредоплаты Тогда
					    стр.КурсПредоплаты = КурсПредоплаты;
						ЕстьИзменения = ИСТИНА;			
					КонецЕсли;
				КонецЕсли; 
				
				
				КурсОтгрузки = 0;
				Если ОстатокСуммыПоНакладной > 0 Тогда
					КурсОтгрузки = ПолучитьКурсыВалютНаДатуОтгрузки(ВыборкаДетальныеЗаписи.Ссылка.Валюта, ВыборкаДетальныеЗаписи.Ссылка.Дата);
				КонецЕсли;
				
				Если стр.КурсОтгрузки <> КурсОтгрузки Тогда
				    стр.КурсОтгрузки = КурсОтгрузки;
					ЕстьИзменения = ИСТИНА;			
				КонецЕсли;
				
				
				
				КурсСредний = 0;
				Если стр.КурсСредний <> КурсСредний Тогда
				    стр.КурсСредний = КурсСредний;
					ЕстьИзменения = ИСТИНА;			
				КонецЕсли;
			
			КонецЕсли; 
			
			
			УИДЗаказа1 = ""; УИДЗаказа2 = ""; УИДЗаказа3 = "";УИДЗаказа4 = "";УИДЗаказа5 = "";УИДЗаказа6 = "";УИДЗаказа7 = "";УИДЗаказа8 = "";УИДЗаказа9 = "";
			
			Если ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда
				
				Заказы = ЭтотОбъект.Товары.Выгрузить();
				Заказы.Свернуть("ЗаказКлиента","");
				Заказы.Сортировать("ЗаказКлиента");
				
				
				Ном = 0;
				Счет = 0;
				Для Ном = 0 По Заказы.Количество()-1 Цикл
					Счет = Ном + 1;
					Выполнить("УИДЗаказа"+Счет+" = Заказы["+Ном+"].ЗаказКлиента.Ссылка.УникальныйИдентификатор()");
				КонецЦикла; 
				
				Для Порядок = 1 По 9 Цикл
					Выполнить("Если стр.UID_ZAK"+Ном+" <> УИДЗаказа"+Ном+" Тогда
					|			стр.UID_ZAK"+Ном+" = УИДЗаказа"+Ном+";
					|			ЕстьИзменения = ИСТИНА;
					|			КонецЕсли;")	
				КонецЦикла;
			КонецЕсли;
			
			Если стр.ПометкаУдаления <> ПометкаУдаления Тогда
				стр.ПометкаУдаления = ПометкаУдаления;
				ЕстьИзменения = ИСТИНА;
			КонецЕсли;
			
			Если ЕстьИзменения = ИСТИНА Тогда
				стр.ПризнакОбработано = 0;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если ЕстьИзменения = ИСТИНА Тогда
			НаборЗаписейОбменРеализация.Записать(ИСТИНА);
		КонецЕсли;
		
	Иначе
		
		МенеджерЗаписей = РегистрыСведений.Обмен_Реализация.СоздатьМенеджерЗаписи();
		МенеджерЗаписей.РеализацияСсылка = ЭтотОбъект.Ссылка;
		
		МенеджерЗаписей.UID_DOC = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
		МенеджерЗаписей.ДатаДок = ЭтотОбъект.Дата;
		МенеджерЗаписей.НомерДок = ЭтотОбъект.НомерБСО;
		МенеджерЗаписей.УНП = СокрЛП(ЭтотОбъект.Контрагент.ИНН);
		МенеджерЗаписей.КодФилиалаКонтрагента = ЭтотОбъект.Контрагент.КодФилиала;
		МенеджерЗаписей.СуммаДокумента = ЭтотОбъект.СуммаДокумента;
		МенеджерЗаписей.Договор = ЭтотОбъект.Договор.Наименование;
		МенеджерЗаписей.UID_DOG = ЭтотОбъект.Договор.Ссылка.УникальныйИдентификатор();
		МенеджерЗаписей.РасчетныйСчет = ЭтотОбъект.БанковскийСчетКонтрагента;
		МенеджерЗаписей.БИКБанка = ЭтотОбъект.БанковскийСчетКонтрагента.БИКБанка;
		МенеджерЗаписей.Склад = ЭтотОбъект.Склад.Наименование;
		МенеджерЗаписей.Клиент = ЭтотОбъект.Контрагент.Наименование;
		МенеджерЗаписей.КлиентПолноеНаименование = ЭтотОбъект.Контрагент.НаименованиеПолное;
		МенеджерЗаписей.ВидКонтрагента = ЭтотОбъект.Партнер.ВидПартнераКонтрагента.Наименование;
		МенеджерЗаписей.ЮрАдрес = ЮрАдрес;
		МенеджерЗаписей.ФактАдрес = ФактАдрес;
		МенеджерЗаписей.Телефон = Телефон;
		МенеджерЗаписей.СебестоимостьВсего = СебестоимостьВсего;
		МенеджерЗаписей.Себестоимость4111 = Себестоимость4111;
		МенеджерЗаписей.Себестоимость4122 = СебестоимостьФасованных4122;
		МенеджерЗаписей.Себестоимость413 = СебестоимостьТары413;
		МенеджерЗаписей.НДСВсего = НДСВсего;
		МенеджерЗаписей.НДС20 = НДС_20_ПоДоку;
		МенеджерЗаписей.НДС10 = НДС_10_ПоДоку;
		МенеджерЗаписей.БезНДС = БЕЗ_НДС_ПоДоку;
		МенеджерЗаписей.ВыручкаСНДС20 = Выручка_С_НДС_20_ПоДоку;
		МенеджерЗаписей.ВыручкаСНДС10 = Выручка_С_НДС_10_ПоДоку;
		МенеджерЗаписей.ВыручкаБезНДС = Выручка_БЕЗ_НДС_ПоДоку;
		
		МенеджерЗаписей.Благотворительность = БлаготворительностьОбмен;
		МенеджерЗаписей.БезвозмезнаяПередача = БезвозмезднаяПередача;
		МенеджерЗаписей.ДатаПлатежа = ЭтотОбъект.ДатаПлатежа;
		
		МенеджерЗаписей.ПродажиНижеСебестоимости = (ЭтотОбъект.ТоварыНижеСебестоимости.Итог("СуммаСебестоимости") - ЭтотОбъект.ТоварыНижеСебестоимости.Итог("Сумма"));
        
        ТЗНДС = ЭтотОбъект.ТоварыНижеСебестоимости.Выгрузить();
        ТЗНДС.Свернуть("СтавкаНДС","СуммаСебестоимости, Сумма");  
        Для Каждого СтрокаТЗНДС Из ТЗНДС Цикл
            
            Если СтрокаТЗНДС.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
                МенеджерЗаписей.ПродажиНижеСебестоимости20 = СтрокаТЗНДС.СуммаСебестоимости - СтрокаТЗНДС.Сумма;
            КонецЕсли; 
            
            Если СтрокаТЗНДС.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
                МенеджерЗаписей.ПродажиНижеСебестоимости10 = СтрокаТЗНДС.СуммаСебестоимости - СтрокаТЗНДС.Сумма;
            КонецЕсли;
            
            Если СтрокаТЗНДС.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
                МенеджерЗаписей.ПродажиНижеСебестоимостиБЕЗНДС = СтрокаТЗНДС.СуммаСебестоимости - СтрокаТЗНДС.Сумма;
            КонецЕсли;
            
        КонецЦикла; 

		
		УИДЗаказа1 = ""; УИДЗаказа2 = ""; УИДЗаказа3 = "";УИДЗаказа4 = "";УИДЗаказа5 = "";УИДЗаказа6 = "";УИДЗаказа7 = "";УИДЗаказа8 = "";УИДЗаказа9 = "";
		
		
		
		Если ЭтотОбъект.Валюта <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
				
				
				МенеджерЗаписей.Валюта = ЭтотОбъект.Валюта;
				
				
				КурсПредоплаты = 0;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				| СвязанныеДокументы.Ссылка КАК Ссылка
				|ИЗ
				| КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
				|ГДЕ
				| СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ";
				
				Запрос.УстановитьПараметр("Док", ЭтотОбъект.Ссылка.ДокументОснование);
				
				
				
				//РезультатЗапроса = Запрос.Выполнить().Выгрузить();
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств")	Тогда 
						Если ВыборкаДетальныеЗаписи.Ссылка.Проведен Тогда
							Если ВыборкаДетальныеЗаписи.Ссылка.СуммаДокумента <= ЭтотОбъект.Ссылка.СуммаДокумента Тогда
								КурсПредоплаты = ПолучитьКурсыВалютПоПредоплате(ВыборкаДетальныеЗаписи.Ссылка.Валюта, ВыборкаДетальныеЗаписи.Ссылка.Дата);
							КонецЕсли; 
						КонецЕсли; 
					КонецЕсли;
				КонецЦикла;
				
				
				Если КурсПредоплаты <> 0 Тогда
					 МенеджерЗаписей.КурсПредоплаты = КурсПредоплаты;
				КонецЕсли; 
				
				
				КурсОтгрузки = 0;
				МенеджерЗаписей.КурсОтгрузки = КурсОтгрузки;
				
				
				КурсСредний = 0;
				МенеджерЗаписей.КурсСредний = КурсСредний;
			
			КонецЕсли; 
			
		
		
		
		Если ЭтотОбъект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоЗаказамНакладным Тогда
			
			Заказы = ЭтотОбъект.Товары.Выгрузить();
			Заказы.Свернуть("ЗаказКлиента","");
			Заказы.Сортировать("ЗаказКлиента");
			
			Ном = 0;
			Счет = 0;                                                  
			Для Ном = 0 По Заказы.Количество()-1 Цикл
				Счет = Ном + 1;
				Выполнить("УИДЗаказа"+Счет+" = Заказы["+Ном+"].ЗаказКлиента.Ссылка.УникальныйИдентификатор()");
			КонецЦикла; 
			
			Для Ном = 1 По 9 Цикл
				Выполнить("МенеджерЗаписей.UID_ZAK"+Ном+" = УИДЗаказа"+Ном+";")	
			КонецЦикла;	
		КонецЕсли; 
		
		
		МенеджерЗаписей.ПометкаУдаления = 0;
		МенеджерЗаписей.ПризнакОбработано = 0;
		
		МенеджерЗаписей.Регистратор = ЭтотОбъект.Ссылка;
		МенеджерЗаписей.Записать(ИСТИНА);
		
	КонецЕсли; 
	
КонецПроцедуры


&НаСервере
Функция ПолучитьКурсыВалютПоПредоплате(Валюта, ДатаКурса)
  
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ
    |  КурсыВалютСрезПоследних.Валюта КАК Валюта,
    |  КурсыВалютСрезПоследних.Курс КАК Курс
    |ИЗ
    |  РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
    |ГДЕ
    |  КурсыВалютСрезПоследних.Период = &Период
    |  И КурсыВалютСрезПоследних.Валюта = &Валюта";
  
  Запрос.УстановитьПараметр("Период", НачалоДня(ДатаКурса));
  Запрос.УстановитьПараметр("Валюта", Валюта);
  
  РезультатЗапроса = Запрос.Выполнить();
  
  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  
  КурсПредоплаты = 0;
  
  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    КурсПредоплаты = ВыборкаДетальныеЗаписи.Курс;
  КонецЦикла;
  
  Возврат КурсПредоплаты;
  
КонецФункции

&НаСервере
Функция ПолучитьКурсыВалютНаДатуОтгрузки(Валюта, ДатаКурса)
  
  Запрос = Новый Запрос;
  Запрос.Текст = 
    "ВЫБРАТЬ
    |  КурсыВалютСрезПоследних.Валюта КАК Валюта,
    |  КурсыВалютСрезПоследних.Курс КАК Курс
    |ИЗ
    |  РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
    |ГДЕ
    |  КурсыВалютСрезПоследних.Период = &Период
    |  И КурсыВалютСрезПоследних.Валюта = &Валюта";
  
  Запрос.УстановитьПараметр("Период", НачалоДня(ДатаКурса));
  Запрос.УстановитьПараметр("Валюта", Валюта);
  
  РезультатЗапроса = Запрос.Выполнить();
  
  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  
  КурсОтгрузки = 0;
  
  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    КурсОтгрузки = ВыборкаДетальныеЗаписи.Курс;
  КонецЦикла;
  
  Возврат КурсОтгрузки;
  
КонецФункции


Функция ПроверитьЗаданиеНаДоставку(Заказ)

	ЗаданиеФормируется = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение
		|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен = ИСТИНА
		|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Распоряжение", Заказ);
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыЗаданийНаПеревозку.Формируется);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаданиеФормируется = ИСТИНА;
	КонецЦикла;
	
	Возврат ЗаданиеФормируется;


КонецФункции // ()


&НаСервере
 Функция УбратьЛидирующиеНули(НомерДокумента_)
    
    Попытка
        НомерДокумента_ = Формат(Число(НомерДокумента_), "ЧГ=");
    Исключение
        НомерДокумента_ = СтрЗаменить(СокрЛ(СтрЗаменить(СокрП(НомерДокумента_), "0", " ")), " ", "0");
		
        Префикс = "";
        Пока КодСимвола(НомерДокумента_) < 48 Или КодСимвола(НомерДокумента_) > 57 Цикл
            Префикс = Префикс + Лев(НомерДокумента_, 1);
            НомерДокумента_ = Сред(НомерДокумента_, 2);
        КонецЦикла;
        Если Не ПустаяСтрока(Префикс) Тогда
            НомерДокумента_ = Префикс + УбратьЛидирующиеНули(НомерДокумента_);
        КонецЕсли;
	КонецПопытки;
	
    НомерДокумента_ = СтрЗаменить(СокрЛП(НомерДокумента_), "-", "");
	
    Возврат НомерДокумента_;
    
КонецФункции  

&НаСервере
Процедура ПечатьСвидетельстваНаСеменаНаСервере(ТабДок) Экспорт
	
	Объект = ЭтотОбъект.Ссылка;
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    //ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	
	ТабДок.ПолеСнизу = 10;
	
	ТабДок.РазмерКолонтитулаСнизу = 5;
	
	//// Колонтитулы
	//ТабДок.НижнийКолонтитул.Выводить = Истина;
	//ТабДок.НижнийКолонтитул.ТекстСправа = НСтр("ru= 'Лист [&НомерСтраницы] из [&СтраницВсего]'");
	
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ТолькоПросмотр = Истина;	
	Макет = ПолучитьОбщийМакет("СвидетельствоНаСемена");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	НаименованиеФирмы = "";
	
	ОбластьШапка.Параметры.Заполнить(Объект);
	
	ОбластьШапка.Параметры.Дата = ТекущаяДата();
	//ОбластьШапка.Параметры.НаименованиеФирмы = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , Объект.БанковскийСчет), "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	ОбластьШапка.Параметры.НаименованиеФирмы = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), "ПолноеНаименование,ИНН,,,,,,");
	ОбластьШапка.Параметры.НаименованиеФирмы1 = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Организация, Объект.Дата, , ), ",,ЮридическийАдрес,Телефоны,,,,");
	//ОбластьШапка.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата,, ), "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,,,,");
	Если ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
		ОбластьШапка.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата,, ), "ПолноеНаименование,ИНН,,,,,") + ", " +Объект.АдресДоставки + ", " + ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата,, ), "Телефоны,,,,") ; 
	Иначе	
		ОбластьШапка.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(Объект.Контрагент, Объект.Дата,, ), "ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,,,,");
	КонецЕсли;
	
	Если ЭтотОбъект.ЭтоИнтернетЗаказ Тогда
     ОбластьШапка.Параметры.ПредставлениеПолучателя = ""+СокрЛП(ЭтотОбъект.ЗаказКлиента.Клиент);
   КонецЕсли;
	
	НомерСвидетельства_ = Объект.Номер;	
	НомерСвидетельства = УбратьЛидирующиеНули(НомерСвидетельства_);
	
	ОбластьШапка.Параметры.НомерСвидетельства = НомерСвидетельства;
	
	ТабДок.Вывести(ОбластьШапка);
	
	
	Область_Секция_8  = Макет.ПолучитьОбласть("Секция_8");
	
	Ном = 0;  
	
	ТЗ_Товары = Объект.Товары.Выгрузить();
	
	ТЗ_Товары.Свернуть("Номенклатура,Серия,Упаковка","КоличествоУпаковок,Количество");
	
	//Для каждого СтрокаТовары Из Объект.Товары Цикл
	Для каждого СтрокаТовары Из ТЗ_Товары Цикл
		//Если СтрокаТовары.Отменено Тогда
		//	Продолжить;
		//КонецЕсли; 
		
		
		Если СтрокаТовары.Номенклатура.Ссылка.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.Товар Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СтрокаТовары.Номенклатура.Ссылка.ВидТМЦ.ТипТМЦ = Перечисления.ТипыТМЦ.ТранспортнаяТара Тогда
			Продолжить;
		КонецЕсли; 
		
		
		Ном = Ном+1;
		Область_Секция_8.Параметры.Ном = Ном;
		
		Товар = СокрЛП(СтрокаТовары.Номенклатура.НаименованиеПолное);
		ВидРасфасовки_Есть = СтрокаТовары.Номенклатура.УпаковкаГрузомест;
		
		Если ЗначениеЗаполнено(ВидРасфасовки_Есть) Тогда
			ВидРасфасовки = ", "+ВидРасфасовки_Есть;
		Иначе
			ВидРасфасовки = "";
		КонецЕсли; 
		
		ВесПартии = 0;
		
		Если СтрокаТовары.Номенклатура.ЕдиницаИзмерения.Вес > 0 Тогда
			ВесПартии = СтрокаТовары.Номенклатура.ЕдиницаИзмерения.Вес*СтрокаТовары.Количество;
		КонецЕсли;	 
		
		Если ВесПартии = 0 Тогда
			Если СтрокаТовары.Номенклатура.УпаковкаГрузомест.Вес  > 0 Тогда
				ВесПартии = СтрокаТовары.Номенклатура.УпаковкаГрузомест.Вес*СтрокаТовары.Количество;
			КонецЕсли; 
		КонецЕсли;
		
		Если ВесПартии = 0 Тогда
			Если СтрокаТовары.Упаковка.Вес  > 0 Тогда
				ВесПартии = СтрокаТовары.Количество*СтрокаТовары.Упаковка.Вес;
			КонецЕсли; 
		КонецЕсли;
		
		Если ВесПартии <> 0 Тогда
			//ВесПартии = ",  вес партии "+Строка(ВесПартии)+" кг.";
			ВесПартии = ""+Строка(ВесПартии)+" кг.";
		Иначе
			ВесПартии = "";
		КонецЕсли; 
		
		ВесПартии = ""+ВесПартии+Символы.ПС+""+СтрокаТовары.Количество+" "+СтрокаТовары.Упаковка.ЕдиницаИзмерения.Наименование;
		
		Партия_МССО_Ссылка = СтрокаТовары.Серия.Партия_МССО.Ссылка;
		
		
		Если Партия_МССО_Ссылка.Анализы.Количество() > 0 Тогда
			Для Каждого СтрокаАнализы Из Партия_МССО_Ссылка.Анализы Цикл 
				
				ВсхожестьЕсть = СтрокаАнализы.Всхожесть;
				Если ЗначениеЗаполнено(ВсхожестьЕсть) Тогда
					Всхожесть = "всхожесть "+ВсхожестьЕсть+"%";
				Иначе
					Всхожесть = "";
				КонецЕсли;
				
				ВлажностьЕсть = СтрокаАнализы.Влажность;
				Если ЗначениеЗаполнено(ВлажностьЕсть) Тогда
					Влажность = ", влажность "+ВлажностьЕсть+"%";
				Иначе
					Влажность = "";
				КонецЕсли;
				
				СОКЕсть = СтрокаАнализы.СОК;
				Если ЗначениеЗаполнено(СОКЕсть) Тогда
					СОК = ", семян основной культуры "+СОКЕсть+"%";
				Иначе
					СОК = "";
				КонецЕсли;
				
				ПримесиЕсть = СтрокаАнализы.Примеси;
				Если ЗначениеЗаполнено(ПримесиЕсть) Тогда
					Примеси = ", примесь семян др. растений "+ПримесиЕсть+"%";
				Иначе
					Примеси = "";
				КонецЕсли;
				
				Масса1000семянЕсть = СтрокаАнализы.Масса1000семян;
				Если ЗначениеЗаполнено(Масса1000семянЕсть) Тогда
					Масса1000семян = ", масса 1000 семян "+Масса1000семянЕсть+"г";
				Иначе
					Масса1000семян = "";
				КонецЕсли;
				
				
				
				Болезни_Вредители_КарантинныеОбъекты = "";
				
				Болезни = ", зараженность болезнями " + СтрокаАнализы.БолезниПроцент+ "%";
				Вредители = ", зараженность вредителями " + СтрокаАнализы.БолезниПроцент+ "%";
				КарантинныеОбъекты = ", карантинные объекты " + СтрокаАнализы.КарантинныеОбъекты+ " 0 шт/кг";
				
				Болезни_Вредители_КарантинныеОбъекты = ""+Болезни+Символы.ПС+Вредители+Символы.ПС+КарантинныеОбъекты;
				
				Область_Секция_8.Параметры.Болезни_Вредители = Болезни_Вредители_КарантинныеОбъекты;
				
				
				
				
				
				
				//Если ЗначениеЗаполнено(СтрокаАнализы.Примечание) = Истина Тогда
					Область_Секция_8.Параметры.Прочее = ""+Символы.ПС+СтрокаАнализы.Примечание;
				//КонецЕсли; 
				
				УдостоверениеОКондиционностиЕсть = СтрокаАнализы.УдостоверениеОКондиционности;
				Если ЗначениеЗаполнено(УдостоверениеОКондиционностиЕсть) Тогда
					УдостоверениеОКондиционности = "Удостоверение о качестве семян № "+УдостоверениеОКондиционностиЕсть;
				Иначе
					УдостоверениеОКондиционности = "";
				КонецЕсли;
				                       
				ДатаУдостоверенияЕсть = Формат(СтрокаАнализы.ДатаУдостоверения,"ДЛФ=D");
				Если ЗначениеЗаполнено(ДатаУдостоверенияЕсть) Тогда
					ДатаУдостоверения = " от "+ДатаУдостоверенияЕсть;
				Иначе
					ДатаУдостоверения = "";
				КонецЕсли;
				
				ЛабораторияЕсть = СтрокаАнализы.Лаборатория;
				Если ЗначениеЗаполнено(ЛабораторияЕсть) Тогда
					Лаборатория = ", выданное "+ЛабораторияЕсть;
				Иначе
					Лаборатория = "";
				КонецЕсли;
				
				СрокДействияАнализаЕсть = СтрокаАнализы.СрокДействияАнализа;
				
				Если НЕ ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
					Продолжить;
				КонецЕсли;
				Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
					СрокДействияАнализа = ", срок действия до "+Формат(СрокДействияАнализаЕсть,"ДЛФ=D");
					//СрокДействияАнализа = ""+Формат(СрокДействияАнализаЕсть,"ДЛФ=D");
				Иначе
					СрокДействияАнализа = "";
				КонецЕсли;
				
				
			КонецЦикла;
			
		Иначе
			
				ВсхожестьЕсть = Партия_МССО_Ссылка.Всхожесть;
				Если ЗначениеЗаполнено(ВсхожестьЕсть) Тогда
					Всхожесть = "всхожесть "+ВсхожестьЕсть+"%";
				Иначе
					Всхожесть = "";
				КонецЕсли;
				
				ВлажностьЕсть = Партия_МССО_Ссылка.Влажность;
				Если ЗначениеЗаполнено(ВлажностьЕсть) Тогда
					Влажность = ", влажность "+ВлажностьЕсть+"%";
				Иначе
					Влажность = "";
				КонецЕсли;
				
				СОКЕсть = Партия_МССО_Ссылка.СОК;
				Если ЗначениеЗаполнено(СОКЕсть) Тогда
					СОК = ", семян основной культуры "+СОКЕсть+"%";
				Иначе
					СОК = "";
				КонецЕсли;
				
				ПримесиЕсть = Партия_МССО_Ссылка.Примеси;
				Если ЗначениеЗаполнено(ПримесиЕсть) Тогда
					Примеси = ", примесь семян др. растений "+ПримесиЕсть+"%";
				Иначе
					Примеси = "";
				КонецЕсли;
				
				Масса1000семянЕсть = Партия_МССО_Ссылка.Масса1000семян;
				Если ЗначениеЗаполнено(Масса1000семянЕсть) Тогда
					Масса1000семян = ", масса 1000 семян "+Масса1000семянЕсть+"г";
				Иначе
					Масса1000семян = "";
				КонецЕсли;
			
				УдостоверениеОКондиционностиЕсть = Партия_МССО_Ссылка.УдостоверениеОКондиционности;
				Если ЗначениеЗаполнено(УдостоверениеОКондиционностиЕсть) Тогда
					УдостоверениеОКондиционности = "Удостоверение о качестве семян № "+УдостоверениеОКондиционностиЕсть;
				Иначе
					УдостоверениеОКондиционности = "";
				КонецЕсли;
				
				ДатаУдостоверенияЕсть = Формат(Партия_МССО_Ссылка.ДатаУдостоверения,"ДЛФ=D");
				Если ЗначениеЗаполнено(ДатаУдостоверенияЕсть) Тогда
					ДатаУдостоверения = " от "+ДатаУдостоверенияЕсть;
				Иначе
					ДатаУдостоверения = "";
				КонецЕсли;
				
				ЛабораторияЕсть = Партия_МССО_Ссылка.Лаборатория;
				Если ЗначениеЗаполнено(ЛабораторияЕсть) Тогда
					Лаборатория = ", выданное "+ЛабораторияЕсть;
				Иначе
					Лаборатория = "";
				КонецЕсли;
				
				СрокДействияАнализаЕсть = Партия_МССО_Ссылка.СрокДействияАнализа;
				Если ЗначениеЗаполнено(СрокДействияАнализаЕсть) Тогда
					СрокДействияАнализа = ""+Формат(СрокДействияАнализаЕсть,"ДЛФ=D");
				Иначе
					СрокДействияАнализа = "";
				КонецЕсли;
				
				
				
				
		КонецЕсли; 
		
		//////// лук \\\\\\\\\
		
		Дополнительно_Лук = "";
		Лук_НаличиеОтходовВсего = Партия_МССО_Ссылка.Лук_НаличиеОтходовВсего;	
		Если Лук_НаличиеОтходовВсего > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук +Символы.ПС+"наличие отходов и примесей "+Лук_НаличиеОтходовВсего+"%, в том числе: "; 	
		КонецЕсли;	
		
		Лук_БольныеПоврежденные = Партия_МССО_Ссылка.Лук_БольныеПоврежденные; 
		
		Если Лук_БольныеПоврежденные > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук + "луковиц больных, поврежденных  вредителями "+Лук_БольныеПоврежденные+"%"; 	
		КонецЕсли;
		

		Лук_Высохший = Партия_МССО_Ссылка.Лук_Высохший; 

		Если Лук_Высохший > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук + ", высохших "+Лук_Высохший+"%"; 	
		КонецЕсли;
		
		
		
		Лук_СМеханическимиПовреждениями = Партия_МССО_Ссылка.Лук_СМеханическимиПовреждениями; 

		Если Лук_СМеханическимиПовреждениями > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук + ", с механическими повреждениями , проросших, оголенных (при осеннем исп-и) "+Лук_СМеханическимиПовреждениями+"%"; 	
		КонецЕсли;
		
		
		Лук_Примеси = Партия_МССО_Ссылка.Лук_Примеси; 

		Если Лук_Примеси > 0 Тогда
			Дополнительно_Лук = Дополнительно_Лук + ", примеси (земля,чешуя и др.) "+Лук_Примеси+"%"; 	
		КонецЕсли;
		
		
		Область_Секция_8.Параметры.Дополнительно_Лук = Дополнительно_Лук; 
		
		Область_Секция_9  = Макет.ПолучитьОбласть("Секция_9");
		
		Если ЗначениеЗаполнено(Дополнительно_Лук)  Тогда
			
			Область_Секция_9.Параметры.СрокДействияАнализа = ""+Прав(СрокДействияАнализа,10)+" г.";    //////  07-05-2025
		КонецЕсли;
		
		//////// лук \\\\\\\\\
		
		
		
		//////// картофель \\\\\\\\\
		Дополнительно_Картофель = "";
		
		
		Если ЗначениеЗаполнено(Партия_МССО_Ссылка.ВнешнийВид) Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"внешний вид "+Партия_МССО_Ссылка.ВнешнийВид;
		КонецЕсли;          
		
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейСПризнакамиУдушья > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней с признаками «удушья».подмороженных, с ожогами, уродливых, с израстаниями и легкообламывающимися наростами, разрезанных, раздавленных, с ободранной кожурой более 1/3 поверхности клубня - "+Партия_МССО_Ссылка.НаличиеКлубнейСПризнакамиУдушья+"%";
		КонецЕсли;
		
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейНеСоответствующихПоРазмер > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней не соответствующих по размеру - "+Партия_МССО_Ссылка.НаличиеКлубнейНеСоответствующихПоРазмер+"%";
		КонецЕсли;
		
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейСПовреждениями > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней с повреждениями инспекция по механическими (порезы, вырывы, трещины семеноводству вмятины тканей клубней глубиной более 5 мм и карантину и длиной более 10 мм) и вредителями (проволочниками более трех ходов, грызунами растений хрущами и сов - "+Партия_МССО_Ссылка.НаличиеКлубнейСПовреждениями+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейДругихБотаническихСортов > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней других ботанических сортов - "+Партия_МССО_Ссылка.НаличиеКлубнейДругихБотаническихСортов+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.НаличиеКлубнейСБолезнямиВсего > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие клубней, пораженных болезнями, всего - "+Партия_МССО_Ссылка.НаличиеКлубнейСБолезнямиВсего+"%"+Символы.ПС+" в т.ч.:";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.МокройГнилью > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"мокрой гнилью - "+Партия_МССО_Ссылка.МокройГнилью+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.ЧернойНожкой > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"черной ножкой - "+Партия_МССО_Ссылка.ЧернойНожкой+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.КольцевойГнилью > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"кольцевой гнилью - "+Партия_МССО_Ссылка.КольцевойГнилью+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.Фитофторозом > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Фитофторозом - "+Партия_МССО_Ссылка.Фитофторозом+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.РезиновойСухимиГнилями > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"презиновой, сухими гнилями (фомоз, фузариозантракноз) - "+Партия_МССО_Ссылка.РезиновойСухимиГнилями+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.СтеблевойНематодой > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"стеблевой нематодой - "+Партия_МССО_Ссылка.СтеблевойНематодой+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.ОбыкновеннойПаршой > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"обыкновенной и серебристой паршой (поражение более 1/3 поверхности клубней) - "+Партия_МССО_Ссылка.ОбыкновеннойПаршой+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.Ризоктониозом > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"ризоктониозом (при поражении от 1/10 до 14 включительно, поверхности клубней) - "+Партия_МССО_Ссылка.Ризоктониозом+"%";
		КонецЕсли;
		
		Если Партия_МССО_Ссылка.НаличиеЗемлиПостороннихПримесей > 0 Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Наличие земли и посторонних примесей - "+Партия_МССО_Ссылка.НаличиеЗемлиПостороннихПримесей+"%";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Партия_МССО_Ссылка.ЗараженностьСемянКарантиннымиОбъектами) Тогда
			Дополнительно_Картофель = Дополнительно_Картофель+Символы.ПС+"Зараженность семян карантинными объектами "+Партия_МССО_Ссылка.ЗараженностьСемянКарантиннымиОбъектами;
		КонецЕсли;          
		
		Область_Секция_8.Параметры.Дополнительно_Картофель = Дополнительно_Картофель; 
		
		//////// картофель \\\\\\\\\
		
		
		
		///// Удостоверение о качестве семян № [ТаблицаВ.ДК], выданное [ТаблицаВ.ДЛ], срок действия до [ТаблицаВ.СД]
		 
		    
		Область_Секция_8.Параметры.Всхожесть = Всхожесть;
		Область_Секция_8.Параметры.Влажность = Влажность;
		Область_Секция_8.Параметры.СОК = СОК;
		Область_Секция_8.Параметры.Примеси = Примеси;
		Область_Секция_8.Параметры.Масса1000семян = Масса1000семян;
		
		Область_Секция_8.Параметры.УдостоверениеОКондиционности = УдостоверениеОКондиционности;
		Область_Секция_8.Параметры.ДатаУдостоверения = ДатаУдостоверения;
		Область_Секция_8.Параметры.Лаборатория = Лаборатория;
		Область_Секция_8.Параметры.СрокДействияАнализа = СрокДействияАнализа;
		
		//[?(ТаблицаВ.ВС="","","всхожесть "+ ТаблицаВ.ВС+"%")]
		//[?(ТаблицаВ.ВЛ="","",", влажность "+ ТаблицаВ.ВЛ+"%")]
		//[?(ТаблицаВ.СОК="","",", семян основной культуры "+ ТаблицаВ.СОК+"%")]
		//[?(ТаблицаВ.ПР="","",", примесь семян др. растений "+ ТаблицаВ.ПР+"%")]
		//[?(ТаблицаВ.М1="","",", масса 1000 семян "+ ТаблицаВ.М1+"г")]
		
		//[?(ТаблицаВ.АктОпр="","","Акт апробации № "+ТаблицаВ.АктОпр)]
		//[?(ТаблицаВ.Свид="","","Сертификат на семена № "+ТаблицаВ.Свид)]
		
		
		/////Репродукция = ?(СтрокаТовары.Серия.Партия_МССО.Репродукция = 1,", репродукция "+СтрокаТовары.Серия.Партия_МССО.Репродукция,"");
		РепродукцияЕсть = Партия_МССО_Ссылка.Репродукция;
		Если ЗначениеЗаполнено(РепродукцияЕсть) Тогда
			Репродукция = ", репродукция "+РепродукцияЕсть;
		Иначе
			Репродукция = "";
		КонецЕсли; 
		
		СортоваяЧистотаЕсть = Партия_МССО_Ссылка.СортоваяЧистота;
		Если ЗначениеЗаполнено(СортоваяЧистотаЕсть) Тогда
			СортоваяЧистота = "Сортовая чистота "+СортоваяЧистотаЕсть;
		Иначе
			СортоваяЧистота = "";
		КонецЕсли; 
		
		
		АктАпробацииЕсть = Партия_МССО_Ссылка.АктАпробации;
		Если ЗначениеЗаполнено(АктАпробацииЕсть) Тогда
			АктАпробации = "Акт апробации № "+АктАпробацииЕсть;
		Иначе
			АктАпробации = "";
		КонецЕсли; 
		
		СвидетельствоЕсть = Партия_МССО_Ссылка.Свидетельство;
		Если ЗначениеЗаполнено(СвидетельствоЕсть) Тогда
			Свидетельство = "Сертификат на семена № "+СвидетельствоЕсть;
		Иначе
			Свидетельство = "";
		КонецЕсли; 
		
		
		
		//Партия_МССО = ", партия № "+Партия_МССО_Ссылка;
		Партия_МССО = ""+Партия_МССО_Ссылка;
		
		Область_Секция_8.Параметры.Товар = Товар;
		Область_Секция_8.Параметры.ВидРасфасовки = ВидРасфасовки;
		Область_Секция_8.Параметры.Репродукция = Репродукция;
		Область_Секция_8.Параметры.Партия_МССО = Партия_МССО;
		Область_Секция_8.Параметры.ВесПартии   = ВесПартии;
		Область_Секция_8.Параметры.ГодУрожая   = ""+Партия_МССО_Ссылка.ГодУрожая;
		
		
		
		Область_Секция_8.Параметры.СортоваяЧистота = СортоваяЧистота;
		Область_Секция_8.Параметры.АктАпробации = АктАпробации;
		Область_Секция_8.Параметры.АктАпробации = Свидетельство;
		
		
		
	//	[СокрЛП(ТаблицаВ.Номенклатура.ПолнНаименование)] [СокрЛП(ТаблицаВ.Номенклатура.ВидРасфасовки)]
	//	[?(СокрЛП(ТаблицаВ.РП)="1", ", репродукция "+ТаблицаВ.РП,?(СокрЛП(ТаблицаВ.РП)="2", ", репродукция "+ТаблицаВ.РП,", "+ТаблицаВ.РП))],
	//	партия № [СокрЛП(ТаблицаВ.Партия)], [ТаблицаВ.К_во][ТаблицаВ.Ед]
	
	
	//   [?(ТаблицаВ.СЧ="0%","","Сортовая чистота "+ТаблицаВ.СЧ)]
	
	
		ОбработкаСемян = "-";
		Если ЗначениеЗаполнено(Партия_МССО_Ссылка.ОбработкаСемян) = ИСТИНА Тогда
			ОбработкаСемян = ""+Партия_МССО_Ссылка.ОбработкаСемян;
		КонецЕсли;
	
	    Область_Секция_8.Параметры.ОбработкаСемян = ""+ОбработкаСемян;
	
		ТабДок.Вывести(Область_Секция_8);
	КонецЦикла; 
		
	
	
	
	
	
	//Область_Секция_9  = Макет.ПолучитьОбласть("Секция_9");
	//
	//Область_Секция_9.Параметры.СрокДействияАнализа = ""+Прав(СрокДействияАнализа,10)+" г.";    //////  07-05-2025
	
	Приложения = "";
	Приложения = "ТТН на "+НСтр("ru= 'на [&СтраницВсего]' листах");
	
	Область_Секция_9.Параметры.Приложения = Приложения;
	
	ТабДок.Вывести(Область_Секция_9);
	
	
	Область_Подпись  = Макет.ПолучитьОбласть("Подпись");          
	
	
	Область_Подпись.Параметры.Выдал = Пользователи.ТекущийПользователь().ФизическоеЛицо;
	Область_Подпись.Параметры.ВыдалДолжность = СокрЛП(Пользователи.ТекущийПользователь().ФизическоеЛицо.Уточнение);
	
	ТабДок.Вывести(Область_Подпись);

	
	Область_Секция_10  = Макет.ПолучитьОбласть("Секция_10");          
	
	ТабДок.Вывести(Область_Секция_10);
	
	// Колонтитулы
	ТабДок.НижнийКолонтитул.Выводить = Истина;
	ТабДок.НижнийКолонтитул.ТекстСправа = НСтр("ru= 'Лист [&НомерСтраницы] из [&СтраницВсего]'");
	

	
КонецПроцедуры


&НаСервере
Процедура ПодготовитьДанныедляОтправкиПоЭлПочте(ТабДок, ВидСчета)  Экспорт
	Объект = ЭтотОбъект.Ссылка;
	Если Объект.Контрагент.Партнер.СогласиеКлиентаНаПолучениеРассылкиЭлДок = ИСТИНА Тогда
		
		ПутьКФайлуЭД     = "";
		ИмяФайла	   = "";
		ПолноеИмяФайла = "";
		
		ПутьКФайлу = "\\192.168.0.111\DATA_EXCHANGE_1C83\E_DOC\";
		НомСвид = "";
		НомСвид = Объект.Номер;
		ИмяФайла = ""+ВидСчета +" "+УбратьЛидирующиеНули(НомСвид)+".xls";
		ПутьКФайлуЭД = ПутьКФайлу+ИмяФайла;
		
		ТабДок.Записать(ПутьКФайлуЭД, ТипФайлаТабличногоДокумента.XLS);
		
		МенеджерЗаписи = РегистрыСведений.РассылкаЭлектронныхДокументовКлиентам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Контрагент = Объект.Контрагент;
		МенеджерЗаписи.Документ = Объект.Ссылка;
		МенеджерЗаписи.ПутьКФайлуЭД = ПутьКФайлуЭД; 
		
		 Если ЗначениеЗаполнено(Объект.Ссылка.ДокументОснование.АдресДоставки) Тогда
		     Если ТИПЗНЧ(Объект.Ссылка.ДокументОснование.АдресДоставки) <> ТИП("Строка") Тогда
			      Если ЗначениеЗаполнено(Объект.Ссылка.ДокументОснование.АдресДоставки.ЭлектроннаяПочта) Тогда
				  
				  	  АдресЭлПочты = Объект.Ссылка.ДокументОснование.АдресДоставки.ЭлектроннаяПочта;
				  
				  КонецЕсли;
			 КонецЕсли;

		КонецЕсли;

		Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
			МенеджерЗаписи.АдресЭлПочты = СокрЛП(АдресЭлПочты);
		Иначе
			Ном = 0;
			Для каждого Строка Из Объект.Контрагент.Партнер.КонтактнаяИнформация Цикл
				Если Строка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					МенеджерЗаписи.АдресЭлПочты = Строка.Представление;
				КонецЕсли; 
			КонецЦикла;
			
		КонецЕсли; 
			
		//Если ЗначениеЗаполнено(Объект.АдресДоставки) Тогда
		//     Если ТИПЗНЧ(Объект.АдресДоставки) <> ТИП("Строка") Тогда
		//	      Если ЗначениеЗаполнено(Объект.АдресДоставки.ЭлектроннаяПочта) Тогда
		//		  
		//		  	  АдресЭлПочты = Объект.АдресДоставки.ЭлектроннаяПочта;
		//		  
		//		  КонецЕсли;
		//	 КонецЕсли;

		//КонецЕсли;

		
		
		//АдресЭлПочты = "";
		//Пока ВыборкаДетальныеЗаписиЭП.Следующий() Цикл
		//	АдресЭлПочты = ВыборкаДетальныеЗаписиЭП.ЭлектроннаяПочта;
		//КонецЦикла;
			
		Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
			МенеджерЗаписи.АдресЭлПочты = СокрЛП(АдресЭлПочты);
		Иначе
			Ном = 0;
			Для каждого Строка Из Объект.Контрагент.Партнер.КонтактнаяИнформация Цикл
				Если Строка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
					МенеджерЗаписи.АдресЭлПочты = Строка.Представление;
				КонецЕсли; 
			КонецЦикла;
			
		КонецЕсли; 
		
	    МенеджерЗаписи.Записать(Истина);
		
	КонецЕсли;   
   
КонецПроцедуры


&НаСервере
Процедура ОбработкаПрисоединенныхФайловНаСервере() Экспорт
	
	МассивФайлов = Новый Массив;
	ПутьКФайлу = "\\192.168.0.111\DATA_EXCHANGE_1C83\E_DOC\";

	Объект = ЭтотОбъект.Ссылка;
	
	Для каждого Строка Из ЭтотОбъект.Товары Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПартионныеКарточкиПрисоединенныеФайлы.Ссылка КАК Ссылка,
			|	ПартионныеКарточкиПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
			|	ПартионныеКарточкиПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу
			|ИЗ
			|	Справочник.ПартионныеКарточкиПрисоединенныеФайлы КАК ПартионныеКарточкиПрисоединенныеФайлы
			|ГДЕ
			|	ПартионныеКарточкиПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
			|	И ПартионныеКарточкиПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ВладелецФайла", Строка.Серия.Партия_МССО);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ПутьКФайлуЭД     = "";
			ИмяФайла	   = "";
			ПолноеИмяФайла = "";
			
			ИмяФайла = ВыборкаДетальныеЗаписи.Ссылка.Наименование;
			РасширениеФайла = ВыборкаДетальныеЗаписи.Ссылка.Расширение;
			СсылкаНаФайл = ПолучитьНавигационнуюСсылку(ВыборкаДетальныеЗаписи.Ссылка);
			ДвоичныйФайл = ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(ВыборкаДетальныеЗаписи.ссылка);
			
			ПутьКФайлуЭД = ПутьКФайлу+ИмяФайла+"."+РасширениеФайла;

			ДвоичныйФайл.Записать(ПутьКФайлуЭД);
			
			Если Объект.Контрагент.Партнер.СогласиеКлиентаНаПолучениеРассылкиЭлДок = ИСТИНА Тогда
				
				
				МенеджерЗаписи = РегистрыСведений.РассылкаЭлектронныхДокументовКлиентам.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Контрагент = Объект.Контрагент;
				МенеджерЗаписи.Документ = Объект.Ссылка;
				МенеджерЗаписи.ПутьКФайлуЭД = ПутьКФайлуЭД; 
				
				
				ЗапросЭП = Новый Запрос;
				ЗапросЭП.Текст = 
				"ВЫБРАТЬ
				|	ПунктыРазгрузкиПогрузкиКлиентов.ЭлектроннаяПочта КАК ЭлектроннаяПочта
				|ИЗ
				|	Справочник.ПунктыРазгрузкиПогрузкиКлиентов КАК ПунктыРазгрузкиПогрузкиКлиентов
				|ГДЕ
				|	ПунктыРазгрузкиПогрузкиКлиентов.ПометкаУдаления = ЛОЖЬ
				|	И ПунктыРазгрузкиПогрузкиКлиентов.Владелец = &Владелец
				|	И ПунктыРазгрузкиПогрузкиКлиентов.Наименование = &Наименование";
				
				ЗапросЭП.УстановитьПараметр("Владелец", Объект.Контрагент.Партнер);
				ЗапросЭП.УстановитьПараметр("Наименование", Объект.АдресДоставки);
				
				РезультатЗапросаЭП = ЗапросЭП.Выполнить();
				
				ВыборкаДетальныеЗаписиЭП = РезультатЗапросаЭП.Выбрать();
				
				АдресЭлПочты = "";
				Пока ВыборкаДетальныеЗаписиЭП.Следующий() Цикл
					АдресЭлПочты = ВыборкаДетальныеЗаписиЭП.ЭлектроннаяПочта;
				КонецЦикла;
				
				Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
					МенеджерЗаписи.АдресЭлПочты = СокрЛП(АдресЭлПочты);
				Иначе
					Ном = 0;
					Для каждого Строка Из Объект.Контрагент.Партнер.КонтактнаяИнформация Цикл
						Если Строка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
							МенеджерЗаписи.АдресЭлПочты = Строка.Представление;
						КонецЕсли; 
					КонецЦикла;
					
				КонецЕсли; 
				
				МенеджерЗаписи.Записать(Истина);
				
			КонецЕсли;   
			
		КонецЦикла;
		
	КонецЦикла; 
	
	
КонецПроцедуры

Функция ПроверитьКонтрагентаНаПризнакОтгрузкуРазрешил(Контрагент)
	ЕстьРазрешение = ЛОЖЬ;
	
	НаборЗаписей = РегистрыСведений.СписокКлиентовСПризнакомОтгрузкуРазрешил.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество()>0 Тогда
	
		ЕстьРазрешение = ИСТИНА;
	
	КонецЕсли; 
	
	Возврат ЕстьРазрешение;
КонецФункции // ()

Функция ПолучитьЗаказыПоРеализации(Ссылка)
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|	И  ТИПЗНАЧЕНИЯ(РеализацияТоваровУслугТовары.Ссылка) = ТИП(Документ.ЗаказКлиента)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.ЗаказКлиента";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	Возврат РезультатЗапроса;	

КонецФункции // ()


