
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ТаблицаНайдено.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилищаТаблицаНайдено));
	Элементы.ПродолжитьЗапись.Видимость = Параметры.ЭтоЗапись
										И Пользователи.РолиДоступны("ВводИнформацииПоНоменклатуреБезКонтроля")
										И ТаблицаНайдено.НайтиСтроки(Новый Структура("НайденоПоНаименованию", Истина)).Количество() = 0;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКоманд

&НаКлиенте
Процедура ВыбратьСуществующую(Команда)
	
	ОчиститьСообщения();
	Если Элементы.ТаблицаНайдено.ТекущиеДанные = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Номенклатура не выбрана'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		,
		"ТаблицаНайдено");
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
		
	СтруктураВозврата.Вставить("Действие","ВыбратьСуществующую");
	СтруктураВозврата.Вставить("Номенклатура",Элементы.ТаблицаНайдено.ТекущиеДанные.Номенклатура);
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗаполнение(Команда)
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("Действие","ПродолжитьЗаполнение");
	СтруктураВозврата.Вставить("Номенклатура",Неопределено);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗапись(Команда)
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("Действие","ПродолжитьЗапись");
	СтруктураВозврата.Вставить("Номенклатура",Неопределено);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

#КонецОбласти