
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ИспользоватьППД              = ПолучитьФункциональнуюОпцию("ИспользоватьПолнотекстовыйПоискПриПодбореТоваров");
	ИспользоватьСтандартныйПоиск = Константы.ИспользоватьСтандартныйПоискПриПодбореТоваров.Получить();
	
	Если ИспользоватьППД Тогда
		Элементы.ПодсказкиКРасширенномуПоиску.ТекущаяСтраница = Элементы.ИспользуетсяППД;
	Иначе
		Элементы.ПодсказкиКРасширенномуПоиску.ТекущаяСтраница = Элементы.НеИспользуетсяППД;
	КонецЕсли;
	
	Если ИспользоватьСтандартныйПоиск Тогда
		Элементы.ПодсказкиКИспользованиюНастройкиПоУмолчанию.ТекущаяСтраница = Элементы.СтандартныйПоиск;
	Иначе
		Элементы.ПодсказкиКИспользованиюНастройкиПоУмолчанию.ТекущаяСтраница = Элементы.РасширенныйПоиск;
	КонецЕсли;
	
	Если Параметры.ВариантПоискаТоваров = "ПоУмолчанию" Тогда
		ИспользованиеНастройкиПоУмолчанию = "ПоУмолчанию";
		ВариантПоиска = ?(ИспользоватьСтандартныйПоиск, "Стандартный", "Расширенный");
	Иначе
		ИспользованиеНастройкиПоУмолчанию = "Индивидуально";
		ВариантПоиска = ?(Параметры.ВариантПоискаТоваров = "Стандартный", "Стандартный", "Расширенный");
	КонецЕсли;
	
	Если ИспользованиеНастройкиПоУмолчанию = "ПоУмолчанию" Тогда
		Элементы.ГруппаВариантПоиска.Доступность = Ложь;	
	Иначе 
		Элементы.ГруппаВариантПоиска.Доступность = Истина;
	КонецЕсли;

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеНастройкиПоУмолчанию1ПриИзменении(Элемент)
	
	Если ИспользованиеНастройкиПоУмолчанию = "ПоУмолчанию" Тогда
		Элементы.ГруппаВариантПоиска.Доступность = Ложь;
		ВариантПоиска = ?(ИспользоватьСтандартныйПоиск, "Стандартный", "Расширенный");
	Иначе
		Элементы.ГруппаВариантПоиска.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеНастройкиПоУмолчанию2ПриИзменении(Элемент)
	
	Если ИспользованиеНастройкиПоУмолчанию = "ПоУмолчанию" Тогда
		Элементы.ГруппаВариантПоиска.Доступность = Ложь;
		ВариантПоиска = ?(ИспользоватьСтандартныйПоиск, "Стандартный", "Расширенный");
	Иначе
		Элементы.ГруппаВариантПоиска.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураПараметров = Новый Структура;
	
	Если ИспользованиеНастройкиПоУмолчанию = "ПоУмолчанию" Тогда
		СтруктураПараметров.Вставить("ВариантПоискаТоваров", "ПоУмолчанию");
	Иначе
		СтруктураПараметров.Вставить("ВариантПоискаТоваров", ВариантПоиска);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ИспользоватьСтандартныйПоиск",ИспользоватьСтандартныйПоиск);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

