
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИсточникКопирования = Параметры.ИсточникКопирования;
	Элементы.КопироватьИндивидуальныеУпаковки.Видимость = Параметры.ЕстьИндивидуальныеУпаковкиВОбъектеКопирования;
	Элементы.КопироватьИндивидуальныеХарактеристики.Видимость = Параметры.ЕстьИндивидуальныеХарактеристикиВОбъектеКопирования;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработкаКоманд
&НаКлиенте
Процедура Копировать(Команда)
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("КопироватьИндивидуальныеУпаковки",КопироватьИндивидуальныеУпаковки);
	СтруктураВозврата.Вставить("КопироватьИндивидуальныеХарактеристики",КопироватьИндивидуальныеХарактеристики);
	Закрыть(СтруктураВозврата);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);

КонецПроцедуры

#КонецОбласти